{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re adding new peripheral health reporting capabilities to the Pro Management portal, enabling admins to proactively monitor device issues in bring your own device (BYOD) rooms and desks.\n</p><p>These reports help identify when peripherals are faulty, missing, moved, or undetectable by a PC—allowing admins to take action before users report problems. Reports for rooms require a Teams Shared Devices license. Desk reporting is currently in public preview.</p><p>This change is associated with Microsoft 365 Roadmap ID:&nbsp;<a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=493319\" target=\"_blank\">493319</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide and GCC): Rollout will begin in early July 2025 and is expected to complete by late July 2025.\n</p><p><b>How this affects your organization:</b></p><p>Admins can now use peripheral status data to detect hardware issues in BYOD rooms and desks before they impact users. This proactive monitoring can reduce support tickets and improve meeting space reliability.\n</p><ul><li>Reports for rooms require a Teams Shared Devices license.\n</li><li>Reports for desks are available in public preview and do not yet require a license.\n</li></ul><p><b>What you can do to prepare:</b></p><p>To ensure accurate peripheral status reporting:\n</p><ul><li>Use multiple peripherals in each room or desk setup. The system compares expected device pairings (e.g., if Peripheral A and B are usually connected together, but A is missing, it will be flagged).\n</li><li>Simplify connectivity for users by using a single cable solution to connect all peripherals.\n</li><li>Ensure rooms and desks are bookable and have associated peripherals—this enables the Teams desktop client to send the necessary telemetry. Peripheral association can be done manually or automatically.</li></ul><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? Maybe (device telemetry is used for reporting)\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493319"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is enhancing peripheral health reporting in the Pro Management portal for BYOD spaces. This allows admins to monitor and address device issues proactively. Room reports require a Teams Shared Devices license, while desk reports are in public preview. Rollout begins in early July 2025."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090689",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-09T23:13:36.4Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:13:28Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Enhanced peripheral data in Pro Management portal reports for BYOD spaces",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
