{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 10, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Users will have the capability to open their core applications, such as Chat, Teams, and other essential apps, in separate windows by selecting <i>Open in new window</i>&nbsp;from the app's context menu. This latest update facilitates enhanced productivity and provides greater customization of the user's workflow. This improvement enables users to manage their core collaboration applications more efficiently, ultimately leading to a more streamlined and effective work environment.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=495003\" target=\"_blank\">495003.</a></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early September 2025 and expect to complete by mid-September 2025. \n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2025 and expect to complete by early October 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Your organization will now be able to open their core collaboration apps in its own window.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8e49dcbe-7689-4ac0-90dd-2daeaad975ae\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Users will be able to open core Microsoft Teams apps in separate windows starting September 2025, enhancing productivity and customization. The rollout requires no admin action but may necessitate updates to training and documentation. Refer to Microsoft 365 Roadmap ID 495003 for details."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-10T14:21:46.203Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-27T23:16:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Pop out your core apps into a new window.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
