{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 18, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>This feature will empower administrators to manage the availability of trusted Microsoft Teams apps based on rules, for enhanced security. Admins will be able to manage Microsoft 365 certified apps in the Teams admin center through a new control in <i>Org-wide settings</i>. You can further customize the availability of these apps based on permissions accessed and publisher names. The system automatically checks the Microsoft 365 certified apps that meet all the conditions you specify and makes those apps available.&nbsp;<b>&nbsp;</b></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485712\" target=\"_blank\">485712</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2025 and expect to complete by early December 2025.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, you cannot manage at bulk the availability of Microsoft 365 certified apps. They are only controlled by third-party app tenant settings.\n</p><p>After this rollout, you can manage Microsoft 365 certified apps availability from org-wide settings in the Teams admin center at <i>Manage apps &gt; Actions &gt; Org-wide app settings &gt; Microsoft 365 certified apps</i>.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e2c6ba81-7623-471a-8d06-0b6ad6e2ef00\" style=\"width: 400px;\" alt=\"admin settings\"></p><p>You can configure additional criteria from the <i>Customize availability </i>option:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c2d0f382-0897-432d-8a46-028de82b2e2d\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before or after the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation. This new control will be disabled by default.</p><p>Learn more: <i>Manage org-wide app settings</i> in <a href=\"https://learn.microsoft.com/microsoftteams/manage-apps#manage-org-wide-app-settings\" target=\"_blank\">Manage your apps in the Microsoft Teams admin center - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485712"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will enable admins to manage Microsoft 365 certified third-party apps by rules in org-wide settings, enhancing security. This feature rolls out globally from mid-July to mid-October 2025, allowing bulk app availability control based on permissions and publishers, with no prior admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-02-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1085133",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-18T19:41:17.143Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-29T23:14:18Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Rule-based enablement of Microsoft 365 third-party apps in the Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
