{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>If your organization has&nbsp;<a href=\"https://learn.microsoft.com/purview/sensitivity-labels-sharepoint-onedrive-files\">Enabled sensitivity labels for files in SharePoint and OneDrive</a> with Microsoft Purview and has <a href=\"https://learn.microsoft.com/purview/sensitivity-labels-coauthoring\">Enabled co-authoring for files encrypted with sensitivity labels</a> with Purview, email notifications for files with encryption will soon include context previews, such as when mentioning someone in a comment, assigning a task, and replying to comments in Microsoft Word, Microsoft Excel, or Microsoft PowerPoint. The notification emails will inherit the file's sensitivity label and encryption settings.\n</p><p>This message is associated with to Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?searchterms=486822\" target=\"_blank\">486822</a> and Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?searchterms=486825\" target=\"_blank\">486825</a>.\n</p><p>This message applies to encrypted files on Windows desktops, Mac desktops, on the web, and on iOS/Android.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late April 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p>This change will be on by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1050194",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-07T22:59:47.073Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-07T22:59:16Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Protected Microsoft 365 files will have context previews in email notifications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
