{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Purview | Data Loss Prevention for Microsoft Exchange Online:</p><p>Before this rollout, Exchange Online relies only on the file extension (such as .docx and .pdf) to identify the type of an attachment but this approach can be bypassed if a file is renamed with a misleading extension. To address this, we’re enhancing our detection logic to go beyond just the visible file extension. After this rollout, even if a file’s extension is altered, Exchange will evaluate the actual content of the file to determine its true type. This ensures that policies based on file type (such as <i>File extension is…</i>) will remain effective and secure, even when attachments are renamed or disguised.\n\nThis improvement provides you with a more robust and reliable way to enforce compliance and security rules around file sharing.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=493291\" target=\"_blank\">493291</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-July 2025 and expect to complete by late August 2025.</p><p>General Availability (Worldwide): We will begin rolling out late August 2025 and expect to complete by late September 2025.\n</p><p>General Availability (GCC, GCC High): We will begin rolling out late August 2025 and expect to complete by mid-October 2025.\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, you can configure rules in the Purview portal based on the true file type using the <i>File Extension is</i> predicate in Data Loss Prevention for Exchange Online, and then you will start to see seeing the relevant details for rule matches in all the experiences, such as <i>Alerts </i>and <i>Activity explorer</i>.\n</p><p>To set up this feature for Exchange, go to <i>Data Loss Prevention &gt; Policy Settings &gt; Create rule </i>and use the<i> File extension is</i> condition:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f72b28e6-0a73-4b61-abd8-238172b0939c\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>How the configured rule appears in other Purview experiences. For example, in Incident reports:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/793f00df-04fb-434a-bbc5-cb51c9422145\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>How the configured rule appears in <i>Alerts:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f7aa5251-72ff-4826-a562-17a7b1a9285d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>How the configured rule appears in <i>Activity explorer:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5563aa22-da23-4aa6-b595-6c67b6b772f0\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This feature will be available by default for admins to configure.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>If you are already using the File Extension is predicate in Data Loss Prevention for Exchange Online, be prepared to see increase in number of detections for these predicates because we will validate these predicates for both visible and the true file extensions after this rollout.</p><p>Learn more: <a href=\"https://learn.microsoft.com/powershell/module/exchange/new-dlpcompliancerule?view=exchange-ps\" target=\"_blank\">New-DlpComplianceRule (ExchangePowerShell) | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493291"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention for Exchange Online will enhance detection by evaluating the actual content of files, not just their extensions. This update, rolling out from mid-July to mid-October 2025, ensures more robust compliance and security. Admins can configure rules based on true file types without prior action."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-26T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1085582",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-30T19:33:54.59Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-30T19:33:31Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: True file types detected in Microsoft Exchange Online DLP (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
