{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This feature displays policy tips only after recipients are added to an email. This enhancement ensures that policy tips are relevant and based on actual recipients, preventing confusion caused by premature policy tips.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483358\" target=\"_blank\" style=\"\">483358</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in late March 2025 and expect to complete by early April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>This feature helps prevent accidental data loss by displaying policy tips only after the recipient is added. When composing an email with sensitive information, such as trade secrets or personally identifiable information (PII), the policy tip will appear based on the actual recipients, ensuring users are alerted to potential data loss risks. </p><p>This new feature is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483358"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's new feature displays policy tips only after recipients are added to an email, ensuring relevance and preventing confusion. This will roll out globally from late March to early April 2025. No admin action is required, but user notification and documentation updates are recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-23T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1028321",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-11T05:06:04.027Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-11T05:05:47Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Recipient-triggered policy tips",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
