{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Viva\nLearning Search is transitioning to an “intent-based” search from the current\n“keyword-based” search. As a part of “intent-based” search, Viva Learning will\nunderstand the core intent of the user query and show learning results based on\nuser’s intent. Users can interact with Viva Learning Search in their natural\nlanguage and get relevant content much easier.&nbsp;\nIntent-based search personalizes the Search experience for the user.&nbsp;</p><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=479749\" target=\"_blank\">479749</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out on mid-March 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b></p><p></p><div><p>Viva Learning in-app searches are powered by <a href=\"https://learn.microsoft.com/azure/search/\">Azure AI search</a>.\nViva Learning semantically understands the content based on Title, Description,\nSkill Tags, Keywords attribute of the content. These attributes are ingested\ninto Viva Learning either from <a href=\"https://learn.microsoft.com/viva/learning/content-sources-365-admin-center\">out-of-box connectors</a> like LMS and 3P connectors or pushed into Viva Learning using <a href=\"https://learn.microsoft.com/graph/api/resources/viva-learning-api-overview?view=graph-rest-1.0\">VLGraph APIs</a>.&nbsp;</p><p>When a user types a query in Viva Learning search, our\nsemantic engine understands the user intent and matches it with the content processed\npreviously. The semantic understanding happens for every user-query separately,\nthe process is optimized so that users do not see any delay in Search results.&nbsp;</p><p>As Copilot in Viva Learning uses Viva Learning Search\ninternally, Viva Learning Copilot results and suggestions are also enhanced to\nshow intent based results. Semantic Search also takes the\n“prioritized-provider” configuration into consideration while showing results\nfor every query. &nbsp;</p><b>Permissions</b><p>Semantic search takes all existing permissions (permissions\nset in Viva Learning, SharePoint or in LMS if applicable) into consideration\nwhile showing results.</p><b>Impacted Surfaces</b><p>The following are surfaces are impacted by Semantic Search:</p><ul><li>Viva Learning Search engine results page</li><li>Viva Learning Copilot</li><li>Content Curation Modals in</li><ul><li>Learning Paths</li><li>Manage Academies</li><li>Manage Permissions</li><li>Feature Set</li><li>Learning Collections</li><li>Learning Tab</li><li>Compose extension in Teams Chat</li></ul></ul><b>Language Support</b><p>Semantic Search is supported in all <a href=\"https://learn.microsoft.com/viva/learning/viva-learning-supported-languages\">languages\nsupported by Viva Learning</a>.</p><p><b>Responsible AI:</b> Please find Azure AI Search transparency note <a href=\"https://learn.microsoft.com/legal/search/transparency-note?context=%2Fazure%2Fsearch%2Fcontext%2Fcontext&amp;tabs=enrichment\">here</a>.</p><p>The Microsoft Search team handles Viva Learning results in\nMicrosoft 365 search surfaces (such as SharePoint and Bing@Work). Therefore,\nin-app Semantic Search results may differ from those in non-Viva Learning\nsurfaces.</p><p><b>What you need to do to prepare:</b></p><p>Since Semantic Search relies on content titles,\ndescriptions, skill tags, and keywords, Viva Learning recommends that learning\ncurators enrich their content with detailed information on these attributes.\nThis will help our semantic engine better understand the content and provide\nmore accurate suggestions for user queries.</p></div>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479749"
    },
    {
      "Name": "Summary",
      "Value": "Viva Learning is transitioning to an intent-based search, enhancing search results by understanding user queries semantically. This update, rolling out in March 2025, will personalize search experiences and improve content relevance. It affects various Viva Learning surfaces and supports all Viva Learning languages. Curators should enrich content attributes for better results."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1036565",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-24T18:47:36.543Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T23:03:02Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Viva Learning - Semantic search support for in-app Searches",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
