{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We have removed the Animation setting in Microsoft Teams. Instead, users can configure animations at the operating system (OS) level. If users disable animations in Microsoft Windows or macOS, Teams will honor that preference. This means users no longer need a separate setting in Teams to control animations. We will not reinstate the Teams-level animation control. Moving forward, Teams will rely entirely on the OS setting for animation preferences.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Available now.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change happened automatically. No admin action is required. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams has removed its animation setting, now relying on the OS-level animation settings in Windows and macOS. This change is automatic and requires no admin action. It applies to Teams for Windows desktop, Mac desktop, and the web. Notify users and update documentation as needed."
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1056991",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-16T23:56:40.917Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-16T23:56:30Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Use OS-level animation settings instead of Teams-level animation settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
