{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 20, 2025: The rollout of the feature on Viva Connections in Teams mobile will now be completed by end June 2025. The feature is generally available on Viva Connections in Teams desktop and Teams web platforms.</p><p>We are evolving the Feed experience in Microsoft Viva Connections for Microsoft Teams. Instead of the Feed, people in your organization will soon see a Microsoft SharePoint <i>News </i>experience in Viva Connections, for a fresh new look that simplifies the user experience. Learn more:</p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/Viva_Connections_Blog/introducing-enterprise-news-reader-in-viva-connections/4383832\" target=\"_blank\">Introducing enterprise news reader in Viva connections | Microsoft Community Hub</a>\n</li><li><a href=\"https://www.youtube.com/watch?v=CJXod7Q8uMs\" target=\"_blank\">Watch video</a> (14:12 min)\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=472018\" target=\"_blank\">472018</a>.\n</p><p>This message applies to Viva Connections in Teams for Windows desktop, Teams for iOS/Android, and Teams for the web, with this exception: This rollout will also include a Microsoft 365 Copilot-powered summary experience initially available only in Teams for Windows desktop. Microsoft 365 Copilot licensed users will have an additional option to generate a Copilot summary of the top 10 (or fewer) items in a user's <i>News </i>feed. A Microsoft 365 Copilot license is required to use this summarization feature in the news feed.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early March 2025 and expect to complete by mid-March 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late March 2025 and expect to complete by late June 2025 (previously late May).\n</p><p><i>Due to the nature of rollout technology across various platforms, some users may see the new experience sooner than others or in one platform first before the others.</i>\n</p><p><b>How this will affect your organization:</b>\n</p><p>Users will see recommended SharePoint <i>News </i>based on the sites they follow, frequently access, posts by people they work with, and other trending sites. As always, users will only see news they have appropriate permissions for, and if a news item is audience-targeted, the <i>News </i>feed will honor that and filter out news items. Boosted news and news from your organization's news sites will always be prioritized at the top of the <i>News </i>feed.\n</p><p>Users can like news items in their feed and save them for later. They will have an immersive news experience in Viva Connections, without leaving Teams to read new content for individual sites they follow.\n</p><p>This change will be on by default.\n</p><p>The new Feed experience in Viva Connections in Teams for desktop and the web:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/22b17231-19b4-4c11-ab8e-f782b13ea3bb\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The new Feed experience in Viva Connections in Teams for iOS/Android:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2f4efbbd-9491-4055-af77-cf1923eda608\" style=\"width: 310.994px;\" alt=\"user controls\">\n</p><p>The Copilot-powered summary experience available only in Teams for Windows desktop for Microsoft 365 Copilot licensed users:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e6b37788-0a00-4c43-be0d-32b76aaa76e4\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "472018"
    },
    {
      "Name": "Summary",
      "Value": "The rollout of the new News feature in Viva Connections for Teams mobile will be completed by end of June 2025. The feature is already available on Teams desktop and web. Users will see SharePoint News instead of the Feed, with a Copilot-powered summary option for licensed users. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1020218",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-20T19:05:11.93Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T22:18:07Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Connections: New News feature in Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
