{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 21, 2025: We have updated content. Thank you for your patience.</p><p>We’re providing clarification on a recent update related to OneDrive account prompts.\n</p><p>\n</p><p></p><p>Users have long been able to use personal Microsoft accounts with OneDrive on corporate Windows devices—unless restricted by admin policy. Administrators who have already restricted personal accounts on corporate devices can continue to manage this as before. This new feature introduces a prompt only when a personal account is already signed in on the device, encouraging users to also sign into OneDrive with that account.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e1f16d1f-e7ef-4d35-896d-183bffaa1015/032e219799e6662eff1cd20b1c150acb98cb5818.png\" style=\"width: 600px;\"><br></p><p>Importantly, this prompt does not automatically combine or transfer files between personal and corporate accounts. Users must take deliberate action to move or save files between accounts, and Microsoft blocks the move of known folders to personal OneDrive accounts from domain joined devices by default. Additionally, data protection features such as sensitivity labels and data loss prevention (DLP) policies continue to apply.</p><p>This update does not “sync” personal files with corporate accounts or vice versa. It simply allows access to separate OneDrive accounts on the same device without merging content – similar to checking both work and personal emails on one device without combining inboxes.</p><p>Devices in regions where the Digital Markets Act is applicable will not see this prompt.</p><p>Organizations that have already disabled personal OneDrive accounts on corporate devices with the DisablePersonalSync policy will not see this prompt. Administrators can also suppress it using the DisableNewAccountDetection policy. More information on configuring policies can be found <a href=\"https://learn.microsoft.com/sharepoint/use-group-policy#prevent-users-from-syncing-personal-onedrive-accounts\" target=\"_blank\">here</a>.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=490064\" target=\"_blank\">490064</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in mid-June 2025 and expect to complete by early July 2025.</p><p><b>How this will affect your organization:</b></p><p>This feature prompts users who are signed into a personal Microsoft account on a Windows device and actively using their corporate OneDrive to also sign into OneDrive with their personal account. Once signed in, users can access both their personal and corporate OneDrive accounts on the same device—without merging content. The prompt is enabled by default and only appears if a personal account is already in use on the device. <i>Organizations that have previously restricted personal account usage with the DisablePersonalSync policy will not see the prompt.</i> Administrators can also suppress it using the DisableNewAccountDetection policy.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p></p><div style=\"\">To prepare for this change, it is recommended to update any support documentation. Organizations that have previously restricted personal account usage with the DisablePersonalSync policy will not see the prompt. Administrators can also suppress it using the DisableNewAccountDetection policy.</div><p></p><br>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490064"
    },
    {
      "Name": "Summary",
      "Value": "OneDrive will prompt users to add their personal accounts if already signed in on corporate Windows devices. This does not merge personal and corporate files. Administrators can manage or suppress this prompt using specific policies. The update rolls out from mid-June to early July 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075910",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-21T16:19:18.047Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:24:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "OneDrive: Prompt to Add Personal Account to OneDrive Sync",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
