{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With this rollout, admins will be able to access detailed audit logs for the <i>Give control,</i> <i>Take control,</i> and screensharing features in Microsoft Teams. These logs will provide comprehensive information, including the names and timestamps of the individuals involved in each action. The logs will indicate who initiated or received control of a screensharing session and who started the screensharing session, along with the corresponding timestamps. Further, the logs will indicate who took control, and gave control and the timestamps of these actions. This new feature ensures greater transparency and accountability for all control and screensharing activities.</p><p>This message applies to meetings, webinars, and town halls in Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android. Note: Give and Take control are not supported in town-halls, webinars and Teams for iOS/Android.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489224\" target=\"_blank\">489224</a>.</p><p>\n</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early July 2025 and expect to complete by mid-July 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 and expect to complete by late July 2025.\n</p><p><b>How this will affect your organization:</b></p><p>This feature will be available by default for admins to configure in the Microsoft Purview portal.</p><p>Create a new search in the Purview audit portal at <i>Audit &gt; Audit search &gt; New search.</i></p><p>Audit search results in Purview:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/154fcc0c-d6b3-4c27-ba8c-cd82d06b1661\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489224"
    },
    {
      "Name": "Summary",
      "Value": "Admins will soon access detailed audit logs for Give control, Take control, and screensharing in Microsoft Teams, including names and timestamps. This feature, available across various platforms except in town-halls, webinars, and Teams for iOS/Android, will roll out in July 2025 and can be configured in the Microsoft Purview portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090698",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-09T23:18:42.44Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:18:33Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New audit logs for Give control, Take control, and Screensharing",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
