{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, Microsoft Endpoint data loss prevention (Endpoint DLP) supports <i>Audit only, Block, and Block with override</i> on the <i>Create policy</i> page in Microsoft Purview | Endpoint DLP. This rollout will add two new modes: <i>Off </i>and <i>Allow</i>.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=480731\" target=\"_blank\">480731</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early March 2025 and expect to complete by mid-March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The two new modes are:</p><ul><li>Off: Endpoint DLP will not trigger events or Alerts and will not trigger notifications. You can use this enforcement mode to configure restrictions for a specific group.\n</li><li>Allow: Endpoint DLP will not trigger Alerts and will not trigger notifications but will trigger events in Activity explorer.\n</li></ul><p>In Microsoft Purview, the new <i>Allow </i>and <i>Off </i>enforcement modes on the <i>Create policy</i> page for Endpoint DLP:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e22869d2-50c6-4d61-861f-ff55a4232dad\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>The new modes will be available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You will need these prerequisites to use the new modes:</p><ol><li>All prerequisites in <a href=\"https://learn.microsoft.com/purview/device-onboarding-overview#prepare-your-windows-devices\" target=\"_blank\">Onboard Windows devices into Microsoft 365 overview | Microsoft Learn</a>\n</li><li>A Defender Antimalware client version higher than 4.18.25010. To find the version of Microsoft Defender (Windows Defender) Antimalware, follow these steps:\n<ol><li>Open <i>Windows Security.\n</i></li><li>Click on the <i>Settings </i>gear icon.\n</li><li>Look for the <i>About </i>link.\n</li><li>The <i>About </i>page contains the version information for the Windows Defender components.\n</li></ol></li></ol><p></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "480731"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Endpoint DLP is adding two new modes, \"Off\" and \"Allow,\" to the existing \"Audit only,\" \"Block,\" and \"Block with override\" options. The rollout will occur in March 2025. These modes will be available by default, and prerequisites include specific Defender Antimalware client versions. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1012244",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-21T00:55:31.55Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-21T00:55:13Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention: New Allow and Off modes for each activity",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
