{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: The Microsoft Teams Meeting add-in in classic Microsoft Outlook for Windows desktop will suggest meeting options to meeting organizers based on meeting details, helping organizers easily schedule meetings with optimized settings from the scheduling form.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=487858\" target=\"_blank\">487858</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early June 2025 and expect to complete by mid-June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, meeting organizers that have the Teams add-in installed for classic Outlook for Windows desktop will be able to see <i>Meeting option</i> suggestions in the new <i>Setup </i>pane of the scheduling form when they schedule a Teams meeting. meeting organizers can open the <i>Setup </i>pane from the Teams Meeting add-in ribbon in the form, or the pane will automatically open when suggestions are available.\n</p><p>A meeting organizer can save or accept the suggestions and easily update <i>Meeting options</i> from the pane.\n</p><p>This feature will be available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Refer to documentation on how to manage, install, and troubleshoot the Teams COM add-in for Classic Outlook for Windows:</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-addins-in-the-admin-center?view=o365-worldwide\" target=\"_blank\">Manage add-ins in the admin center - Microsoft 365 admin | Microsoft Learn</a></li><li><a href=\"https://support.microsoft.com/office/use-add-ins-in-outlook-1ee261f9-49bf-4ba6-b3e2-2ba7bcab64c8#bkmk_classic_installstore\" target=\"_blank\">Use add-ins in Outlook - Microsoft Support</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/meetings/resolve-teams-meeting-add-in-issues\" target=\"_blank\">Resolve issues with Teams Meeting add-in for classic Outlook - Microsoft Teams | Microsoft Learn</a></li></ul><p>Before rollout, we will update this post with new documentation.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "487858"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"487858\":[{\"RoadmapId\":487858,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2025-04-24T19:12:35.5847547Z\",\"LatestRing\":null},{\"RoadmapId\":487858,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2025-04-24T19:12:35.5847548Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Teams Meeting add-in for classic Microsoft Outlook for Windows will soon suggest meeting options based on meeting details. This feature will roll out in June 2025 and will be available by default. No admin action is required, but organizations should notify users and update documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-09-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1059668",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-21T23:38:38.27Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-21T23:38:28Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Meeting option suggestions in classic Microsoft Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
