{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 13, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>A new Slide Control feature allows presenters in both meetings and events to share control of their Microsoft PowerPoint presentations. Users with control will be able to move the slides forward and backward for all users in the meeting, making it easy for each speaker to directly control their content.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fafeb557-ec85-4bc9-82b2-3fa27575138c\" style=\"width: 450px;\"><br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484844\" target=\"_blank\">484844</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early July 2025 and expect to complete by mid-July 2025. \n</p><p>General Availability (Worldwide): We will begin rolling out late July 2025 and expect to complete by early August 2025.\n</p><p>General Availability (GCC): We will begin rolling out late July 2025 and expect to complete by mid-August 2025. \n</p><p>General Availability (GCC High): We will begin rolling out mid-August 2025 and expect to complete by late August 2025. \n</p><p>General Availability (DoD): We will begin rolling out early September 2025 and expect to complete by mid-September 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>On release, Slide Control will be enabled for all internal users in the tenant and disabled for all external users.</p><p><b>What you need to do to prepare:</b></p><p>Before release, decide what feature scope you'd like to apply within your tenant, meaning which type of users are allowed to use the new Slide Control feature. </p><p>Note: Slide Control only allows for presenters to share control of their slides with the users they choose; users cannot request control themselves.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "484844"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"484844\":[{\"RoadmapId\":484844,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-06-06T23:15:23.4115712Z\",\"LatestRing\":null},{\"RoadmapId\":484844,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-06-06T23:15:23.4115714Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a Slide Control feature for PowerPoint presentations, allowing presenters to share control of slides in meetings and events. The rollout will occur from July to September 2025, varying by release type. The feature will be enabled for internal users and disabled for external users."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052166",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-13T20:25:20.3Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T01:46:10Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Slide Control for PowerPoint presenters",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
