{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft SharePoint Online: SharePoint and Global Admins will be able to use a Microsoft PowerShell cmdlet to review tenant-level usage data for the SharePoint agents trial.\n</p><p>After this rollout, the PowerShell cmdlet <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/get-spocopilotpromousage?view=sharepoint-ps\" target=\"_blank\">Get-SPOCopilotPromoUsage</a> will show&nbsp;usage data for the SharePoint agents trial at the tenant level (total trial queries used, trial queries left, and trial queries available in tenant). This report will show historical data starting from January 2025 when the SharePoint agents trial started.\n</p><p><b>When this will happen:</b></p><p>General Availability (Production): The PowerShell cmdlet <code>Get-SPOCopilotPromoUsage</code> will be available starting March 1, 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Starting March 1, 2025, current SharePoint admins will need to download the 16.0.25813.12000 version of <a href=\"https://www.microsoft.com/download/details.aspx?id=35588&amp;msockid=397fbfe1479b6451031fab56466a6516\" target=\"_blank\">SharePoint PowerShell</a> to access <code>Get-SPOCopilotPromoUsage</code>.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/sharepoint/manage-trial-agents-sharepoint-powershell\" target=\"_blank\">Manage trial access to SharePoint agents with PowerShell - SharePoint in Microsoft 365 | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New PowerShell cmdlet, Get-SPOCopilotPromoUsage, will be available on March 1, 2025, for SharePoint and Global Admins to review tenant-level usage data for the SharePoint agents trial. Admins need to download version 16.0.25813.12000 of SharePoint PowerShell. No admin action is required before or after the rollout."
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1015905",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-25T00:38:40.907Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-25T00:38:24Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint Online: New usage reports through Microsoft PowerShell for the SharePoint agents trial",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
