{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams for iOS/Android: New DVR (digital video recording) functionality for users who attend town halls.\n</p><p>This feature is available for town hall instances from all organizers, regardless of the license assigned to the organizer.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486694\" target=\"_blank\">486694</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late May 2025 and expect to complete by late May 2025.\n</p><p>General Availability (GCC High, DoD): We will begin rolling out early June 2025 and expect to complete by early June 2025.</p><p><b>How this will affect your organization:</b></p><p>This new feature will allow town hall attendees to interact with a live streaming town hall in the same way as they would interact with recorded content when viewing on desktop or web. DVR functionality in the town hall enables event attendees to pause and move forward or back in a town hall, navigate to any previously streamed timestamp, and other abilities that make it more convenient and easier for users to interact with a town hall and digest the content being presented.\n</p><p>To get started, attendees will touch the screen over the content being presented in the town hall and the DVR controls will appear. In this image, the live town hall is on the left, and the DVR view is on the right:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c52bbf4c-123a-4f43-9f03-244a77928587\" style=\"width: 400px;\" alt=\"user controls\"></p><p>The user can pause, play, skip 10 seconds forward or backward. The user can also control the volume of the content using volume control. The user can also jump to any point of time in the past from the start of an event. The user can catch up with the content and join the live event by selecting the <i>Watch live</i> button. The town hall window will remain open for 24 hours after the end of the event.</p><p>We are committed to continuously improving the Microsoft Teams experience and are excited to bring this new capability to our customers.\n</p><p>This feature will be available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/plan-town-halls\" target=\"_blank\">Plan for Teams town halls - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486694"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"486694\":[{\"RoadmapId\":486694,\"Platform\":\"iOS\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-28T12:31:59.4465737Z\",\"LatestRing\":null},{\"RoadmapId\":486694,\"Platform\":\"Android\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-28T12:31:59.4465739Z\",\"LatestRing\":null},{\"RoadmapId\":486694,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-28T12:31:59.4465739Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "New DVR capabilities for Microsoft Teams town halls on iOS and Android will roll out in May 2025 (Worldwide, GCC) and June 2025 (GCC High, DoD). This feature allows attendees to pause, skip, and navigate through live town hall events, enhancing interaction and convenience. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061725",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-24T23:17:21.8Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T23:17:10Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: New DVR (digital video recording) capabilities for town halls on iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
