{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><i>NOTE:</i></b><i> If you are a Microsoft Teams customer (not a Microsoft Teams Premium customer), we are sending this message to you because this new setting will take effect automatically for any user assigned a Microsoft Teams Premium or Microsoft 365 Copilot license, even if your organization previously didn't have these licenses. Therefore, we recommend all organizations review this message, regardless of your organization's current license status.</i>\n</p><p>Coming soon: We will add a new Microsoft PowerShell policy setting called <code>SpeakerAttributionBYOD</code> to <code>csTeamsAIPolicy</code> for Microsoft Teams Premium users. This setting gives IT admins more control over speaker attribution in BYOD (bring your own device) scenarios. <b>NOTE: </b>This setting will be enabled by default when the feature rolls out.</p><p>This setting allows organizations to manage how speaker attribution is used in meetings where users join via personal devices, helping enhance the in-meeting and post-meeting experience with features like speaker labels (Speaker 1, Speaker 2, etc.) and Microsoft 365 Copilot in shared spaces (meetings, chat). To access Copilot features, a Microsoft 365 Copilot license is required.\n</p><p>This message applies to Teams for Windows desktop and Teams for Mac desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=488301\" target=\"_blank\">488301</a>.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out early June 2025 and expect to complete by mid-June 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, the <code>CsTeamsMeetingPolicy</code> has a parameter called <code>RoomAttributeUserOverride</code>&nbsp;that can be set to three values (<code>OFF</code>, <code>Distinguish</code>, and <code>Attribute</code>) to allow admins to manage speaker attribution for their users.</p><p>After this rollout, the new setting <code>SpeakerAttributionBYOD</code> for <code>csTeamsAIPolicy</code> will control whether speaker attribution is enabled for meetings joined from BYOD scenarios.\n</p><p>The new policy setting enables voice-based speaker attribution in shared meeting scenarios where users join using their personal devices</p><p>Key benefits of this change include:\n</p><ul><li>Ensures all participants in the room are recognized and attributed in transcripts</li><li>Enables users to get the most out of intelligent recap and Copilot insights</li><li>Enhances meeting room experiences through intelligent audio and video capabilities</li><li>Higher usage of speaker attribution by removing barriers for licensed users</li><li>Improved value realization from Teams Premium and Copilot licenses</li><li>Easier customizable configurations based on customer needs</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before or after the rollout. Review your current configuration to assess the impact on your organization.</p><p>After the new setting rolls out to your organization, you can modify the setting using PowerShell if you prefer to disable the feature.</p><p>If you wish to modify the on by default setting before it rolls out to your organization, you can do that in May. We will update this message to let you know when you can take this preemptive action. </p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/powershell/module/teams/set-csteamsaipolicy?view=teams-ps\" target=\"_blank\">Set-CsTeamsAIPolicy (MicrosoftTeamsPowerShell) | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/powershell/module/teams/get-csteamsaipolicy?view=teams-ps\" target=\"_blank\">Get-CsTeamsAIPolicy (MicrosoftTeamsPowerShell) | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/rooms/voice-and-face-recognition\" target=\"_blank\">Overview of voice and face enrollment - Microsoft Teams | Microsoft Learn</a></li><li>Learn more about <a href=\"https://support.microsoft.com/office/use-microsoft-teams-intelligent-speakers-to-identify-in-room-participants-in-a-meeting-transcription-a075d6c0-30b3-44b9-b218-556a87fadc00#bkmk_setupvoiceprofile\" target=\"_blank\">setting up voice enrollment for end users</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-10-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052162",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-10T01:45:04.563Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T01:44:41Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Premium: New Speaker Attribution setting for BYOD in CsTeamsAIPolicy (enabled ON by default)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
