{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 30, 2025: We have updated the timeline below. Thank you for your patience.&nbsp;&nbsp;</p><p>Coming soon: Users will be able to use the new Compress feature to reduce the file sizes of PDFs stored on Microsoft OneDrive for the web or Microsoft SharePoint. Users can choose from three different compression levels.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=487440\" target=\"_blank\">487440</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early July 2025 (previously late April) and expect to complete by late July 2025 (previously early May).</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late July 2025 (previously late May) and expect to complete by early August 2025 (previously early June).</p><p><b>How this will affect your organization:</b></p><p>To compress PDF files for a smaller size:\n</p><p>1. Open a PDF in OneDrive for the web (in SharePoint, go to the document library and choose <i>Preview</i>):\n</p><p>2. Select the <i>Compress</i> button at the top of the screen:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/66fdc740-0992-45bd-9ef9-996744fcbc1b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>3. Select a compression level and then select <i>Save a copy</i> to save the compressed file:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/55ba79c2-ef00-4df6-a86a-908346dee3eb\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>A progress notification will appear at the bottom of the screen. After the compression is complete, select <i>Open </i>from the notification to view the compressed file:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8a3953ab-9cc2-449a-9347-8d89e55f09b1\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>FAQ</i>\n</p><p><i>What is the quality and subsampling for each compression level?</i></p><p>We offer three levels of image compression. All use lossy compression and chroma subsampling to reduce file sizes while maintaining visual quality. The options are:&nbsp;</p><ul><li>Light compression: Apply 4:2:0 color subsampling and reduce 25% of image pixels.&nbsp;</li><li>Medium compression: Apply 4:2:0 color subsampling and reduce 50% of image pixels.&nbsp;</li><li>Heavy compression: Apply 4:2:0 color subsampling and reduce 75% of image pixels.</li></ul><p>Users can compress one PDF at a time. The original file must be smaller than 300 MB.</p><p>This feature is on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p><b>Note:</b> Some users may see this feature before other users in your organization.\n</p>\n<p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "487440"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint and OneDrive will soon introduce a PDF compression feature, allowing users to reduce PDF file sizes with three compression levels. The rollout starts in July 2025 for Targeted Release and completes by early August 2025 for General Availability. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061109",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-30T19:24:48.173Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T00:56:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint and Microsoft OneDrive: New PDF compression feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
