{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Effective May 17, 2025, we will retire the option for users to invite external partners to Microsoft Teams by sending an SMS to their phone number to join Teams and continue the conversation. We are retiring this feature to provide a more consistent experience. Organizations can continue to use emails to invite partners outside of their organizations for external teamwork.</p><p>Alternatively, customers can sign up for a two-way SMS calling plan to continue inviting external partners to Teams by sending an SMS to their phone number. \n</p><p>This change will happen automatically by the specified date. No admin action is required. Please notify your users about this change, update relevant documentation as appropriate, and share alternatives for users to invite external partners to Teams.</p><p><i>Learn more</i></p><ul><li><a href=\"https://support.microsoft.com/office/add-or-invite-people-outside-your-org-to-a-chat-in-microsoft-teams-6897ab47-9f60-4db6-8b95-18599714fe57\" target=\"_blank\">Add or invite people outside your org to a chat in Microsoft Teams - Microsoft Support</a> (will be updated before feature retires)</li><li>About two-way SMS: <a href=\"https://learn.microsoft.com/microsoftteams/sms-overview\" target=\"_blank\">Planning for SMS in Microsoft Teams - Microsoft Teams | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will retire SMS invitations to external partners effective May 17, 2025. Users can continue inviting external partners via email or by signing up for a two-way SMS calling plan. This change requires no admin action, but users should be informed, and documentation updated."
    }
  ],
  "EndDateTime": "2025-07-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1057714",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-18T03:29:12.64Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-18T03:28:52Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: We will retire SMS invitations from Teams to external partners",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
