{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>SharePoint&nbsp;Online users are now able to use the left navigation pane to create new SharePoint sites or pages, as well as to navigate to SharePoint sites where they have recently contributed to a page.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b6a5cbc0-297e-4a0d-9521-65d65f271855\" style=\"width: 450px;\"></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We began rolling out early March 2025 and expect to complete by late April 2025.</p><p><b>How this will affect your organization:</b></p><p>SharePoint users can now leverage the left navigation panel to filter pages related to various sites they have recently worked on.</p><p><u>How to create new pages from specific SharePoint sites</u>:</p><p>SharePoint users can quickly select from <i style=\"\">Recently edited</i> on the Start page without extra navigation. To create a new page:</p><ol><li>Under <i>Recently edited</i>, select the site on which you want to create a new page.\n</li><li>At the top of the screen, choose one of the six available templates to create a new page.</li></ol><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/535d6b27-402f-418e-bd63-e1ce674d16f6\" style=\"width: 450px;\"><span style=\"background-color: rgb(255, 255, 0);\"><br></span></p><p><span style=\"background-color: rgb(255, 255, 0);\"><br></span></p><p><u>How to navigate to a SharePoint site from SharePoint Start:</u></p><ol><li>Under <i>Recently edited</i>, select the site you want to navigate to.\n</li><li>Click <i>Open site</i> located on the top right of the screen.</li></ol><p>\n</p><p><u>How to copy an existing page in SharePoint Start:\n</u></p><ol><li>Locate the page you want to duplicate under <i>My pages</i> or <i>My pages on this site</i> located in the middle of the screen.\n</li><li>Scroll over the page and then select <i>Duplicate</i>.\n</li></ol><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fa9368d7-ef0a-448c-b1aa-ccbf207f0b57\" style=\"width: 300px;\"><b><br></b></p><p><b>FAQs</b></p><p><u style=\"\">Can I see all the SharePoint sites I've used before?\n</u></p><p>To see all SharePoint sites to which you've contributed pages, go to <i>View all sites</i> at the bottom of the <i>Recently edited</i> list.</p><p><u style=\"\">I have used other SharePoint sites which are not displayed in SharePoint Start.\n</u></p><p>SharePoint Start displays only those sites which you have created, edited, shared, or to which you have published pages.</p><p><u style=\"\">In what ways does SharePoint Start assist users in managing their pages?\n</u></p><p>Authors and their collaborators can easily find drafts or published pages under <i>My pages</i> or <i>My pages on this site</i>. Hovering over a page shows <i>Duplicate</i>, <i>Share</i>, or <i>More actions</i> options.</p><p>By selecting <i>More action</i>, users are presented with more actions including <i>Open</i>, <i>Share</i>, <i>Duplicate</i>, <i>Copy link</i>, <i>Manage access</i>, and <i>Delete</i>.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/87ba7622-f29d-42ec-901e-801515e14401\" style=\"width: 200px;\"><br></p><p> \n</p><p><span style=\"background-color: rgb(255, 255, 0);\">\n\n</span></p><p>Additional clarification on the other listed actions is provided below:\n</p><ul><li><i>Open </i>lets users view the selected page in canvas mode.\n</li><li><i>Share</i> lets users create a link to share the page with collaborators.\n</li><li><i>Duplicate </i>enables users to create an exact copy of the selected page.\n</li><li><i>Manage access</i> restricts user access.\n</li><li><i>Delete </i>moves the selected page to the recycle bin.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online users can now manage pages using the left navigation pane, create new pages, navigate to recently edited sites, and duplicate existing pages. The rollout began in March 2025 and will complete by April 2025. No admin action is required, but user notification and documentation updates are recommended."
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1042934",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-28T05:37:09.077Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-28T05:37:02Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint Online: Manage SharePoint pages using the left navigation pane",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
