{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As hybrid and remote collaboration continues to evolve, we’re seeing growing disparities in how people are seen, heard, and engaged during meetings. These challenges are particularly noticeable for participants joining remotely, using assistive technologies, or communicating through different modalities.</p><p>Before this rollout, sign language users face several challenges during meetings, including difficulty locating and identifying their interpreters, as well as ensuring proper positioning of interpreter video feeds. Furthermore, active speaker detection prioritizes audio, resulting in participants who communicate through sign language often receiving less visual prominence than verbal speakers. These challenges make it more difficult for Deaf and hard-of-hearing participants to remain fully engaged during meetings.\n</p><p>In Microsoft Teams, we are committed to addressing these gaps, with a particular focus on enhancing the meeting experience for Deaf and hard-of-hearing participants who communicate using sign language. As part of our initial efforts, we are introducing Sign Language Mode. When enabled, Sign language users will benefit from an enhanced meeting experience. Interpreters will be clearly identified in the participant roster and visually distinguished throughout meetings. Deaf and hard-of-hearing participants who use sign language will be automatically detected and elevated to active speaker status, ensuring equal prominence with spoken audio participants. This will help create a more equitable and collaborative environment for everyone.\n</p><p><b>NOTE:</b> Teams for Windows desktop and Teams for Mac desktop are required for sign language detection. Support for Teams for web will come later this year. Sign language detection will not work on mobile devices. Signer promotion to the primary meeting view will work in Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android. \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=494843\" target=\"_blank\">494843</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early July 2025 and expect to complete by mid-July 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 and expect to complete by late July 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>To address these issues, sign language interpreters will be identifiable and clearly displayed in the participant roster, as well as visually distinguished throughout the meeting experience. Also, when a Deaf or hard-of-hearing participant is detected using sign language, they will be elevated to active speaker status and receive the same prominence and treatment as audio-based participants.</p><p>This feature will be available by default to be enabled by users via the Teams accessibility settings.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>Before the rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494843"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"494843\":[{\"RoadmapId\":494843,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-07-10T07:17:37.5258357Z\",\"LatestRing\":null},{\"RoadmapId\":494843,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-07-10T07:17:37.525836Z\",\"LatestRing\":null},{\"RoadmapId\":494843,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-07-10T07:17:37.5258361Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing Sign Language Mode to enhance meeting experiences for Deaf and hard-of-hearing participants. This feature will identify and visually distinguish interpreters, elevate sign language users to active speaker status, and ensure equal prominence with audio participants. Rollout begins in July 2025 for desktop and web platforms."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-09-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1088725",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-05T23:39:56.547Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-05T23:39:25Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Inclusive meeting enhancements for sign language users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
