{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to introduce Microsoft 365 Copilot Wave 2 Spring release updates to the Microsoft 365 Copilot app—the starting place for AI at work. Designed for the new AI-first way of working, these updates for Copilot Chat users (without a Microsoft 365 Copilot license) include:</p><ul><li><b>Refreshed navigation pane:</b> Easily navigate between modules using a simplified UI.</li><li><b>Simplified Copilot Chat experience:</b> Quick access to chat history, Copilot Pages, and agents, with collapsible navigation pane.</li><li><b>Agent Store: </b>Easily find, pin, and use a range of agents.</li></ul><p>These updates will provide a more streamlined and productive experience, helping to ensure that users have the tools they need to use AI effectively at work. Learn more about this announcement: <a href=\"https://aka.ms/NewM365CopilotApp\" target=\"_blank\">https://aka.ms/NewM365CopilotApp</a>&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=490155\" target=\"_blank\">490155</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release (Web, Windows): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.</p><p>General Availability (Web, mobile, Windows): We will begin rolling out late May 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Copilot Chat users (without a Microsoft 365 Copilot license) will notice the following changes to the Microsoft 365 Copilot app.</p><p>Note: Please refer to MC1060780&nbsp;for Microsoft 365 Copilot app updates for licensed Microsoft 365 Copilot users.</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9bdb98d3-d7b2-4aaf-a8a6-bce596304657\" width=\"400\" height=\"\"><b><br></b></p><p><b>1. Refreshed Navigation Pane -</b> The Microsoft 365 Copilot app's left navigation pane now provides users with quick access to essential modules such as Search, Chat, Notebooks, Create, and Apps. Users can pin or unpin apps and agents to customize their workspace. Users can also install Microsoft 365 apps to their desktop using the Install button in the Apps module. Notifications for Copilot asynchronous activity will be indicated by toast notifications and bubble icons in the navigation pane.</p><p><b>2. Upgrade Copilot -&nbsp;</b>As communicated in MC1017114, users can also request a Microsoft 365 Copilot license from their admin, or self-service purchase a license, by selecting “Upgrade Copilot” present in the navigation pane. To manage the “Upgrade Copilot” experience, see <a href=\"https://learn.microsoft.com/microsoft-365/commerce/subscriptions/manage-self-service-purchases-admins?view=o365-worldwide#allow-or-block-self-service-purchases-and-trials\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif;\">Manage self-service purchases and trials (for admins)</a>.</p><p><b><u>New modules:</u></b></p><p><b>3. Notebooks – </b>Notebooks requires a Microsoft 365 Copilot license. Copilot Chat users will see this module in the left navigation pane but if they select it, they will be shown a screen indicating that a license is required, along with additional information on the feature and how to upgrade. Note: The Notebooks module may not be visible in the left navigation pane for all customers.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/484ce2fd-9209-4f99-bff3-e4a7bb40943b\" width=\"400\" height=\"\"></p><p><b><u>Existing modules:</u></b></p><p><b>4.\tSearch –</b>&nbsp;With this update, Search replaces the Home module. Search will have a refreshed experience displaying key files in dedicated sections for easier access and a search bar to help them quickly find what they need.</p><p><b>5.\tChat –</b> Chat has been streamlined for a simplified experience with an updated collapsable left navigation pane for quick access to chat history, Copilot Pages, agents, and the Agent Store located underneath Chat. Additionally, the input box is moving to the center of the UI with prompt suggestions found below it. Users can also use the Copilot key or Win + C shortcut on Windows 11 devices to open Chat and invoke the Microsoft 365 Copilot app.</p><p><b>6.\tCreate – </b>Create will have a refreshed UI that lets users quickly create documents, presentations, and more using templates.</p><p><b><u>Mobile: </u></b></p><p>Below are changes specific to the mobile app experience:</p><ul><li><b>Navigation pane -</b> Users will see the Search, Chat, and Create modules pinned to the bottom of the app. Users can access other modules (Pages, Agents, Chats, Apps) through the new navigation hamburger menu in the top left of the UI.\n</li><li><b>Create -</b> The Scan, Extract, and Dictate flows from the Capture module have been merged into the Create module for a one-stop destination for all creation flows in the app.</li></ul><p>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>The update to the Microsoft 365 Copilot app will occur automatically by the specified dates, requiring no admin action before the rollout. However, it is advisable to notify your users about this change and update any relevant documentation to ensure a smooth transition.</p><p>Admins can manage Microsoft 365 Copilot app scenarios with the following controls:</p><table class=\"table table-bordered\"><tbody><tr><td><b>Setting</b></td><td><b>Description</b></td><td><b>Documentation</b></td></tr><tr><td><b>Chat</b></td><td>Admins can manage access to Copilot Chat, whether it is pinned for users, and web search.&nbsp;</td><td>Managing Chat: <a href=\"https://learn.microsoft.com/copilot/manage\" target=\"_blank\">Manage Microsoft 365 Copilot Chat | Microsoft Learn</a></td></tr><tr><td><b>Agents</b></td><td>Admins can manage agents for Copilot in the same way as they manage any other app in the Integrated apps section of the Microsoft 365 admin center. Admins can enable, disable, assign, block, or remove agents for their organization, and manage Copilot capabilities and data privacy.</td><td>See settings configurations here: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in Integrated Apps - Microsoft 365 admin | Microsoft Learn</a></td></tr><tr><td><b>Pages</b></td><td>Ability to manage Copilot Pages, .loop files stored in a user-owned SharePoint Embedded containers, using an admin on/off switch.</td><td>See settings configurations here: <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-components-configuration?view=o365-worldwide\" target=\"_blank\">Manage Loop components in your organization | Microsoft Learn</a></td></tr><tr><td><b>Copilot Key and Windows + C shortcut</b></td><td>Admins can map the Copilot key to the Microsoft 365 Copilot app.</td><td>Use policy to map the Copilot key: <a href=\"https://learn.microsoft.com/windows/client-management/manage-windows-copilot#policies-to-manage-the-copilot-key\" target=\"_blank\">Policies to manage the Copilot key</a></td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490155"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot app updates for unlicensed users include a refreshed navigation pane, simplified chat experience, and an Agent Store. The rollout begins mid-May 2025 for targeted release and late May 2025 for general availability. No admin action is required, but user notification is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060783",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-23T17:04:13.323Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T14:28:56Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "(Highlight) Microsoft 365 Copilot app: Updates for unlicensed Microsoft 365 Copilot Chat users (Wave 2 Spring release)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
