{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Bilateral chat policy is a new type of policy for restricting external group chats in Microsoft Teams to maximum of two organizations. This policy will be available for admins to set up and apply to users and groups where external access policies are already set up. After the policy is enabled, automatically enforced compliance controls will prohibit users from creating or adding users from more than two organizations to external group chats.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams on the web, and Teams for iOS/Android.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490566\" target=\"_blank\">490566</a>.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early June 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Admins will be able to set up bilateral chat policy in the Teams admin center or Microsoft PowerShell. Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/bilateral-chat-enforcement\" target=\"_blank\">Set up a bilateral chat policy - Microsoft Teams | Microsoft Learn</a></p><p>After external access and the bilateral chat policy is set up, users with the policy can be in external group chats only with a maximum of two organizations. The user is also removed from existing external group chats with more than two organizations.</p><p>This policy doesn't apply to meetings, meeting chats, or channels.\n</p><p>This policy is available by default for admins to configure.</p><p>Adding user to an external group chat that violates bilateral chat policy:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/748d0dfa-2349-4af4-9de2-45896a0fdd00\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Creating an external group chat that violates bilateral chat policy:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6f37645b-3170-4c6c-9914-f3a4ffb0bfb4\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>To set up a bilateral chat policy, you must first set up and enable external access.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/bilateral-chat-enforcement\" target=\"_blank\">Set up a bilateral chat policy - Microsoft Teams | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490566"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a bilateral chat policy to restrict external group chats to a maximum of two organizations. This policy, rolling out in June 2025, applies to all Teams platforms and will be configurable by admins. It does not affect meetings, meeting chats, or channels."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1080690",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-22T23:48:23.627Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-22T23:48:03Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New bilateral chat policy for restricting external group chats to a maximum of two organizations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
