{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 21, 2025: We have updated the content Thank you for your patience.</p><p>SharePoint Online Tenant Administrators can now allow script sources for modern pages in SharePoint sites. This feature is particularly useful in scenarios where modern pages have custom code that loads scripts (e.g., TypeScript code) from external sources like a content delivery network (CDN). SharePoint will now report to administrators where sources that have not been allowed are loaded from, providing a way for administrators to identify those sources and take action. Tenant Administrators can also enforce browsers to only load scripts from allowed sources. This behavior can be enabled using SharePoint Online Management Shell.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out on late March 2025 and expect to complete by early April 2025.</p><p>General Availability (Worldwide): We will begin rolling out on late April 2025 and expect to complete by late April 2025.</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out on late April 2025 and expect to complete by early June 2025 (previously mid-May).</p><p><b>How this will affect your organization:</b></p><p>Tenant Administrators will have the option to control and govern where custom code loads scripts and, if needed, enforce browsers to only load scripts from trusted sources. A new \"Trusted script sources\" page will give administrators control over which source can be trusted to load scripts.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3b34c585-d76a-4298-9e27-888804978fbb\" style=\"width: 450px;\"></p><p><br></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/60c8e8ab-6f88-4d18-870f-3114006b7141\" style=\"width: 450px;\"></p><p><br></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/39c433d2-d7ed-4530-bcdb-0f774aa44c0a\" style=\"width: 450px;\"></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/23bb2ec6-cf5f-40c1-84fd-439be67e0055\" style=\"width: 450px;\"></p><p><b>What you need to do to prepare:</b></p><p></p><div style=\"\">This rollout will happen automatically with no admin action required.</div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online Tenant Administrators can now allow and control script sources for modern pages, enforcing browsers to load scripts only from trusted sources. This feature will roll out from late March to early June 2025, depending on the release type. No admin action is required for this rollout."
    }
  ],
  "EndDateTime": "2025-07-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1055557",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-21T19:27:12.027Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-15T00:31:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "SharePoint Online: Content Security Policy Control in Tenant Administration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
