{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams Rooms on Windows can now join Microsoft events (webinars, town halls, structured meetings) as attendees. You can attend directly from the invited Teams Room with the same features that attendees have for all events. This is available only in Teams Rooms Pro.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484125\" target=\"_blank\">484125</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.</p><p>General Availability (GCC): We will begin rolling out late May 2025 and expect to complete by mid-June 2025.\n</p><p>General Availability (GCC High): We will begin rolling out late June 2025 and expect to complete by mid-July 2025.</p><p>General Availability (DoD): We plan begin rolling out late August 2025 and expect to complete by mid-September 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Recently we announced official support with Teams Rooms on Windows devices as a presenter in Teams Townhall &amp; Webinars ensuring an optimal experience for every event. Starting from app version 5.2.115.0, Teams Town halls and Webinars are exclusively available in rooms with a Teams Rooms Pro license.</p><p>Today, Teams Rooms on Windows with a Pro license can now join events as attendees, making it easier to schedule watch parties for your organization and enjoy an official supported experience. Please note that joining events from Teams Rooms with a non-Pro license will not be supported.&nbsp;</p><p>This feature will be enabled by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "484125"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows can now join Microsoft events as attendees with a Teams Rooms Pro license. This feature will roll out from mid-May 2025 to mid-September 2025, depending on the region. No admin action is required, but users should be notified."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1062452",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-25T22:56:58.857Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-25T22:56:50Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Join as attendees in Microsoft events from Teams Rooms on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
