{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 15, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Coming soon for the Microsoft Viva Engage app for iOS and Android: We will shorten the name for this app from \"Viva Engage\" to \"Engage.\" The change will display in the Apple App Store and Google Play Store and in the installed app.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late May 2025 (previously early May) and expect to complete by late June 2025 (previously mid-May).\n</p><p><b>How this will affect your organization:</b>\n</p><p>The app will continue to work and update as normal, without any additional action from the user.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Viva Engage app for iOS and Android will be renamed to \"Engage\" in app stores. The rollout will start in late May 2025 and complete by late June 2025. No user action is required, but notifying users and updating documentation is recommended."
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1047929",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-15T20:30:53.19Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T02:57:38Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage app for iOS/Android will have a shorter name in app stores",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
