{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 22, 2025: We have updated the timeline. Thank you for your patience.</p><p>We're introducing a new way to seamlessly access your most recently used SharePoint agents directly within the Microsoft 365 Copilot app—no need to navigate back to the SharePoint site. This enhancement helps users stay focused and productive by reducing context switching.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=482601\" target=\"_blank\">482601</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in mid-September 2025 (previously mid-July).</p><p><b>How this will affect your organization:</b></p><p>With this update, users can quickly return to their most recently used SharePoint agents from within the Microsoft 365 Copilot app. SharePoint agents are implemented as <code>.agent</code> files stored on SharePoint sites. Admins can disable an agent at any time by deleting the corresponding file.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/17e2b503-7a17-42cc-8596-7c547685a9e5\" width=\"400\" height=\"\"></p><p>This feature is designed to streamline workflows and improve discoverability of agents users rely on most. It will be on by default.</p><p>\n</p><p><b>What you need to do to prepare:</b></p><ul><li>Consider updating internal training materials and documentation to reflect this new access point.\n</li><li>Review your organization’s SharePoint agent management practices to ensure appropriate governance and lifecycle management.</li></ul><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tMaybe - It introduces a new access point to existing .agent files.</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?\tYes - SharePoint agents are AI-powered and interact with user data.\n</li><li>Does the change provide end users any new way of interacting with generative AI?\tYes - Users can more easily re-engage with generative AI agents.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "482601"
    },
    {
      "Name": "Summary",
      "Value": "Access recently used SharePoint agents directly within the Microsoft 365 Copilot app, starting mid-September 2025. This feature aims to reduce context switching and improve productivity. Admins can manage agents by deleting the corresponding .agent files. Update training materials and review SharePoint agent management practices."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1099692",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-22T18:59:38.14Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-20T22:16:55Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot: Access SharePoint agents in the Microsoft 365 Copilot app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
