{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Users will have the capability to customize their keyboard shortcuts in Microsoft Teams. This feature update empowers users to modify existing shortcuts and assign a key combination of their preference. Through the keyboard shortcuts dialog, users can easily customize their shortcuts by selecting a shortcut, entering a new key combination, and saving the changes. This enhancement enables users to choose their preferred keys for frequently used shortcuts, thereby eliminating the necessity to remember the default key combinations. This feature is designed to enhance user efficiency and streamline workflow by providing a more personalized experience.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490048\" target=\"_blank\">490048</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early June 2025 and expect to complete by mid-June 2025.</p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by early July 2025.</p><p><b>How this will affect your organization:</b></p><p>Users in your organization can now customize their shortcut key combinations to something more familiar to them.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490048"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"490048\":[{\"RoadmapId\":490048,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-05-02T09:16:29.1391908Z\",\"LatestRing\":null},{\"RoadmapId\":490048,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-05-02T09:16:29.1391911Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Users will be able to customize their keyboard shortcuts in Microsoft Teams starting June 2025. This feature allows modifying existing shortcuts and assigning preferred key combinations, enhancing user efficiency. No admin action is required, but notifying users and updating documentation is recommended. For more details, refer to Microsoft 365 Roadmap ID 490048."
    },
    {
      "Name": "Platforms",
      "Value": "Mac"
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066158",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-01T17:11:02.83Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T17:10:57Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Customize your keyboard shortcuts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
