{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 25, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Before this rollout, Microsoft Purview | Endpoint Data Loss Prevention admins cannot restrict Microsoft Edge browser access to sensitive files through <i>Restricted apps and app groups.</i> After this rollout, admins can configure apps or app groups to be blocked in Edge, including a message showing policy violation details.</p><p><b>When this will happen:</b></p><p>Public Preview: We began rolling out early April) and expect to complete by early April 2025.\n</p><p>\n</p><p>\n</p><p>General Availability (Worldwide): We began rolling out early July 2025 (previously early April and expect to complete by late July 2025 (previously early April).</p><p><b>How this will affect your organization:</b>\n</p><p>Purview admins should be aware that these groups are now enforceable in Edge and that non-Edge supported browsers will suggest opening the link in Edge if blocked.</p><p>Purview admins can configure groups in Purview at <i>Data Loss Prevention &gt; Endpoint DLP settings &gt; Restricted apps and app groups</i> that are extensible to the Edge browser.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5a7c7031-37f5-4481-bc2e-7f1e272b174d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Users will see a DLP notice when an app or app group attempts to open a protected file.</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/29bc7297-b29c-492f-bce4-f0df2fc55a7c\" alt=\"user controls\" style=\"width: 400px;\">\n</p><p>This change will be available by default for admins to configure.</p><p><b>What you need to do to prepare:</b>\n</p><p>Identify policies that could be impacted, modify, and help test the new protected Edge experience.</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: The <i>Edge support for apps and app groups (preview)</i> section of <a href=\"https://learn.microsoft.com/purview/dlp-configure-endpoint-settings#edge-support-for-apps-and-app-groups-preview\" target=\"_blank\">Configure endpoint DLP settings | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Endpoint Data Loss Prevention will now support app or app group restrictions in the Microsoft Edge browser. This feature, rolling out from April to July 2025, allows admins to block apps or app groups in Edge and show policy violation details. Admins should update policies and notify users."
    }
  ],
  "EndDateTime": "2025-07-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052914",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-25T18:22:34.35Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T23:35:05Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention: App or app group restriction support for Microsoft Edge browser",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
