{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Purview | Information Protection: On-demand classification of files is a new capability that will help you discover and classify sensitive content in historical data in Microsoft SharePoint Online and Microsoft OneDrive. This includes files that have never been scanned or files that have not been scanned in some time.\n</p><p>On-demand classification of files is a pay-as-you-go (PAYG) feature (not part of the E5 license).\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=475062\" target=\"_blank\">475062</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late March 2025 and expect to complete by early April 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, classifying files for sensitive data only applies to new or modified items (but not to existing content that has not been edited or opened by users) after a new classifier is created in Purview.\n</p><p>After this rollout, this new feature will help in the following situations: \n</p><ul><li>You need to discover sensitive content in historical data that has not been classified by Purview.\n</li><li>You need to retroactively discover and classify sensitive content in historical data, due to updates or changes to custom classifier definitions.\n</li><li>You need to apply Microsoft Purview | Data Loss Prevention (DLP), a Microsoft Purview | Information Protection (MIP) label, or Microsoft Purview | Data Lifecycle Management (DLM) policies to historical data at rest that was previously unclassified.\n</li></ul><p>After you execute an on-demand classification, any policy configured in DLP, MIP, or DLM will be automatically triggered to apply action if corresponding classifiers are found.\n</p><p>This feature will be available by default for admins to configure. This screenshot shows how to configure the feature in the new Purview portal &gt; <i>Data Loss Prevention &gt; Classifiers &gt; Data scans &gt; PHI scan:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/cd968995-7daa-4f8b-89b6-c722da1b917d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "475062"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is introducing on-demand classification of files in SharePoint and OneDrive, allowing discovery and classification of sensitive historical data. This pay-as-you-go feature will roll out in public preview from late March to early April 2025 and be generally available by late June 2025. Admins can configure this feature, which will automatically apply relevant policies. No immediate action is required from admins before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1013459",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-21T23:41:02.753Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-21T23:39:26Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: On-demand classification of files in SharePoint and OneDrive for business",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
