{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft is retiring the <a href=\"https://support.microsoft.com/en-us/office/create-an-alert-to-get-notified-when-a-file-or-folder-changes-in-sharepoint-e5a79e7b-a146-46da-a9ef-d65409ba8918#Pick_tab=Online\" target=\"_blank\">SharePoint Alerts feature</a> to streamline and modernize user notifications. With Power Automate, organizations can benefit from an enhanced, versatile solution that goes beyond traditional alerts, offering seamless integration across Microsoft 365 services and more.</p><p><b>Key Points\n</b></p><ul><li>Major: Retirement\n</li><li>Timeline:\n<ul><li>Starting from July 2025, the creation of new SharePoint Alerts will be gradually turned off for newly onboarding tenants.\n</li><li>Starting from September 2025, the creation of new SharePoint Alerts will be gradually turned off for all tenants.\n</li><li>Starting from October 2025, the SharePoint Alert expiration feature will be gradually activated. Once activated, any SharePoint Alert will have a validity of 30 days starting from its first run, then it will expire. Users can self-service re-enable expired SharePoint Alerts and extend their expiration for another 30 days. Re-enabling and extending SharePoint Alerts can be done by using the “<a href=\"https://support.microsoft.com/en-us/office/manage-view-or-delete-sharepoint-alerts-99dfb19c-9a90-4a8c-aba1-aa8c8afb0de2\" target=\"_blank\">Manage my alerts</a>” list/library menu item, opening the SharePoint Alert to update, extending its expiration date and clicking OK. For more details refer to this <a href=\"https://aka.ms/retirement/alerts/support\" target=\"_blank\">support article</a>.\n</li><li>Starting July 2026, Microsoft will remove the ability to use SharePoint Alerts, existing SharePoint Alerts cannot be extended anymore and will not work anymore.\n</li></ul></li><li>Action: Review and assess impact\n</li></ul><p><b>How this will affect your organization\n</b></p><p>If your organization still uses SharePoint Alerts, they will no longer function from July 2026 onwards. We recommend customers to port their SharePoint Alerts to the <a href=\"https://www.microsoft.com/en-us/power-platform/products/power-automate/\" target=\"_blank\">Power Automate platform</a> or alternatively create a <a href=\"https://support.microsoft.com/en-us/office/create-a-rule-to-automate-a-list-or-library-151ea008-7fa6-409b-b0bd-b04a3b3cacd5\" target=\"_blank\">SharePoint Rule</a>.\n</p><p><b>What you need to do to prepare\n</b></p><p>It’s recommended to update your user training content and prepare your help desk to support your organization with this retirement. SharePoint Alerts users will be notified of this feature retirement via banners in both the relevant SharePoint Online page and Alert emails and users can self-service extend the alerts they deem required. \n</p><p>For admins:\n</p><ul><li>Optionally use the <a href=\"https://aka.ms/assessment/alerts\" target=\"_blank\">Microsoft 365 Assessment</a> tool to scan your tenants for SharePoint Alerts.\n</li><li>Review the <a href=\"https://learn.microsoft.com/en-us/sharepoint/dev/business-apps/power-automate/sharepoint-connector-actions-triggers\" target=\"_blank\">documentation on using Power Automate with SharePoint Online</a>.\n</li><li>Review the documentation on using <a href=\"https://support.microsoft.com/en-us/office/create-a-rule-to-automate-a-list-or-library-151ea008-7fa6-409b-b0bd-b04a3b3cacd5\" target=\"_blank\">SharePoint Rules</a>.\n</li><li><b>Note:</b> There will not be an option to extend SharePoint Alerts beyond July 2026.\n</li></ul><p>Learn more:</p><ul><li>Detailed <a href=\"https://aka.ms/retirement/alerts/support\" target=\"_blank\">support article</a> with additional resources.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring the SharePoint Alerts feature to modernize notifications. Key dates include the gradual phase-out starting July 2025, with complete removal by July 2026. Organizations should transition to Power Automate or SharePoint Rules. Update training materials and support resources accordingly. More details are available in the provided support article."
    }
  ],
  "EndDateTime": "2026-09-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1072889",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-13T16:32:57.35Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-13T16:32:40Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "SharePoint Alerts retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
