{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 21, 2025: We will be rolling out the change to prevent users from activating the SharePoint spaces feature in site settings (or using PowerShell) starting May 15th. It will still be possible to disable the feature using this dialog. Users attempting to enable the feature will receive an error message indicating that the Spaces feature is being deprecated and cannot be enabled at this time. Sites with the feature <b>already enabled </b>will continue to function with the feature enabled.</p><p>Due to limited usage and our focus on investing in <a href=\"https://learn.microsoft.com/mesh/overview\" target=\"_blank\">Microsoft Mesh</a> where immersive 3D content can be created and experienced in a multi-user collaborative experience, we will retire the <i>spaces</i> feature from Microsoft SharePoint Online starting March 10, 2025 and ending August 11, 2025. As another alternative, you may choose to transition some existing content to SharePoint Pages.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Users will no longer be able to view or create SharePoint <i>spaces</i> after this retirement is complete. Retirement timeline details:\n</p><ul><li>Starting March 10, 2025, the <i>spaces</i> feature be turned off by default. After this date, users can still access the <i>spaces</i> feature on SharePoint sites that have used it previously and users can enable the feature for individual sites on the <i>Site features</i> page.\n</li><li>Starting May 15, 2025, users will no longer be able to enable the <i>spaces</i> feature on the <i>Site features</i> page, but SharePoint sites with the feature already enabled will continue to function as normal. </li><li>Starting August 11, 2025, the feature will be fully disabled and users will be unable to view, edit, or create new spaces.\n</li></ul><p>Learn how to identify SharePoint sites with the spaces feature enabled: <a href=\"http://support.microsoft.com/topic/11ac7262-865f-4b15-a596-53a1646970a0\" target=\"_blank\">SharePoint Spaces deprecation - Microsoft Support</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically by the specified date. No admin action is required; however, existing content will no longer be usable after the feature is retired. Please notify your users about this change, update relevant documentation, and consider <a href=\"https://learn.microsoft.com/mesh/overview\" target=\"_blank\">Microsoft Mesh</a> for future immersive experiences in Microsoft 365.\n</p><p>You and your users can identify spaces content in a SharePoint site by going to the <i>Pages</i> library and looking for files where the <i>Content type</i> is <i>Space.</i>\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/sharepoint-spaces-7b65edfb-7cc9-42e3-af37-178d79364a5e\" target=\"_blank\">SharePoint Spaces deprecation - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The SharePoint \"spaces\" feature will retire between March 10, 2025, and August 11, 2025. Users will gradually lose the ability to enable and use this feature. Existing spaces will remain functional until full deprecation. Users are encouraged to transition to Microsoft Mesh for immersive experiences."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1002417",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-21T13:45:24.867Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-11T00:34:59Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft SharePoint: The \"spaces\" feature will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
