{
  "ActionRequiredByDateTime": "2025-07-08T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To help organizations stay current and benefit from the latest Microsoft 365 innovation, we are modernizing the Semi-Annual Enterprise Channel to streamline update options and align with evolving customer needs. These changes simplify channel management and encourage broader adoption of update cadences that deliver features and security updates more efficiently.\n</p><p>This message applies to Windows desktop apps.\n</p><p><i>What’s changing</i>\n</p><p>Semi-Annual Enterprise Channel Preview and Semi-Annual Enterprise Channel Extended will be retired\n</p><ul><li>Devices currently on Semi-Annual Enterprise Channel Preview will not receive updates after July 8, 2025.\n</li><li>Support for Semi-Annual Enterprise Channel Extended will end March 10, 2026.\n</li><li>Feature previews are now available through Current Channel and Monthly Enterprise Channel.\n</li></ul><p>Semi-Annual Enterprise Channel support will be simplified\n</p><ul><li>Starting July 8, 2025, the Semi-Annual Enterprise Channel will move to a 6+2-month lifecycle (6 months of feature updates followed by 2 months of rollback support).\n</li><li>This channel will be reserved for specialized non-attended scenarios where more frequent updates are not practical.\n</li></ul><p>Monthly Enterprise Channel improvements\n</p><ul><li>Starting June 1, 2025, the Monthly Enterprise Channel will support N, N-1, and N-2 builds, giving admins greater flexibility during deployment validation.\n</li><li>All update channels will continue to receive security updates on Patch Tuesday.\n</li></ul><p><i>What you need to do\n</i></p><p>Now is the time to evaluate your update strategy:\n</p><ul><li>Migrate devices off the Semi-Annual Enterprise Channel Preview to ensure they continue receiving security updates.\n</li><li>Move interactive or user-facing devices to the Monthly Enterprise Channel for a more modern, validated experience.\n</li><li>For any remaining devices on the Semi-Annual Enterprise Channel, plan to follow the twice-yearly update cycle in January and July.\n</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365-apps/updates/overview-update-channels\" target=\"_blank\">Overview of update channels for Microsoft 365 Apps</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is modernizing the Semi-Annual Enterprise Channel for Windows desktop apps to streamline updates and align with customer needs. The Semi-Annual Enterprise Channel Preview and Extended will be retired by 2025 and 2026, respectively. Organizations should migrate devices to other channels and plan for a twice-yearly update cycle."
    }
  ],
  "EndDateTime": "2025-07-02T23:45:10Z",
  "HasAttachments": false,
  "Id": "MC1087098",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-02T23:45:57Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-02T23:45:10Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft 365: Retiring and modernizing the Semi-Annual Enterprise Channel for Windows desktop apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
