{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 14, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon for new Microsoft Outlook for Windows desktop and Microsoft Outlook for the web: Users will be able to type text and jump to the next message in the message list. For example, when the message list is sorted by sender with <i>From</i>, users will be able to type \"Philip\" to jump to the first message where the sender is \"Philip.\"</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490058\" target=\"_blank\">490058</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late May 2025 (previously early May) and expect to complete by late June 2025 (previously mid-June).</p><p><b>How this will affect your organization:</b></p><p>After this rollout, users will be able to enter text to jump to a message. This includes jumping to a date when sorted by <i>Date</i>, jumping to a sender when sorted by <i>From</i>, jumping to a category when sorted by <i>Category</i>, and so on.</p><p>\n</p><p>This change will be on by default.</p><p>As an example, when a user has their message list sorted by sender with <i>From</i>, the user can select the arrow icon to reveal the new<i> Type to jump to a sender</i> option to jump to a specific sender:</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/70bcf3b6-b870-4834-b2eb-9c9799d79864\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490058"
    },
    {
      "Name": "Summary",
      "Value": "New Microsoft Outlook for Windows and Outlook for the web will soon allow users to type text to jump to specific messages in the message list. This feature will roll out from late May to late June 2025. No admin action is required, but users should be informed of the change."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066439",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-14T15:10:23.63Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-02T03:45:27Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows and Outlook for the web: Jump to a message in the message list",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
