{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the Use enhanced analytics for voicemail and direct callback feature for Dynamics 365 Contact Center. This feature will enhance the existing analytics data model to provide insights into calls that overflow and are handled by voicemail or direct callback. This feature will reach general availability on May 5th, 2025. <br><br><b>How does this affect me?</b><br>Currently, analytics aren't available to track direct callback, voicemail and any other overflow activity. Supervisors lack insights into conversations that go through overflows leading up to voicemails or callbacks. Now, analytics for voicemails and direct callback actions for overflows will give supervisors insights into these overflow actions via custom reporting and help them plan efficiently.<br><br>The new metrics supported via improved data model for overflow actions reporting help in the following ways:<br><br><b>For Voicemails</b><ul><li>Conversations that resulted in a voicemail.</li><li>Voicemail left during business hours vs. outside-of-business hours.</li><li>Voicemail left for individual or group.</li></ul><b>For Direct callback and general overflow actions</b><ul><li>List conversations with overflow action of any type that triggered direct callback.</li>Identify the overflow condition that's triggered, before work items are queued, when work items are queued, or out of operation hours.</li><li>Identify the time the overflow action was triggered.</li><li>Identify whether the customer accepted the callback option and the time it was accepted.</li><li>Identify when callback was initiated by the system.</li><li>Identify if and when the callback notification was accepted by a service representative.</li></ul><b>What do I need to do to prepare?</b><br>This message is for awareness and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-15T06:19:28Z",
  "HasAttachments": false,
  "Id": "MC1055726",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-15T06:20:36.45Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-15T06:19:28Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Use enhanced analytics for voicemail and direct callback",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
