{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>IT Administrators can now monitor the health of Microsoft Teams desktop clients for Windows and Mac through the new ‘Teams client health’ page in the Teams admin center.</p><ul><li>This page provides actionable insights into client health metrics, such as crashes, launch failures, and update failures. It also enables better monitoring of Teams client version adoption and updates. \n</li><li>Administrators have detailed data on top issues, insights, and tools to quickly address client health problems. \n</li><li>Administrators can monitor version adoption, version health, and get granular details about devices and users with the latest client versions. \n</li><li>Administrators can see the recency of client versions and proactively address issues that prevent automatic updates to the most secure Teams client version.</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478610\" target=\"_blank\">478610</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late March 2025 and expect to complete by late April 2025.&nbsp;</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late April 2025 and expect to complete by late May 2025.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>When these capabilities and tools are released in Teams admin center, administrators will be able to access the ‘Teams client health’ page via the left navigation and be able to proactively monitor Teams client health and Issues impacting end users in their tenant as well as find actionable guidance on how to troubleshoot and resolve these user-impacting issues.</p><p>Administrators will also be able to proactively monitor which devices and users might be using outdated versions of the Teams client to be able to move them to the latest and most secure version</p><p>Additionally, this information can also be sorted, filtered, and exported to a .csv for further analysis and troubleshooting.&nbsp;</p><p>This will be only accessible to limited admin <a href=\"https://learn.microsoft.com/microsoftteams/using-admin-roles\" target=\"_blank\">roles</a>:  Teams Administrator, Teams Communication Administrator, and Teams Communications Support Engineer.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required.</p><p>Ensure you and the required users have access to the above-mentioned roles or request to enable this new feature for more roles. \n<br>For more information, refer to our documentation:</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/teams-client-health\" target=\"_blank\">The Teams client health dashboard in the Teams admin center.</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/teams-client-health-update-monitoring\" target=\"_blank\">Update monitoring in the Teams admin center.</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "IT Administrators can now monitor Microsoft Teams desktop client health for Windows and Mac via the new ‘Teams client health’ page in the Teams admin center. This feature, rolling out from March to May 2025, provides insights into client health metrics and allows proactive monitoring and troubleshooting. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1015900",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-25T00:35:37.347Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-25T00:34:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Client health dashboards in Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
