{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting April 18, 2025, plans created or managed through Project in Power Apps or Project Accelerator or Project Online will no longer appear in the Recent tab within Planner and Project for the web. To continue accessing these plans easily, we recommend using the workarounds outlined below.</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because our reporting indicates your organization may be using Planner in conjunction with Project in Power Apps or Project Accelerator or Project Online.\n</p><p>After April 18, 2025, plans created, updated, or deleted via Project in Power Apps or Project Accelerator or via Project Online may no longer appear as recently accessed in the 'Recent' tab of My Plans in Planner in Teams, Planner for the Web and Project for the Web.\n</p><p>For example:\n</p><p>New plans created from Project in Power Apps or Project Accelerator or Project Online will not appear in the 'Recent' tab in Project for the web, Planner for web, Planner in Teams. \n</p><p>Deleted plans from Project in Power apps or Project Accelerator or Project Online may still appear in the 'Recent' tab in Project for the web, Planner for web, Planner in Teams but will return an error when accessed. \n</p><p>There is no impact to accessing your plans directly in Project in Power Apps or Project Accelerator or Project Online—you can continue to work with your plans as usual from those experiences.\n</p><p>Additionally, there is no impact when creating, updating, or deleting plans directly in Planner or Project for the web. These activities will continue to sync properly, and your plans will appear as expected in the 'Recent' tab.\n</p><p><b>Workarounds available:</b></p><ul><li>Project in Power Apps or Project Accelerator users can open plans via the Tasks tab or use the “Open in Project” option to ensure plans appear in the Recent tab in Project for the web and Planner My Plans.\n</li><li>Project Online users can continue to access plans through Project Online, though these plans may not sync to the Recent view in Project for the web or Planner My Plans.\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [],
  "EndDateTime": "2025-06-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1048633",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-04T23:31:11.547Z",
  "Services": [
    "Planner",
    "Project for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T23:21:43Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Changes to Plan Visibility in Planner and Project for the Web 'Recent' for Project Apps and Project Online users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
