{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce the release of a new report in the Microsoft Exchange admin center (EAC) that provides usage data for the new Microsoft Outlook for Windows desktop and classic Microsoft Outlook for Windows desktop. This is the same data made available via the Microsoft 365 admin center usage report in March and is intended to make the data more easily accessible to Outlook admins who regularly use the Exchange admin center.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out early May 2025 and expect to complete by late May 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The new report<i> Outlook for Windows Usage</i> will be added to the <i>Reports </i>section in the EAC. This report will provide admins with detailed insights into user activity on the new Outlook for Windows versus the classic Outlook for Windows. The report includes a line chart showing the sum of users by endpoint over different time periods (days/weeks/months) and a data table with columns for email address, last activity date, and usage status for new and classic Outlook. You can export the data to csv and filter and search in the report.</p><p>The new report will be available by default in the Exchange admin center at <i>Reports &gt; Outlook for Windows Usage:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/529ca482-8b19-4a74-9fd2-ab3b8509e40b\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Examples of <i>User details</i> reports:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/dc55a3a9-17ef-45fe-ab61-12fb4e7a613c\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout is happening automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to update any relevant documentation.\n</p><p>Familiarize yourself with the new report and its features. Ensure that your organization’s admins have access to the EAC and are aware of the new reporting capabilities to support their new Outlook migration efforts.</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "A new usage report for the new and classic Microsoft Outlook for Windows is being added to the Microsoft Exchange admin center. The rollout started in early May 2025 and will complete by late May 2025. No admin action is required, but admins should familiarize themselves with the new report."
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1079734",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-21T22:45:41.013Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-21T22:45:30Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange admin center: New usage report for new Microsoft Outlook for Windows and classic Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
