{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 3, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Purview | Data Security Posture Management for AI: We will add support for Microsoft Copilot in Fabric and Microsoft Security Copilot.\n</p><p>A Microsoft 365 Copilot license is not required to use these new capabilities.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486697\" target=\"_blank\">486697</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late March 2025 and expect to complete by late April 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late June 2025 (previously late May) and expect to complete by late August 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Audit and sensitive information types detected in interactions will be monitored by default.\n</p><p>To see prompts and responses in Microsoft Purview Data Security Posture Management for AI for Copilot in Fabric and Security Copilot, admins must create a new policy called <i>DSPM for AI - Capture interactions for Copilot experiences </i>in the Microsoft Purview portal &gt;<i> DSPM for AI &gt; Recommendations &gt; </i>under the recommendation called <i>Secure interactions in Microsoft Copilot experiences (preview):</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/27159cad-9c67-4ee1-be6d-365158ab52a6\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/purview/ai-microsoft-purview\" target=\"_blank\">Microsoft Purview data security and compliance protections for Microsoft 365 Copilot and other generative AI apps | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/ai-microsoft-purview-considerations\" target=\"_blank\">Considerations for deploying Microsoft Purview Data Security Posture Management for AI &amp; data security and compliance protections for Microsoft 365 Copilot and Microsoft 365 Copilot Chat | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486697"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview will integrate Microsoft Copilot in Fabric and Microsoft Security Copilot, starting public preview in late March 2025 and general availability in late June 2025. No Copilot license is required. Admins must create a new policy to monitor interactions. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1043462",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-03T20:11:45.22Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-28T23:56:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Security Posture Management for AI: Additional Copilot integrations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
