{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 18, 2025: We have updated the timeline. Thank you for your patience.</p><p>To enhance the viewing experience in Engage, videos in the feed will now autoplay on mute with captions enabled by default. Users can enable sound with a single click, making video content more accessible and engaging.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=494686\" target=\"_blank\">494686</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out on late July 2025 (previously early July) and expect to complete by late August 2025 (previously mid-July).</p><p><b>How this will affect your organization:</b></p><p></p><p>Users accessing Engage via the web or Microsoft Teams (desktop) will see videos autoplay silently as they scroll through their feed. Captions will be visible by default, and users can choose to enable sound. This update aims to improve content discoverability and engagement without disrupting the user experience.</p><p>Admins can manage this behavior at the tenant level using a toggle in the Engage admin settings. The feature is on by default.</p><p><b>What you need to do to prepare:</b></p>No action is required. If your organization prefers to disable autoplay, you can do so via the Engage admin center.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494686"
    },
    {
      "Name": "Summary",
      "Value": "Videos in Engage will autoplay on mute with captions enabled by default starting late July 2025. Users can enable sound with a click. This update aims to improve content discoverability and engagement. Admins can manage this feature in the Engage admin settings. No action is required unless disabling autoplay."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-10-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1088730",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-18T20:38:15.05Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-05T23:43:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Autoplay videos in Engage (Muted)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
