{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In alignment with Microsoft 365 core workload administration best practices private content mode will be retired as of June 30th, 2025. This feature has been utilized for specific use cases related to Viva Engage administration and management, and we have outlined alternative solutions for these scenarios in the communication below. This applies to Engage on web, Engage on Teams and Engage on outlook.&nbsp;</p><p>\n</p><p><b>When this will happen:</b></p><p>(Worldwide) The feature will be completely retired by June 30th, 2025&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Viva Engage will no longer support private content mode, present within the classic Yammer admin center. Verified admins will no longer be able to enable or disable this feature. If the feature was left on by a verified admin, then it will be disabled for them.&nbsp;&nbsp;</p><p>There are alternative methods that can fulfill the needs previously met by private content mode:&nbsp;&nbsp;</p><ul><li>Viewing private community content without being a member: Users with the Global Administrator or Groups Administrator role can search for private communities within Engage and join these communities without requiring explicit approvals. Learn more about other Entra ID roles <a href=\"https://Microsoft Entra built-in roles - Microsoft Entra ID | Microsoft Learn\" target=\"_blank\">here</a>. </li><li>Viewing community admins and members for private communities without being a member: Since Engage Communities are backed by Microsoft 365 groups, the list of group owners and group members are visible within Entra ID for all users. Learn more about group management <a href=\"https://Learn about groups, group membership, and access - Microsoft Entra | Microsoft Learn\" target=\"_blank\">here</a>. </li><li>Handling legal/audit cases in Engage: Compliance administrators, eDiscovery managers, and eDiscovery administrators can access, search, and export private community and private message content on Viva Engage. Learn more about our eDiscovery standard solution <a href=\"https://learn.microsoft.com/en-us/purview/edisc\" target=\"_blank\">here</a>.&nbsp;</li></ul><p>Admins are also able to perform <a href=\"https://learn.microsoft.com/en-us/viva/engage/eac-as-manage-data\" target=\"_blank\">network data exports</a> which can be manipulated to handle other advanced use cases.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>There will be <i>no exceptions </i>to the retirement which will be done on June 30th, 2025. We recommend you communicate clearly and early to admins of this impending change and coordinate an effort to understand the alternative solutions proposed above.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will retire the private content mode by June 30th, 2025. Verified admins will no longer be able to enable or disable this feature. Alternative methods are provided for viewing private community content, handling legal cases, and managing group memberships. Admins should prepare for this change by exploring the alternatives."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1045211",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-31T22:33:12.193Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-31T22:33:05Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Viva Engage: Private content mode will retire as of June 30th, 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
