{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 4, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>In Microsoft SharePoint Online, Microsoft Lists forms are being updated to enhance your list data collection and management. These updates include subscribing to notifications, form scheduling, conditional branching, quick form creation, and additional field-type support.&nbsp;</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=124865\" target=\"_blank\">124865</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We began rolling out early January 2025 and expect to complete by mid-February 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-February 2025 and expect to complete by late April 2025 (previously late March).</p><p><b>How this will affect your organization:</b></p><p>Updates to the Microsoft Lists forms include these key improvements:\n</p><ul><li>New creation experience: Users can now create forms directly from Lists home, SharePoint, and the Lists app in Microsoft Teams. This streamlined process automatically creates the underlying list for responses, saving time and effort.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fa7d2d89-c3d1-4309-86b6-cd7a6a082d6a\" style=\"width: 450px;\"></p><p><br></p><ul><li>Conditional branching: Conditional branching allows you to show or hide questions based on previous answers, ensuring respondents only see relevant questions. You can branch questions to other questions or based on choices in a Choice field.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/d0a1a70d-816c-4674-8cc5-2b969a216dbb\" style=\"width: 450px;\"></p><p><br></p><ul><li>Add logo: Enhance your forms with a relevant logo, making them look more professional and reinforcing brand identity.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/d27a4e87-6551-456e-b180-f9b9f4f7961c\" style=\"width: 450px;\"></p><p><br></p><ul><li>Support for Additional Field Types Attachments, Image, Location, Lookup. Please note that for Lookup fields respondents need at least read access to the underlying source list to see and select the options.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f61b9bd8-5ff1-4274-8fa2-22a92c1120e9\" style=\"width: 450px;\"></p><p><br></p><ul><li>Get notified of new responses and Schedule form Start/End dates: Choose to be notified when someone submits a response to a form you own or have access to. Set specific start and end dates for your forms.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a4d57773-115a-4ac9-b47f-98b450967c1f\" style=\"width: 450px;\"></p><p><br></p><p>For more information, see <a href=\"https://techcommunity.microsoft.com/blog/spblog/microsoft-lists-forms-whats-new/4374037\" target=\"_blank\">Microsoft Lists forms: What's New</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online is updating Microsoft Lists forms to include new features such as notifications, form scheduling, conditional branching, quick form creation, and additional field-type support. The rollout begins in January 2025 for Targeted Release and mid-February 2025 for General Availability, completing by late April 2025. No admin action is required."
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1005510",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-04T18:59:01.817Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-14T01:15:09Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "SharePoint Online: Updates to Microsoft Lists forms",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
