{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Microsoft Planner for the web (<a href=\"https://planner.cloud.microsoft\" target=\"_blank\">https://planner.cloud.microsoft</a>) brings together the simplicity of Microsoft To Do, the collaboration of Planner, and the advanced capabilities of Microsoft Project into one platform. Planner for the web offers a comprehensive and scalable solution, whether users are managing individual tasks or overseeing professional-grade projects. All users with an existing Project for the web license will have access to Planner. (A Microsoft Teams license is also required to use Planner in Teams.)</p><p>Starting early August 2025, we will retire Project for the web and will redirect its users to Planner for the web and Planner for Teams, for a smooth transition.\n</p><p>Premium plans from Project for the web automatically will be available in Planner, ensuring users experience a seamless migration without losing any data.</p><p>We will add these capabilities to Planner before the redirect goes into effect:</p><ul><li>Users will be able view and manage non-default environment plans in Planner.</li><li>We will rename Project Power app to Planner power app (and the button to open the plan in Project will be replaced with a button to open the plan in Planner).</li><li>Project settings in the Microsoft 365 admin center will move to the Planner page in the admin center.</li><li>Tenants with only Project licenses will be able to access basic plan functionality in Planner.</li><li>We will roll out the new Planner to GCC High.</li></ul><p>User experience in Project and Roadmap for the web and Teams\n</p><ul><li>When launching Project for the web or Roadmap for the web, users will see a page directing them to open Planner for the web, they will not be able to dismiss this screen or use Project or Roadmap for the web.</li><li>Existing Project tabs in Teams will no longer open the associated project, and instead will show users a page to inform them to re-pin their tab using the Planner tab for Teams</li><li>Existing Roadmap tabs in Teams will no longer open the associated roadmap, and instead will show a page directing users to the Planner app in Teams</li><li>Users will no longer have access to view or create Roadmaps in Project for the web, but their Roadmap data will remain in Dataverse</li><li>We will remove the Project tab and Roadmap tab apps from the Teams app store.</li></ul><p><b>When this will happen:</b></p><ul><li>For Worldwide: We will begin rolling out early August 2025 and expect to complete by mid-August 2025.\n</li><li>For GCC: We will begin rolling out mid-August 2025 and expect to complete by late August 2025.\n</li><li>For GCC High: We will begin rolling out late August 2025 and expect to complete by mid-September 2025.\n</li></ul><p><b>How this will affect your organization:</b>\n</p><p>Due to low usage and our efforts to simplify the user experience, these Project for the web features are not available in Planner:</p><ul><li>Users will need to migrate their existing Roadmaps to Portfolios because Planner does not support opening roadmaps. Learn more about migrating Roadmaps to Portfolios: <a href=\"https://support.microsoft.com/office/manage-multiple-plans-with-portfolios-in-microsoft-planner-dbba638b-8066-40e4-89d5-dd16e2c61724\" target=\"_blank\">Manage multiple plans with portfolios in Microsoft Planner - Microsoft Support</a></li><li>Portfolios in Planner do not support adding rows for Microsoft Azure DevOps or Microsoft Project Online</li><li>Import MPP is not available in Planner. Learn more about how to use the Project Power App to import projects from Microsoft Project for Windows desktop: <a href=\"https://support.microsoft.com/office/move-your-project-from-project-desktop-to-project-power-apps-7e2639ea-58b4-4e0e-9c62-6ad078b40b69\" target=\"_blank\">Move your project from Project desktop to Project Power Apps - Microsoft Support</a></li><li>Users are not able to pin Portfolios as a Teams tab</li></ul><p><b>What you need to do to prepare:</b>\n</p><ul><li>This retirement will happen automatically by the specified dates with no admin action required before or after the rollout. Review your current configuration to assess the impact on your organization.\n</li><li>You may want to notify your users and update any internal documentation to reflect these changes.</li><li>Migrate existing Roadmap data to Portfolios in Planner before the redirect rollout date.\n</li><li>Inform your users to proactively re-pin your Projects in Teams tabs using the Planner in Teams tabs</li><li>Start using Planner in your organization today to minimize disruption when the redirect is rolled out</li><li>Supporting adoption resources: <a href=\"https://adoption.microsoft.com/microsoft-planner/\" target=\"_blank\">The new Microsoft Planner</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Project for the web and Project in Teams will retire in August 2025, redirecting users to Planner for the web and Planner in Teams. Existing Project features will be integrated into Planner, ensuring a seamless transition. Users should migrate Roadmap data to Portfolios and re-pin Projects in Teams tabs using Planner."
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1068905",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-06T22:40:18.187Z",
  "Services": [
    "Project for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-06T22:40:06Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Project for the web and Project in Teams will retire and redirect to Planner for the web and Planner in Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
