{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 22, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Provide a meaningful name to first channel of the team, with no restrictions on the name. The first channel, if named \"General\" (in English), will follow the behavior as General in any other teams.&nbsp;</p><p>\n</p><p><b>When this will happen:</b></p><p>Targeted Release (Worldwide): We will begin rolling out late April 2025 (previously mid-April) and expect to complete by late April 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 (previously early May) and expect to complete by mid-May 2025.</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late May 2025 (previously early May) and expect to complete by late May 2025 (previously mid-May)</p><p><b>How this will affect your organization:</b></p><p>Team owners on desktop client will now be able to name the first channel as General while creating the team or can rename the existing first channel as General by manually typing the string \"General\" or using the more options button in the text field. Naming the channel \"General\" will show it at the top of the team in the channel list, however, no other first channel name will show the channel at the top.</p><p> Naming the channel \"General\" manually by typing or selecting \"More options\" &gt; \"Set name to General\"</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/bcd2b06e-c5d6-4703-bef2-9cd0bcbe2d63/19b12ae0dda3991561bd53de05c18e37fad9623e.png\" style=\"width: 500px;\"></p><p>Channel when named \"General\" shown at the top of the team in teams and channels list in the left pane</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e81d9e46-24fa-435c-94d3-b108e75fbb55/fe798e17f2679123e8c5518ff51472bd18db98a8.png\" style=\"width: 500px;\"></p><p>Channel when named anything else shown in alphabetical order in the teams and channels list in the left pane</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/b57b3fee-d9de-4176-9c20-f72150fc16d1/a42a0a4b305653b0ce8c9313b57b3deb49422137.png\" style=\"width: 500px;\"></p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate.&nbsp;</p>\n<p></p>\n<p>Related documents:</p><p> <a href=\"https://support.microsoft.com/en-us/office/edit-a-channel-in-microsoft-teams-3497a0d0-5cae-44be-8a57-0d75b48da859\" target=\"_blank\">Edit a channel in Microsoft Teams</a> - Microsoft Support (will be updated once the feature is rolled out).</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Team owners can now name the first channel \"General\" or any other name without restrictions. If named \"General,\" it will appear at the top of the channel list. The rollout starts late April 2025 for Targeted Release and mid-May 2025 for General Availability. Update training and documentation accordingly."
    }
  ],
  "EndDateTime": "2025-07-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1048628",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-22T21:02:14.367Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T23:14:23Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Provide a meaningful name to the first channel of the team",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
