{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 25, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon: The Microsoft Copilot Studio agent report template in the Microsoft Viva Insights advanced insights app will be available in public preview for all Viva Insights customers. This Microsoft Power BI template provides Viva Insights analysts an aggregated view of Microsoft Copilot Studio agent adoption and impact across the organization over time with flexibility to explore details for specific agents.\n</p><p>This feature will be enabled for tenants who meet either of these eligibility criteria: \n</p><ol><li>Tenant must have Viva Insights licenses (either minimum 50+ assigned Viva Insights licenses or 50+ Microsoft 365 Copilot licenses)\n</li><li>Tenants must have Copilot Studio licenses, either standalone, pay-as-you-go, or bundled with Microsoft 365 Copilot, and have created at least one agent* and published the agent in a <a href=\"https://learn.microsoft.com/power-platform/admin/environments-overview#environment-types\" target=\"_blank\">Production environment</a>.    \n</li></ol><p>*The Copilot Studio agents report covers usage and impact metrics for agents built using Copilot Studio that are published outside of Microsoft 365 Copilot or Microsoft 365 Copilot Chat. This version of the reports excludes agents that enhance Microsoft 365 Copilot and autonomous agents.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=472020\" target=\"_blank\">472020</a>.\n</p><p>This message applies to Viva Insights for Windows desktop and Viva Insights for the web.\n</p><p><b>When will this happen</b>\n</p><p>Public Preview: We will begin rolling out early May 2025 (previously mid-April) and expect to complete by late May 2025 (previously late April).\n</p><p>In May 2025, we will update this message with the plan for the General Availability (Worldwide) of this feature.\n</p><p><b>How will this affect your organization</b>\n</p><p><i>After this rollout, your organization will see these changes</i>\n</p><ul><li>In the <a href=\"https://admin.powerplatform.microsoft.com/\" target=\"_blank\">Microsoft Power Platform admin center (PPAC)</a>, a new <i>M365 Services</i> toggle will control the cross-boundary flow of <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/analytics-summary\" target=\"_blank\">agent performance and usage data</a> for generative AI features from Power Platform to Microsoft 365.\n<ul><li>This toggle is on by default for non-Federal Risk and Authorization Management Program (non-FedRAMP) environments. Learn more: <a href=\"https://learn.microsoft.com/power-platform/admin/geographical-availability-copilot?tabs=new\" target=\"_blank\">Move data across regions for Copilots and generative AI features - Power Platform | Microsoft Learn</a>\n</li><li>For all other environments, if the <i>M365 Services</i> toggle is on, data from Copilot Studio will flow to Viva Insights by default.\n</li><li>If desired, Power Platform admins can turn off the data flow to Viva insights using Microsoft PowerShell. Learn more: <a href=\"https://learn.microsoft.com/power-platform/admin/geographical-availability-copilot?tabs=new\" target=\"_blank\">Move data across regions for Copilots and generative AI features - Power Platform | Microsoft Learn</a>\n</li></ul></li><li>For tenants with Power Platform environments across multiple geos, Copilot Studio agent usage data is sent to and stored in the base location of the tenant in Viva Insights. <b>IMPORTANT:</b> To avoid unintentional data sharing across geographies, cross-geo sharing is off by default, so agent usage data will not be sent to Viva Insights for those tenants. Power Platform admins can turn on cross-data sharing with a PowerShell script, which will allow agent usage data to be stored in base location of the data in Viva Insights. Learn more: <a href=\"https://learn.microsoft.com/power-platform/admin/geographical-availability-copilot?tabs=new\" target=\"_blank\">Move data across regions for Copilots and generative AI features - Power Platform | Microsoft Learn</a></li><li>The Viva Insights admin has the flexibility to delete the Copilot Studio agent data for the entire tenant using PowerShell. Learn more: <a href=\"https://learn.microsoft.com/viva/insights/advanced/introduction-to-advanced-insights\" target=\"_blank\">Introduction to advanced insights | Microsoft Learn</a>\n</li><li>Viva Insights analysts will be able to set up and view the Copilot Studio agent Power BI report in the Viva Insights advanced insights app. Learn how to generate the report in the Viva Insights advanced insights: <a href=\"https://learn.microsoft.com/viva/insights/advanced/introduction-to-advanced-insights\" target=\"_blank\">Introduction to advanced insights | Microsoft Learn</a>\n</li></ul><p>Users with the Insights Analyst role will be able to generate the Copilot Studio agent report in the Viva Insights advanced insights app. The report output will include:\n</p><p>1. Ability to review Copilot Studio agent adoption trends across the organization:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/bf0a5253-98cd-4383-8604-499631aa2329\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>2. Ability to understand agent key performance indicators (KPIs) of top agents across your entire tenant:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2f6700c2-80b3-4d0a-9b81-3517b0d2e7b7\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>3. Ability to explore details of specific KPIs of Microsoft Copilot Studio agents:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a53b5e15-d3c6-42d7-9319-1a2475dc4a4b\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What do you need to do to prepare:</b>\n</p><p>Review and assess the impact of introducing these features for your organization. You might consider reviewing these features with your works council and updating your training and documentation as appropriate. This rollout will happen automatically by the specified date with no action specifically required from Microsoft Viva Insights admin or Microsoft Power Platform admin unless needed for any specific action described in this message. You may want to notify your admins about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><p>These articles will be updated before rollout:</p><ul><li>Learn more about the Copilot Studio custom agents report and the advanced insights app: <a href=\"https://learn.microsoft.com/viva/insights/advanced/introduction-to-advanced-insights\" target=\"_blank\">Introduction to advanced insights | Microsoft Learn</a>\n</li><li>Learn how to generate Power BI report templates: <a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/templates/introduction-to-templates\" target=\"_blank\">Introduction to Power BI templates in Microsoft Viva Insights | Microsoft Learn</a>      \n</li><li>Learn more about Copilot Studio and how to create an agent: <a href=\"https://learn.microsoft.com/microsoft-copilot-studio/fundamentals-what-is-copilot-studio\" target=\"_blank\">Overview - Microsoft Copilot Studio | Microsoft Learn</a>\n</li><li>Learn more about Microsoft Power Platform admin center: <a href=\"https://learn.microsoft.com/power-platform/admin/admin-documentation\" target=\"_blank\">Administer Microsoft Power Platform - Power Platform | Microsoft Learn</a>\n</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "472020"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Copilot Studio agent report template will be available in public preview for Viva Insights customers in May 2025. This Power BI template provides insights into agent adoption and impact. Eligibility requires specific licenses and agent creation. The rollout includes new admin controls and data flow options."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-07-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1034590",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-25T13:40:13.277Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-18T00:02:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights: Microsoft Copilot Studio agents report (Preview) for the advanced insights app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
