{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Engage: Community admins will have an upgraded experience for approving multiple community membership requests in one place. Community admins receive an email when a community membership request is made. After this rollout, when community admins select the link in the email, they will go to a centralized approval page that compiles all community membership requests across all their communities.\n</p><p>This message applies to:\n</p><ul><li>Engage app on the desktop (as a progressive web app)\n</li><li>Engage app in Microsoft Outlook (new Outlook for Windows desktop, Outlook for the web, and new Outlook for Mac desktop)\n</li><li>Engage app in Microsoft Teams (Teams for Windows desktop, Teams for Mac desktop, and Teams for the web)\n</li><li>Engage on the web (www.engage.cloud.microsoft.com)\n</li></ul><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479406\" target=\"_blank\">479406</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 and expect to complete by late April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Community admins will be able to access the new experience through the link in an email requesting community membership:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/702ae4c8-c50d-4879-8667-25ed12569ba7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479406"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will soon allow community admins to approve multiple membership requests from a centralized page accessed via email notifications. This update applies to various platforms and will roll out in April 2025. No admin action is required, but organizations should review configurations and notify users."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-07-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1035702",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-19T00:13:50.327Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T00:13:28Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: Updates to Community membership approval from email notifications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
