{
  "ActionRequiredByDateTime": "2025-10-14T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Reminder: Support for the mobile Universal Windows Platform (UWP) apps (Microsoft Word, Microsoft Excel and Microsoft PowerPoint) will end on October 14, 2025. After that date, no further updates, security fixes, or technical support will be available for these applications.\n</p><p>We communicated this retirement in MC921113 <i>Support for the Word Mobile, Excel Mobile, and PowerPoint Mobile UWP applications will end on October 14, 2025</i> (published October 2024)</p><p><b>When this will happen:</b>\n</p><p>This retirement will occur on October 14, 2025. \n</p><p><b>How this will affect your organization:</b>\n</p><p>If Microsoft Windows-based devices within your organization are running Word Mobile, Excel Mobile, or PowerPoint Mobile, we recommend that the applications be removed before the October 14, 2025, end of support date. While they may continue to function, using unsupported software could lead to potential security risks and other issues.\n</p><p>If you’re using Microsoft Intune, you can run a report to identify devices running these applications. In the Microsoft Intune admin center, go to <i>All services &gt; Apps | Monitor &gt; Discovered apps</i> and search for \"office.word\", “office.excel”, or “office.powerpoint”. The application version will start with \"16001.14326.xxxxx.x\".\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To mitigate these risks and ensure your organization remains secure and compliant, we recommend removing these three UWP applications and switching to alternatives:\n</p><ul><li><a href=\"https://www.microsoft.com/microsoft-365/mobile?ocid=oo_support_mix_marvel_ups_support_smcofficemobile_inline\" target=\"_blank\">Microsoft 365 Copilot mobile app</a> for iOS or Android phones and tablet devices</li><li>Word, Excel, and PowerPoint on the web. <a href=\"https://www.microsoft365.com/\" target=\"_blank\">Learn more</a>.</li><li>Windows desktop versions of Word, Excel, and PowerPoint in a Microsoft 365 plan. <a href=\"https://www.microsoft.com/microsoft-365/enterprise/microsoft365-plans-and-pricing\" target=\"_blank\">Compare Microsoft 365 Enterprise Plans</a>.\n</li></ul><p>Learn more about the end of support for the OneNote UWP application (OneNote for Windows 10): <a href=\"https://support.microsoft.com/office/moving-to-onenote-on-windows-4ba7b498-aafc-44b1-8326-a582a6c71196\" target=\"_blank\">Moving to OneNote on Windows - Microsoft Support</a>.\n</p><p>Planning ahead will help you avoid potential disruptions and keep your organization’s software environment secure and up to date.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Support for Word Mobile, Excel Mobile, and PowerPoint Mobile UWP applications will end on October 14, 2025. Organizations should remove these apps before this date to avoid security risks. Alternatives include Microsoft 365 Copilot mobile app, web versions of Word, Excel, and PowerPoint, or desktop versions in a Microsoft 365 plan."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1058303",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-19T01:23:32.66Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-19T01:23:06Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Reminder: Support for the Word Mobile, Excel Mobile, and PowerPoint Mobile UWP applications will end on October 14, 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
