{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for new Microsoft Outlook for Windows desktop: Users will be able to quickly categorize their emails using predefined shortcuts, enhancing productivity and streamlining their email organization process.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483507\" target=\"_blank\">483507</a>.\n</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-May 2025 and expect to complete by mid-June 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by mid-July 2025.</p><p><b>How this will affect your organization:</b></p><p>The category shortcuts will work in the same way as they worked in classic Outlook, where the user can assign a shortcut to function keys ranging from CTRL+F2 to CTRL+F12. We will migrate the classic Outlook category shortcuts to the new Outlook for Windows. This feature is currently only available in new Outlook for Windows.\n</p><p>After this rollout, users can manage category shortcuts in Outlook <i>Settings </i>at <i>Accounts &gt; Categories,</i> which has a new column called <i>Shortcut</i>. The user can select the pencil icon to assign a function key to an existing shortcut:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/30993863-bde5-4443-8304-ae0e99ad1438\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>When creating or editing a new category, users can add a new category <i>Shortcut</i>:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f0b4880f-0d32-4445-83b2-ab2ad17f7318\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-categories-in-outlook-87f27f03-4d9f-48dd-9623-2702692a4480\" target=\"_blank\">Use categories in Outlook - Microsoft Support</a> (will be updated before rollout)</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483507"
    },
    {
      "Name": "Summary",
      "Value": "New Microsoft Outlook for Windows will support category shortcuts, allowing users to quickly categorize emails using predefined shortcuts. Rollout starts mid-May 2025 for Targeted Release and mid-June 2025 for General Availability. No admin action is required; users can manage shortcuts in Outlook Settings."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1057713",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-18T03:28:21.163Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-18T03:28:00Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Support for category shortcuts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
