{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will update how the <a href=\"https://support.microsoft.com/office/first-things-to-know-about-teams-discover-feed-054aa1ca-20ec-4db5-8aa2-dbcd0d17a76b\" target=\"_blank\">Discover Feed</a> appears in Microsoft Teams to ensure it’s helpful and relevant for every user. After this rollout, the feed will be shown to users who are part of more than five channels (including hidden channels). This change will help to ensure the Discover Feed includes meaningful updates and conversations and avoids showing an empty or low-activity feed. As always, we’re continuing to evolve the Teams experience based on user feedback and engagement.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We began rolling out mid-April 2025 and expect to complete by late April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>This change will be available by default. There are no tenant level settings. Defaults will not change.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or rafter the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/first-things-to-know-about-teams-discover-feed-054aa1ca-20ec-4db5-8aa2-dbcd0d17a76b\" target=\"_blank\">First things to know about Teams Discover Feed - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Discover Feed in Microsoft Teams will now only be shown to users with more than five channels, including hidden ones. This update aims to provide meaningful updates and avoid low-activity feeds. The rollout began in mid-April 2025 and will complete by late April 2025, with no admin action required."
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066160",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-01T17:11:47.877Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T17:11:43Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: The Discover Feed will only be shown to users with more than five channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
