{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 21, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>After this rollout, users will have a new Microsoft Viva Engage experience in Microsoft Teams for iOS/Android. Creating, commenting, and reacting to conversations will be easier than before the rollout.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=475969\" target=\"_blank\">475969</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late March 2025 (previously early March) and expect to complete by mid-April 2025 (previously mid-March).</p><p>General Availability: We will begin rolling out mid-April 2025 (previously mid-March) and expect to complete by early May 2025 (previously early April).</p><p><b>How this will affect your organization:</b>\n</p><p>All key existing Engage functionality will be refreshed in the new Engage app:</p><ul><li>Feed: Read and react to top conversations across the organization in different communities and storylines.</li><li>Communities: Join and participate in organization and social communities in the organization.</li><li>Activity notifications: Community announcements, @mentions, and more notifications continue to keep you notified of anything needing your attention\n</li><li>Leadership corner: Catch up on the latest content posted by organization leaders (if licensed for Microsoft Viva Suite or Microsoft Viva Communications and Communities (C&amp;C))\n</li></ul><p>In the Engage app in Microsoft Teams: Left: The <i>Feed </i>tab. Middle: The <i>Communities </i>tab and <i>Activity </i>notifications. Right: An example of content posted by an organization leader:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f7ae775d-0a66-42db-bd15-ac846a3d503a\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>For admins:</p><ul><li>There are no changes to the deployment of Engage or the Viva Engage app in Teams with this change.\n</li><li>This change will work seamlessly and independently with these releases that also affect the Viva Engage app in Teams.\n<ul><li> Microsoft 365 <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=474126&amp;filters=&amp;searchterms=474126\" target=\"_blank\">Roadmap ID 474126</a> / MC978923 Microsoft Viva Engage: New reply and reaction notifications in Microsoft Teams (published January 2025)\n</li><li>Microsoft 365 <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=472914\" target=\"_blank\">Roadmap ID 472914</a> / MC969448 Microsoft Teams: Viva Engage storyline will be integrated in Teams (published December 2024)\n</li><li>Microsoft 365 <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481280\" target=\"_blank\">Roadmap ID 481280</a>: Automatic rename of Engage for Teams Frontline Worker SKU users, releasing in April 2025</li></ul></li><li>Continue to manage the Viva Engage app in Teams from the Teams app center.\n</li></ul><p></p><p>For users: \n</p><ul><li>If users have the Viva Engage app installed in Teams, they will receive this update by default, with no action needed by you.\n</li><li>With this change, there is no change to the standalone Viva Engage app available in the Android or iOS app stores.\n</li><li>Existing notification settings in Teams will be respected and will continue to work in a new <i>Conversation </i>view.\n</li><li>While not all features in the existing Viva Engage app in Teams will be available after this rollout, the functionality continues to be available in other Teams clients, in the Viva Engage apps in the Android and iOS app stores, and in Viva Engage on the web. Missing functionality includes:\n<ul><li>Searching for content in Viva Engage\n</li><li>Delegation (post on behalf of someone, etc.)\n</li><li>Community live events\n</li><li>iOS only: \n<ul><li>Answers tab\n</li><li>Community details, membership management, and analytics\n</li><li>Topics feed\n</li></ul></li></ul></li><li>Storyline will be rolled out with <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=472914\" target=\"_blank\">Feature 472914</a>. Before that rollout, users can access another user's storyline by tapping the header in a storyline post from that user.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users and corporate communicators in your organization about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "475969"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating the Microsoft Viva Engage Communities app for Teams Mobile. The rollout will begin in late March 2025 and complete by early May 2025. Users will experience improved functionality for creating, commenting, and reacting to conversations. Admins and users do not need to take any action for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1023485",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-21T19:55:59.39Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T01:11:01Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Updated Microsoft Viva Engage Communities app for Teams Mobile",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
