{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>People Skills is an intelligent data layer in Microsoft 365 Copilot that infers skills derived from user activity mapped to a customizable built-in skill taxonomy, enhancing Copilot Chat, Microsoft 365, and Viva experiences with contextualized information about the people in your organization.  For employees, People Skills empowers them to discover, connect, and learn about others in the organization while leaders gain visibility into talent landscape strengths, gaps, and opportunities. Learn more in our <a href=\"https://techcommunity.microsoft.com/blog/microsoft365copilotblog/announcing-people-skills-general-availability-and-new-skills-agent/4406364\">General Availability announcement. </a>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): we will begin rolling out in late May 2025 and expect to complete by late June 2025.</p><p><b>How this affects your organization:</b></p><p>Once available and configured, users can launch People Skills, so your organization enjoys the following benefits right away: \n</p><ul><li>Skill inferencing from an advanced AI model to help users keep their skills fresh* \n</li><li>A built-in skills library, ready to use out-of-the-box or customize as needed  \n</li><li>Personalized skills in Microsoft 365 experiences including Microsoft 365 Copilot, Microsoft 365 profile card, Microsoft 365 profile editor, Org explorer, and People companion. \n</li><li>Skills landscape reports for leaders and analysts available from the Advanced Insights template page in Viva Insights.\n</li><li>Skills-based learning experience in Viva Learning\n</li><li>Available in June 2025, People Skills will also power a new Skill Discovery agent for employees and leaders: \n</li><li>The Skill Discovery agent enables employees to easily find experts in the organization, understand colleague’s skillsets, and make informed decisions about skill development.\n</li><li>The Skill Discovery agent informs leaders on strategic workforce planning decisions with an up-to-date view of talent landscape strengths, gaps, and opportunities. \n</li></ul><p><i>*Notes: \n</i></p><ul><li>Availability: For this May release, People Skills will be available to Microsoft 365 Copilot customers, and select Microsoft 365 and Viva customers, excluding customers with education (student or faculty) or government SKUs. More information coming soon about support for additional SKUs. \n</li><li>People Skills - Foundation service plan: Customers with the “People Skills – Foundation\" service plan (Microsoft 365 commercial customers without a Microsoft 365 Copilot SKU, excluding education and government) will have access to the People Skills service excluding AI inferencing and Microsoft 365 Copilot capabilities. \n</li><li>People Skills – Advanced service plan: Customers with the “People Skills – Advanced\" service plan (including Microsoft Viva Suite, Viva Insights (including Workplace Analytics and Feedback customers), and Viva Learning customers) will have access to the People Skills service with AI inferencing, excluding Microsoft 365 Copilot capabilities.\n</li><li>Microsoft 365 Copilot in Productivity Apps service plan: Customers with the “Microsoft 365 Copilot in Productivity Apps service plan,” excluding education and government SKUs, will now have People Skills available, including AI-inferencing and related Copilot experiences. \n</li><li>User Profile Application (UPA) Skills: If your organization has a dependency on skills data that surfaces in About Me on the Microsoft 365 profile card and editor (formerly in Delve), or on the skills field in the UPA API or Graph API, note those skills will be hidden from the Microsoft 365 profile card and editor when you deploy People Skills, and replaced with this new experience:\n<ul><li>People Skills will migrate shared UPA user skills data to this new experience at a future date. <a href=\"https://go.microsoft.com/fwlink/?linkid=2313228&amp;clcid=0x409\" target=\"_blank\">Learn more about this transition before you deploy People Skills</a> \n</li></ul></li></ul><p><b>What you can do to prepare:</b></p><p>Most organizations can quickly set up People Skills using our out-of-the-box skills library of over 16,000 skills. You also have the option to curate your own library by importing custom skills. \n</p><ol><li>From the Copilot page in the <a href=\"https://admin.microsoft.com/adminportal/home#/featureexplorer\" target=\"_blank\">Microsoft 365 admin center</a>, select People Skills in Microsoft 365 Copilot\n</li><li>You’ll be redirected to the page in the M365 Admin Center to complete setup\n</li><li>Select “Begin quick setup” \n</li></ol><p>All skills in the library, including 16,000+ skills across multiple domains and industries, are pre-selected by default. You have the option to filter out skills from the People Skills library. The more skills you include from the People Skills library, the more relevant skills users will see in their profiles.\n</p><p><i>Note:</i> You may add or remove skills later after setting up People Skills. Learn more about how to <a href=\"https://go.microsoft.com/fwlink/?linkid=2313228&amp;clcid=0x409\" target=\"_blank\">Manage your skills library</a> \n</p><p>Within a few days after your organization launches People Skills, people enabled for AI inferencing in skills will see a personalized list of skills on their profile cards by default, which they can curate , and skills will appear in Copilot searches and other Microsoft 365 experiences. Both skills people confirm and those provided by AI based on their role and work activity in Microsoft 365 will be visible by default on their profile card. Skills added by AI will be identified as skills someone the person might have. \n</p><p>You can change visibility settings in PowerShell, and people can also adjust their own skills visibility . Both admins and users have control over their skills inference setting and skill profile visibility. Admins can adjust setting in PowerShell, while users can update settings in their Microsoft 365 profile editor. \u2028<a href=\"https://go.microsoft.com/fwlink/?linkid=2313228&amp;clcid=0x409\" target=\"_blank\">Learn more about People Skills settings.</a>\n</p><p><i>Note:</i> Users without a license that provides access to skills AI inferencing will receive a skills experience that does not include AI features. They will be able to search the skills library you deploy to create and share a skills profile. <a href=\"https://go.microsoft.com/fwlink/?linkid=2310915\" target=\"_blank\">Learn more about licensing</a>.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot: People Skills will be available from late May to late June 2025. It enhances Microsoft 365 experiences by inferring skills from user activity, providing personalized skills profiles, and offering skills landscape reports. It includes a built-in skills library and a Skill Discovery agent for employees and leaders."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060842",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-23T16:17:32.41Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:07:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: People Skills will be available starting in May",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
