{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Engage: Enhanced and updated user settings.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=472019\" target=\"_blank\">472019</a>.\n</p><p>This message applies to Viva Engage for Windows desktop, Viva Engage for Mac desktop, Viva Engage on the web, Viva Engage for iOS/Android, and Viva Engage in all Microsoft Teams platforms.\n</p><p>This message does not apply to external networks and their members.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, we will carry over the user settings from Microsoft Yammer to Viva Engage, retaining all major functionalities in a new modern design. Key settings include language customization, header theme customization, dark mode, reaction skin tone options, and customizable notification settings for each community. This new experience will provide a more user-friendly and intuitive interface, consistent with other Microsoft 365 applications.</p><p>Users can access the new settings in the same way they accessed them before the rollout: with the gear icon in Viva Engage or with the three-dot menu in Engage in Teams.\n</p><p>New User <i>Settings &gt; General:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/47ef27b1-8078-43f7-8289-6870a364fd0b\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>New user <i style=\"\">Settings &gt; Notifications:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9e84e584-31f5-497c-a23e-631b460290b4\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>After this rollout, users' previous settings will remain intact and continue to be honored. These settings from the old experience will no longer be available in the modernized version:</p><ul><li>Changing password: Like every other Microsoft 365 application, users can manage passwords in Microsoft 365 account settings.\n</li><li>Contact preferences: Like every other Microsoft 365 application, users can manage contract preferences in Microsoft 365 account settings.</li><li>Changing language and time zone for overall Microsoft 365: Like every other Microsoft 365 application, users can manage language and time zone in M365 account settings.\n</li><li>“I install a new application” and “There are new suggestions for people to follow (weekly)” notification settings will be retired.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update the below existing public documentations with revised content.\n</p><ul><li><a href=\"https://support.microsoft.com/office/use-diverse-skin-tone-preferences-for-viva-engage-reactions-d28e25ed-ef20-4c7d-b54c-8bebe9caaded\" target=\"_blank\">Use diverse skin tone preferences for Viva Engage reactions - Microsoft Support</a>\n</li><li><a href=\"https://support.microsoft.com/office/change-my-viva-engage-profile-and-settings-web-and-desktop-ab813bce-5312-4688-94ee-70018545cd3c\" target=\"_blank\">Change my Viva Engage profile and settings (Web and Desktop) - Microsoft Support</a>\n</li><li><a href=\"https://support.microsoft.com/office/accessibility-in-viva-engage-9ebafb82-e3c5-4201-bfff-ef3a0a71f61b\" target=\"_blank\">Accessibility in Viva Engage - Microsoft Support</a> \n</li><li><a href=\"https://support.microsoft.com/office/manage-viva-engage-notifications-93e530e0-189f-4768-8f28-7683d48cc996\" target=\"_blank\">Manage Viva Engage notifications - Microsoft Support</a> \n</li><li><a href=\"https://support.microsoft.com/topic/manage-email-with-viva-engage-digests-6c309167-02b2-4f32-9374-9117ef95d186\" target=\"_blank\">Manage email with Viva Engage digests - Microsoft Support</a>\n</li><li><a href=\"https://prod.support.services.microsoft.com/office/manage-viva-engage-desktop-notifications-bf60a88f-23cc-4ee3-b81d-5637b073d1de\" target=\"_blank\">Manage Viva Engage desktop notifications - Microsoft Support</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "472019"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will soon have modernized user settings, rolling out from mid-March to late April 2025. The update will retain key functionalities from Microsoft Yammer, offering a more intuitive interface. Some settings will be managed through Microsoft 365 account settings. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1025208",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-07T01:13:32.77Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-07T01:13:19Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: Modernized user settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
