{
  "ActionRequiredByDateTime": "2025-06-18T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of our ongoing convergence process for all Microsoft Defender workloads, we will retire SIEM (Security Information and Event Management) agents from Microsoft Defender for Cloud Apps in starting mid-November 2025 and ending late November 2025. We recommend you transition to APIs that support the management of activities and alerts data from multiple workloads.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Existing Microsoft Defender for Cloud Apps SIEM agents will function as is until the SIEM agents retire, but no new SIEM agents can be configured starting June 19, 2025. Microsoft Sentinel agents will remain supported and can still be added.</p><p>Defender for Cloud Apps alerts and activities data currently supported in the SIEM agents are also available in the unified API and SIEM solutions that provide access to alerts and activity data for all Microsoft security products, for cross-workload visibility:</p><ul><li>For alerts and activities, Defender XDR streaming API: <a href=\"https://learn.microsoft.com/defender-xdr/streaming-api\" target=\"_blank\">Stream Microsoft Defender XDR events - Microsoft Defender XDR | Microsoft Learn</a>\n</li><li>For Microsoft Entra ID Protection login events: <a href=\"https://learn.microsoft.com/defender-xdr/advanced-hunting-identitylogonevents-table\" target=\"_blank\">IdentityLogonEvents table in the advanced hunting schema - Microsoft Defender XDR | Microsoft Learn</a>\n</li><li>For alerts, Microsoft Graph security alerts API (v2): <a href=\"https://learn.microsoft.com/graph/api/security-list-alerts_v2?view=graph-rest-1.0&amp;tabs=http\" target=\"_blank\">List alerts_v2 - Microsoft Graph v1.0 | Microsoft Learn</a>\n</li><li>We also recommend viewing Defender for Cloud Apps alerts data in the Microsoft Defender XDR incidents API. Learn more: <a href=\"https://learn.microsoft.com/defender-xdr/api-incident\" target=\"_blank\">Microsoft Defender XDR incidents APIs and the incidents resource type - Microsoft Defender XDR | Microsoft Learn</a>\n</li></ul><p>These APIs enhance security monitoring and management and offer additional supported capabilities that utilize data from multiple Microsoft Defender workloads.</p><p><b>What you need to do to prepare:</b></p><p>To ensure continuity and access to the same data available before this retirement through Microsoft Defender for Cloud Apps SIEM agents, we recommend transitioning to the supported unified API and SIEM solutions. We encourage you to begin planning your migration to these solutions to take advantage of their enhanced capabilities. </p><p>Learn more: <a href=\"https://learn.microsoft.com/defender-cloud-apps/siem\" target=\"_blank\">Generic SIEM integration - Microsoft Defender for Cloud Apps | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Cloud Apps will retire SIEM agents between mid-November 2025 and late November 2025. No new SIEM agents can be configured after June 19, 2025. Transition to APIs for managing activities and alerts data from multiple workloads is recommended. Microsoft Sentinel agents remain supported."
    }
  ],
  "EndDateTime": "2026-01-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1077861",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-19T23:43:41.81Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-19T23:43:22Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Defender for Cloud Apps: SIEM agents will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
