{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: We're excited to announce an update to the green room feature that will enhance the management of live sessions for town halls, webinars, and structured meetings. Presenters in the green room will be able to easily promote attendees from the waiting room to the green room using the <i>Participants </i>roster.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Available now.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, organizers and presenters in the green room can promote an attendee by searching for the attendee's name from the participant roster, selecting the three-dot menu, and choosing <i>Make a presenter:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fe0c1b57-5a0b-430f-a50d-edfe75830b44\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be on by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout happened automatically by the specified dates with no admin action required. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/using-the-green-room-in-microsoft-teams-5b744652-789f-42da-ad56-78a68e8460d5\" target=\"_blank\">Using the green room in Microsoft Teams - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Presenters in Microsoft Teams can now promote attendees from the waiting room to the green room using the Participants roster. This update is available for Teams on Windows, Mac, and the web, and requires no admin action. Notify users and update documentation as needed."
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098937",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-19T23:01:19.187Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-19T23:01:11Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Presenters can promote attendees to the green room",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
