{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 16, 2025: We have updated the content. Thank you for your patience.</p><p>Detection, processing and storage of interactions done on generative AI applications such as Security Copilot, Copilot Studio and others under Microsoft Purview Data Compliance solutions including Data Lifecycle Management, eDiscovery, and Communication Compliance, and Microsoft Purview Data Security capabilities  including Insider Risk Management and data classification will begin using a pay-as-you-go pricing model on May 1 in preparation for general availability. Microsoft Purview Audit will only use pay-as-you-go pricing for audit logs related to non-Microsoft generative AI applications. Microsoft 365 Copilot Chat data (with or without a Copilot license) will not be impacted by these new pay-as-you-go meters.&nbsp;</p><p>This change is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?id=488495\" target=\"_blank\">488495</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview (paid): Rollout of new pay-as-you-go model will begin early May 2025 and is expected to complete by early May 2025. </p><p>General Availability (Worldwide): We will begin rolling out in late June 2025 (previously mid-June) and expect to complete by early July 2025 (previously late June).</p><p><b>How this will affect your organization:</b></p><p>Detection, processing and storage of interactions done on generative AI applications under Microsoft Purview Data Compliance solutions including Audit, Data Lifecycle Management, eDiscovery, and Communication Compliance, and Microsoft Purview Data Security capabilities including Insider Risk Management and data classification will transition to a pay-as-you-go pricing model. To continue using these features, you need to link an Azure subscription to Microsoft Purview to enable billing. Starting May 1, 2025, you will be billed based on usage of Non-M365 AI applications for each of these solutions. </p><p><b>What you need to do to prepare:</b>\n</p><p>Microsoft Purview admins with appropriate permissions can enable the pay-as-you-go features from Microsoft Purview by taking a few steps to link an Azure subscription.</p><p>You will not be able to use certain pay-as-you-go features without linking to a valid subscription, after early July 2025. </p><p>To learn more: <a href=\"https://go.microsoft.com/fwlink/?linkid=2285100\" target=\"_blank\">Enable Microsoft Purview PAY-AS-YOU-GO features</a></p><p>If your tenant has enabled pay-as-you-go billing for Microsoft Purview, you will begin getting charged for usage of these data compliance PAYG features starting May 1, 2025. If you do not wish to get charged, please cease usage of these features before May 1.&nbsp;</p><p>Solution admins with appropriate permissions can use the Non-M365 AI applications in the&nbsp;<a href=\"https://purview.microsoft.com/informationprotection/purviewmipoverview\" target=\"_blank\">Microsoft Purview portal</a>&nbsp;under the respective Data Compliance and Data Security solutions.</p><p>Microsoft Purview Communication Compliance provides the tools to help organizations detect regulatory compliance violations (for example SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to ensure user-level privacy.  \n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies to manage security and compliance. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy. ​&nbsp;</p><p>\n</p><p> \n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488495"
    },
    {
      "Name": "Summary",
      "Value": "Data security and compliance capabilities for generative AI applications in Microsoft Purview will transition to a pay-as-you-go pricing model starting May 1, 2025. This affects features like Data Lifecycle Management, eDiscovery, and Communication Compliance. To use these features, link an Azure subscription. General availability begins in late June 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1048612",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-26T19:16:49.737Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T23:02:53Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Data security & compliance capabilities for GenAI applications in Microsoft Purview transitioning to paid public preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
