{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: A new town hall meeting option called <i>Who has control of production tools</i> allows organizers to designate who can manage the screen during the event. Assigned individuals will be able to start the event, control what attendees see, and end the event, for a smoother, more organized experience.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=487432\" target=\"_blank\">487432</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early May 2025 and expect to complete by mid-May 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late May 2025 and expect to complete by early June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, organizers, co-organizers, and presenters can bring participants on or off screen and start or end the event. After this rollout, only assigned users will have the ability to perform these actions. Organizers, co-organizers, or presenters who are not assigned can still join the event and present but will be restricted from managing the screen or starting and ending the event. Presenters who are unassigned will not be able to manage assigned users with the options <i>Make an attendee</i> or <i>Remove from meeting</i>. A clapperboard icon will appear next to the names of participants who have been granted these permissions during the event.\n</p><p>In Town hall meeting options, event organizers can designate which roles have control over production tools at <i>Details &gt; Production tools:</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/7c7936a7-fafa-4bbe-9393-a7fd16433189\" style=\"width: 400px;\" alt=\"user controls\"></p><p><i>Who has control of production tools</i> will have three options:\n</p><ol><li><i>Organizers, co-organizers and presenters:</i> This is the default.</li><li><i>Organizers and co-organizers</i></li><li><i>Specific people</i></li></ol><p>This meeting option is only available for town halls and does not require a Teams Premium license. We recommend the organizer set this option before the event starts.\n</p><p><i>Limitations</i>\n</p><ul><li><i>Who has control of production tools</i> is not available for meetings or webinars.\n</li><li>Users joining through older Teams versions will continue to see the existing behavior, where all organizers, co-organizers, and presenters have the ability to manage the screen.\n</li></ul><p>\n</p><p>Any new events created or updated after late May 2025 will receive the new <i>Who has control of production tools</i> meeting option by default.\n</p><p>This feature will be available by default for meeting organizers to configure.\n\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "487432"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"487432\":[{\"RoadmapId\":487432,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-20T11:12:15.2566716Z\",\"LatestRing\":null},{\"RoadmapId\":487432,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-20T11:12:15.256672Z\",\"LatestRing\":null},{\"RoadmapId\":487432,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-20T11:12:15.2566721Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce a new town hall meeting option called \"Who has control of production tools\" in May 2025. This feature allows organizers to designate who can manage the screen, start, and end the event. It applies to Teams for Windows, Mac, and the web, and does not require a Teams Premium license."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-08-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1058258",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-18T23:53:18.32Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-18T23:52:41Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Specify who can manage the screen in town halls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
