{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to ensure compliance with geographical regulations and elevate customer satisfaction by customizing quiet time rules per region in Dynamics 365 Customer Insights - Journeys. This feature will reach general availability on July 1, 2025.<br><br>\n<b>How does this affect me?</b><br>\nWith the enhanced quiet time options, you can:<ul>  \n<li>Ensure adherence to various regulations by establishing quiet time rules for different regions or based on your business operation.</li>\n<li>Set the times, days, and dates when customers shouldn't be contacted.</li> \n<li>Customize quiet time settings for a particular journey. Upon activation of the journey, interactions are either initiated or queued in accordance with the preset rules and the identified customer's time zone or location.</li></ul>\nThese options ensure that you can stay compliant with local and regional regulations regarding customer privacy.<br><br>\n<b>What action do I need to take?</b><br>\nThis message is for awareness and no action is required.<br><br>\nIf you would like more information about this feature, please visit <a href=\"https://aka.ms/ADO11069-1\"target=\"_blank\">Set quiet times to prevent messages from sending during unwanted hours</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-07-11T19:17:50Z",
  "HasAttachments": false,
  "Id": "MC1092332",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-11T19:19:56.727Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-11T19:17:50Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Insights - Journeys - Respect quiet times, engage based on location and time zones",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
