{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're updating how feedback policies are managed for in-app surveys in Microsoft Teams. As part of this change, Teams for Windows desktop and Teams for the web will stop using Teams-specific feedback policies and instead adopt the Cloud Policy service for Microsoft 365. This change aligns survey feedback with other in-app feedback experiences, simplifying policy management across your organization. This change will be on by default.</p><p>Note: Before this rollout, the Teams feedback policy is also on by default. The new policy is common across all M365 apps and now includes Microsoft Teams too.</p><p>This message is associated with MC790791<i> (Updated) Microsoft Teams: Changes to in-app feedback experience and feedback policy (Teams Desktop and Teams for web), </i>published May 2024 and updated August 2024<i>.</i></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by mid-July 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Give a compliment/Report a problem experience has already migrated over to Cloud Policy Service and Surveys now will also use the same policy as other in-app feedback experiences. This will make managing feedback easier as all feedback entry points can be controlled through a single tenant policy.\n</p><p>After this rollout, there will be no change in how users send or submit feedback through surveys or other in-app feedback mechanisms. However, survey feedback will now be governed by the same Microsoft 365 Cloud Policy that controls other feedback entry points (such as <i>Give a compliment </i>or<i> Report a problem</i>). This unification simplifies administration by enabling centralized control of all feedback experiences.\n</p><p><b>NOTE:</b> Teams for iOS and Android will continue to use Teams-specific feedback policies for now. We will publish a separate MC post when those platforms transition to Cloud Policy.</p><p><b>What you need to do to prepare:</b></p><p>Review currently used Teams feedback policies and ensure Microsoft 365 cloud feedback policies are updated to reflect your organization needs for in-app feedback collection.</p><ul><li>Teams feedback policies: <a href=\"https://learn.microsoft.com/microsoftteams/manage-feedback-policies-in-teams\" target=\"_blank\">Manage feedback policies in Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/misc/feedback-user-control?view=o365-worldwide\" target=\"_blank\">Learn about Microsoft feedback for your organization - Microsoft 365 admin | Microsoft Learn</a>\n</li><li>Cloud Feedback Policy Service: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-feedback-ms-org?view=o365-worldwide\" target=\"_blank\">Manage Microsoft feedback for your organization - Microsoft 365 admin | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/deployoffice/admincenter/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Microsoft 365 Apps | Microsoft Learn</a>\n</li></ul><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your admins and/or users about this change and update internal documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams in-app survey feedback policies will be managed by Microsoft 365 Cloud Policy by default, starting late June 2025. This change simplifies feedback policy management by aligning Teams with other Microsoft 365 apps. Teams for iOS and Android will continue using Teams-specific policies for now. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098174",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-18T23:18:46.18Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-18T23:18:22Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: In-app survey feedback policies will be managed by default with Microsoft 365 Cloud Policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
