{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 16, 2025: We have updated the timeline below. Thank you for your patience.</p><p>April 11, 2025: There was an error previously published that we have corrected. Previously we mentioned that the Microsoft Teams town halls dial-in options would be available to attendees and presenters, and that it would appear as separate email invited. This is not correct. </p><p>Presenters and Organizers can now, with this update, join a Teams town hall using the dial-in options and code displayed on the Event Scheduling page after publishing. This code should only be used for Organizers and Presenters, not attendees.&nbsp;</p><p>Presenters and attendees can now join Microsoft Teams town halls using dial-in options and join codes.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=476488\" target=\"_blank\">476489.</a></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-May 2025 (previously early May) and expect to complete by late May 2025 (previously mid-May).\n</p><p>General Availability (Worldwide): We will begin rolling out late May 2025 (previously mid-May) and expect to complete by late May 2025.\n</p><p>General Availability (GCC, GCC High): We will begin rolling out early June 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>With the release of this feature, Teams town hall presenters and organizers may join a Town hall using the dial-in option. Teams town hall does not support dial-in Attendees at this time. </p><p>This update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "476489"
    },
    {
      "Name": "Summary",
      "Value": "Presenters and organizers can now join Microsoft Teams town halls using dial-in options and join codes, but this feature is not available for attendees. The rollout will begin mid-May 2025 and complete by late June 2025, depending on the release phase. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1009929",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-16T16:16:54.25Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-19T00:44:54Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Join town halls using dial-in options and join codes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
