{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: A new moderated meeting template for organizers with a Microsoft Teams Premium license and tenants that are enabled for Information Barriers (IB) will enable secure collaboration between users separated by information barriers (also known as ethical walls) under strict compliance oversight. With this capability, meetings involving participants from restricted groups can proceed only when a designated meeting moderator—assigned by the compliance department—is present. Meeting attendees must wait in the lobby until the moderator joins the meeting. Attendees can chat during the meeting only when the meeting moderator is present. If the last moderator leaves the meeting, the meeting automatically ends. These features ensure real-time compliance monitoring and maintain regulatory integrity during sensitive cross-barrier interactions.\n</p><p>Organizers must have a Teams Premium license and the tenant must be enabled for Information Barriers. Attendees can have a Microsoft Teams license (not premium).</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486833\" target=\"_blank\">486833</a>.</p><p><b>NOTE: </b>To successfully use this feature, you must configure IB v2 for your tenant. To schedule a meeting in which a user invites people from conflicting barriers, the meeting organizer will need a Teams Premium license.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late May 2025 and expect to complete by mid-May 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out end of June 2025 and expect to complete by mid-July 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users will find this template in the meeting invitation drop-down menu, with the <i>Add required moderators</i> field:</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1d2a8be4-5377-43b5-8af9-3c91db973341\" style=\"width: 400px;\" alt=\"user controls\"></p><p>This feature will be available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>Compliance must create and authorize moderators in the Microsoft Purview Compliance portal in order to use this feature. </p><p>To learn more about setting up a moderator and using the new meeting template:</p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/information-barriers-v2-is-now-generally-available-for-all-new-onboarding-custom/3757781\" target=\"_blank\">Information Barriers v2 is now generally available for all new onboarding customers | Microsoft Community Hub</a></li><li><a href=\"https://learn.microsoft.com/purview/information-barriers-edit-segments-policies\" target=\"_blank\">Manage information barriers policies | Microsoft Learn</a></li></ul><p>Before rollout, we will update this post with new documentation.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486833"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Premium will introduce a moderated meeting template for secure collaboration between users separated by information barriers. Meetings require a designated moderator for compliance, and attendees wait in the lobby until the moderator joins. This feature, available for various Teams platforms, requires IB v2 configuration and a Teams Premium license for organizers. Rollout starts in May 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061104",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-24T00:54:50.747Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T00:54:40Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Premium: Moderator-governed meetings for information barrier compliance",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
