{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Graph offers a unified API endpoint for accessing data from multiple Microsoft cloud services in a single response. The Audit Search Graph API allows our customers to programmatically access the new async Audit Search experience, which also provides improved reliability and search completeness.</p><p>We previously announced the General Availability of Microsoft Purview's Audit Search Graph API in November 2024, as communicated in MC720778 <i>(Updated) Microsoft Purview: Audit Search with Microsoft Graph API </i>(published February 2024, updated June 2024).</p><p>However, after this announcement, we identified issues that cause the API to fail in Graph v1.0. As a result, we have rolled back this release and address these issues before re-publishing the API to Graph v1.0.\n</p><p>We understand the inconvenience this rollback may cause and sincerely apologize for any disruption to your operations. Your satisfaction is our priority, and we are committed to delivering a reliable and efficient API experience.\n</p><p>In the interim, the <a href=\"https://learn.microsoft.com/graph/api/resources/security-auditlogquery?view=graph-rest-beta\" target=\"_blank\">Audit Search Graph API will continue to be available in Beta</a> and will function as expected. We appreciate your patience and understanding as we work diligently to resolve these issues.</p><p>You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more about Purview Audit: <a href=\"https://learn.microsoft.com/purview/audit-solutions-overview\" target=\"_blank\">Learn about auditing solutions in Microsoft Purview | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "117587"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052169",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-10T01:47:45.7Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T01:47:26Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Audit Search with Microsoft Graph API has rolled back to beta",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
