{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 17, 2025: We have updated the content. Thank you for your patience.</p><p>Introducing pay-as-you-go departmental billing for SharePoint Agents in Copilot Control System.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Starting early June 2025, M365 Administrators can set up Pay-as-you-go for SharePoint Agents via Copilot Control System. Administrators can add billing polices and connect to SharePoint Agents to establish departmental chargeback and billing.</p><p><b>How this will affect your organization:</b></p><p>Admins can set up Pay-as-you-go for SharePoint Agents in Copilot under “Billing &amp; usage”. They can connect Billing Policies to SharePoint Agents, allowing end users within those policies to use SharePoint Agents.</p><p>Users in organizations with 50 or more Microsoft 365 Copilot licenses have had promotional access to SharePoint Agents since January 2025. With this promotional access ending June 30, admins will need to enable Pay-as-you-go billing to allow users in their organization without a Microsoft 365 Copilot license to continue using SharePoint Agents. Departmental billing enables organizations using Pay-as-you-go billing to allocate costs across business units and manage spend more precisely.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a602f734-f754-4789-98c6-10f9db80cdfb\" width=\"400\" height=\"\"></p><br><p><b>What you need to do to prepare:</b></p><p>Before applying billing policies to SharePoint Agents in Copilot Control System, customers who have already set up SharePoint Agents for consumptive billing must:</p><ol><li>Turn off the legacy tenant-level pay-as-you-go for SharePoint Agents from Copilot -&gt; Billing &amp; usage.</li><li>Create the required Billing Policy </li><li>Connect the Billing Policy to SharePoint Agents</li></ol><p></p><br>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 admins can now set up Pay-as-you-go billing for SharePoint Agents via the Copilot Control System starting early June 2025. This allows departmental billing and precise cost management. Admins need to disable legacy tenant-level billing, create new billing policies, and connect them to SharePoint Agents."
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075905",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-17T17:29:43.147Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:21:40Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Onboard SharePoint agents as a Pay-as-you-go scenario",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
