{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 19, 2025: We have updated the content. Thank you for your patience.\n</p><p>Coming soon to Microsoft Teams: The Facilitator agent can take real-time notes during your Teams meetings, allowing everyone to co-author and collaborate seamlessly. This frees everyone up to focus and engage deeply in meetings, while also helping drive alignment before the meeting ends.&nbsp;&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478611\" target=\"_blank\">478611</a>.\n</p><p>We introduced the Targeted Release preview of this feature in MC937709 (Updated) Facilitator in Teams Meetings and Chats (published and updated November 2024).\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.\n</p><p>A Microsoft 365 Copilot license is required to use this feature.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early July 2025 (previously early June) and expect to complete by late July 2025 (previously late June). </p><p><b>How this will affect your organization:</b></p><p>After this rollout, as an admin, you control whether Facilitator will be available to your entire organization or to a certain group of users. The Facilitator app will be on by default unless all apps are blocked by your organization. For use in meetings, Facilitator will be off by default, and licensed users will have the option to enable. Learn more:&nbsp;<a href=\"https://learn.microsoft.com/MicrosoftTeams/facilitator-teams\" target=\"_blank\">Set up Facilitator in Microsoft Teams for collaborative AI notes - Microsoft Teams | Microsoft Learn</a>\n</p><p>Facilitator and Microsoft 365 are built on Microsoft's comprehensive approach to security, compliance, and privacy. As a part of the security promise, you can discover, protect, and govern AI interactions with Facilitator through Microsoft Purview. Microsoft Purview Data Security Posture Management (DSPM) for AI helps IT and security teams proactively discover and manage data risks. Use DSPM for AI in conjunction with other Microsoft Purview capabilities such as Audit, eDiscovery, and Data Lifecycle Management to ensure data security and compliance for your organization. Learn more about Microsoft Purview here:&nbsp;<a href=\"https://learn.microsoft.com/purview/ai-microsoft-purview\" target=\"_blank\">Microsoft Purview data security and compliance protections for Microsoft 365 Copilot and other generative AI apps | Microsoft Learn</a>.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p><p><b>Known Limitations\n</b></p><p>Sensitivity labels applied to the meeting will not automatically be applied to the meeting notes file. For example, if an organizer marks a meeting as highly confidential and turns on AI-generated notes, those notes will not be marked as highly confidential. The suggested workaround is to not use Facilitator in meetings where sensitive information will be discussed. This limitation will be documented in admin and end user documentation at release. Microsoft is actively working on meeting sensitivity label inheritance to notes and will provide more updates as they are available.\n</p><p>Learn more \n</p><ul><li>If you're using Microsoft 365 Copilot in your organization (with your work or school account): <a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-privacy\" target=\"_blank\">Data, Privacy, and Security for Microsoft 365 Copilot | Microsoft Learn</a></li><li>Admin documentation: <a href=\"https://learn.microsoft.com/MicrosoftTeams/facilitator-teams\" target=\"_blank\">Set up Facilitator in Microsoft Teams for collaborative AI notes - Microsoft Teams | Microsoft Learn (will be updated before rollout)</a></li><li>User documentation (meetings): <a href=\"https://support.microsoft.com/office/automate-notetaking-in-microsoft-teams-meetings-37657f91-39b5-40eb-9421-45141e3ce9f6\" target=\"_blank\">Automate notetaking in Microsoft Teams meetings - Microsoft Support (will be updated before rollout)</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478611"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon introduce the Facilitator agent for real-time note-taking during meetings, available from early July 2025. This feature requires a Microsoft 365 Copilot license and will be off by default in meetings. Admins can control its availability. Sensitivity labels won't apply automatically to notes."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1017117",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-19T19:22:42.017Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-26T00:28:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Facilitator agent real-time notes in meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
