{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Some shared mailbox users and Delegates need to have the ability to manage the settings (such as Categories, Notifications, Rules, and Signatures) of the mailbox that is shared with them. In Outlook for Windows, this can be done by adding the Mailbox as an Account. </p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=375635\" target=\"_blank\">375635</a></p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-May 2025 and expect to complete by mid-June 2025.</p><p>Targeted Release: We will begin rolling out mid-June 2025 and expect to complete by mid-July 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 and expect to complete by mid-August 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users with Full Access permission to a shared mailbox, or another user's mailbox, will have the ability to add that mailbox as an account in the new Outlook for Windows. Users who have full access mailboxes that are automapped will see a 'Promote' button on the Shared with Me Settings page. Clicking this button will allow users to add the mailbox as an account.</p><p>For organizations that do not have automapping enabled, shared mailboxes will be automatically added as accounts when the users adds the mailbox and they have the correct permission to add it as an accounts.&nbsp;</p><p>Once a user adds a shared mailbox as an account, they will have the ability to manage all settings for that mailbox. This is similar behavior that exists in the classic Outlook for Windows and OWA through the 'open another mailbox' button.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>\n</p>\n<p></p>\n<p>#newoutlookforwindows</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "375635"
    },
    {
      "Name": "Summary",
      "Value": "Shared mailbox users and Delegates will be able to manage settings by adding the mailbox as an account in Outlook for Windows. Rollout starts in mid-May 2025 for Public Preview and completes by mid-August 2025 for General Availability. No admin action is required, but review and notify users about this change."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1065056",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-29T23:44:29.463Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-29T23:44:21Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Shared Mailboxes as Accounts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
