{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 28, 2025: Please disregard this message as it was published by mistake. We apologize for any confusion.</p><p>Coming soon: An update to the behavior of an existing tenant setting in Microsoft Fabric that allows Fabric admins to enable Microsoft Copilot and other features powered by Microsoft Azure OpenAI in Fabric. \n</p><ul><li>Fabric tenant setting name: <i>Users can use Copilot and other features powered by Azure OpenAI\n</i></li><li>Impact: No impact if no action is taken</li></ul><p>This feature does not require an additional Microsoft 365 Copilot license. Only Fabric capacity is required.</p><p><b>When this will happen:</b>\n</p><p>\n</p><p>Starting May 12, 2025, this change will be incrementally rolled out to all customers of Fabric.\n</p><p>Fabric service admins can check the visual cue at the top of the <i>Tenant settings</i> page to check when the setting behavior has been updated and take action as necessary.\n</p><p><b>How this will affect your organization:</b></p><p>What is the change?\n</p><p>Before this rollout, this setting is delegated to capacity admins by default and cannot be changed by tenant admins. That is, tenant admins cannot take back control of this setting from their capacity admins and drive feature management at the tenant level. \n</p><p>After this rollout, tenant admins will be able to take back control of this setting from their capacity admins. Tenant admins can remove delegation if necessary by unchecking <i>Capacity admins can enable/disable </i>in the Fabric Admin portal at <i>Tenant settings &gt; Users can use Copilot and other features powered by Azure OpenAI.</i></p><p><i>Tenant settings </i>delegation to capacity admins in Fabric:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/79d191fe-e64b-470c-bbd9-e45bd219ff1a\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>If you do not intend to remove delegation for this setting, no action is needed for your tenant. The current setting value and the corresponding capacity level values do not change when this new behavior is rolled out. \n</p><p>If you do intend on taking back control of this setting from the capacity admins, follow these steps:</p><ul><li><i>Review and decide the appropriate settings for your tenant.</i> Review the implications of taking back control:<ul><li>Capacity admins will no longer be able to see this setting in the <i>Delegated tenant settings</i> tab in the <i>Capacity</i> settings. \n</li><li>If delegation is disabled, all capacities will follow the tenant setting values and cannot override tenant admin selection. \n</li><li>If setting is enabled for the capacity and delegation is removed with tenant-level value as <i>Off</i>, then existing Copilot features will stop for users in the capacity. Consider communicating to capacity admins before removing delegation.</li><li><a href=\"https://cxcs.microsoft.net/file/ccp/en-us/68eb97cf-39df-4fb3-a757-c68869bce3a5\" target=\"_blank\">Watch a short video</a> (no sound, 00:19 seconds)</li></ul></li><li><i>Action for Microsoft 365 global admins and Fabric admins:</i> If no action is taken, the current behavior for this setting across the tenant and capacity level does not change. If you opt to remove delegation, we recommend communicating to your capacity admins and implications.</li></ul><p>We encourage you to assess the behavior update and make any necessary changes to align with your organization’s compliance policies. This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>If you have any questions or need further assistance, please do not hesitate to contact our support team. </p><p>Learn more: <a href=\"https://learn.microsoft.com/fabric/fundamentals/copilot-fabric-overview\" target=\"_blank\">Overview of Copilot in Fabric - Microsoft Fabric | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Updated April 28, 2025: Please disregard this message as it was published by mistake. We apologize for any confusion."
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1062450",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-28T17:53:10.8Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-25T22:55:30Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Fabric: Changes to delegation capabilities for Microsoft Azure OpenAI tenant settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
