{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 30, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Before this rollout, Microsoft Teams has one admin policy to control event access for webinars and town halls. After this rollout, admins can control who can attend town halls in their organization with the new policy setting <code>TownhallEventAccessType</code>.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483250\" target=\"_blank\">483250</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, admins can control the event access for town hall created by their users with the new policy setting <code>TownhallEventAccessType</code> in the Teams admin center and Microsoft PowerShell. The policy has two new attributes: <code>Everyone </code>and <code>Everyone in Organization including Guests</code>:\n</p><ul><li>If <code>Everyone </code>is selected, town halls will not be restricted to a certain identity type; however, your organizers can still choose to restrict their town hall as they wish. This is the default setting.</li><li>If <code>Everyone in Organization including Guests</code> is selected, town halls in your organization will only allow users in your organization and guest users to your tenant to attend. Town hall organizers may choose to further restrict their town halls but cannot invite users who are not part of their organization or who are not guests to attend.\n</li></ul><p>If you have feedback on these attributes or have suggestions for new attributes, please send an email to <a href=\"mailto://EventAccessFeedback@microsoft.com\" target=\"_blank\">EventAccessFeedback@microsoft.com</a></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>By default, <code>TownhallEventAccessType</code> will be set to <code>Everyone</code>. If you would like to change the default setting before the rollout begins, you can use this Microsoft PowerShell code:\n</p><p style=\"margin-left: 25px;\"><code>Set-CsTeamsEventsPolicy -Identity Global -TownhallEventAccessType EveryoneInOrganizationAndGuests</code></p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/set-up-town-halls\" target=\"_blank\">Manage who can schedule and attend town halls in Microsoft Teams - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483250"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating its town hall event access policy. Admins will now have a new setting, `TownhallEventAccessType`, to control who can attend town halls. The rollout starts mid-June 2025 and completes by late June 2025. The default setting is `Everyone`, but it can be changed to `Everyone in Organization including Guests`."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Mobile, Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1047244",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-30T21:44:22.5Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-03T02:06:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New town hall event access policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
