{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: If desired, admins will be able to configure <i>View and upload</i> as a permission option for Anyone links to folders in Microsoft OneDrive. After this rollout, tenants will be able to restrict Anyone links for folders to view only while still enabling the <i>Request files </i>functionality.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485801\" target=\"_blank\">485801</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early June 2025 and expect to complete by late June 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late June 2025 and expect to complete by early August 2025.\n</p><p><b>How this will affect your organization:</b></p><p>This feature offers admins more granular control over content access, ensures compliance with internal data policies, helps enable external sharing, and helps administrators maintain a higher level of data governance. This feature is off by default and will not impact existing settings. After this rollout, admins can enable the new <i>View and upload</i> option with Microsoft PowerShell: <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps\" target=\"_blank\">Set-SPOTenant (Microsoft.Online.SharePoint.PowerShell) | Microsoft Learn</a> or in the Microsoft SharePoint admin center by going to<i> Policies &gt; Sharing:</i></p><p>\n\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/68423343-07df-47b0-9863-8c77a0ec5156\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>Before this rollout: When an admin sets Anyone links for folders to <i>View, edit, and upload</i> in PowerShell or the SharePoint admin center, the user can set folders to <i>Can edit</i> or <i>Can view</i> and can use the <i>Request files</i> feature for the folder. To comply with internal data policies or to have greater information control, an admin may choose to restrict the Anyone links for folders to <i>View</i>. With this setting, users are limited to <i>Can view </i>folder links, but the <i>Request files</i> feature is not available.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c8e4928d-207b-44ce-baba-c54c6fc33868\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><i>After this rollout: </i></p><p>Admins can set Anyone links for folders to<i> View and upload</i>. With this setting, users can only set folders to Anyone can view links <i>(Can view </i>or <i>Can't download) </i>and continue to access the <i>Request files</i> feature.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8b8d781a-5f21-4555-a1d2-2cd7243a0384\" style=\"width: 400px;\" alt=\"user settings\">\n\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i></p><ul><li>The <a href=\"https://learn.microsoft.com/sharepoint/turn-external-sharing-on-or-off#advanced-settings-for-anyone-links\" target=\"_blank\">Advanced settings for Anyone links</a> section in <a href=\"https://learn.microsoft.com/sharepoint/turn-external-sharing-on-or-off\" target=\"_blank\">Manage sharing settings for SharePoint and OneDrive in Microsoft 365 - SharePoint in Microsoft 365 | Microsoft Learn</a> </li><li><a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps\" target=\"_blank\">Set-SPOTenant (Microsoft.Online.SharePoint.PowerShell) | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485801"
    },
    {
      "Name": "Summary",
      "Value": "Admins will soon be able to configure a \"View and upload\" permission for Anyone links to folders in OneDrive, starting June 2025. This feature allows more granular control over content access and maintains the \"Request files\" functionality. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1078765",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-20T23:45:19.807Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-20T23:45:01Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: New \"View and upload\" permission for Anyone links to folders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
