{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Viva Engage: Community admins will have an upgraded experience for viewing, creating, and editing text in the full <i>Community information</i> section. The new experience will use a simplified version of the same publisher used for creating posts in Viva Engage and will limit the length of the <i>Community information</i> section to 32k characters (the same as the limit for articles).\n</p><p>This message applies to:\n</p><ul><li>Engage app on the desktop (as a progressive web app)\n</li><li>Engage app in Microsoft Outlook (new Outlook for Windows desktop, Outlook for the web, and new Outlook for Mac desktop)\n</li><li>Engage app in Microsoft Teams (Teams for Windows desktop, Teams for Mac desktop, and Teams for the web)\n</li><li>Engage on the web (www.engage.cloud.microsoft.com)\n</li></ul><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479405\" target=\"_blank\">479405</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late March 2025 and expect to complete by mid-April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The updated <i>Community information</i> experience in Viva Engage:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/89d31dc8-2ced-4ea4-b0ab-4824a7731068\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479405"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will soon update the \"Community information\" experience for community admins, simplifying text creation and editing, and limiting the section to 32k characters. This change will apply to various Engage apps and will roll out from late March to mid-April 2025. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1034581",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-17T23:57:44.703Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-17T23:57:33Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: Updated \"Community information\" experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
