{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 24, 2025: The rollout of this feature has been delayed. In the meantime, the Microsoft 365 Copilot app will continue directing users to the My account portal for installations. A status update on the new modal dialog is expected in November.</p><p>The <a href=\"http://portal.office.com/account/\" target=\"_blank\">My account</a>&nbsp;portal will be replaced by a new modal dialog within the Microsoft 365 Copilot app (formerly Office.com) on <a href=\"https://m365.cloud.microsoft/\" target=\"_blank\">web </a>and desktop. The new modal will support end user self-installs that are currently available on the My account portal (Office, Project, Visio, and Skype for Business).</p><p><b>When this will happen:</b></p><p>\n</p><p>\n</p><p>\n</p><p>Targeted Release: We will communicate via Message center when we are ready to proceed.</p><p>General Availability (Worldwide): We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b></p><p>End users will be able to download their apps by accessing the modal dialog in <b>Apps &gt; Install apps &gt; Install Microsoft 365 apps</b> in the Microsoft 365 Copilot web and desktop app.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p><i style=\"\">If you allow users to self-install apps:</i></p><ul><li>Please remove direct links to the My account portal (https://portal.office.com/account) in your self-install communications. Instead, please refer your users to the official Microsoft documentation for installing Office (<a href=\"https://support.microsoft.com/office/download-install-or-reinstall-microsoft-365-or-office-2024-on-a-pc-or-mac-4414eaaf-0478-48be-9c42-23adc4716658\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Download, install or reinstall Microsoft 365 or Office 2024 on PC or Mac</a>).  This article will be updated to describe the new self-installs experience when it is released.</li></ul><p><i>If you do not allow users to install apps:</i></p><ul><li>You can continue to use the <a href=\"https://learn.microsoft.com/microsoft-365-apps/deploy/manage-software-download-settings-office-365\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Microsoft 365 admin center installation options</a> setting or the <a href=\"https://learn.microsoft.com/graph/api/m365appsinstallationoptions-update?view=graph-rest-1.0&amp;tabs=http\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">m365AppsInstallationOptions API</a> to block self-installs. If you already configured these settings, users will still be blocked from installing apps in the new experience.</li></ul><p>Blocking Microsoft Admin Portals using Conditional Access Policies will no longer block self-installs. If you have used this setting to block self-installations, you will need to use one of the settings listed above instead.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The rollout of the new modal dialog for installing Microsoft 365 apps from the Microsoft 365 Copilot app has been delayed. Users will continue using the My account portal for installations until November. Organizations should update their self-install communications and use admin center settings or APIs to manage app installations."
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1062453",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-24T15:27:09.58Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-25T22:57:17Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Changes to how users install Microsoft 365 apps from the Microsoft 365 Copilot app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
