{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 11, 2025: Removing this post as it is a duplicate of MC1047912. We will continue rolling out.</p><p>Microsoft Purview Data Security Investigations (DSI) is a new AI-powered solution that enables data security teams to identify incident-related data, conduct deep content analysis, and mitigate risk within one unified solution.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will communicate via Message center when we are ready to proceed.</p><p>General Availability (Worldwide): We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b>\n</p><p>DSI enables data security admins to efficiently identify incident-relevant content by searching their Microsoft 365 data estate to locate emails, Microsoft Teams messages, Microsoft Copilot prompts and responses, and documents. \n</p><p>After an admin scopes an investigation, DSI’s generative AI capabilities allow admins to gain deeper insights into the impacted data, revealing critical security risks and sensitive information. Investigative capabilities include the ability to categorize evidence, perform vector searches, and examine impacted data for security and sensitive data risks. \n</p><p>DSI visualizes correlations between investigation data, users, and their activities. To mitigate identified risks, DSI facilitates secure collaboration between partner teams. Post-investigation learnings can be used to refine existing policies to strengthen your organization's security practices.\n</p><p>Get started with DSI on the overview page with information on enrollment and enabling RBAC (role-based access control):\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/82df60fe-2cdb-4797-b6dd-932f68723273\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Categorize your data to identify highest risk items and plan mitigation actions accordingly:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ca4ca459-4bba-4a62-bb85-22c5d16680a4\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Understand investigation progress and insights with the Investigation summary view:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/57756948-9ca3-4d98-89b7-6c6d770b092e\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/accelerate-data-security-investigations-with-ai-powered-deep-content-analysis/4396099\" target=\"_blank\">Accelerate data security investigations with AI-powered deep content analysis | Microsoft Community Hub</a></p><p>When the Public Preview begins, we will update this post with new documentation.\n</p><p>Get started on the Purview DSI overview page (coming soon) to complete setup and get oriented in a few simple steps:\n</p><ol><li>Enable access in Microsoft Purview &gt; <i>Permission </i>for DSI admins, DSI investigators and DSI reviewers in your organization.\n</li><li>Complete the DSI first-run experience including:\n<ol><li>Enrolling your Purview subscription for non-AI storage and processing meter\n</li><li>Enrolling for AI consumption using security compute units \n</li></ol></li><li>Get started with your first investigation.</li></ol><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485707"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1040540",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-11T15:28:03.6Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-24T22:24:19Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: New Purview Data Security Investigations (DSI) solution",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
