{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Defender for Cloud Apps: Improvements to threat protection capabilities. We will <b>implement a new dynamic model for threat protection detections and alerts</b>. This change aims to improve and maintain a high signal-to-noise Ratio (SNR) for detections.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out the first batch of policies early June 2025 and expect to complete by early July 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Our new dynamic model allows our security researchers an ability to<b> </b><i>respond faster to new threats</i>, to update detection logic based on the evolving threat landscape. This means that detections can be added, removed, or modified dynamically to <i>ensure optimal protection against emerging threats.</i> Note: These are research-driven detections, so Customers will enjoy the protection without the need to actively configure them.\n</p><p>This rollout will be seamless, and you will continue to receive the same standard of protection without disruption to the provided security coverage. After rollout begins, we will include the migrated policies in <a href=\"https://learn.microsoft.com/defender-cloud-apps/anomaly-detection-policy\" target=\"_blank\" style=\"\">Create anomaly detection policies - Microsoft Defender for Cloud Apps | Microsoft Learn</a> (to be updated).</p><p>The first batch of policies will be:</p><ol><li>Suspicious inbox manipulation rule</li><li>Suspicious email deletion activity</li><li>Suspicious email forwarding rule</li><li>Activity from an anonymous proxy</li><li>Activity from a botnet-associated IP address</li></ol><p>Note: In addition to the policies in the first batch mentioned above, all other OOTB policies will eventually be migrated to the new dynamic model.</p><p>After this rollout:\n</p><ul><li>By applying the new dynamic model, we aim to provide more accurate and timely threat detections, enhancing your overall organization security.</li><li>In some cases, policies may be split into several different detections and alerts in order to provide an additional degree of protection and better understanding for the SOC teams on the threat etymology.</li><li>For several months during the gradual migration of OOTB policies, the policies will be disabled but still temporarily visible in Defender for Cloud Apps. <i>After the migration has completed, we will remove the policies from the legacy policies page, </i>and we will send a separate MC post about this removal.</li></ul><p>This migration will be seamless and available by default. However, please note that we will disable legacy policies and their configured governance actions. If you wish to retain governance actions, please re-enable the policies from the legacy policies page at Defender portal &gt; Cloud apps &gt; Policy management page.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a8459765-2e00-472d-a761-412a9bad31a2\" style=\"width: 400px;\" alt=\"admin settings:>\n</p><p><b>What you need to do to prepare:</b></p><p>This <span style=\" background-color:=\"\" rgb(255,=\"\" 255,=\"\" 0);\"=\"\"></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Cloud Apps will enhance threat protection with a new dynamic model for detections and alerts, rolling out from June to July 2025. This model allows faster response to threats and will be implemented seamlessly. Legacy policies will be disabled but visible temporarily. No admin action is required."
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061724",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-24T23:16:50.203Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T23:16:19Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Cloud Apps: Improvements to threat protection capabilities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
