{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 5, 2025: We have updated the timeline. Thank you for your patience.</p><p>Coming soon: A new integration between Insider Risk Management (IRM) and Data Security Investigation (DSI) in Microsoft Purview. This enhancement allows data security admins to launch a pre-scoped DSI directly from an IRM case, enabling deeper investigation into risky user behavior and better post-incident impact assessment.</p><p>DSI is a new AI-powered solution that enables data security teams to identify incident-related data, conduct deep content analysis, and mitigate risk within one unified solution. DSI enables data security admins to efficiently identify incident-relevant content by searching their Microsoft 365 data estate to locate emails, Teams messages, Copilot prompts and responses, and documents. Once the investigation is scoped, DSI’s generative AI capabilities allow admins to gain deeper insights into the impacted data, revealing critical security risks and sensitive information. Investigative capabilities include the ability to categorize evidence, perform vector searches, and examine impacted data for security and sensitive data risks. To mitigate identified risks, DSI facilitates secure collaboration between partner teams. Post-investigation learnings can be used to refine existing policies to strengthen an organization's security practices.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486827\" target=\"_blank\">486827</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-July 2025 and expect to complete by late July 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late November 2025 (previously late August) and expect to complete by late December 2025 (previously late September).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout:</p><ul><li>Members of the Insider Risk Management Investigators role group can initiate a DSI directly from an IRM case.\n</li><li>However, they must also be assigned the Data Security Investigation Investigator role to view the investigation results.\n</li><li>This streamlines the investigation process by allowing admins to:<ul><li>Go to Purview compliance portal &gt; IRM</li><li>Go to <i>Cases</i>, and open any case listed</li><li>Select <i>Case actions</i>\n</li><li>Choose <i>Investigate data security with AI </i>from the dropdown menu\n</li><li>Name the investigation and select relevant content\n</li><li>Launch the investigation with a single click</li></ul></li></ul><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. DSI will need to be set up for successful investigation in DSI once an investigation is created from an IRM case. Prerequisite steps to configure DSI: <a href=\"https://learn.microsoft.com/purview/data-security-investigations-get-started\" target=\"_blank\">Get started with Data Security Investigations (preview) | Microsoft Learn</a>. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com\" target=\"_blank\">Microsoft Purview compliance portal</a>.</p><p>Learn more</p><ul><li><a href=\"https://learn.microsoft.com/purview/data-security-investigations\" target=\"_blank\">Learn about Data Security Investigations (preview) | Microsoft Learn</a> </li><li><a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/accelerate-data-security-investigations-with-ai-powered-deep-content-analysis/4396099\" target=\"_blank\">Accelerate data security investigations with AI-powered deep content analysis | Microsoft Community Hub</a></li><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-cases\" target=\"_blank\">Take action on insider risk management cases | Microsoft Learn</a> (will be updated before rollout)</li><li><a href=\"https://learn.microsoft.com/purview/data-security-investigations-investigation\" target=\"_blank\">Create an investigation in Data Security Investigations (preview) | Microsoft Learn</a> (will be updated before rollout)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486827"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview will integrate Insider Risk Management (IRM) with Data Security Investigation (DSI) in preview by mid-July 2025, enabling admins to launch AI-powered, in-depth data investigations directly from IRM cases. General availability is expected by late November 2025, streamlining risk assessment and response."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-02-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1091445",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-05T16:37:06.833Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-10T23:16:09Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Update: Microsoft Purview compliance portal | Insider Risk Management: Data Security Investigation integration (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
