{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Fabric will implement workspace access limits from August 1 to August 31, 2025, as part of ongoing efforts to improve service quality and reliability. Once this limit is rolled out, each Fabric workspace will be limited to a maximum of 1,000 users or groups in workspace roles (Admin, Member, Contributor, Viewer). This change does not affect the number of users within a group itself. For example, a workspace with one group, that group is permitted to have over 1,000 users.</p><p><b>When this will happen:</b></p><p>This change will roll out between August 1, 2025, and August 31, 2025.</p><p><b>How this affects your organization:</b></p><p>Once this feature is rolled out: \n</p><ul><li>A maximum of 1,000 users or groups can have workspace roles for a Power BI or Fabric workspace.</li><li>Workspaces that are already over the limit will remain overlimit, but no additional users or groups can be added to workspace roles until the workspace is under the limit.</li><li>For overlimit workspaces, workspace admins will need to consolidate user/group access to stay under the limit.</li><li>Workspace admins or members attempting to add users or groups after this limit is reached, will get an error in the workspace access flow.</li></ul><p><b>What you can do to prepare:</b></p><p>Admins can take the following steps:</p><ol><li>Retrieve all workspaces in your org by using this API: <a href=\"https://learn.microsoft.com/en-us/rest/api/fabric/admin/workspaces/list-workspaces?tabs=HTTP\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif;\">Admin - List all workspaces</a></li><li>Retrieve access details for each workspace using this API: <a href=\"https://learn.microsoft.com/en-us/rest/api/fabric/admin/workspaces/list-workspace-access-details?tabs=HTTP\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif;\">Admin - List workspace access details.</a></li><li>Identify workspaces that are near, at, or over the limit based on access details count in step #2</li><li>Identify workspace admins for workspaces that are near, at, or over the limit from step #3 and step #2</li><li>Work with workspace admins to consolidate access by (a) Grouping users by role (Admin, Member, Contributor, Viewer) (b) Assigning access via groups instead of individual users</li></ol>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Fabric will limit workspace roles to 1,000 users or groups from August 1 to August 31, 2025. Overlimit workspaces can’t add more users/groups until under the limit. Admins should consolidate access and use provided APIs to manage workspaces."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098946",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-19T23:25:25.457Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-19T23:25:03Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Limit on number of users or groups that can be added to workspace roles in Fabric and Power BI",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
