{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In MC797119<i> (Updated) SharePoint Online: A new Start experience</i> (published May 2024, updated June 2024), we announced the new Microsoft SharePoint s<i>tart</i> (Preview) experience, featuring a user-friendly approach that reduces the effort required for creating sites and pages. We have received feedback regarding concerns about the content policy, specifically in relation to personal pages. Starting mid-March 2025 and ending early April 2025, we will retire the ability for SharePoint users to create personal pages from SharePoint s<i>tart </i>(Preview).\n</p><p>The other features in SharePoint <i>start </i>(Preview) will continue to work after we retire the ability to create personal pages from SharePoint <i>start </i>(Preview).\n</p><p>As an alternative, we recommend that SharePoint users create pages that are connected to sites from SharePoint <i>start (Preview).</i>\n</p><p><b>How this will affect your organization:</b>\n</p><p>When the retirement has been implemented for your tenant, this notification will display at the top of the SharePoint user page: <i>Publish your pages to sites. Creating new personal pages that aren’t connected to sites is no longer supported.</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4749cc5d-48ae-48b3-8550-f80e49ed3af8\" style=\"width: 400px;\" alt=\"user message\">\n</p><p><i>To create a new page from a page template in SharePoint </i>start<i> (Preview) that is connected to a SharePoint site</i>\n</p><p>1. In SharePoint <i>start</i> (Preview), go to <i>Create a page</i> and select a page template:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ce4dca91-3b5a-4995-9346-6eddde288f74\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>2. On the right panel, choose a SharePoint site or enter the name of a SharePoint site to begin creating a new page on that site.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/98a6c4ce-f28b-4535-ad3a-50a8a85aa6e1\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>FAQs</i>\n</p><p><i>Can users still access personal pages they have created before the retirement?\n</i></p><ul><li>Users can continue their work on these pages. They can be found under <i>My pages</i> or <i>My pages on this site </i>in SharePoint <i>start </i>(Preview).\n</li></ul><p><i>Can users move these personal pages to another location?</i>\n</p><ul><li>No, but SharePoint admins can move existing personal pages to other destinations using this PowerShell cmdlet: <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/copy-spopersonalsitepage?view=sharepoint-ps\" target=\"_blank\">Copy-SPOPersonalSitePage (Microsoft.Online.SharePoint.PowerShell)</a>\n</li></ul><p><i>Can users convert a personal page to a page connected to a SharePoint site?</i>\n</p><ul><li>No, there is currently no option for users to convert personal pages to pages connected to SharePoint sites through the user interface. SharePoint admins can move personal pages to SharePoint sites using the <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/copy-spopersonalsitepage?view=sharepoint-ps\" target=\"_blank\">PowerShell cmdlet</a>.\n</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will retire the ability to create personal pages from SharePoint start (Preview) between mid-March 2025 and early April 2025. Users should create pages connected to SharePoint sites instead. Existing personal pages remain accessible but cannot be moved or converted by users, only by admins using PowerShell."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1018344",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-27T00:41:49.75Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-27T00:41:42Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft SharePoint: We will retire creating personal pages from SharePoint \"start\" (Preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
