{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 27, 2025: We have updated the content. Thank you for your patience.</p><p>Coming soon: A new license request feature and self-service purchase for Microsoft 365 Copilot will be widely available for all tenants. End user license request and self-service purchase will now be available for users with Microsoft 365 E1, Microsoft 365 E3, Microsoft 365 E5, Microsoft Office 365 Plan E1, Microsoft Office 365 Plan E3, Enterprise Mobility + Security E3, Enterprise Mobility + Security E5, Microsoft 365 Apps for Business and standalone products.  Both License request and self-service purchase will be shown within Microsoft 365 apps such as Copilot Chat, the unpaid version of work chat included in your Microsoft 365 subscription.  \n</p><p>\n</p><p>License Request allows users to request a Microsoft 365 Copilot license directly from their admin. This helps you efficiently assign unused licenses or purchase additional ones and assign based on user request. Global admins, license admins, and user admins will be able to manage these requests seamlessly in the Microsoft 365 admin center and can choose between standard or custom messaging, including directing to a third-party URL.</p><p>Self-Service Purchase allows users to purchase Microsoft 365 Copilot licenses directly with their own credit card and use within their tenant with their Microsoft admin’s visibility and control. <b>Note: </b>If your organization has previously disabled self-service purchase for Microsoft 365 Copilot, your existing settings will be honored.</p><p>This message is related to MC853238 (Updated) Microsoft 365 admin center: New self-service purchase and trial settings (published August 2024, updated September 2024). This message is also related to MC886385 Copilot for Microsoft 365 available for self-service purchase (November 2024) and MC899941 Microsoft 365 Copilot: Self-service purchase settings in Microsoft 365 admin center (E3, E5) (September 2024).</p><p> \n</p><p><b>When this will happen:</b> \n</p><p>General availability (Worldwide): We will begin rolling out late March 2025 and expect to complete by late May 2025.  \n</p><p><b>How this will affect your organization:</b> \n</p><p><i><u>License Request:  \n</u></i></p><p>After this rollout, global admins, license admins and user admins will be able to manage license requests in the Microsoft 365 admin center, where you can approve or deny the request.  \n</p><p>Notifications in the Microsoft 365 admin center of pending license requests from users:&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/52468d5d-c55b-463d-acce-66e7e2897d27\" width=\"400\" height=\"\"></p><p>Admins can manage user requests in the Microsoft 365 admin center on the Licenses page:</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/bb3b31a0-eac5-49c0-af95-f2c4b49a4b7c\" width=\"400\" height=\"\"></p><p>This change will be available by default to users. Admins can choose to set up their own custom license request process outside of Microsoft Admin Center (Use your own request process).</p><p><i><u>Self Service Purchase: \n</u></i></p><p>As an admin, you ultimately still maintain control over licenses in your tenant. You can view licenses purchased by users in the Microsoft 365 admin center, by going to Billing &gt; Your Products page. You can also view by going to the Licensing page and viewing or filtering to Self-Service licenses. On the Products tab, select the Self-service filter. As with any new product, you will be able to view product usage in your tenant in the Usage page in MAC.\n</p><p>You are able to take over control of licenses purchased by the user at any time and manage them as you would any other license within your tenant. Please note the cancellation policy for Copilot for Microsoft 365 – the user has a seven-day window to receive a full refund. Action notifications will surface in the Microsoft 365 admin center, when a self-service purchase happens, allowing you to see the new license on the licensing page. \n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/5d445dc9-9078-4667-97af-ed0551999065\" width=\"400\" height=\"\"></p><ul><li>License Request Help and support: <a href=\"https://learn.microsoft.com/microsoft-365/commerce/licenses/manage-license-requests?view=o365-worldwide\" target=\"_blank\">Manage self-service license requests in the Microsoft 365 admin center | Microsoft Learn</a>\n</li><li>Self Service Purchase Help and support: <a href=\"https://learn.microsoft.com/microsoft-365/commerce/subscriptions/manage-self-service-purchases-admins?view=o365-worldwide#enable-or-disable-self-service-purchases-and-trials\" target=\"_blank\">Manage self-service purchases and trials (for admins) | Microsoft Learn</a>\n</li><li><a href=\"https://aka.ms/Copilot/MSWorksCouncilsArticle\" target=\"_blank\">Deploying Microsoft 365 Copilot and AI at Microsoft with our works councils - Inside Track Blog</a>\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins and users about this change and update any relevant documentation.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will soon offer a new license request feature and self-service purchase option for various Microsoft 365 plans. Admins can manage license requests and self-service purchases in the admin center. The rollout begins in late March 2025 and completes by late May 2025. Existing self-service purchase settings will be honored."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1017114",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-27T19:24:35.273Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-26T00:27:17Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: End User License Requests",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
