{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 29, 2025: We have updated the title, timeline, and content. Thank you for your patience.</p><p>Available now: The new <code>SpeakerAttributionBYOD</code> setting is now available in <code>csTeamsAIPolicy</code> for Microsoft Teams Premium users. This gives IT admins more control over speaker attribution when users join meetings from personal (BYOD) devices. Admins can now configure this setting using PowerShell. If no action is taken, it will be enabled by default starting in early June 2025.</p><p><i style=\"\">NOTE: If you are a Microsoft Teams customer (not a Microsoft Teams Premium customer), we are sending this message to you because this new setting will take effect automatically for any user assigned a Microsoft Teams Premium or Microsoft 365 Copilot license—even if your organization previously didn’t have these licenses. Therefore, we recommend all organizations review this message, regardless of your organization’s current license status.</i></p><p>This setting allows organizations to manage how speaker attribution is used in meetings where users join via personal devices, helping enhance the in-meeting and post-meeting experience with features like speaker labels (Speaker 1, Speaker 2, etc.) and Microsoft 365 Copilot in shared spaces. To access Copilot features, a Microsoft 365 Copilot license is required.\n</p><p>This message applies to Teams for Windows desktop and Teams for Mac desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=488301\" target=\"_blank\">488301</a>.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out early June 2025 and expect to complete by late June 2025 (previously mid-June).\n</p><p><b>How this will affect your organization:</b></p><p>Previously, speaker attribution was managed using the <code>RoomAttributeUserOverride</code>parameter in <code>CsTeamsMeetingPolicy</code>. Going forward, <code>SpeakerAttributionBYOD</code> in <code>csTeamsAIPolicy</code> will determine whether attribution is used when users join from BYOD scenarios.</p><p><b>What you need to do to prepare:</b></p><p>The new setting is available now, and admins can begin configuring it using PowerShell based on their organization's preferences.\n</p><p>If no action is taken, the setting will be enabled by default during the rollout in June 2025.\n</p><p>If you prefer to modify the setting before the rollout begins, you can do so at any time starting now.</p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/powershell/module/teams/set-csteamsaipolicy?view=teams-ps\" target=\"_blank\">Set-CsTeamsAIPolicy (MicrosoftTeamsPowerShell) | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/powershell/module/teams/get-csteamsaipolicy?view=teams-ps\" target=\"_blank\">Get-CsTeamsAIPolicy (MicrosoftTeamsPowerShell) | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/rooms/voice-and-face-recognition\" target=\"_blank\">Overview of voice and face enrollment - Microsoft Teams | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New policy setting for Speaker Attribution in BYOD scenarios is now available in Microsoft Teams Premium, enabled by default starting June 2025. IT admins can configure this setting using PowerShell. This affects both Microsoft Teams Premium and Microsoft 365 Copilot license users."
    }
  ],
  "EndDateTime": "2025-10-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052162",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-29T22:00:14.143Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T01:44:41Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Now available - new policy setting for Speaker Attribution in BYOD scenarios - Enabled ON by default",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
