{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 10, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>We're introducing a new capability in the Teams Admin Center that allows Teams administrators to remotely collect diagnostic logs from users' Teams clients on Windows and Mac devices. This feature helps streamline troubleshooting by enabling secure, admin-initiated log collection without requiring user action or causing disruption.</p><p> \n</p><p>This message is associated with Microsoft 365 Roadmap IDs <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=491439\" target=\"_blank\">491439</a></p><p><b>When will this happen:</b> \n</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 and expect to complete by late October 2025 (previously late July).</p><p><b>How this will affect your organization:</b></p><p>This update introduces a new tool in the Teams Admin Center for tenant administrators. Admins with the following roles will be able to remotely collect Teams client logs:\n</p><ul><li>Teams Administrator\n</li><li>Teams Communications Administrator\n</li><li>Teams Communications Support Engineer\n</li></ul><p>To collect logs, navigate to the <i>Manage users</i> page in the Teams Admin Center, select a user, and choose <i>Request client logs</i> from the <i>Client health</i> tab or the user’s profile card. Admins can then download, view, share, or delete the collected logs as needed.\n</p><p>This process is seamless and does not interrupt the end user’s experience.</p><p><b>What you need to do to prepare:</b> \n</p><ul><li>Review and update internal documentation and training materials for your support teams.\n</li><li>Ensure that only authorized admin roles have access to this capability.</li></ul><p><b>Compliance considerations:</b></p><ul><li>Does the change store new customer data? Yes (diagnostic logs may contain user-specific data).\n</li><li>Does the change alter how existing customer data is processed, stored, or accessed? Yes.</li><li>Does the change modify, interrupt, or disable any of the following capabilities (Purview)? Maybe (logs may contain data relevant to DLP or audit scenarios).</li><li>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights)? Maybe (logs may be subject to data subject rights requests).</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "491439"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will enable admins to remotely collect diagnostic logs from users' Windows and Mac clients via the Teams Admin Center starting mid-July 2025. This seamless process aids troubleshooting without user disruption. Admin roles must be authorized, and compliance with data handling and privacy considerations is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-12-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1087099",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-10T18:57:56.733Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-02T23:46:42Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Remote log collection in Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
