{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to the default configuration of Fabric and Power BI capacities.</p><p>Starting on June 9, 2025, all Power BI and Fabric capacity SKUs will support XMLA read/write operations by default.&nbsp;</p><p><b>When this will happen:</b></p><p>June 9, 2025</p><p><b>How this affects your organization:</b></p><p>You are receiving this message because your organization may be using Fabric or Power BI capacities.</p><p>The intended change aims to assist semantic model owners and co-authors with write permissions using XMLA-based tools to create, edit, and maintain semantic models, such as DAX Query View in the web, Live Editing in Power BI Desktop, SQL Server Management Studio (SSMS), Tabular Editor (TE), or the Semantic Link library in Fabric notebooks. This change also aims to streamline automated deployments and co-authoring scenarios. Prior to this change, these users needed their capacity administrators to change the XMLA Endpoint configuration on their capacities to enable read/write mode before they were able to use XMLA-based tools.</p><p><b>What you can do to prepare:</b></p><p>When this change takes effect, capacity admins who wish to maintain XMLA read-only access to their capacities can proactively switch their XMLA Endpoint to OFF and then back to read-only mode. By explicitly applying the XMLA Endpoint Read Only setting, the capacity is no longer using the default configuration.</p><p>To learn more, see the <a href=\"https://learn.microsoft.com/power-bi/enterprise/service-premium-connect-tools#enable-xmla-read-write\" target=\"_blank\">Semantic model connectivity with the XMLA endpoint article</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting June 9, 2025, Fabric and Power BI capacities will default to XMLA read/write operations. This change aids semantic model owners and co-authors with write permissions using XMLA-based tools. Capacity admins can switch XMLA Endpoint to read-only if needed."
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075915",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-16T22:25:52.707Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:25:45Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Default XMLA configuration for Fabric and Power BI capacities changes to Read/Write",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
