{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>New Outlook for Windows desktop and Outlook for the web will soon support a two-click view for encrypted emails, which requires user confirmation before allowing access to encrypted emails. As an admin, you can enable the two-click feature for your users.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483883\" target=\"_blank\">483883</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 and expect to complete by late April 2025.\n</p><p>General Availability (GCC): We will begin rolling out early May 2025 and expect to complete by late May 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With this two-click feature enabled, users will be required to select <i>View message</i> for every encrypted email, and then the email will render. This feature ensures that users deliberately access\nencrypted email content, reducing the risk of accidental exposure, especially in unsecured environments like public spaces or during screen sharing:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/33b73500-41af-497b-8c09-4ab896ae1ff5\" style=\"width: 400px;\" alt=\"user message\">\n</p><p><span>Admins can find the </span><code>TwoClickMailPreviewEnabled</code><span> setting in the Microsoft Azure directory. This setting is a Boolean type with default = 0, which means the experience is disabled by default. To enable the feature for all users in your tenant, set value = 1.\n</span></p><p>Alternatively, you can access and set the value for this setting using the Microsoft PowerShell cmdlet <code>-Set-OrganizationConfiguration</code><span> in the Microsoft Exchange Online PowerShell. Learn more: </span><a href=\"https://learn.microsoft.com/powershell/exchange/exchange-online-powershell?view=exchange-ps\" target=\"_blank\">Exchange Online PowerShell | Microsoft Learn</a>\n</p><p>By default, the two-click setting is off.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required from admins unless you want to enable this feature.\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation if you plan to enable this feature.\n</p><p></p>#newoutlookforwindows<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483883"
    },
    {
      "Name": "Summary",
      "Value": "New Outlook for Windows desktop and Outlook for the web will support a two-click view for encrypted emails starting April 2025. Admins can enable this feature, which requires user confirmation before accessing encrypted emails, to reduce accidental exposure. The setting is disabled by default."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041456",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-26T05:03:20.057Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T05:03:04Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook and Outlook for the web: New setting to enable two-click view for encrypted emails",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
