{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft&nbsp;Teams Events invite emails will be separated based on the role of the participant. Event organizers will get an email explaining the specific roles of participants in the event. Similarly, each presenter will get a separate calendar invite, allowing the organizers of town halls to maintain separate invites for attendees.&nbsp;</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=476488\" target=\"_blank\">476488</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early March 2025 and expect to complete by mid-March 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 and expect to complete by late March 2025.</p><p>General Availability (GCC, GCC High): We will begin rolling out early April 2025 and expect to complete by mid-April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>This feature update allows the organizers of town halls to maintain separate invites for attendees.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "476488"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will separate event invite emails based on participant roles (Attendee, Presenter, Co-organizer). This feature will roll out in March 2025, with no admin action required. Organizers can maintain separate invites for attendees. Notify users and update documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-05-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1009930",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-19T00:45:58.183Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-19T00:45:30Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Distinguish invites among Attendee, Presenter, and Co-organizer emails",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
