{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 15, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We will soon introduce a new limit on dynamic distribution groups (DDGs) in Microsoft Exchange Online. Each organization will be limited to a maximum of 3,000 DDGs. After this limit is reached, admins will need to remove existing DDGs before creating new ones. Learn more: <a href=\"https://learn.microsoft.com/office365/servicedescriptions/exchange-online-service-description/exchange-online-limits#dynamic-distribution-group-limits\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Exchange Online limits - Service Descriptions | Microsoft Learn</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin enforcing this limit in mid-April 2025 (previously early April).</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization has fewer than 3,000 DDGs, this change will not impact you. However, after your organization reaches this limit, you will not be able to create new DDGs until some existing DDGs are removed.\n</p><p>This change will be on by default and cannot be turned off by admins.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>The enforcement of the DDG limit will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>We recommend reviewing the usage of Dynamic Distribution Groups (DDGs) in your organization and removing any DDGs that are no longer needed. You can use the <i>Dynamic distribution groups</i> report in the Exchange admin center (EAC) to see the number of DDGs in your organization and insights into their usage. To access this report, go to the EAC &gt; <i>Reports &gt; Mail flow &gt; Dynamic distribution group</i> report. Learn more: <a href=\"https://learn.microsoft.com/exchange/monitoring/mail-flow-reports/mfr-dynamic-distribution-groups-report\" target=\"_blank\">Dynamic Distribution Groups report in the new EAC in Exchange Online | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange Online will introduce a new limit of 3,000 dynamic distribution groups (DDGs) per organization, starting mid-April 2025. Admins will need to remove existing DDGs before creating new ones if this limit is reached. This change is automatic and cannot be turned off."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024399",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-15T15:07:25.803Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:52:47Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online: New limit for dynamic distribution groups (DDGs)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
