{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>You can now use the Teams button across personal peripheral devices without having to manually select a specific device in the Teams devices settings. This provides a more seamless experience navigating across multiple certified for Microsoft Teams personal peripheral USB devices (with a wire or a dongle) connected to the same host device (such as your laptop). For example, you can use the Teams button on headset A to bring up the meeting pre-join screen, then use the Teams button on headset B to join the meeting, and then use the Teams button on your connected speakerphone to raise hand in the meeting, and so on.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485714\" target=\"_blank\">485714</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by late May 2025.</p><p>General Availability (GCC): We will begin rolling out late May 2025 and expect to complete by mid-June 2025. \n</p><p>General Availability (GCC High): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b> \n</p><p>The Teams button will work on all peripheral devices that are wired or with a dongle and connected to the same laptop without needing to manually switch between selected devices in the Teams devices settings.</p><p><b>What you need to do to prepare:</b>&nbsp;</p><p>This rollout will happen automatically with no admin action required. The Teams button will work on all peripheral devices that are wired or with a dongle and connected to the same laptop without needing to manually switch between selected devices in the Teams devices settings. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485714"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"485714\":[{\"RoadmapId\":485714,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-10T05:15:40.7318781Z\",\"LatestRing\":null},{\"RoadmapId\":485714,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-10T05:15:40.7318782Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052163",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-10T01:45:23.293Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T01:45:18Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Teams button support on multiple connected peripheral devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
