{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’ve heard feedback that our existing Microsoft Power BI tenant settings for the Microsoft Azure Maps Power BI visual aren’t clear enough and don’t give admins enough control over what is and isn’t available in the tenant. After this rollout, admins will have updated tenant settings for Azure Maps that are split into three controls:\n\n</p><table>\n<tbody>\n<tr>\n<th>Setting name</th>\n<th>Description</th>\n<th>Default state</th>\n</tr>\n<tr>\n<td>Users can use the Azure Maps visual.</td>\n<td>When this setting is on, users will be able to create and view the Azure Map visual.\n<b>Note: </b>This setting does not control whether data is able to leave your region/compliance boundary for mapping purposes.</td><td>On by default, except for existing tenants that have explicitly turned Azure Maps off.</td></tr><tr><td>Data sent to Azure Maps can be processed outside your tenant's geographic region, compliance boundary, or national cloud instance.</td>\n<td>Azure Maps services are currently not available in all regions and geographies. With this setting on, data sent to Azure Maps can be processed in a region where the service is available, which might be outside your tenant's geographic region, compliance boundary, or national cloud instance.</td><td>Off by default, except for existing tenants that have turned on Azure Maps.</td></tr><tr><td>Data sent to Azure Maps can be processed by Microsoft Online Services Subprocessors.</td>\n<td>Some Azure Maps visual services, including the selection tool, may require mapping capabilities provided in part by Microsoft Online Services subprocessors. This setting will control the availability of these features.</td><td>Off by default, except for existing tenants that have turned on Azure Maps.</td>\n</tr>\n</tbody>\n</table>\n\n<p></p><p>As part of this change, your organization will be required to update to the April 2025 version of Power BI Desktop or later. In older versions of Power BI Desktop, the visual will show an error message. The message will indicate the tenant setting needs enabling, but to fully resolve it, the user needs to update their version Power BI Desktop. You can use an endpoint management service such as Microsoft Intune to identify the versions your users are currently using.</p><p>This message applies to Power BI for Windows desktop and the Power BI service on the web.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b></p><p>With this update, you'll have more refined control over the Azure Map visual. The default availability of Azure Maps is changing as part of this update, so more users may have access to the visual by default in your tenant. If you are in a region where Azure Map services are not available and you weren't already using Azure Maps in your tenant, you will need to enable the tenant setting that allows processing data sent to Azure Maps outside your tenant's region for the map visual to work. \n</p><p>The tenant switch controlling the availability of the Azure Map visual will be on by default. The settings controlling if data sent to Azure Maps can be processed outside of your tenant's region and can be sent to subprocessors will both be on for tenants already using Azure Maps and will be off by default for everyone else. \n</p><p>To continue using the Azure Maps visual, you’ll need to be on at least the April 2025 version of Power BI Desktop for Windows.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins and users about this change and update any relevant documentation.\n</p><ul><li>Review your current configuration for Azure Maps in Power BI, use that as reference for understanding what the new defaults will be when these changes roll out, and plan for any necessary changes after the new settings roll out.</li><li>Use an endpoint management service such as Microsoft Intune to confirm what version of Power BI Desktop for Windows that your users have installed.\n</li><li>You will be able to access these new tenant settings alongside other Microsoft Fabric tenant settings: Sign into Microsoft Fabric and select Fabric settings (gear icon) &gt; <i>Admin portal &gt; Tenant settings.</i></li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/fabric/admin/service-admin-portal-integration#use-azure-maps-visual\" target=\"_blank\">Integration admin settings - Microsoft Fabric | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins will have updated tenant settings for Azure Maps in Power BI, split into three controls. The update requires Power BI Desktop April 2025 version or later. Rollout begins mid-June 2025. Notify admins and users, review configurations, and use endpoint management to check Power BI Desktop versions."
    }
  ],
  "EndDateTime": "2025-08-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1073069",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-13T22:55:44.68Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-13T22:55:36Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Power BI: Tenant setting changes for Microsoft Azure Maps in Power BI",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
