{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Users will have the capability to open their core applications, such as Chat, Teams, and other essential apps, in separate windows by selecting <i>Open in new window</i>&nbsp;from the app's context menu. This latest update facilitates enhanced productivity and provides greater customization of the user's workflow. This improvement enables users to manage their core collaboration applications more efficiently, ultimately leading to a more streamlined and effective work environment.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early July 2025 and expect to complete by mid-July 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 and expect to complete by early August 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Your organization will now be able to open their core collaboration apps in its own window.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8e49dcbe-7689-4ac0-90dd-2daeaad975ae\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will allow users to open core apps like Chat and Teams in separate windows starting July 2025. This update aims to enhance productivity and workflow customization. The rollout requires no admin action, but updating training and documentation is recommended."
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-27T23:16:39.31Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-27T23:16:28Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Pop out your core apps into a new window.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
