{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire the option to open a file in classic Microsoft Teams starting April 15, 2025, and ending April 30, 2025. Instead, we recommend opening the file in the appropriate app (Microsoft Word, Microsoft Excel, or Microsoft PowerPoint) in the desktop or web, where we will continue to invest our development resources. This retirement is to address certain security vulnerabilities that surfaced recently with classic Teams. <i>NOTE:</i> This retirement will not affect file open options for the new version of Microsoft Teams.</p><p>This message applies to classic Teams for Windows desktop, classic Teams for Mac desktop, and classic Teams for the web.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8c4d7722-2b54-4cfb-a038-0a602fc3ca66\" style=\"width: 400px;\" alt=\"user controls\"></p><p>This change will happen automatically by the specified date. No admin action is required. Consider notifying your users about this change and updating relevant internal documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The option to open files in classic Microsoft Teams will be retired between April 15, 2025, and April 30, 2025, due to security vulnerabilities. Users should open files in the appropriate desktop or web app instead. This change does not affect the new version of Microsoft Teams."
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1058266",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-19T00:03:00.49Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-19T00:02:22Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Classic Microsoft Teams: The option to open files in Teams will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
