{
  "ActionRequiredByDateTime": "2025-04-21T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Due to ongoing security hardening of Microsoft Purview services, the Microsoft Purview Audit Management Activity API will be hosted on a new set of IP addresses which will have a new service tag.</p><p><b>When this will happen:</b> \n</p><p>This change will be in effect on April 21, 2025. \n</p><p><b>How this will affect your organization:</b>  \n</p><p>If your organization followed official M365 endpoint guidance (<a href=\"https://aka.ms/m365endpoints\" target=\"_blank\">https://aka.ms/m365endpoints</a>), then no action is necessary, and no impact is expected.\n</p><p>If your organization’s network security policies only allow access to Service tag or allowlisting specific IPs, you will need to make changes to add the new Service tag for continued access. \n</p><p>This new service tag will be shared by multiple Microsoft Security Products to offer various capabilities.  The service tag <i>M365ManagementActivityApiWebhook</i> will be unaffected and should continue to be allow listed by your organization.\n</p><p><b>What you need to do to prepare:</b>  \n</p><p>If you currently allow outbound traffic based on Azure service tags, please add the new Azure service tag <i>AzureFrontDoor.MicrosoftSecurity</i> which will be applicable and available by April 21, 2025.\n</p><p>For updated service tag definition, please refer to <a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=56519\" target=\"_blank\">Download Azure IP Ranges and Service Tags – Public Cloud from Official Microsoft Download Center</a>\n</p><p>For more information about the Microsoft Purview Audit Management Activity API, please refer to <a href=\"https://learn.microsoft.com/en-us/office/office-365-management-api/office-365-management-activity-api-reference?toc=%2Fmicrosoft-365%2Fcompliance%2Ftoc.json&amp;bc=%2Fmicrosoft-365%2Fbreadcrumb%2Ftoc.json\" target=\"_blank\">Management Activity API reference | Microsoft Learn</a>.</p><p>\n</p><p><b>Note:</b>&nbsp;Refer to <a href=\"https://aka.ms/m365endpoints\" target=\"_blank\">Microsoft 365 URLs and IP address ranges</a>&nbsp;which outlines M365 network guidance on the supported way to manage domains for M365.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-05-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052910",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-10T23:33:07.39Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T23:32:58Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Action Required - Microsoft Purview Audit Management Activity API service tag changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
