{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Beginning mid-August 2025, the New Outlook for Mac will become the default experience for users in the Current Channel (version 16.100 and later). As part of this change, the admin preference key EnableNewOutlook—which previously allowed control over the default toggle state—will be retired. Users will no longer be able to switch back to Legacy Outlook starting with version 16.102 in mid-October 2025.</p><p>This update reflects our commitment to delivering a modern, performant, and reliable Outlook experience.\n</p><p><b>When this will happen:</b></p><ul><li>Legacy Outlook toggle admin perference i.e. EnableNewOutlook retired: Mid-August 2025 (version 16.100 and later)</li><li>Users can no longer switch to legacy Outlook: Mid-October (version 16.102 and later)</li></ul><p><b>How this affects your organization:</b></p><ul><li>The New Outlook for Mac will be the default experience for all users in the Current Channel.</li><li>The EnableNewOutlook admin configuration key will no longer be honored in configuration profiles.\n</li></ul><p>The New Outlook is built on Microsoft’s modern sync technology and offers:\n</p><ul><li>Improved performance and reliability\n</li><li>Enhanced support for modern collaboration features\n</li><li>A consistent cross-platform experience\n</li></ul><p>It also supports key enterprise capabilities including:\n</p><ul><li>On-premises support\n</li><li>Online Archive\n</li><li>Shared Mailboxes and Calendars\n</li><li>Delegation\n</li></ul><p>Some features not yet available in New Outlook include:\n</p><ul><li>AppleScript\n</li><li>Import/Export\n</li><li>Public Folders\n</li></ul><p>For the latest feature availability, please refer to the <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=Outlook%2CMac\" target=\"_blank\">Microsoft 365 Roadmap</a>.\n</p><p><b>What you can do to prepare:</b></p><ul><li>Notify users that New Outlook will become the default.</li><li>Update training materials and internal documentation to reflect the new experience.\n</li><li>For questions or support, users can go to Help &gt; Contact Support in Outlook for Mac.\n</li><li>For tenant-level questions or to tailor communications, please use your Message Center submission workflow or contact your Microsoft account team.\n</li></ul><p>More information: <a href=\"https://support.microsoft.com/en-us/office/end-of-support-for-legacy-outlook-for-mac-7b9cf644-7035-4345-a151-8c1c7a65ac25\" target=\"_blank\">End of support for legacy Outlook for Mac</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook for Mac will retire the admin preference to switch to legacy Outlook starting mid-August 2025. The New Outlook will become the default for users in the Current Channel, and switching back to Legacy Outlook will be disabled by mid-October 2025. Users should update training materials and notify users of the change."
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098932",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-19T22:59:18.88Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-19T22:59:04Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Outlook for Mac desktop: Retiring the admin preference to switch to legacy Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
