{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Introducing a new feature that will bring interactive agents into Microsoft Teams meetings and 1-on-1 calls. Users will be able to engage with agents as a group or privately, with zero-state prompts and history support for seamless interactions. Before this rollout, only agents built on Microsoft Copilot can support sessions, which means they can remember the context of previous interactions in the same session, for more relevant responses. Custom agents do not yet have session support. </p><p>After this rollout, all agents from Microsoft 365 Copilot Chat and Microsoft Copilot Studio will be available for users in their meetings and calls. This feature will allow developers to invite colleagues to give feedback and securely test agents, without affecting sensitive data or production channels.\n</p><p>A Microsoft 365 Copilot license or a Microsoft 365 license is required to use this feature. As part of the Microsoft 365 SKUs, if users have access to declarative agents in Microsoft Copilot Chat, agents are available in their meetings and calls. No license is required for custom engine agents.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490564\" target=\"_blank\">490564</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We began rolling out early June 2025 and expect to complete by mid-June 2025.\n</p><p>General Availability (Worldwide, GCCH): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users will be able to discover and acquire new agents (and view installed ones) from the existing apps pane in meetings by using @mentions or the + button in the compose box in chat.\n</p><p>Benefits:</p><ul><li>Easy access and interaction with agents during meetings and calls\n</li><li>Seamless interactions with zero-state prompts and history support\n</li><li>Private and group-scoped agents for personal assistance and for improved group collaboration</li></ul><p>This feature will be available by default. No action is required to enable this feature for meetings and 1-on-1 calls.\n</p><p>Users will be able to privately interact with an agent in their meetings and calls. In this screenshot, a user begins a private chat with the Contoso agent to ask questions related to the context of the meeting:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e6296ff6-01b1-4a13-90aa-78515bf166da\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Users can choose to escalate a private agent interaction to the group. In this screenshot, a user has added a private agent. The user can then share the agent to the group, adding it to the meeting chat for everyone to view and interact with the agent:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/70f9fa35-2b20-4337-ae0c-5fd894442535\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>To prepare for rollout, admins can pre-pin meeting agents for their tenants, enabling users to easily discover and use the most relevant agents for their work.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/agents-overview\" target=\"_blank\">Agents for Microsoft 365 Copilot | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490564"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"490564\":[{\"RoadmapId\":490564,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-06-05T17:12:02.1752307Z\",\"LatestRing\":null},{\"RoadmapId\":490564,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-06-05T17:12:02.1752309Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing interactive agents for meetings and 1-on-1 calls, allowing users to engage with agents privately or in groups with zero-state prompts and history support. This feature, requiring a Microsoft 365 Copilot license, will be available by default for Teams on Windows, Mac, and web. The rollout begins in June 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1087634",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-03T22:53:50.78Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-03T22:52:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Interactive agents for meetings and calls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
