{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva: Feature Access Management for Copilot features will support the AI administrator role. As communicated in MC985479 <i>Microsoft 365 admin center: AI administrator role authorization to manage Copilot settings</i> (published January 22, 2025), the AI administrator role is a newly introduced role for AI and Microsoft 365 Copilot administration that enables admins to manage Microsoft Copilot efficiently without requiring extensive Global admin permissions.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-February 2025 and expect to complete by late February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Feature Access Management allows authorized admins to create access policies, enabling them to tailor the deployment of certain Viva features based on local and regulatory requirements. After this rollout, Copilot features in Viva with existing Feature Access Management controls can also be managed by AI admins. Also, all future Copilot features will have AI admin access by default. Admins can manage Copilot feature controls through the Feature Access Management in the Viva admin center, the dedicated <i>Copilot settings</i> page in the Microsoft 365 admin center, or with Microsoft PowerShell.\n</p><p>Please see below for a complete list of Viva Copilot features that AI administrators can now manage through access policies:\n</p><ul><li>Copilot in Microsoft Viva Engage  \n</li><li>Copilot in Microsoft Viva Goals\n</li><li>Copilot Dashboard\n</li><li>Copilot Dashboard Auto Enablement\n</li><li>Copilot Dashboard Delegation\n</li><li>Copilot Assisted Value\n</li><li>Copilot in Microsoft Viva Insights\n</li></ul><p><b>Note: </b>Copilot in Microsoft Viva Glint is currently not managed by Feature Access Management and is in transition to be supported, as communicated in MC1004409&nbsp;<i>Microsoft Viva Glint: Use Feature Access Management in Viva for Microsoft 365 Copilot in Glint</i> (published February 12,&nbsp;2025). After this transition is complete, AI administrators will have access to manage this feature as well.\n</p><p>Admins with the AI administrator role will be able to manage access policies for all Copilot-related features in Viva. This includes both the current Copilot features (listed above) and any future Copilot features that become available in Feature Access Management in Viva.\n</p><p>Admins in other roles (such as Global admins) who already have management access to these feature controls will continue to retain their access.\n</p><p>This feature update will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Microsoft Viva - Feature access management | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva's Feature Access Management will support the AI admin role starting mid-February 2025. AI admins can manage Copilot features without extensive Global admin permissions. This includes current and future Copilot features in Viva. No admin action is required for the rollout. More details are available [here](https://learn.microsoft.com/viva/feature-access-management)."
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1005508",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-18T18:58:57.497Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-14T01:14:34Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Feature Access Management will support the AI admin role",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
