{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 27, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: New naming logic for Microsoft OneDrive folder shortcuts. We will add the site name or the user's OneDrive to all new folder shortcuts. Before this rollout, OneDrive shortcuts have the same name as the folder. After this rollout, the shortcut will also include the name of site where there the original folder exists. If a colleague shares a folder with user, and the users creates a shortcut for that folder, the shortcut will include the name of the person who owns the folder. This change will help you easily identify the source of the folder shortcut and differentiate it from other content in your OneDrive &gt; <i>My Files.\n</i></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late June 2025 (previously mid-March) and expect to complete by mid-July 2025 (previously mid-April).</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, any new folder shortcuts you add to your OneDrive &gt; <i>My Files</i> will follow the new naming convention. For example:\n</p><ul><li>If you go to a SharePoint site named <i>Marketing Team</i> and create a shortcut to a folder named <i>Project File</i>, the shortcut will appear as <i>Marketing Team – Project Files </i>in your OneDrive &gt; <i>My Files</i>.\n</li><li>If you add a shortcut to a folder named <i>Blog post</i> from Mona Kane’s OneDrive, the shortcut will appear as <i>Mona Kane’s files – Blog post </i>in your OneDrive &gt; <i>My Files.\n</i></li></ul><p><i>Key points</i>\n</p><ul><li>The new naming logic will apply only to new shortcuts added after this rollout.\n</li><li>Existing shortcuts will retain their current names.\n</li><li>This change will be reflected in OneDrive for the web, OneDrive for iOS/Android, Microsoft File Explorer, Mac Finder, and Microsoft Teams.\n</li><li>This change will be available by default.\n</li></ul><p>Examples of the new naming logic for folder shortcuts in OneDrive:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fd419419-487c-415f-9a17-31e8c555384a\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/add-shortcuts-to-shared-folders-in-onedrive-d66b1347-99b7-4470-9360-ffc048d35a33\" target=\"_blank\">Add shortcuts to shared folders in OneDrive for work or school - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft OneDrive will introduce a new naming convention for folder shortcuts starting late June 2025, completing by mid-July 2025. New shortcuts will include the site or owner's name for better identification. Existing shortcuts remain unchanged. This update applies across OneDrive web, mobile apps, File Explorer, Mac Finder, and Microsoft Teams. No admin action is required."
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1025216",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-28T15:37:03.363Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-07T01:17:35Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft OneDrive: New naming convention for folder shortcuts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
