{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Additional room and desk peripherals, including docking stations and webcams, are supported in BYOD spaces (including bookable desks), enabling users to seamlessly connect and utilize audio and video peripherals for a better experience. If the space is licensed, admins get an expanded view and insightful reports for peripherals associated with Bring Your Own Device (BYOD) spaces in the Pro Management portal.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486693\" target=\"_blank\">486693</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early May 2025 and expect to complete in mid-May 2025.</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p>Docking stations and webcams will now begin to appear in the Pro Management portal inventory device page, crowdsourced from the Teams desktop app. These peripherals can then be manually or automatically associated to BYOD rooms or bookable desks to automate and improve BYOD/Desk UX and provide admin insights into room UX quality.</p><p>BYOD auto association will begin to receive signals and auto-associate these new peripherals to BYOD rooms. This process automatically builds a full view of your inventory for you, including what peripherals are currently located in which BYOD rooms.</p><p>As a result, <a href=\"https://learn.microsoft.com/microsoftteams/rooms/bring-your-own-device\" target=\"_blank\">BYOD</a> and <a href=\"https://learn.microsoft.com/microsoftteams/rooms/bookable-desks\" target=\"_blank\">Bookable Desks</a> end user experiences will automatically activate for any user who plugs in a peripheral associated to a BYOD room or desk. These user experiences are designed to adapt the Teams desktop client to solve common user issues in rooms and desks, and includes but is not limited to the following features:</p><ul><li>(Rooms) Auto-select Room AV peripherals so that users don't accidentally use their laptop speaker and mic in a meeting room.</li><li>(Rooms) <a href=\"https://support.microsoft.com/office/use-shared-display-mode-in-meeting-rooms-a59c6886-9028-44da-a3cc-5563be40a214\" target=\"_blank\">Shared display mode</a> to protect confidential information and present clean output without meeting controls or presenter's notes to the room display.</li><li>(Rooms) Speaker Attribution so transcript (and Microsoft 365 Copilot) know who is speaking in your meeting.</li><li>(Rooms) Disable voice isolation so others in the room can be heard.</li><li>(Rooms) Room Node in participant roster.</li><li>(Desks) <a href=\"https://learn.microsoft.com/microsoftteams/rooms/bookable-desks\" target=\"_blank\">Auto-book</a> a desk upon peripheral plug in.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Inform your users about the experiences that will be automatically activated for them when they plug in to a peripheral that has been associated to a room or a desk. These changes are to make their meeting room and desk experiences better.</p><p>If you do not want end user experiences to automatically activate for a user, please refer to the admin documentation for <a href=\"https://learn.microsoft.com/microsoftteams/rooms/bring-your-own-device\" target=\"_blank\">BYOD rooms</a> or <a href=\"https://learn.microsoft.com/microsoftteams/rooms/bookable-desks\" target=\"_blank\">desks</a>. If you do not want peripherals to auto associate to rooms, automatically building your inventory for you, please disable this in settings for the Pro management portal.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486693"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"486693\":[{\"RoadmapId\":486693,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-23T15:17:21.0990849Z\",\"LatestRing\":null},{\"RoadmapId\":486693,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-23T15:17:21.099085Z\",\"LatestRing\":null},{\"RoadmapId\":486693,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-04-23T15:17:21.0990851Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will expand peripheral auto-association support for BYOD spaces, including docking stations and webcams, starting May 2025. This will enhance user experiences and provide admins with better insights. Users will benefit from features like auto-selecting room AV peripherals, shared display mode, and auto-booking desks."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1059673",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-21T23:42:55.483Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-21T23:42:50Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Expanded and enhanced peripheral auto-association support for Bring Your Own Device (BYOD) spaces",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
