{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 23, 2025: We have updated the content. Thank you for your patience.</p><p>Coming soon: IT administrators will be able to run silent, synthetic Microsoft Teams call simulations to specific subnets—enabling proactive network readiness checks and early detection of issues before they affect users. This will ensure high-quality, seamless communication experiences across the organization.</p><p>This feature requires a Teams Premium license on your user's devices.</p><p>This message applies to Teams for Windows desktop and Teams for Mac desktop.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490055\" target=\"_blank\">490055</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early August 2025 and expect to complete by mid-August 2025\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2025 and expect to complete by late August 2025.</p><p><b>How this will affect your organization:</b></p><p>Silent test calls offer proactive monitoring, allowing IT teams to detect and address network issues before they affect users. By integrating silent test calls into your operational routines, you can proactively detect and resolve potential issues.</p><ul><li>Tests run silently in the background on the Teams client at scheduled times.\n</li><li>A test runs for 60 seconds.\n</li><li>Tests are targeted at a specific subnet.\n</li><li>Test will run only on Desktop clients (Windows and Mac).</li><li>Tests only run if the device is idle (user is not in an active Teams call).\n</li><li>Users experience no disruption: no notifications, sounds, or visible changes.</li></ul><p>This feature will be available by default for admins to configure.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490055"
    },
    {
      "Name": "Summary",
      "Value": "IT administrators will soon be able to run silent Microsoft Teams call simulations for proactive network checks, requiring a Teams Premium license. This feature, available for Windows and Mac desktops, will roll out in August 2025. No user disruption occurs during tests. Admins should review configurations and notify users."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1089323",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-23T20:57:13.937Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-06T23:36:39Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Support for making a silent test call",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
