{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 12, 2025: We have updated the content. Thank you for your patience.</p><p>Coming soon: <code>ActorInfoString</code>, a new audit log field in Microsoft Exchange Online (EXO) designed to improve the accuracy, clarity, and depth of your audit logs. <code>ActorInfoString</code> records the true user agent responsible for each audited event, giving security and compliance teams increased visibility into actions performed in your Exchange Online environment. This update builds on the existing audit schema by capturing more granular information about clients, devices, and applications involved in audited operations.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p>Once enabled, <code>ActorInfoString</code> will appear as a new field in your Exchange Online audit logs, alongside existing fields such as <code>ClientInfoString</code>. This addition provides an unambiguous record of which client, device, or application performed a given operation, supporting better investigation of incidents, improved detection of suspicious activity, and strengthened compliance reporting. Existing audit schema fields, records, and integrations will remain unchanged, ensuring a seamless transition without service impact or data loss.</p><p>After this rollout, change administrators will see these key improvements:</p><p>\n</p><ul><li>Clarity: Easily reveal the true user agent behind every action in your logs.\n</li><li>Better security: Accelerate investigation and threat detection by tracing the actual source of actions.\n</li><li>Compliance: Enhance your audit trails to more effectively meet regulatory standards.\n</li><li>Future-readiness: Prepare your monitoring and log analysis for evolving audit needs.</li></ul><p>Use the following to find the new field:</p><p>1.\tAccess the Audit Logs:\n</p><ul><li>Go to the Microsoft Purview compliance portal: https://compliance.microsoft.com\n</li><li>Navigate to Audit &gt; Audit Search\n</li></ul><p>2.\tSearch for Exchange Online Activities:\n</p><ul><li>Use filters to narrow down to Exchange Online activities.\n</li><li>You can specify date ranges, users, or specific operations.</li></ul><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/0e085366-1f93-4148-90c1-cbefbdc1161f/126d1a97bf544f2c013e56443b04c487905f71db.png\" style=\"width: 700px;\"><br></p><p>Example of how <code>ActorInfoString</code> should appear for admins:</p><p><code>ee33-4930-9efd-2b7f2c8183b7\",\"RecordType\" : 50, “Resultstatus\" : \"Succeeded\",\"UserKey\":\"1c6b6 ActorInfoString\" : “Client-REST ;Client-RESTSystem;UserAgent-<b>NoUserAgent</b> <b>Appld-1c6b689d-1</b></code></p><p><b>What you need to do to prepare:</b></p><p>No action is required before rollout. However, we recommend reviewing your log collection and analysis tools to ensure they are ready to consume the new <code>ActorInfoString</code> field. This update is non-disruptive and will not alter your existing audit data or integrations. We will update this message with official documentation and release notes that will provide additional details and best practices for leveraging the new field.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange Online is introducing a new audit log field, ActorInfoString, to improve audit log accuracy and visibility. Rolling out in late May 2025, this field records the true user agent responsible for each event, aiding security and compliance. No action is required before rollout; existing data remains unchanged."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066337",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-16T17:13:04.67Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T22:29:42Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online: Introducing ActorInfoString in Exchange Online audit logs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
