{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 12, 2025: We have updated the timeline. Thank you for your patience.</p><p>Note: If your organization does not support Android, you can safely ignore this message.\n</p><p>Before this rollout, when viewing an email message, a user can access the available conversation actions in Microsoft Outlook for Android in the top right corner of the screen. After this rollout, these actions will be at the bottom of the screen. The user will be able to customize the order and placement of the actions to suit their needs.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early July 2025 and expect to complete by early September 2025 (previously early August).\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, actions formerly found in the top right of the reading pane (such as <i>Mark Unread, Pin, Delete, </i>and <i>Archive)</i> will move to a toolbar at the bottom of the reading pane:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/18028225-b5b2-4e1e-b9a0-1e96348935d4\" style=\"width: 250px;\" alt=\"user controls\">\n</p><p>Users can customize the order of these actions and choose which stay visible in the toolbar and which remain in the overflow menu, with the toolbar displaying as many as space allows.\n</p><p>Left: Reorder conversation actions in the Edit navigation pane, which users can access from the three-dot menu in the toolbar at the bottom of the reading pane. Right: Conversation actions in the three-dot menu:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e3871cd9-4db2-4c71-b58e-787832125750\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This consistent layout will help users build muscle memory, as actions will remain in the same positions across accounts and message views. To maintain  consistency across different accounts and views, inaccessible actions will be visibly disabled, lowering the chances of triggering unintentional actions.\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook for Android will move conversation actions from the top right to a customizable toolbar at the bottom of the reading pane, rolling out from July to early September 2025. This change improves consistency and requires no admin action, but user notification is recommended."
    }
  ],
  "EndDateTime": "2026-01-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1068902",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T14:15:05.1Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-06T22:38:59Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook for Android: Updated conversation actions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
