{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Porting wizard for Microsoft Teams Phone in the Microsoft Teams admin center simplifies the transfer of telephone numbers from external carriers (such as AT&amp;T) to Microsoft Teams Calling Plans. We’re excited to introduce an enhanced version of the wizard, launching first with customers in the United States and Canada. The current wizard will still be available.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 and expect to complete by early February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The updated wizard will offer a seamless and efficient port order management process, streamlining everything from order creation to submission. Key enhancements include:\n</p><ul><li>Simplified portability check: Effortlessly verify number eligibility.\n</li><li>Save draft orders: Start and finish orders on your schedule.\n</li><li>Edit validated orders: Easily make adjustments to validated orders.\n</li></ul><p>To access: Admins Teams admin center &gt; <i>Voice: Phone numbers</i> tab &gt; Select the <i>Port</i> link.\n</p><p>This updated wizard will be available by default.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/phone-number-calling-plans/transfer-phone-numbers-to-teams?tabs=new-porting-wizard\" target=\"_blank\">Transfer phone numbers to Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/phone-number-calling-plans/port-order-status\" target=\"_blank\">What's the status of your port orders? - Microsoft Teams | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Phone is launching an improved Calling Plan Porting wizard for the US and Canada in the Teams admin center by early February 2025. Enhancements include simplified portability checks, the ability to save draft orders, and edit validated orders. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1009935",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-19T00:48:11.66Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-19T00:47:17Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Phone: Improved Calling Plan Porting wizard will be GA for US and Canada in the Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
