{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the <a target=\"_blank\" href=\"https://aka.ms/9945_1 \">Configure feedback surveys using Copilot Studio</a> feature. With this feature you can create and manage surveys that go out to the customers after a call or conversation ends. This feature will be generally available for the <b>voice channel</b> on April 30, 2025. Please note, this feature will remain in public preview for all other channels.<br><br><b>How does this affect me?</b><br>Feedback surveys unify the process of configuring the surveys across channels while using the generative AI capabilities of Copilot Studio agents.<br><br>With this feature, you can:<ul><li>Use Copilot Studio agents to gather customer feedback and configure contextual actions, depending on the feedback.</li><li>Unify and centralize the process of configuring surveys across all channels—messaging, voice, and custom channels.</li><li>Use predefined templates to create surveys.</li><li>Allow supervisors to view and review feedback summarized into actionable insights.</li></ul><b>What do I need to do to prepare?</b><br>Please ensure that the following prerequisites are met prior to the release of this feature:<ul><li>Copilot Studio and the channels in Dynamics 365 Contact Center or Dynamics 365 Customer Service are available in the same environment.</li><li>Assign the Omnichannel Administrator role.</li></ul>This message is for awareness and no additional action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-15T20:40:02Z",
  "HasAttachments": false,
  "Id": "MC1056198",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-15T20:42:23.227Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-15T20:40:02Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center – Configure feedback surveys using Copilot Studio",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
