{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Microsoft Teams calendar combines rich productivity features and the latest innovations, like Microsoft Copilot and Microsoft Places, to help users collaborate seamlessly from anywhere. The new calendar is designed to be familiar and reliable, as it’s one unified calendar that works across new Outlook for Windows, Outlook on the web, Places, and Teams. With this update, users will see the \"New calendar\" toggle at the top right of the calendar app in Teams. New calendar is on by default, and users can toggle it off to return to the classic calendar.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early April 2025 and expect to complete by late April 2025.</p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>When a user visits the Calendar app in Teams, by default, New calendar will be shown. A toggle will still be available to switch back to the&nbsp;old calendar.&nbsp;</p><p>For more information, visit <a href=\"https://support.microsoft.com/office/get-started-with-the-new-calendar-in-microsoft-teams-98f3b637-5da2-43e2-91b3-f312ab3e4dc5\" target=\"_blank\">Get started with the new calendar in Microsoft Teams</a>.</p><p><b>What you need to do to prepare:</b>:&nbsp;</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new calendar feature that integrates with Outlook and Teams, including innovations like Microsoft Copilot and Microsoft Places. The rollout starts in April 2025 for Targeted Release and May 2025 for General Availability. Users can toggle between the new and classic calendars. No admin action is required."
    }
  ],
  "EndDateTime": "2025-07-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041464",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-26T05:09:36.863Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T05:09:14Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New calendar feature in opt-out experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
