{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 7, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Coming soon for Microsoft Teams: A new <i>Manage what attendees see</i> feature will help organizers and presenters deliver polished town hall events by simplifying the attendee view and keeping the focus on participants brought on screen. The new feature allows assigned organizers and presenters to preview changes before applying them all at once.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=487431\" target=\"_blank\">487431</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-July 2025 and expect to complete by late July 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late July 2025 and expect to complete by early August 2025.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, when an organizer or presenter brings a participant or shared content on or off screen, the change is immediately reflected in the attendees' view. </p><p>After this rollout, organizers and presenters will have the option to preview their changes before applying them. This allows for smoother, more polished transitions in the attendee's view, without showing every adjustment made by the organizer or presenter managing the screen. Organizers can go to the town hall <i>Meeting options</i> to locate the <i>Manage what attendees see</i> feature.\n</p><p>We will change the <i>Manage what attendees see</i> option from a toggle to radio buttons. <i>Manage what attendees see</i> will have three options:</p><ul><li><i>Off:</i> All participants will appear onscreen.\n</li><li><i>On: </i>Organizers and presenters can share content and bring attendees on screen to view the content.\n</li><li><i>On with preview:</i> Organizers and presenters can share content, preview the content, and then bring attendees on screen to view the content.\n</li></ul><p>To use the new <i>On with preview option</i>, the organizer must select it before the event begins. By default, <i>Manage what attendees see</i> is set to <i>Off </i>when scheduling a meeting or webinar, and <i>On </i>when scheduling a town hall. The <i>On with preview</i> option is only available for town halls and does not require a Teams Premium license.</p><p><i>Limitations</i></p><ul><li>The <i>On with preview </i>option is not available in meetings or webinars. For these events, the organizer will only have the option to select <i>Off </i>or <i>On </i>for <i>Manage what attendees see</i>.</li><li>Only assigned users joining through Teams for Windows desktop or Teams for the web will have the option to preview and apply changes. Any assigned users joining through mobile or Microsoft Teams Room will not have the ability to bring participants or shared content on or off screen.</li><li>Users joining through older Teams versions will continue to see the existing behavior, where users don't have the option to preview changes in <i>Manage what attendees see.\n</i></li></ul><p>Any new meetings or events created after mid-June 2025 will receive the new updates by default to the <i>Manage what attendees see</i> feature.</p><p>This feature will be available by default for meeting organizers to configure.</p><p>Select the presenter or content you’d like to preview before sending live to your event:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/bab4b649-e331-4a73-bb10-922d34f0ac7f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Select <i>Send live </i>to seamlessly send the content from the <i>Preview </i>window to the attendee view:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1e0fbfda-b5dd-451f-8321-7e6a49d2b206\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>We recommend you review <a href=\"https://support.microsoft.com/office/manage-what-attendees-see-in-microsoft-teams-19bfd690-8122-49f4-bc04-c2c5f69b4e16\" target=\"_blank\">Manage what attendees see in Teams meetings</a> (will be updated before rollout) for a comprehensive overview of the feature and conduct a test session with the feature turned on to get acquainted with the new controls.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "487431"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce \"Manage what attendees see\" with an \"On with preview\" option for town halls, allowing organizers to preview changes before attendees see them. Rolling out July–August 2025, it enhances polished event delivery, applies to desktop and web, and requires no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2026-09-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1058259",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-07T17:21:08.593Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-18T23:53:58Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Preview changes before making them visible to attendees with \"Manage what attendees see\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
