{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 13, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Major update: Microsoft Viva Pulse is rolling out a new delegation feature in July 2025 that enables users in your tenant to assign other users as delegates to take actions on their behalf. This feature is designed to support executive assistants, chiefs of staff, and other designated roles who act on behalf of organizational leaders in collecting and analyzing feedback. \n</p><p>\n</p><p>Delegation in Viva Pulse allows a user (the delegator) to authorize another user (the delegate) to manage the Pulse survey lifecycle on their behalf. Delegates can create, send, and manage Pulses, while the delegator retains ownership and visibility into all activity.&nbsp;</p><p>To use this feature, users must have a license for Viva Pulse via Microsoft Viva Suite, Microsoft Viva Workplace Analytics and Employee Feedback, or Microsoft 365 Copilot. This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479753\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">479753</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will roll out the delegation feature in mid-July 2025.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>Delegation is turned on by default in tenants. Admins can manage delegation at the tenant level, group level using Microsoft Entra ID groups or Microsoft 365 groups, or at the user level for maximum flexibility through centralized feature access management.&nbsp;&nbsp;</p><p>You can create and update policies in the<a href=\"https://learn.microsoft.com/Viva/control-access-admin-center\" target=\"_blank\"> Microsoft 365 admin center</a> or in PowerShell. Use the FeatureID value PulseDelegation to configure delegation in the tenant. See Control access to features in Viva to learn more.</p><p>Delegates will be able to: </p><ol><li>Create and send Pulses on behalf of the delegator. Survey recipients for Pulses sent by the delegate will see the email and Teams notifications indicate that the Pulse was sent on behalf of the delegator. </li><li>View all Pulses sent or drafted. </li><li>View all Pulse reports.&nbsp;</li></ol><p>Delegates cannot view or respond to confidential conversations and cannot share Pulse reports.</p><p> <b>What you need to do to prepare:</b></p><p>This rollout will happen automatically in mid-July 2025 with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.&nbsp;&nbsp;</p><p>Learn more</p><ul><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/tenant-admin-dashboard\" target=\"_blank\">View usage metrics with the tenant admin dashboard | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Microsoft Viva - Feature access management | Microsoft Learn</a></li></ul><p>Before we complete rolling out the delegation feature, we will update this post with new documentation that explains how to set up delegation in Viva Pulse.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479753"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse will introduce a new delegation feature in mid-July 2025, allowing users to assign delegates to manage Pulse surveys on their behalf. This feature supports roles like executive assistants and chiefs of staff. Delegation is enabled by default and can be managed at various levels. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1053652",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-13T21:09:59.343Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-11T21:42:37Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: New Delegation feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
