{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As we continue to enhance OneNote with a unified and modern experience, we want to remind you that OneNote for Windows 10 will reach end of support on October 14, 2025. To avoid disruptions, we strongly urge your organization to fully transition to OneNote on Windows (OneNote M365) and uninstall the legacy application as soon as possible. Migrating ensures continued access to the latest features, security updates, and a modernized experience.\n</p><p><b>When this will happen:</b></p><p>OneNote for Windows 10 will reach end of support on October 14, 2025.\n</p><p>How this affects your organization:]</p><ul><li>Enhanced Security &amp; Compliance: OneNote for Windows 10 does not support Microsoft Information Protection (MIP) sensitivity labeling, which is essential for securing sensitive data. Users relying on outdated versions will lose access to labeled content.\n</li><li>New Features &amp; AI-Powered Copilot: OneNote on Windows (OneNote M365) is the future of OneNote, with continuous investment in AI-powered features like Copilot to enhance productivity.\n</li><li>Improved Performance &amp; Support: The legacy version no longer receives updates or bug fixes, leading to potential performance issues and reduced functionality.\n</li><li>Faster Sync &amp; Collaboration: Starting June 2025, users of OneNote for Windows 10 will experience slower sync performance, impacting real-time collaboration and multi-device access.\n</li><li>Uninterrupted OneNote Experience: Beginning July 2025, users of OneNote for Windows 10 will see in-app banners prompting them to switch to OneNote (M365), which could impact their workflows.\n</li></ul><p><b>What you can do to prepare:</b></p><p> Don't wait until your users face disruptions—migrate them now using our migration guide and script for a seamless transition. An external link was removed to protect your privacy.\n</p><p>For assistance, contact:\n</p><ul><li>Microsoft Support\n</li><li>OneNote In-app Support via Help &gt; Support in OneNote on Windows (Win32).\n</li></ul><p>We appreciate your swift action in ensuring a smooth transition.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneNote for Windows 10 will reach end of support on October 14, 2025. Organizations should migrate to OneNote on Windows (OneNote M365) to benefit from enhanced security, new features, improved performance, and faster sync. Use the provided migration guide and contact Microsoft Support for assistance."
    }
  ],
  "EndDateTime": "2025-12-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1035701",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-19T00:13:15.12Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T00:12:34Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Immediate Action Required: 6 Months left, Migrate to OneNote on Windows Now!",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
