{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 7, 2025: We have updated the timeline below. Thank you for your patience.</p><p>In the Microsoft 365 admin center, we will soon introduce a new organizational setting called <i>App usage for custom apps</i> to allow enterprise app developers to view and use app analytics for company apps in the Developer Portal for Microsoft Teams. The Developer Portal is a tool for managing apps and agents built for Microsoft 365 Copilot and Microsoft 365 apps. By viewing custom app's usage, enterprise developers can see the number of active users and get other insights. Admins can allow the app usage for your custom apps to be shown in the Developer Portal.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out mid-April 2025 and expect to complete by mid-May 2025 (previously late April).\n</p><p><b>How this will affect your organization:</b>\n</p><p>By default, the <i>App usage for custom apps</i> setting will be disabled after it rolls out. If you enable this setting, enterprise developers will be provided with better insights into the performance and user engagement of custom apps, helping them make informed decisions about app improvements. If this setting is disabled, developers may be prevented from understanding app usage and other insights, causing disruptive change to their workflow.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>After the rollout, to enable enterprise developers to view app usage, please enable the <i>App usage for custom apps</i> setting in the Microsoft 365 admin center at <i>Settings &gt; Org settings &gt; Services &gt; Developer Portal for Teams.</i>\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/enable-dev-analytics?view=o365-worldwide\" target=\"_blank\">Enable developers to use app analytics in the Developer Portal for Teams - Microsoft 365 admin | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 admin center will introduce a new setting, \"App usage for custom apps,\" allowing enterprise developers to view app analytics in the Developer Portal for Microsoft Teams. This feature will be rolled out from mid-April to mid-May 2025. By default, the setting will be disabled and requires manual enabling."
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1058267",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-07T20:53:49.047Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-19T00:03:39Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Allow usage for custom apps to show in the Developer Portal for Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
