{
  "ActionRequiredByDateTime": "2025-06-01T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The modern Viva Engage user experience is coming to External Networks starting June 1, 2025, and you will soon be asked to initiate migration. In this communication, you will find high-level details about this change. Subsequent Message center posts will include additional details to plan your migration.&nbsp;</p><p>In addition to the user experience changes, we are building modern external networks on top of native Microsoft 365 services just like your Engage home network experience.<span style=\"background-color: rgb(255, 255, 0);\"> </span>This increases the level of compliance and enhances the admin experience by enabling Microsoft 365 admin features that are available on tenants.</p><p><span style=\"background-color: rgb(255, 255, 0);\">\n</span></p><p>IMPORTANT: When requested in future communications, admins must choose to migrate external networks to the modern platform. Failure to respond will result in the legacy external networks being deprecated and deleted.</p><p><b>When this will happen:</b> </p><p>This retirement will occur on June 1, 2025.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>The impact of this update depends on your usage of external networks. If you use external networks and fail to respond to our requests to migrate legacy external networks to the modern experience, then you will experience data loss. We recommend Engage admins review external network usage in their tenant.\n</p><p>When migrating, you will need to communicate with your users. Users may be from your tenant, other tenants, or be using personal guest accounts. Changes to sign-in may be most visible for users with personal guest accounts.\n</p><p>If you are considering future external network usage, you may want to wait to adopt the modern experience until after April 1st when we release External Networks v2.</p><p><b>What you need to do to prepare:</b></p><p>Actions you need to take if you want to migrate from the current implementation to the modern one:\n</p><ol><li>Identify all your external network usage. As an Engage administrator, you may not currently be an administrator of older external networks associated with your tenant.\n</li><li>Use the network data export to download a backup of each of your external networks.\n</li><li>Inform users who are using the External Networks that the experience will shift from the current to the new one once the migration is complete.\n</li><li>Check the Message center for further updates and links to documentation. We plan to release documentation for supporting the adoption of External Networks v2 before March 31st. We will also post a link to the documentation as an update to this post.</li></ol><p>IMPORTANT: If you do not take action by June 1st, we will delete the External Networks as retired.\n</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/engage/eac-as-manage-data\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Export and manage Viva Engage data</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will modernize External Networks starting June 1, 2025. Admins must migrate to the new platform or face deprecation and data loss. Key steps include identifying network usage, exporting data, informing users, and checking for updates. Documentation will be provided before March 31, 2025."
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1036575",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-08T19:33:12.917Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T23:06:59Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Viva Engage: External Networks are being modernized",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
