{
  "ActionRequiredByDateTime": "2025-06-01T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 9, 2025: We have updated the timeline below. Thank you for your patience.</p><p>The modern Viva Engage user experience is available now for External, and you are being asked to initiate migration. This message provides details on adopting the modern version of External Networks. \n</p><p>In addition to the user experience changes, we are building modern External Networks on top of native Microsoft 365 services just like your Engage home network experience. This increases the level of compliance and enhances the admin experience by enabling Microsoft 365 admin features that are available on tenants.\n</p><p>IMPORTANT: When requested in future communications, admins must choose to migrate External Networks to the modern platform. Failure to respond will result in the legacy External Networks being retired and deleted.</p><p><b>When this will happen:</b> </p><p>This retirement will occur on June 15, 2025 (previously June 1).&nbsp;</p><p>If you need additional time, we ask you to please contact your Microsoft Account representative and request them to submit a 60-day extension, which would then allow you to complete the move by August 15th 2025.\n</p><p>If you have already reached out to Microsoft and your exception has been approved, you do not need to submit or apply for the 60-day extension.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The impact of this update depends on your usage of External Networks. We recommend Engage admins review External Network usage in their tenant.\n</p><p>When migrating, you will need to communicate with your users. Users may be from your tenant or other tenants or they be using personal guest accounts. Changes to the sign-in experience may be most visible for users with personal guest accounts.\n</p><p>If you are considering future External Network usage, you may want to adopt the modern experience now. \n</p><p><b>What you need to do to prepare:</b>\n</p><p>Actions you need to take if you want to migrate from the current implementation to the modern one:\n</p><p>1.\tIdentify all your External Network usage. As an Engage administrator, you may not currently be the administrator for older External Networks associated with your tenant.\n</p><p>2.\tUse the network data export to download a backup of each of your External Networks.\n</p><p>3.\tInform users who are using the External Networks that the experience will shift from the current to the new one once the migration is complete.\n</p><p>4.\tCheck the Message center for further updates.\n</p><p>IMPORTANT: If you do not take action by June 15th or have not already requested an extension (and it has been granted), your External Network will be deleted.</p><p>Documentation to configure modern External Networks is now live at: <a href=\"https://learn.microsoft.com/viva/engage/configure-your-viva-engage-network/modern-external-networks\" target=\"_blank\">Set up modern external Viva Engage networks | Microsoft Learn</a>&nbsp;</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/engage/eac-as-manage-data\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Export and manage Viva Engage data</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is modernizing External Networks. Admins must migrate to the new platform by June 15, 2025, or request a 60-day extension. Failure to act will result in deletion. The new experience enhances compliance and admin features. Documentation and further updates are available."
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1036575",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-09T16:31:30.967Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T23:06:59Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Viva Engage: External Networks are being modernized",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
