{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 12, 2025: We have updated the timeline below. Thank you for your patience.</p><p>As part of our ongoing efforts to enhance the Microsoft Defender for Mobile security portal experience, we are updating the ‘Open Wi-Fi’ and ‘Cert Detection for Android’ features within the Network Protection suite. Effective May 19, 2025, when a user connects to an open Wi-Fi network on a mobile device, an alert will no longer be generated on the security portal. Instead, this activity will be recorded as an event and viewable under the device timeline. Similarly, detecting a suspicious certificate during download and installation will also be recorded as an event rather than generating an alert. This change ensures administrators still have visibility without generating alerts there by reducing fatigue. \n</p><p><b>When this will happen:</b></p><p>This change will take effect in a phased rollout starting late May 2025 (previously May 19).\n</p><p><b>How this affects your organization:</b></p><p>This update addresses customer feedback about alert fatigue, especially in environments with high mobile device usage. By logging events like open Wi-Fi connections and suspicious certificate detections in the device timeline rather than triggering alerts, we help reduce noise and streamline operations. This change benefits SOC analysts and administrators by preserving visibility into potential risky events while allowing them to focus on high-priority incidents, improving overall triage efficiency.\n</p><p><b>How the experience looks after the change:</b></p><p>Current security and privacy settings will remain unchanged. The current security settings will apply to the new behavior,<i> <b>so no action is required by the admin</b></i>.\n</p><p>By default, showing open Wi-Fi and suspicious cert detection information on the device timeline is enabled. Admins can disable it or set it to audit mode without any change in current behavior.\n</p><p>There will be no change in user experience; all current behaviors will stay the same with this change.\n</p><p><b>What you can do to prepare</b></p><p>No immediate action is required, but it is recommended that admins review their current Intune policies related to open Wi-Fi networks and cert detection to ensure both are enabled to see events on the device timeline.\n</p><p><br></p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Effective late May 2025, Microsoft Defender for Mobile will log open Wi-Fi connections and suspicious certificate detections as events rather than generating alerts. This change aims to reduce alert fatigue and improve triage efficiency. No action is required from admins, but reviewing Intune policies is recommended."
    }
  ],
  "EndDateTime": "2025-06-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1057719",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-12T20:23:24.713Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-18T03:32:21Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "MDE Mobile: Open Wi-Fi and Certificate Detections will be logged as Events",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
