{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Following several previous notifications in 2024, Microsoft Entra ID Protection alerts will no longer be available in Microsoft Defender for Cloud Apps experiences starting March 5, 2025.\n</p><p>As part of Microsoft Defender for Cloud Apps integration into Microsoft Defender XDR, Microsoft Entra ID Protection alerts will no longer be available in Microsoft Defender for Cloud Apps experiences, but they continue to be fully integrated into Microsoft Defender XDR experiences. These alerts can be found in the Microsoft Defender portal's <i>Incidents &amp; alerts</i> section, aggregated with other alerts from different Microsoft security solutions like Microsoft Defender for Endpoint, Microsoft Defender for Office 365, Microsoft Defender for Identity, Microsoft Defender for Cloud Apps, and more. Learn more about how to configure the Entra IP alert service in the Microsoft Defender portal: <a href=\"https://learn.microsoft.com/defender-xdr/investigate-alerts?tabs=settings\" target=\"_blank\">Investigate alerts in Microsoft Defender XDR - Microsoft Defender XDR | Microsoft Learn</a>\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates your organization may be using or have previously used Entra ID Protection alerts in Defender for Cloud Apps.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically starting from the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/defender-xdr/investigate-alerts?tabs=settings\" target=\"_blank\">Investigate alerts in Microsoft Defender XDR - Microsoft Defender XDR | Microsoft Learn</a>\n</li><li>MC940078 <i>(Updated) Upcoming changes to Defender for Identity activities and alerts in Defender for Cloud Apps experiences</i> (published November 2024, updated February 10, 2025)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra ID Protection alerts will no longer be available in Microsoft Defender for Cloud Apps starting March 5, 2025, but will be integrated into Microsoft Defender XDR. No admin action is required, but review your configuration and notify users. More details are available in the Microsoft Defender portal."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024406",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-05T23:59:53.563Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:59:33Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "[Reminder] Microsoft Defender for Cloud Apps: Change to Microsoft Entra ID Protection alerts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
