{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 23, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon: We will enable the <i>AI and Copilot Resources</i> provider by default for all Microsoft Viva Learning users. Admins will have the ability to manage the visibility of this provider in Viva Learning.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479410\" target=\"_blank\">479410</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early April 2025 and expect to complete by mid-April 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late April 2025 (previously mid-April) and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, the <i>AI and Copilot Resources </i>provider was available by default only to users with a license for Microsoft 365 Copilot.\n</p><p>After this rollout, all Viva Learning users (regardless of their Microsoft 365 Copilot license status) will be able to see the <i>AI and Copilot Resources provider</i> like they see the <i>Microsoft Learn</i> and <i>Microsoft 365 Training</i> providers:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ae10df89-a5f5-49bd-ac51-12bfe0c53c74\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Viva Learning admins and learners will be able to see the <i>AI and Copilot Resources</i> provider content as a carousel under the <i>Browse by: Providers </i>section on the Viva Learning Home page and can select the <i>AI and Copilot Resources</i> provider from the options in the <i>Provider </i>filter on the Search results page. For premium Viva Learning tenants, the provider's content will also be accessible in the <i>Learning </i>tab in Microsoft 365 experiences such as Microsoft SharePoint Search and Microsoft Bing@Work.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Admins can manage the visibility of the <i>AI and Copilot Resources</i> provider in Viva Learning on the <i>Admin</i> page under the <i>Manage providers</i> tab and the <i>Manage Permissions</i> tab. To manage the provider visibility, admins will need the role of Global admin, Knowledge admin, or Knowledge manager or have access through Viva Learning's <a href=\"https://learn.microsoft.com/viva/learning/feature-access-management\" target=\"_blank\">feature access management</a>.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9b20be03-efac-4122-ba9d-5fc1f49131b5\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Content from the <i>AI and Copilot Resources</i> provider is used in Microsoft Copilot Academy. Any permission changes to this provider may affect the Copilot Academy experience for all learners.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/learning/ai-and-copilot-resources\" target=\"_blank\">AI and Copilot resources | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479410"
    },
    {
      "Name": "Summary",
      "Value": "The \"AI & Copilot Resources\" provider will be available to all Viva Learning users by default starting late April 2025. Admins can manage its visibility. This change will happen automatically, and no action is required beforehand. Review configurations and notify users as needed."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1038681",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T14:51:56.303Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-21T23:31:53Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Learning: \"AI & Copilot Resources\" provider will be available to all Viva Learning users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
