{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>September 17, 2025, Update: The rollout to Word, Excel, PowerPoint and OneNote has started and is expected to complete in the coming weeks.</p><p>Updated July 29, 2025, Update: The rollout for Word, Excel, PowerPoint and OneNote has been delayed to mid-August. The original timing has been updated in the original message. Additionally, Copilot Chat in the apps will respect the most recent user state (open or closed) when opening a file.&nbsp;</p><p>We’re excited to announce that we are making Copilot Chat available as a side-by-side experience in Word, Excel, PowerPoint, Outlook, and OneNote to help users access AI in their flow of work.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8806cc60-a99a-4d54-aed6-6c1a9ab5c620\" width=\"400\" height=\"\"></p><p><i>Copilot Chat in Word (Windows desktop) for users without a Microsoft 365 Copilot license. UI elements subject to change.</i></p><p>Users can open Copilot Chat from the app ribbon. Copilot Chat in the apps will respect the most recent user state (open or closed) when opening a file.&nbsp;&nbsp;</p><p>Copilot Chat will be available in these apps for users with a Microsoft 365 Copilot license, and for users without a Microsoft 365 Copilot license who have pinning enabled. We will update the text of the <a href=\"https://go.microsoft.com/fwlink/?linkid=2310640\" target=\"_blank\">Pin Microsoft 365 Copilot Chat admin setting</a> to reflect its expanded scope across Microsoft 365 apps.</p><p><b>Pin Microsoft 365 Copilot Chat in the Microsoft 365 admin center: Existing setting with updated language</b></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/577939e0-be74-4a06-9036-02fe66db1e03\" width=\"200\" height=\"\">\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=494830\" target=\"_blank\">494830</a>\n</p><p><b>When this will happen:</b></p><p>General Availability:</p><ul><li><b>•\tOutlook for Web, new Outlook for Windows, and classic Outlook for Windows: </b>Rollout of this change starts in late June and completes in the weeks following. \n</li><li><b>•\tOutlook for Mac: </b>Rollout of this change for Mac starts in mid-July and completes in the weeks following. \n</li><li><b>•\tWord, Excel, PowerPoint, OneNote (Web, Mac, Windows): </b>Rollout of this change starts in mid-August and completes in the weeks following. \n<ul style=\"\"><li style=\"\">Windows: Current Channel rollout will start in mid-August. Monthly Enterprise Channel rollout will be included as part of Patch Tuesday in September.\n</li><li style=\"\">Mobile (Word/PowerPoint) / iPad (all) rollout will start no earlier than mid-August.</li></ul></li></ul><p><b>What you need to do to prepare:</b></p><p>No admin action is required. However, if your <a href=\"https://go.microsoft.com/fwlink/?linkid=2310640\" target=\"_blank\">Pin Microsoft 365 Copilot Chat admin setting</a> is configured to “Do not pin,” you should adjust it to “Pin” if you want your users without a Microsoft 365 Copilot license to access Copilot Chat in their Microsoft 365 apps.</p><p>Learn more about pinning and managing Copilot Chat: <a href=\"https://learn.microsoft.com/copilot/manage\" target=\"_blank\">Manage Microsoft 365 Copilot Chat | Microsoft Learn</a>.</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? No.</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data? No.&nbsp;</li><li>Does the change provide a new way of communicating between users, tenants, or subscriptions? No.&nbsp;</li><li>Does the change provide end users any new way of interacting with generative AI? No.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494830"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat is being rolled out across Word, Excel, PowerPoint, OneNote, and Outlook on multiple platforms starting mid-2025. It respects user state, requires no admin action unless pinning is disabled, and does not change data processing or AI capabilities."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1096218",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-17T20:59:06.287Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-16T23:13:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Extending Copilot Chat to Microsoft 365 apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
