{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 23, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Coming soon for Microsoft Teams: Meeting participants will be able to request an annotation session while someone else is sharing their screen.</p><p>This message applies to Teams for Windows desktop and Teams for Mac desktop. (Users can view and annotate in Teams on the web but cannot initiate annotations.)\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=89975\" target=\"_blank\">89975</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early July 2025 and expect to complete by mid-July 2025. \n</p><p>General Availability (WW, GCC, GCC High, and DoD): We will begin rolling out mid-July 2025 and expect to complete by late July 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, meeting participants who are not sharing their screens will have the ability to request an annotation session. This request will be sent to the presenter sharing their screen who can choose to accept or deny it:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f808a149-d9f2-4b5d-8cb8-1ff99c8d60a1\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>If the request is accepted, the annotation session will start for everyone in the meeting:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/382d6182-ffc1-4db8-8b6f-b42d24c4144b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p> Anonymous users in the meeting will not be able to send a request.\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-annotation-while-sharing-your-screen-in-microsoft-teams-876ba527-7112-437e-b410-5aec7363c473\" target=\"_blank\">Use annotation while sharing your screen in Microsoft Teams - Microsoft Support</a> (we will update this before rollout)\n</p><p>Watch: <a href=\"https://www.youtube.com/watch?v=RpOCxz4woPA\" target=\"_blank\">How to use Collaborative Annotations in a Microsoft Teams meeting (2022)</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "89975"
    },
    {
      "Name": "Summary",
      "Value": "Meeting participants in Microsoft Teams will soon be able to request collaborative annotation sessions during screen sharing. This feature will roll out in July 2025 for Windows and Mac desktop users. No admin action is required, but notifying users and updating documentation is recommended. Anonymous users cannot request annotations."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-09-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1019312",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-23T14:44:48.69Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T01:28:59Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Meeting participants can request collaborative annotation sessions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
