{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will soon relocate the Microsoft Viva Engage keyword monitoring feature from the classic Microsoft Yammer admin center to a central <i>Advanced moderation</i> experience in the new Viva Engage Communications Dashboard, as communicated in MC1041122 <i>Microsoft Viva Engage: New Communications Dashboard</i> (published March 2025). Network admins, verified admins, and corporate communicators with <i>Advanced moderation</i> access (a granular permission in the corporate communicator role that must be explicitly enabled) will be able to add and monitor keywords in the new location.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478658\" target=\"_blank\">478658</a>.\n</p><p>This message applies to:\n</p><ul><li>Engage app on the desktop (as a progressive web app)\n</li><li>Engage app in Microsoft Outlook (new Outlook for Windows desktop, Outlook for the web, and new Outlook for Mac desktop)\n</li><li>Engage app in Microsoft Teams (Teams for Windows desktop, Teams for Mac desktop, and Teams for the web)\n</li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-April 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout:\n</p><ul><li>If your organization has monitored keywords in the previous experience, all keywords will be available in the new destination in the Communications Dashboard. </li><li>Engage will continue to support regex formatting functionality to help with keyword specificity. Learn more about supported formats at <a href=\"https://learn.microsoft.com/viva/engage/manage-security-and-compliance/manage-data-compliance\" target=\"_blank\">Manage Viva Engage data compliance | Microsoft Learn</a>.\n</li><li>Admins and corporate communicators can designate an email recipient to receive keyword monitoring email notifications. </li><li>All detected conversations with keywords will be visible in the <i>Advanced moderation</i> tab. Admins and corporate communicators can view all public conversations and all private conversations they have access to if those threads are associated with monitored keywords. From the <i>Advanced moderation</i> tab, moderators can review these conversations or act on them (mute, close, delete, or dismiss from review). Reviewed conversations are available on the <i>Advanced moderation</i> page for 30 days, providing transparency into all tasks performed across moderators.</li><li>Organizations that have never used keyword monitoring can access the experience in the new destination and begin using this feature.</li></ul><p>Keyword monitoring from the <i>Advanced moderation</i> tab in the Communications dashboard:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/694b648d-4ad2-41ac-b150-74f36a68c2d4\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Network admins, verified admins, and Engage admins can assign new or existing corporate communicators with <i>Advanced moderation</i> access from the Role management page in the Engage admin center. This granular permission in the corporate communicator role is disabled by default. This permission must be specifically enabled to facilitate moderation.\n</p><p><i>Learn more</i>\n</p><p>We will update these documents before rollout:\n</p><ul><li><a href=\"https://learn.microsoft.com/viva/engage/eac-key-admin-roles-permissions\" target=\"_blank\">Manage admin roles in Viva Engage | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/engage/manage-security-and-compliance/manage-data-compliance\" target=\"_blank\">Manage Viva Engage data compliance | Microsoft Learn</a>\n</li></ul><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478658"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Viva Engage keyword monitoring feature will move from the Yammer admin center to the new Viva Engage Communications Dashboard's Advanced moderation experience. This change, affecting various Engage apps, will roll out from mid-April to late June 2025. Admins need to review configurations and may notify users."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041179",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-25T20:00:30.697Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-25T20:00:21Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Monitoring keywords in the new Communications Dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
