{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Direct Send is a method used to send emails directly to a Microsoft Exchange Online customer’s hosted mailboxes from on-premises devices, applications, or third-party cloud services using the customer’s own accepted domain. It is an advanced method of sending messages to your users and requires proper configuration of SPF, DKIM, and DMARC to ensure messages are delivered successfully.</p><p>Many customers do not need to use Direct Send. Because SPF protections do not always outright block messages and sometimes deliver them to the Junk folder, it is possible for malicious senders mimicking Direct Send to have their messages that spoof your own domains land in the Junk folder and potentially confuse your users. Before this rollout, no feature existed to block Direct Send traffic for customers who have no need to use it. We will roll out the new <i>Reject Direct Send</i> setting for Exchange Online.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: Available now.</p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out early September 2025 and expect to complete by early September 2025.</p><p><b>How this will affect your organization:</b></p><p>Direct Send covers anonymous messages sent from your own domain to your organization’s mailboxes and so enabling this setting will block any of that traffic. Direct Send traffic may include third-party services that you have given permission to use your domain or one of your own email applications hosted on-premises. To avoid having these messages rejected when this feature is enabled, they need to be authenticated. You can authenticate them by creating a <i>partner mail flow connector</i> for these messages.    \n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout has happened automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.\n</p><p>By default, the new opt-in <code>RejectDirectSend</code> setting is set to <code>False</code>.  To enable the Reject Direct Send feature, Exchange Online admins can run this Microsoft PowerShell cmdlet: \n</p><p><code>Set-OrganizationConfig -RejectDirectSend $true</code>\n</p><p>The change should propagate out to your entire service within 30 minutes. With the feature enabled, any received Direct Send messages will see the following message:  \n</p><p><code>550 5.7.68 TenantInboundAttribution; Direct Send not allowed for this organization from unauthorized sources</code> \n</p><p>Unless you re-enable Direct Send, any messages that hit this error will need a partner connector created to authenticate their source as an approved sender.  \n</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/exchange/introducing-more-control-over-direct-send-in-exchange-online/4408790\" target=\"_blank\">Introducing more control over Direct Send in Exchange Online | Microsoft Community Hub</a></p><p>We invite Exchange admins to try out the feature and provide feedback that we can use to validate and proceed to offering this feature for General Availability.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange Online introduces a new \"Reject Direct Send\" parameter to block unwanted Direct Send traffic. Public Preview is available now, with General Availability in September 2025. Admins can enable this feature using PowerShell. Review configurations and notify users. Learn more [here](https://techcommunity.microsoft.com/blog/exchange/introducing-more-control-over-direct-send-in-exchange-online/4408790)."
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1093237",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-12T23:13:16.973Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-12T23:13:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online: New Reject Direct Send parameter (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
