{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: Enhanced spell checking with multi-language support. This feature will help users communicate more effectively with fewer spelling errors.\n</p><p>This message applies to Teams on Windows desktop and Teams on Mac desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470600\" target=\"_blank\">470600</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early April 2025 and expect to complete by mid-April 2025.\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out early May 2025 and expect to complete by mid-May 2025.\n</p><p>General Availability (GCC High): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.\n</p><p>General Availability (DoD): We will begin rolling out late June 2025 and expect to complete by early July 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Users will choose their languages for spell checking in Teams settings. Before rollout, we will update this post with revised documentation.\n</p><p>Key features</p><ul><li>Advanced spell checking: Improved accuracy to ensure messages are clear and professional.\n</li><li>Multi-language support: Seamlessly switch between up to three languages.\n</li><li>Custom dictionary: Users can add their own words for personalized spell checking.\n</li></ul><p>\n</p><p>This change will be available to users by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470600"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"470600\":[{\"RoadmapId\":470600,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-03-26T21:13:43.3697058Z\",\"LatestRing\":null},{\"RoadmapId\":470600,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-03-26T21:13:43.369706Z\",\"LatestRing\":null},{\"RoadmapId\":470600,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-03-26T21:13:43.369706Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon have enhanced spell checking with multi-language support, rolling out from April to July 2025. Users can choose languages in settings, and features include advanced spell checking, multi-language support, and a custom dictionary. No admin action is required, but user notification is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1040545",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-24T22:28:14.693Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-24T22:28:00Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Enhanced spell checking will support multiple languages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
