{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to the total number of items that can be created in a Fabric workspace. Currently, there are limits on the number of Power BI items allowed in a workspace, but no such limits for Fabric items. With this change, there will be a <i>combined limit of 1000 Fabric and Power BI items per workspace</i>. i.e. a workspace can have a total of 1000 Fabric and Power BI items. This would help ensure quality of service for users, by preventing capacity overload due to too many items in a Fabric workspace. For tenants where Fabric is not enabled, the existing limits of 1000 Power BI items per workspace will continue to apply.&nbsp;</p><p><b>When this will happen:</b></p><p>This change will start rolling out from late March 2025, and will finish on mid-April 2025.</p><p><b>How this will affect your organization:</b></p><p>Once this change is implemented:\n</p><ul><li>For workspaces that contain fewer than 1000 items, once the limit of 1000 is reached, users will be unable to create additional items.\n</li><li>For workspaces that exceed 1000 items as of April 10, 2025, a grace period of 180 days will be provided. After the expiration of this grace period, users will no longer be able to create additional items in the workspace.\n</li><li>To create new items in workspaces that have reached the item limit, users will need to delete items until the total number of items in the workspace is less than 1000.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Admins should assess the number of items per workspace in their tenant and develop a plan for managing items in both current and future workspaces. The total number of items in a workspace can be found in the Admin Monitoring workspace, within the Feature adoption and usage report under the Inventory section (documentation can be found <a href=\"https://learn.microsoft.com/fabric/admin/feature-usage-adoption#measures\" target=\"_blank\">here</a>).</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "A combined limit of 1000 Fabric and Power BI items per workspace will be enforced starting late March 2025. Workspaces exceeding this limit by April 10, 2025, will have a 180-day grace period. Admins should assess and manage item counts, with guidance available in the Admin Monitoring workspace."
    }
  ],
  "EndDateTime": "2025-08-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1020197",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-28T22:10:15.95Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T22:10:05Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Enforcing item limits in a Fabric workspace",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
