{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>EEEU, which stands for Everyone Except External Users, is a permission setting used in Microsoft SharePoint and Microsoft OneDrive to manage access to content. This setting allows all internal users in an organization to access certain content while excluding external users. <a href=\"https://learn.microsoft.com/microsoft-365/troubleshoot/access-management/grant-everyone-claim-to-external-users#use-microsoft-entra-groups-and-dynamic-membership-instead-of-default-claims\" target=\"_blank\">We discourage use of this setting</a> due to concerns about inadvertent oversharing of user data.\n</p><p><b>What is changing</b>\n</p><p>Starting April 10, 2025 and ending by September 30, 2025, we will run logic to detect and remove the EEEU permission from the root site of each user’s OneDrive and the default document library in OneDrive.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this retirement, apps, processes, or users may be able to discover and access content from OneDrive because of the inadvertent presence of EEEU in the root web and default document library in OneDrive. After the EEEU permission is removed, these apps, processes, and users will lose access to the content from the affected OneDrive accounts. Users, processes, and apps that were granted direct permissions to specific files and folders of a OneDrive account will not be impacted and will continue to retain their access.\n</p><p>We recommend OneDrive owners and OneDrive admins give explicit permission to individual files and folders in OneDrive to be accessed by one or more users or apps.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically by the specified date. No admin action is required. Please notify your users about this change and update relevant documentation. If you have questions or wish to discuss more, please open a support ticket.</p><p><i>Learn more: </i>The section called <a href=\"https://learn.microsoft.com/microsoft-365/troubleshoot/access-management/grant-everyone-claim-to-external-users#use-microsoft-entra-groups-and-dynamic-membership-instead-of-default-claims\" target=\"_blank\">Use Microsoft Entra groups and dynamic membership instead of default claims</a> in <a href=\"https://learn.microsoft.com/microsoft-365/troubleshoot/access-management/grant-everyone-claim-to-external-users\" target=\"_blank\">Grant Everyone claim to external users in Microsoft 365 - Microsoft 365 | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft OneDrive will remove the EEEU sharing permission from the root web and default document library between April 10, 2025, and September 30, 2025, to prevent inadvertent data oversharing. Users, processes, and apps with direct permissions will retain access. No admin action is required; notify users and update documentation."
    }
  ],
  "EndDateTime": "2025-12-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1013464",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-21T23:43:28.537Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-21T23:43:15Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft OneDrive: We will remove the EEEU sharing permission from root web and default document library",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
