{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to new Microsoft Outlook: Newsletters in Outlook enable customers to create, distribute, and track success for their internal email newsletters. This message applies to the new Outlook for Windows and Outlook for the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=328282\" target=\"_blank\">328282</a></p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-February 2025 and expect to complete by late March 2025. Rollout will begin in Targeted Release and will proceed to Standard Release.</p><p>General Availability (Worldwide): We will begin rolling out early August 2025 and expect to complete by early September 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users in your organization using the new Outlook for Windows and Outlook for the Web can create professional and engaging email newsletters with a variety of rich elements and leverage built-in tools to manage reader engagement. Readers can discover and subscribe to newsletters that interest them using the new Explore page in the Outlook Newsletters module, accessible in the left-side navigation menu. The new module also includes pages for users to view their drafts.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/10316c90-2355-40ad-a123-df8032a58a67\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>Outlook Newsletters will roll out on the specified date as an opt-in preview, meaning that no users in your organization will have access to the new module without you taking additional configuration steps.\n</p><p>User access to Outlook Newsletters is controlled by the OwaMailboxPolicy. OutlookNewslettersAccessLevel property. The default value of this property is Undefined until you set it explicitly, which will default to NoAccess while Outlook Newsletters remains in Preview. You can use Set-OwaMailboxPolicy to update this property to ReadWrite, ReadOnly, or NoAccess. Users with ReadWrite access can create content in Outlook Newsletters while ReadOnly limits users to accessing content created by others in your organization.\n</p><p>For more information on using OutlookNewslettersAccessLevel, please see: <a href=\"https://learn.microsoft.com/en-us/microsoft-365-apps/outlook/manage/newsletters\" target=\"_blank\">Newsletters in Outlook (Preview) - Microsoft 365 Apps | Microsoft Learn</a>\n</p><p>After enabling Outlook Newsletters, you may want to notify your users about this change and update any relevant documentation.\n</p><p>End-user help: <a href=\"https://support.microsoft.com/en-us/office/newsletters-in-outlook-preview-b35566e6-d319-450d-8930-86e483cda3ee\" target=\"_blank\">Newsletters in Outlook (Preview) - Microsoft Support</a></p><p>Ongoing updates:\n</p><ul><li>Some keyboard navigation and narrator support is still being finished while in Public Preview.\n</li><li>Soft delete support is still in development.\n</li><li>GoLocal support is still in planning.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "328282"
    },
    {
      "Name": "Summary",
      "Value": "Newsletters in Outlook for Windows and Web will allow users to create, distribute, and track internal email newsletters. The rollout begins in mid-February 2025 for Public Preview and August 2025 for General Availability. Access is controlled by OwaMailboxPolicy and requires configuration. Additional details and updates are provided."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-11-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1009916",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-20T15:06:16.587Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-19T00:33:51Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Outlook for Windows and Web: Outlook Newsletters",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
