{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are updating the Places Core service plan to better reflect its current status.</p><p>Effective April 30th, 2025, you will no longer see Places Core service plan. This service plan will be renamed to RETIRED-Places Core.</p><p><b>How this will affect your organization:</b>\n</p><p>This update DOES NOT impact your organization or users that are using Places currently. Customers with a qualifying Microsoft 365 subscription have access to Places core features, which include setting up and updating work plans, viewing collaborators’ work plans, accessing the Places card experiences in calendar, scheduling in-person meetings, managing hybrid RSVP, and workplace presence related capabilities.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This is for your information and, you will not need to do anything.\n</p><p>Learn more about Places: <a href=\"https://learn.microsoft.com/en-us/microsoft-365/places/places-overview\" target=\"_blank\">Microsoft Places overview</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Changes to the Places Core service plan will take effect on April 30th, 2025, renaming it to RETIRED-Places Core. This update does not impact current users or organizations. No action is required. For more information, visit the Microsoft Places overview."
    }
  ],
  "EndDateTime": "2025-06-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066935",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-02T22:59:11.753Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-02T22:58:57Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Informational: Changes to Places Core service plan",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
