{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, we do not support skip logic in Microsoft Viva Pulse surveys. We currently support rating scale questions, multiple choice questions, matrix, and ranking order questions in Pulse surveys.\n</p><p>After this rollout, users can add skip logic to single-select multiple choice and rating scale questions (without follow-ups) in Viva Pulse. With skip logic, a respondent’s answer can determine which question they see next, for more tailored and dynamic surveys.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.\n</p><p>Viva Pulse is available for users with a license for Microsoft Viva Suite, Viva Workplace Analytics and Employee Feedback, or for tenants who are using a Pulse admin-led trial. Users with a Microsoft 365 Copilot license may also be able to access Viva Pulse, if admins have enabled access using their Copilot subscription.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=407640\" target=\"_blank\">407640</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>End users can add skip logic to these question types (without follow-ups):\n</p><ul><li>Single-select multiple choice\n</li><li>Rating scale\n</li></ul><p>These features will be available by default.\n</p><p>Pulse authoring view with <i>Skip logic</i> definitions highlighted:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/dc6a6ac8-ec22-4c19-8716-b26ce63786ac\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Pulse authoring view with the <i>Matrix </i>question type highlighted:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/91640fbd-2e41-402c-afb2-e988b65e5ec2\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/create-a-pulse-to-get-feedback-from-your-team-817d3eba-3ce7-4079-80cc-ae8ae96fa61e\" target=\"_blank\">Create a Pulse to get feedback from your team - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "407640"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse will introduce skip logic to surveys, allowing tailored and dynamic questions based on previous answers. This feature will be available for single-select multiple choice and rating scale questions. The rollout starts in early June 2025 and completes by late June 2025, with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1087633",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-03T22:52:28.743Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-03T22:52:14Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: New question types including skip logic in surveys",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
