{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the <a target=\"_blank\" href=\"https://aka.ms/ADO10178\">Edit business rules for omnichannel AI agents</a> feature for Dynamics 365 Contact Center. This feature enables users to design voice AI agent configurations to manage behaviors that can be dynamically altered in near real time without needing to update or republish the agent. This feature will reach general availability on April 30, 2025.<br><br><b>How does this affect me?</b><br>This feature enables the ability to build and configure rules for an Interactive Voice Response (IVR) copilot, within Power Apps, that allows admins to implement call flow changes dynamically, without modifying the copilot logic. This reduces the time spent in standard testing and deployment procedures within Microsoft Copilot Studio.<br><br>This feature is particularly beneficial for enterprises looking to make rapid adjustments in response to environmental factors such as natural disasters or power outages, as well as financial shifts like market fluctuations or policy amendments. It empowers administrators to act decisively in various scenarios, ensuring business continuity and customer satisfaction.<br><br><b>What do I need to do to prepare?</b><br>This message is for awareness and no action is required.<br><br>Once generally available, customers can set up their Power Apps integration with Copilot Studio in a few simple steps:<ol><li>Create and configure your Dataverse table in Power Apps.</li><li>Create an application in Power Apps to support administration of your data.</li><li>Set up an action in Copilot Studio to connect your Dataverse table to your copilot.</li></ol>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-24T16:53:11Z",
  "HasAttachments": false,
  "Id": "MC1061533",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-24T16:54:10.123Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T16:53:11Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center – Edit business rules for omnichannel AI agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
