{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 8, 2025: We have updated the content. Thank you for your patience.</p><p>We are excited to announce the support of the Microsoft Defender for Identity classic sensor on Microsoft Entra Connect servers. This addition expands Defender for Identity’s coverage across hybrid identity environments, providing enhanced visibility and security for these critical assets.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, DoD): Available now.</p><p><b>How this will affect your organization:</b></p><p>With the Defender for Identity classic sensor now available for Entra Connect servers, organizations gain deeper insights into hybrid identity threats. Deploying this sensor allows for more comprehensive monitoring of authentication activities, helping to detect and mitigate potential identity attacks targeting your infrastructure. We strongly recommend installing the Defender for Identity classic sensor on all Entra Connect servers.\n</p><p>Deploy Defender for Identity classic sensor for Entra Connect server:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ab5bb637-de80-4ed2-8fce-c79339492235\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>New posture recommendations for Entra Connect servers:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5b8681da-a6c4-4693-aaf8-7ce60dc78c0a\" alt=\"admin controls\" style=\"width: 400px;\"></p><p>This change is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more</p><ul><li><a href=\"https://learn.microsoft.com/defender-for-identity/deploy/active-directory-federation-services\" target=\"_blank\">Configure sensors for AD FS, AD CS, and Microsoft Entra Connect - Microsoft Defender for Identity | Microsoft Learn</a>&nbsp;</li><li><a href=\"https://techcommunity.microsoft.com/blog/microsoftthreatprotectionblog/protect-and-detect-microsoft-defender-for-identity-expands-to-entra-connect-serv/4226165\" target=\"_blank\">Protect and Detect: Microsoft Defender for Identity Expands to Entra Connect Server</a></li></ul><p>This rollout is available automatically with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Deploy the new Defender for Identity sensor on Microsoft Entra Connect servers. The classic sensor is now available, enhancing visibility and security for hybrid identity environments. This update is available globally, and organizations should install the sensor for comprehensive monitoring and threat detection. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060476",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-08T16:11:35.26Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T03:44:18Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Defender XDR services: Deploy the New Defender for Identity sensor on Microsoft Entra Connect servers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
