{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams: The Facilitator agent can take notes during your Teams meetings and chats. The Facilitator synthesizes key information from the conversations, so users can catch up quickly. In meetings, the Facilitator allows everyone to co-author real-time notes and collaborate seamlessly. In chat, the Facilitator creates and maintains an up-to-date summary of important information as the conversation happens, including key decisions, actions items, and open questions to resolve.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478611\" target=\"_blank\">478611</a>.\n</p><p>We introduced the Targeted Release preview of this feature in MC937709 <i>(Updated) Facilitator in Teams Meetings and Chats</i> (published and updated November 2024).\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.\n</p><p>A Microsoft 365 Copilot license is required to use this feature.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, the Facilitator app will be on by default unless all apps are blocked by your organization. As an admin, you control whether Facilitator will be available to your entire organization or to a certain group of users. Learn more: <a href=\"https://learn.microsoft.com/MicrosoftTeams/facilitator-teams\" target=\"_blank\">Set up Facilitator in Microsoft Teams for collaborative AI notes - Microsoft Teams | Microsoft Learn</a>\n</p><p>Facilitator and Microsoft 365 are built on Microsoft's comprehensive approach to security, compliance, and privacy. As a part of the security promise, you can discover, protect, and govern AI interactions with Facilitator through Microsoft Purview. Microsoft Purview Data Security Posture Management (DSPM) for AI helps IT and security teams proactively discover and manage data risks. Use DSPM for AI in conjunction with other Microsoft Purview capabilities such as Audit, eDiscovery, and Data Lifecycle Management to ensure data security and compliance for your organization. Learn more about Microsoft Purview here: <a href=\"https://learn.microsoft.com/purview/ai-microsoft-purview\" target=\"_blank\">Microsoft Purview data security and compliance protections for Microsoft 365 Copilot and other generative AI apps | Microsoft Learn</a>.\n</p><p><i>Improvements planned for the future: </i>AI-generated notes in chats will move to an editable canvas. This canvas will be backed by a Microsoft SharePoint Embedded file and document management system. We will provide more details closer to the feature's release. Learn more: <a href=\"https://learn.microsoft.com/sharepoint/dev/embedded/overview\" target=\"_blank\">SharePoint Embedded Overview | Microsoft Learn</a>\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i></p><p><i>\n</i></p><ul><li>If you're using Microsoft 365 Copilot in your organization (with your work or school account): <a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-privacy\" target=\"_blank\">Data, Privacy, and Security for Microsoft 365 Copilot | Microsoft Learn</a>.\n</li><li>Admin documentation: <a href=\"https://learn.microsoft.com/MicrosoftTeams/facilitator-teams\" target=\"_blank\">Set up Facilitator in Microsoft Teams for collaborative AI notes - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</li><li>User documentation (meetings): <a href=\"https://support.microsoft.com/office/automate-notetaking-in-microsoft-teams-meetings-37657f91-39b5-40eb-9421-45141e3ce9f6\" target=\"_blank\">Automate notetaking in Microsoft Teams meetings - Microsoft Support</a> (will be updated before rollout)\n</li><li>User documentation (chats): <a href=\"https://support.microsoft.com/office/keep-track-of-chats-with-ai-notes-in-microsoft-teams-0b7efbd0-fd3e-48e7-9a4b-4ea22cdc12c0\" target=\"_blank\">Keep track of chats with AI notes in Microsoft Teams - Microsoft Support</a> (will be updated before rollout)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478611"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing the Facilitator agent to take notes during meetings and chats, summarizing key information and allowing real-time collaboration. This feature will be available from April 2025 and requires a Microsoft 365 Copilot license. Admins can control its availability, and it includes robust security and compliance measures."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-06-23T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1017117",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-03T18:20:58.357Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-26T00:28:48Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Facilitator agent takes notes in meetings and chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
