{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 18, 2025: We have updated the content. Thank you for your patience.</p><p>As part of the Microsoft Secure Future Initiative (SFI) and in alignment with the “Secure by Default” principle, we are updating default settings in Microsoft 365 to help you meet the minimum security benchmark and harden your tenant’s security posture. These changes target legacy authentication protocols and app access permissions that may expose organizations to unnecessary risk.\n</p><p>This is the first step in a broader effort to evaluate and evolve Microsoft 365 defaults through the lens of security best practices.\n</p><p><b>When this will happen:</b></p><p>These changes will begin rolling out in mid-July 2025 and are expected to complete by August 2025.\n</p><p><b>How this affects your organization</b></p><p>The following settings will be updated:</p><table class=\"table table-bordered\"><tbody><tr><td>Settings</td><td>Impact</td></tr><tr><td>Block legacy browser authentication to SharePoint and OneDrive using RPS (Relying Party Suite)</td><td>Legacy authentication protocols like RPS (Relying Party Suite) are vulnerable to brute-force and phishing attacks due to non-modern authentication. Blocking this prevents applications that are using outdated methods from accessing SharePoint and OneDrive via browser. To use PowerShell to block legacy browser authentication, see <a href=\"https://learn.microsoft.com/en-us/powershell/module/microsoft.online.sharepoint.powershell/set-spotenant?view=sharepoint-ps#-legacybrowserauthprotocolsenabled\" target=\"_blank\">Set-SPOTenant</a>.</td></tr><tr><td>Block FPRPC (FrontPage Remote Procedure Call) protocol for Office file opens</td><td>FrontPage Remote Procedure Call (FPRPC) is a legacy protocol used for remote web page authoring. While no longer widely used, Legacy protocols such as FPRPC can be more susceptible to compromise and blocking FPRPC helps reduce exposure to vulnerabilities. With this change, FPRPC will be blocked for opening files, preventing the use of this non-modern protocol in Microsoft 365 clients. To learn how to block the FPRPC protocol, see <a href=\"https://go.microsoft.com/fwlink/p/?linkid=2324509\" target=\"_blank\">turn on web content filtering</a>.</td></tr><tr><td>Require admin consent for third-party apps accessing files and sites</td><td><p>Users allowing third-party apps to access file and site content can lead to overexposure of an organization’s content. Requiring admins to consent to this access can help reduce overexposure. With this change,  Microsoft managed <a href=\"https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/manage-app-consent-policies\" target=\"_blank\">App Consent Policies</a> will be enabled, and users will be unable to consent to third party applications accessing their files and sites by default. Instead, they can request administrators to consent on their behalf. To configure admin consent, follow instructions here: <a href=\"https://go.microsoft.com/fwlink/p/?linkid=2324703\" target=\"_blank\">Configuring the Admin Consent workflow</a>. Customers who have already blocked user consent, turned on our previously recommended consent settings, or applied custom user consent settings will not be affected by this change.<br>Admins can also configure granular app access policies, such as limiting user access to the application for specific users or groups. Learn more <a href=\"https://aka.ms/entra-app-access\" target=\"_blank\">here</a>.<br></p></td></tr></tbody></table><p>These changes are on by default and apply to all Microsoft 365 tenants. No additional licensing is required.\n</p><p><b>What you can do to prepare:</b></p><p>We recommend the following actions:\n</p><ul><li><b>Assess current configurations:</b> As applicable, identify current configurations for <a href=\"https://learn.microsoft.com/en-us/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps#-legacybrowserauthprotocolsenabled\" target=\"_blank\">RPS </a>or <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps\" target=\"_blank\">FPRPC</a> protocols.</li><li><b>Notify stakeholders: </b>Inform IT admins, app owners, and security teams about the upcoming changes.\n</li><li><b>Update documentation: </b>Ensure internal guidance reflects the new defaults and admin consent process.\n</li><li><b>Configure Admin Consent workflow:</b> If third party apps access is applicable for your organization, learn how to set up the workflow: <a href=\"https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/configure-admin-consent-workflow\" target=\"_blank\">Configuring admin consent workflow.</a></li></ul><p>Additional considerations\n</p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? Yes — it blocks access to content via legacy authentication protocols.\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 will update default settings to enhance security by blocking legacy authentication protocols and requiring admin consent for third-party app access. Changes start mid-July 2025 and complete by August 2025. Organizations should assess configurations, notify stakeholders, update documentation, and configure the Admin Consent workflow."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1097272",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-18T18:30:25.227Z",
  "Services": [
    "Microsoft Entra",
    "SharePoint Online",
    "Microsoft OneDrive",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-17T23:24:02Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Upcoming Secure by Default Settings Changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
