{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Text web part in SharePoint Online allows users to add normal text, tables, and paragraphs to a SharePoint site page. It provides various formatting options such as bullets, styles, indentations, links, and highlighting. To use the Text web part, go to <i>edit </i>mode, select the circled plus (+) icon, choose <i>Text </i>from the web part toolbox, and enter your desired text in the Text field.</p><p>In the updated Text web part, similar themed features are grouped together for better customer experience and usability. \n</p><p>The updated text web part will be available in SharePoint and Viva Amplify.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394278\" target=\"_blank\">394278</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): This feature update rolled out early February 2025.</p><p><b>How this will affect your organization:</b></p><p>Users will see a new UI for the Text web part with existing controls and some new ones. The Text web part will automatically adjust by expanding or compressing based on the section layout used. When compressed, the text options will move into the overflow (...) button. Within this web part, users can make all text customizations that are already available like styles, font size, alignment, list, tables, and many more. This web part will also host any text enhancements that may be added in the future.</p><p>For more information, see <a href=\"https://support.microsoft.com/office/add-text-tables-and-images-to-your-page-with-the-text-web-part-729c0aa1-bc0d-41e3-9cde-c60533f2c801\" target=\"_blank\">Add text, tables, and images to your page with the Text web part</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394278"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1004412",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-12T23:32:16.403Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-12T23:31:42Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "SharePoint Online: Enhancements to the Text web part",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
