{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to configure Entra hybrid join for hosted machine groups in Power Automate. This feature will reach general availability on May 31, 2025.<br><br><b>How does this affect me?</b><br>This feature allows your hosted machine group bots to enroll in both your on-premises Active Directory (AD) and Microsoft Entra ID. This enables automation in scenarios that require authentication using an AD account, or when devices need to be managed using Group Policy (GPO). It provides support for joining hosted machine group bots to both on-premises AD and Microsoft Entra ID when using custom virtual networks (VNETs).<ul><li>A custom VNET is configured using Azure Virtual Network.</li><ul><li>Access to the domain controller is required from the custom VNET.</li></ul><li>A custom VNET allows you to access on-premises resources when running your automation.</li><li>Microsoft Entra hybrid join is configured as part of Power Automate network connection setup.</li></ul><b>What do I need to do to prepare?</b><br>This message is for awareness and no action is required.<br><br>If you would like more information on this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/ADO10296\">additional requirements for Microsoft Entra hybrid joined hosted machines groups</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-06-01T15:24:34Z",
  "HasAttachments": false,
  "Id": "MC1066093",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-01T15:25:14.927Z",
  "Services": [
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T15:24:34Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Automate – Configure Entra hybrid join for hosted machine groups",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
