{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Fabric will introduce two Preview features called Workspace-level private links and <i>Outbound access protection </i>at the Fabric workspace level. At the tenant level, the corresponding settings <i>Configure workspace level inbound network rules</i> and <i>Configure workspace level outbound network rules</i> will be in the Advanced networking section of the Fabric admin portal. The new tenant-level settings will be enabled by default, which will allow the workspace admins to configure Workspace-level private links and Outbound access protection. The workspace admin will then decide whether to configure these features at the workspace level. You (the tenant admin) can switch off the tenant toggle in the Fabric admin center if you decide not to make this feature available to your workspace admins.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview (Worldwide): We will begin rolling out early June 2025 and expect to complete by mid-June 2025.\n</p><p>We will communicate the plan for General Availability in a future post.\n</p><p><b>How this will affect your organization:</b>\n</p><p><i>Feature 1: Workspace-level private links</i>\n</p><ul><li>Private links provide secure inbound connectivity to Microsoft Fabric. Workspace admins can set up private links in Microsoft Azure to connect to a Fabric workspace from a specific virtual network.\n</li><li>In Fabric, workspace admins can choose to block inbound public access to your data to significantly reduce the risk of unauthorized access and potential data breaches. During Preview, admins can block inbound public access with the public REST API, which does not require a workspace-level private link set up in Azure. The corresponding-level tenant admin setting <i>Configure workspace level inbound network rules</i> will be available in the Fabric admin portal at <i>Tenant settings &gt; Advanced networking:</i>\n</li></ul><p></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3b49f2b6-47af-4042-895e-bbb33dca04ba\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><i>Feature 2:</i> Outbound access protection<i> at the user workspace level</i></p><ul><li>Data exfiltration is a concern for many enterprises that store sensitive data in the cloud. When used with other networking features in Fabric, the <i>Outbound access protection</i> feature can help secure your data from exfiltration.  Workspace admins will be able to block all the outbound connectivity from the workspace. Once enabled, all outbound connections made by Fabric Spark artifacts from this workspace will be blocked. The only way to enable a connection is by first establishing a managed private endpoint (MPE) from the workspace to the destination. Workspace admins can control this feature in <i>Workspace settings &gt; Network security &gt; Outbound access protection &gt; </i>Switch on the toggle for <i>Block outbound public access:\n</i></li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4eeb53ca-0821-44b0-a4ee-248ff3830a0b\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><ul><li>In this Preview, we will support OneLake and these Fabric items: Lakehouse, Notebook, Environment, and Spark Job Definition. We will also support Cross Workspace shortcuts.\n</li><li>Admin tenant-level setting for <i>Configure workspace level outbound network rules</i> in the Fabric admin portal at <i>Tenant settings &gt; Advanced networking:</i>\n</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/23bc0c8a-3d0a-4460-be30-011c99e24d03\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>After we release these features, please review these settings to assess the impact on your organization and adjust them as needed.\n</p><p>If you have questions or need further assistance, please do not hesitate to contact our support team.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/fabric/security/\" target=\"_blank\">Microsoft Fabric security - Microsoft Fabric | Microsoft Learn</a></p><p>We will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Fabric will introduce Preview features for Workspace-level private links and Outbound access protection in June 2025. These features, enabled by default, allow workspace admins to secure inbound and outbound data connections. Tenant admins can disable these settings in the Fabric admin portal."
    }
  ],
  "EndDateTime": "2025-09-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1070180",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-08T23:09:25.367Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-08T23:09:21Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Fabric: Workspace inbound/outbound access protection will be available by default (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
