{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Call Waiting Beep is a phone feature that provides a less intrusive tone when a user is in a call and a second call comes in to let the user know there is an incoming call when they are busy. A beep tone will play every 5 seconds for the duration of an incoming call ringing.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=491472\" target=\"_blank\">491472</a>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early June 2025 and expect to complete by mid-June 2025.</p><p><b>How this will affect your organization:</b></p><p>To enable this experience on Desktop, users must turn on the Setting within the Teams Settings &gt; Notifications and activity &gt; Play sounds while I’m busy or in a meeting.</p><p>On Teams Mobile app client, Call Waiting Beep is the default experience. When a user is in a Teams Call and is receiving a second incoming call, they will receive this functionality. Call Waiting Beep will be supported on IOS and Android devices.</p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "491472"
    },
    {
      "Name": "Summary",
      "Value": "Call Waiting Beep, a feature providing a tone for incoming calls during active calls, will be available on Desktop and Mobile. Rollout starts early June 2025 and completes mid-June 2025. Users must enable it in Teams Settings on Desktop, while it's default on Mobile. Update training and documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075913",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-16T22:25:22.597Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:25:15Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Call Waiting Beep Enabled on Desktop and Mobile",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
