{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Customers have expressed a significant pain point in managing and controlling the distribution of sensitive information in email. The lack of predicates to monitor the number of recipients or domains in outgoing emails poses a risk of data leaks and non-compliance with regulatory requirements. We are addressing this issue in Microsoft Purview | Data Loss Prevention by rolling out new predicates that will enable organizations to set precise policies that trigger alerts or actions when emails exceed a specified number of recipients or domains. This feature is essential for enhancing data security, ensuring compliance, and providing peace of mind to organizations concerned about unauthorized data dissemination.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=483158\" target=\"_blank\">483158</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late April 2025 and expect to complete by mid-May 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late May 2025 and expect to complete by mid-June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, admins can use the new predicates in Data Loss Prevention &gt; <i>Policy settings &gt; Create rule &gt; Unique recipients greater than</i> and <i>Unique domains greater than</i> to take action on emails based on the number of recipients or domains in the email:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b62fba4b-226a-4f91-af70-9b5b200017a2\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>This change will be available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/powershell/module/exchange/new-dlpcompliancerule?view=exchange-ps\" target=\"_blank\">New-DlpComplianceRule (ExchangePowerShell) | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483158"
    },
    {
      "Name": "Summary",
      "Value": "New predicates for email Data Loss Prevention in Microsoft Purview will allow organizations to set policies based on the number of recipients or domains in outgoing emails. This feature, rolling out in 2025, enhances data security and compliance. No admin action is required before the rollout. More details are available in Microsoft 365 Roadmap ID 483158."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024387",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-05T23:45:13.257Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:44:49Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: New predicates for email DLP to detect number of domains or recipients",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
