{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 3, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Note: If your organization does not support iOS, you can safely ignore this message.\n</p><p>Before this rollout, when viewing an email message, a user can access the available conversation actions in Microsoft Outlook for iOS in the top right corner of the screen. After this rollout, these actions will be at the bottom of the screen. The user will be able to customize the order and placement of the actions to suit their needs.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=492627\" target=\"_blank\">492627</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will gradually begin rolling out early June 2025 (previously early July) and expect to complete by early January 2026.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, actions formerly found in the top right of the reading pane (such as <i>Mark unread, Pin, Delete, </i>and <i>Archive)</i> will move to a toolbar at the bottom of the reading pane:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/38ee1e45-66a2-4516-ab88-68d31318682a\" alt=\"user controls\" style=\"width: 250px;\"></p><p>Users can customize the order of these actions and choose which actions will be visible in the toolbar and which should stay in the three-dot menu, with the toolbar displaying as many actions as space allows.\n</p><p>Left: Reorder conversation actions in the <i>Customize actions</i> pane, which users can access from the three-dot menu in the toolbar at the bottom of the reading pane. Right: Conversation actions in the three-dot menu:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/78911d66-f38a-429e-822f-03dcbb261898\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This consistent layout will help users build muscle memory, as actions will remain in the same positions across accounts and message views. To maintain consistency across different accounts and views, inaccessible actions will be visibly disabled, lowering the chances of triggering unintentional actions.\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "492627"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook for iOS will update conversation actions, moving them from the top right to the bottom of the screen, allowing users to customize their order and placement. This rollout starts in early June 2025 and completes by early January 2026. No admin action is required, but user notification is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "iOS"
    }
  ],
  "EndDateTime": "2026-01-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1072411",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-03T17:20:01.743Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-12T23:41:05Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook for iOS: Updated conversation actions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
