{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are introducing a new Startup Boost task from the Microsoft Office installer to optimize performance and load-time of experiences within Office applications. &nbsp;After the system performs the task, the app remains in a paused state until the app launches and the sequence resumes, or the system removes the app from memory to reclaim resources. The system can perform this task for an app after a device reboot and periodically as system conditions allow.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p>New tasks will be publicly visible in the Windows Task Scheduler.&nbsp;</p><ul><li>Task Names: Office Startup Boost and Office Startup Boost Logon.</li><li>Task Description: This task ensures that Office applications can take advantage of preloading performance enhancements.&nbsp;</li></ul><p>Initial roll-out will be on Microsoft Word and support for additional applications will come in future updates.</p><p>Startup Boost is only available when your PC has enough resources to run without impacting system performance. This includes having at least 8 GB of available RAM, and at least 5 GB of available disk space. Additionally, Startup Boost will be disabled when Energy Saver mode is active.</p><p>Startup Boost is an optional performance feature. It is safe to disable. When disabled, Microsoft Office applications will be fully functional but may take longer to load. Customers can disable Startup Boost entirely by preventing the process from starting. To disable the feature, use the in-app setting, e.g., <i>Word &gt; Options &gt; General &gt; Startup Boost (under Start up Options)</i>.</p><p>Scheduled task entry in Task Scheduler:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/da011aba-1d94-42a5-8bb7-507075d26620\" style=\"width: 450px;\"></p><p><br></p><p>End-user UI to enable/disable Startup Boost in Word:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e038abb2-c032-48ed-a891-5bfcba1bad8e\" style=\"width: 450px;\"><br></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required.&nbsp;</p><p>You can disable this Startup Boost task like any other scheduled task. Please note that Office Installer will automatically recreate all scheduled tasks when it applies an update, so users who disable this task will need to disable it again after an Office update.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing a new Startup Boost task to optimize Office applications' performance and load-time. It will roll out in May 2025, initially for Microsoft Word. The task is optional, visible in Windows Task Scheduler, and can be disabled via in-app settings. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041470",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-26T05:12:04.25Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T05:10:38Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Startup Boost task from Microsoft Office installer for Office applications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
