{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 7, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>We are improving the Microsoft Teams app icon and menu in the Microsoft Windows system tray (taskbar notification area) for ease of use and to reduce the number of steps to perform routine tasks.</p><p>This message applies to Teams for Windows desktop.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early March 2025 and expect to complete by mid-March 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-March 2025 and expect to complete by late May 2025 (previously late April).\n</p><p><b>How this will affect your organization</b></p><p>After this rollout, these changes will affect all users:\n</p><ul><li>Updates to how your account presence is displayed. Instead of seeing My status in the system tray menu, users will now see their current presence status and can quickly change their status. \n</li><li>We removed the <i>Open</i> option from the system tray menu. Users can launch the Teams app by selecting their account name in the system tray:\n</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b2559bc5-6ab3-4ee0-9c56-f551ca127c77\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Changes that will impact users who are signed into both personal and work accounts:\n</p><p>Before this rollout, if a user is signed into both personal and work Teams accounts, the system tray will display two Teams icons and corresponding menus. After this rollout, users will have one Teams icon in the system tray for personal and work accounts:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/114b72d0-b864-4ede-b81a-29e254a10ecf\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare</b> \n</p><p>No action is required, as users will automatically receive these changes by default.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating its system tray icon and menu for Windows desktop to simplify use and reduce steps for routine tasks. The rollout will occur from early March to late May 2025. Changes include displaying current presence status and merging personal and work account icons. No user action is required."
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1011152",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-07T19:44:19.833Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-20T01:14:36Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Updates to the Teams system tray icon and menu",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
