{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><i style=\"\">Updated May 12, 2025: We have updated the timeline below. Thank you for your patience.</i></p><p><i style=\"\">Note: If you are not using frontline worker functionality you can ignore this message.</i></p><p>We are enhancing the default experience for frontline workers by making it easier to connect with their organization and introducing more intuitive app names. These updates include adding the Engage experience into the Tailored Frontline App experience.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481280\" target=\"_blank\">481280</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-April 2025 and expect to complete by late May 2025 (previously late April).</p><p><b>How this will affect your organization:</b></p><p>The <a href=\"https://learn.microsoft.com/microsoft-365/frontline/pin-teams-apps-based-on-license?view=o365-worldwide#scenarios\" target=\"_blank\">Tailored Frontline App experience</a>&nbsp;is getting an update. Users with an F license within your organization will see a new default Teams experience on desktop, web, and mobile. The new experience consists of two primary changes: </p><ol><li>The Connections app will now be named 'Home' with a new Home icon.</li><li>The Engage app will now be added to the list of default pinned apps.</li></ol><p>These changes will not impact:</p><ul><li>Users with an E, A, or G license.</li><li>Organizations with the Tailored Frontline App experience turned off (on by default).</li><li>A frontline worker that has a custom app setup policy.</li><li>A frontline worker that has an app customization applied to the Connections app and/or Engage app.</li><li>A frontline worker with the Connections and/or Engage app blocked for them or their organization.</li></ul><p>These changes will follow the same rules that apply to the Tailored Frontline App experience. The images below depict the new default experience.</p><p>Mobile image:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/47bedd17-a5c4-4f1b-b31c-faa584697754\" style=\"width: 200px;\"><i><br></i></p><p>Desktop image:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/74b27ff6-6875-4c9f-8243-7ea6679c8722\" style=\"width: 100px;\"><br></p><p><b>What you need to do to prepare:</b></p><p>You may want to notify your frontline users about this new experience and update your training and documentation as appropriate. If your organization desires a different app experience for your frontline, then we suggest creating a <a href=\"https://learn.microsoft.com/microsoftteams/teams-app-setup-policies\" target=\"_blank\">custom app setup policy</a> to reflect your desired apps and their order. Additionally, if your organization desires different app names for the Connections and Engage apps, we suggest creating an <a href=\"https://learn.microsoft.com/microsoftteams/customize-apps\" target=\"_blank\">app customization</a> for your entire organization or for a specific group of users.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481280"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is enhancing the default experience for frontline workers by making it easier to connect with their organization and introducing more intuitive app names. Changes include renaming the Connections app to 'Home' and adding the Engage app to default pinned apps. Rollout begins mid-April 2025 and completes by late May 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1036574",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-12T12:55:53.18Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T23:06:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Enhancing the default experience for frontline workers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
