{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for This feature gives the ability for the DLP admin to rename the existing policy/rule without having to create the entire the rule or policy again \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=370535\" target=\"_blank\">370535</a>.</p><p><b>When this will happen:</b> \n</p><p>Public Preview: We will begin rolling out mid-July 2025 and expect to complete by late July 2025. \n</p><p>General Availability (Worldwide): We will begin rolling out late August 2025 and expect to complete by mid-September 2025. \n</p><p>General Availability (GCC, GCC High, DOD): We will begin rolling out mid-October 2025 and expect to complete by late October 2025. \n</p><p><b>How this will affect your organization:</b> \n</p><p>This feature is currently supported for major workloads: Microsoft Exchange Online, Microsoft Teams, Microsoft SharePoint, Microsoft OneDrive, and Microsoft Endpoint. \n</p><p>With this rollout, we will also introduce a new field called <code>DisplayName </code>that you can edit in DLP and in Microsoft PowerShell. For all practical purposes the display name can be used as the name for all the operations. \n</p><p>Renaming an existing policy:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/81d7fbb0-7918-4ee9-985a-709b615cf0af\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Editing a rule to rename it:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9902221d-09fc-4cc1-a81e-fc9c7a43ec16\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>All DLP experiences (such as Incident Reports, User Notifications, Email Alerts, DLP Alerts, MTP Alerts, and Activity Explorer) will start showing the policy/rule names at the point of record generation. For example: If a policy is named P1 at T0 and updated to P2 at T1, all records generated between T0 and T1 will have the name as P1 and all the records from T1 will have the name as P2.  </p><p>This feature will be available by default for admins to configure.</p><p><b>What you need to do to prepare:</b> \n</p><p>This is a non-invasive feature. The tenant admin will not see any changes unless the admin uses the feature.</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/dlp-create-deploy-policy?tabs=purview\" target=\"_blank\">Create and deploy a data loss prevention policy | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "370535"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview will soon allow DLP admins to rename existing policies and rules without recreating them. The feature will roll out in stages from July to October 2025 and will be supported across major workloads. A new editable field, DisplayName, will be introduced. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061103",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-24T00:54:12.837Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T00:53:35Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Ability to rename policy and rules",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
