{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re updating Microsoft Secure Score improvement actions of Microsoft Defender for Identity to ensure a more accurate representation of security posture. This rollout includes new posture recommendations that will be added as Microsoft Secure Score improvement actions and recommendations:</p><ul><li>Install Defender for Identity Sensor on ADCS servers.</li><li>Install Defender for Identity Sensor on Entra Connect.&nbsp;</li><li>Install Defender for Identity Sensor on ADFS servers.</li><li>Change password for gMSA account.</li><li>Change password for sMSA account.&nbsp;</li></ul><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-March 2025 and expect to complete by mid-April 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late March 2025 and expect to complete by late April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>These new security posture reports will be available only if your tenant has a Defender for Identify sensor installed your identity infrastructure. </p><p>This update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. Your score will be updated accordingly.</p><p>Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p><p>Microsoft recommends reviewing the improvement actions listed in Microsoft Secure Score. We will continue to add suggested security improvement actions on an ongoing basis.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is updating Microsoft Secure Score improvement actions for Defender for Identity, adding new recommendations such as installing sensors on ADCS, Entra Connect, and ADFS servers, and changing gMSA and sMSA account passwords. The rollout starts in March 2025, with no admin action required. Review configurations and notify admins."
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1023484",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-21T20:14:02.577Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T01:10:29Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity: New recommendations for Microsoft Secure Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
