{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 5, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Purview | Data Loss Prevention (DLP): A new RBAC (role-based access control) role called Data Classification Content Download. When evidence collection is turned on from Endpoint DLP settings, this role lets admins download endpoint-related evidence files from activity explorer and DLP alerts in the Purview portal and Microsoft Defender XDR portal.\n</p><p>By default, the new role is available in these built-in role groups:\n</p><ul><li>Data Security Management\n</li><li>Information Protection\n</li><li>Information Protection Investigators\n</li></ul><p>To view the evidence, users can continue using the Data Classification Content Viewer role.\n</p><p>For more information on the roles and role groups in Microsoft Purview refer to <a href=\"https://learn.microsoft.com/defender-office-365/scc-permissions\" target=\"_blank\">Roles and role groups in Microsoft Defender for Office 365 and Microsoft Purview - Microsoft Defender for Office 365 | Microsoft Learn</a>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478660\" target=\"_blank\">478660</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 (previously late February) and expect to complete by late March 2025 (previously early March).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, DLP investigators who are assigned to any role group (custom or default) without the role Data Classification Content Download role will be unable to download the endpoint DLP evidence and will encounter the error message, “You need the role Data Classification Content Download to download the evidence\":\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4291400e-6d08-4cec-8ce6-c205b733c0c6\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>We understand the significance of secure data management, and this new role is designed to enhance security. If a user encounters the error message, admins can deploy one of these options from <a href=\"https://learn.microsoft.com/purview/purview-compliance-portal-permissions\" target=\"_blank\">Permissions in the Microsoft Purview compliance portal | Microsoft Learn</a>:\n</p><ul><li>Existing user in built-in role group: Add the role Data Classification Content Download to the built-in role group using the steps in <a href=\"https://learn.microsoft.com/purview/purview-compliance-portal-permissions#add-users-or-groups-to-a-microsoft-purview-built-in-role-group\" target=\"_blank\">Add users or groups to a Microsoft Purview built-in role group</a>.\n</li><li>Existing user in custom role group: Add the role Data Classification Content Download to the built-in role group using the steps in <a href=\"https://learn.microsoft.com/purview/purview-compliance-portal-permissions#update-a-custom-microsoft-purview-role-group\" target=\"_blank\">Update a custom Microsoft Purview role group</a>.\n</li><li>New user: Add the user to an existing role group with the role Data Classification Content Download or create a new custom role group using the steps in <a href=\"https://learn.microsoft.com/purview/purview-compliance-portal-permissions#create-a-custom-microsoft-purview-role-group\" target=\"_blank\">Create a custom Microsoft Purview role group</a>.\n</li></ul><p></p><p>This rollout will have no impact on previewing the evidence.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478660"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention (DLP) is introducing a new role, Data Classification Content Download, allowing admins to download endpoint-related evidence files. The rollout will occur from mid-March to late March 2025. Admins should review configurations and notify relevant personnel about this change. No action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1000267",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-05T16:20:10.74Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-07T23:02:19Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: New role for downloading original file evidence for Endpoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
