{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire the Android and iOS mobile apps for Microsoft Lists. We recommend users switch to the Microsoft Lists mobile browser experience, which offers more functionality and continues to be updated with latest improvements.</p><p><b>When this will happen:</b></p><ul><li>Late June 2025: An information banner will display in the app to inform users about the upcoming retirement of the app and recommend they switch to the mobile web experience.</li><li>Mid-September 2025: New users will not be able to install the mobile apps.</li><li>Mid-November 2025: The app will no longer be visible for new users to download from the Apple App Store or Google Play. Existing app users will get an error when opening the app. \n</li></ul><p><b>How this will affect your organization:</b></p><p>Users will no longer be able to install the apps or use installed apps after the retirement. </p><p>Existing user data and information will not be affected by this retirement and will continue to be available through either through Microsoft Lists for Windows desktop or the mobile browser. To access Lists in a mobile browser, users can go to their SharePoint root site, which is typically https://<b>organization-name</b>.sharepoint.com (for example, https://contoso.sharepoint.com) and then tap the Microsoft Suite navigation icon in the top left corner. If Lists is not in the list of apps, the user can select<i> More apps</i> from the bottom right corner and then tap Lists.</p><p><b>Left:</b> Lists in a mobile browser. <b>Right: </b>Accessing Lists on a mobile browser through SharePoint:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3f2ff085-12a8-4cc3-a734-8b83786299cc\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This change will happen automatically by the specified dates with no admin action required. Please notify your users about this change and recommend the suggested alternative.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/get-started-with-the-microsoft-lists-mobile-app-6abf88b7-4c91-4af2-87c5-8d94afe34623\" target=\"_blank\">Get started with the Microsoft Lists mobile app - Microsoft Support</a>&nbsp;(will be updated before retirement)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will retire the Microsoft Lists mobile apps for iOS and Android. Users should switch to the mobile browser experience. Key dates: information banner in late June 2025, app installation disabled mid-September 2025, and app removal mid-November 2025. Existing data remains accessible via desktop or mobile browser. No admin action required."
    }
  ],
  "EndDateTime": "2026-01-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1087635",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-03T22:54:32.907Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-03T22:54:13Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Lists: Mobile apps for iOS and Android will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
