{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 16, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Businesses using Google Workspace for email and calendaring can now enable bidirectional syncing with Microsoft Teams through the <a href=\"https://aka.ms/TeamsClientAdminApp\" target=\"_blank\">Admin app</a>&nbsp;in Teams. This improved sync ensures that events created in either platform are seamlessly reflected in both, reducing missed meetings and simplifying scheduling.</p><p>Previously, calendar forwarding only handled new incoming invites. The updated sync now supports all calendar invites, including incoming, outgoing, existing, and new events.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488093\" target=\"_blank\">488093</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Rollout will begin in late May 2025 (previously early May) and is expected to complete by late June 2025 (previously late May).</p><p><b>How this will affect your organization:</b></p><p>Administrators must proactively enable this feature; no automatic changes will be made to your environment.\n</p><p>This feature is being rolled out gradually. When the rollout is complete, you can sync up to 50,000 users per tenant. If you have previously set up calendar forwarding using this wizard, bidirectional sync is not yet available. Stay updated via your Microsoft admin center Message Center or the <a href=\"https://learn.microsoft.com/microsoftteams/setup-calendar-syncing-with-google-workspace\" target=\"_blank\">Set up calendar syncing between Google Workspace and Microsoft Teams for your small or medium business</a> support article.</p><p>The feature is rolling out gradually. If it’s not yet available and you haven’t previously set up calendar forwarding, check the <a href=\"https://aka.ms/TeamsClientAdminApp\" target=\"_blank\">Admin app</a>&nbsp; in Teams periodically.</p><p><b>What you need to do to prepare:</b>\n</p><p>Refer to the <a href=\"https://aka.ms/GoogleCalendarSyncSetup\" target=\"_blank\">Set up calendar syncing between Google Workspace and Microsoft Teams for your small or medium business</a>&nbsp;help article for setup instructions and additional support.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488093"
    },
    {
      "Name": "Summary",
      "Value": "Businesses using Google Workspace can now enable bidirectional calendar syncing with Microsoft Teams via the Admin app. This feature, rolling out from late May to late June 2025, supports all calendar events and requires proactive enablement by administrators. Up to 50,000 users per tenant can be synced."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1058265",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-16T15:37:37.957Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-19T00:01:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Bi-directional calendar syncing between Google Workspace and Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
