{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire Sway feature from the <i>Create </i>tab in the Microsoft 365 Copilot app starting March 24, 2025 and ending March 31, 2025 due to low usage. Instead, we recommend using Sway from the <i>Apps </i>section of the Microsoft 365 Copilot app.\n</p><p>This message applies to the Microsoft 365 Copilot app for Windows desktop and Microsoft 365 Copilot app for the web:</p><p>\n</p><p>Microsoft continues to strive to focus resources improving the most impactful apps and experiences. Even though Microsoft is not investing in improving the Sway product, the current capabilities of Sway remain fully supported and Office/Microsoft 365 users are encouraged to leverage the value that Sway offers.\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates your organization may be using Sway.\n</p><p>Users will no longer be able to use Sway from the <i>Create </i>tab after this retirement is implemented:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9eb5d82e-dc21-4dd0-981f-21ab4cfa60fe\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Users can create new Sways and maintain existing Sways from the Apps section of the Microsoft 365 Copilot app:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8e1d4fb1-9238-4ba5-9c1b-23c163ae0ae6\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://support.microsoft.com/sway\" target=\"_blank\">Sway help &amp; learning</a>\n</li><li><a href=\"https://support.microsoft.com/office/the-microsoft-365-app-transition-to-the-microsoft-365-copilot-app-22eac811-08d6-4df3-92dd-77f193e354a5\" target=\"_blank\">The Microsoft 365 app transition to the Microsoft 365 Copilot app - Microsoft Support</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Sway will be retired from the \"Create\" tab in the Microsoft 365 Copilot app between March 24 and March 31, 2025, due to low usage. Users can still access Sway from the \"Apps\" section. No admin action is required, but notifying users and updating documentation is recommended."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1013463",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-21T23:43:01.6Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-21T23:42:49Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft 365 Copilot app: Sway will retire from the \"Create\" tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
