{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 19, 2025: We have updated the timeline. Thank you for your patience.</p><p>Users will have the capability to open their core applications, such as Chat, Teams, and other essential apps, in separate windows by selecting <i>Open in new window</i>&nbsp;from the app's context menu. This latest update facilitates enhanced productivity and provides greater customization of the user's workflow. This improvement enables users to manage their core collaboration applications more efficiently, ultimately leading to a more streamlined and effective work environment.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=495003\" target=\"_blank\">495003.</a></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early November 2025 (previously early September) and expect to complete by mid-November 2025 (previously mid-September). \n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2025 (previously mid-September) and expect to complete by early December 2025 (previously early October).</p><p><b>How this will affect your organization:</b>\n</p><p>Your organization will now be able to open their core collaboration apps in its own window.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8e49dcbe-7689-4ac0-90dd-2daeaad975ae\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting November 2025, Microsoft Teams will allow users to pop out core apps like Chat and Teams into separate windows for improved productivity. The rollout requires no admin action, and organizations may update training accordingly. The update timeline was recently revised."
    }
  ],
  "EndDateTime": "2026-01-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-19T17:51:45.707Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-27T23:16:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Pop out your core apps into a new window.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
