{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to the Microsoft 365 admin center: Updates to the peer benchmark for the overall <i>Adoption Score</i> and <i>People experiences</i> category (excluding AI Adoption Score). The <i>People experiences</i> category helps organizations understand the adoption of features in Microsoft 365. Peer benchmarks in <i>Adoption Score</i> help you compare your organization’s progress towards digital transformation against peers in the same industry and region and of a similar size. Your peer benchmark represents the average score in your cohort, which includes at least 100 similar organizations and refreshes monthly.</p><p>Before this rollout, the benchmarking logic was based on tenant size.\n</p><p>After this rollout, the revised benchmarking logic will improve the accuracy and relevance of the benchmark metric by placing more emphasis on tenant size (based on your count of Microsoft 365 users), to help ensure your peer group primarily includes organizations of a similar size to yours.</p><p>This message is associated with MC1056262 / <i>AI adoption category in Adoption Score now generally available</i> (published April 2025)</p><p> \n</p><p><b>When will this happen:</b> \n</p><p>General Availability (Worldwide): We will begin rolling out late May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p>This change will be on by default. Your peer benchmark values for all people experiences categories may increase or decrease after this update rolls out.</p><p> \n</p><p>Peer benchmarks in a test tenant. The user interface is the same, but the algorithms are updated:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/24bef8d0-10da-401b-9ee9-fd59ebefec6b\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p></p><p><b>What you need to do to prepare:</b> \n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to update your relevant documentation.</p><p>Ensure that anyone in your organization who uses peer benchmarks in <i>Adoption Score </i>are aware of this update.</p><p>Learn more: The <i>Interpreting your organization's Adoption Score</i> section in <a href=\"https://learn.microsoft.com/microsoft-365/admin/adoption/adoption-score?view=o365-worldwide#interpreting-your-organizations-adoption-score\" target=\"_blank\">Microsoft Adoption Score - Microsoft 365 admin | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Updates to the peer benchmark in the Microsoft 365 admin center's Adoption Score and People experiences category will be rolled out in late May 2025. The new benchmarking logic will focus more on tenant size to improve accuracy. This change will be automatic and may affect your peer benchmark values."
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1081583",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-23T23:49:01.033Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-23T23:48:53Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Peer benchmark update in Adoption Score for Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
