{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 15, 2025: We have updated the timeline below. Thank you for your patience.</p><p>A new report for analysts in Advanced Insights will automatically scan for groups with unexpected or changing Copilot usage, as well as changes to collaboration.&nbsp;&nbsp;</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=408543\" target=\"_blank\">408543</a></p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-April 2024 and expect to complete by late May 2025 (previously late April).</p><p><b>How this will affect your organization:</b></p><ul><li>Analysts will see a new Copilot Headlines report in their Advanced Insights report template library.</li><li>Opening the report will give the analyst ranked insights about unexpected Copilot usage across groups based on the Organization attribute. Analysts can run a customized version of the report to use alternative attributes to define the groups. The report will also provide insights about other unexpected behavioral metric changes in these groups.</li><li>In addition to looking for large changes over time, the report looks for groups that are significantly different than “similar employees”. This leverages a new dynamic internal benchmark that uses role-based norms assessed over the company’s entire measured population to estimate an expected metric value for any group.</li></ul><p><b>What you need to do to prepare:</b></p><p>By default, this report will be enabled for all Insights Analyst users. Note that the dynamic internal benchmarks that are used to assess expected behavior are calculated based on the global partition of measured users, and as a result, analysts may be able to infer global role-based norms from these benchmarks. These global role-based norms are protected by a minimum group size of 25.</p><p>If for any reason you prefer that analysts in non-global partitions not have access to internal benchmarks, a global admin or Viva Insights admin can disable this report for all analysts in non-global partitions by using <a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Viva Insights Feature Access Management </a>(VFAM) to disable the feature. When the feature is disabled using VFAM, analysts in the global partition will still have access to the report, but analysts in non-global partitions will not.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408543"
    },
    {
      "Name": "Summary",
      "Value": "A new Copilot Headlines report in Advanced Insights will scan for unexpected or changing Copilot usage and collaboration changes. Public preview starts mid-April 2024, completing by late May 2025. Analysts will see ranked insights and can customize reports. Admins can manage access using Viva Insights Feature Access Management."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1048622",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-15T16:11:52.897Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T23:11:39Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Advanced Insights - Copilot Headlines Report",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
