{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Data Loss Prevention (DLP) will soon extend to preventing Microsoft 365 Copilot from processing emails with sensitivity labels. This feature will allow existing or new DLP policies to provide detection of sensitivity labels in emails as enterprise grounding data and restrict access of the labeled emails in Microsoft 365 Copilot chat experiences. This feature only works for emails sent on or after January 1, 2025.\n</p><p>The preview does not support alerts, audit records, and policy simulation.  \n</p><p>A Microsoft 365 Copilot license is NOT required to access this feature.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489221\" target=\"_blank\">489221</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early June 2025 and expect to complete by late June 2025.</p><p>General Availability (Worldwide): We will begin rolling out early August 2025 and expect to complete by late August 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Organizations with no existing DLP for Microsoft 365 Copilot policies are not impacted.</p><p> Customers with the required licenses will be able to go to the Microsoft Purview portal to create policies in the Data Loss Prevention solution.  Admins can also go to Data Security Posture Management for AI (DSPM for AI) to see recommendations for creating Microsoft 365 Copilot policies.</p><p>Admins should create a new DLP policy using the Copilot location to use this feature: </p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/caa2a36d-7c83-41a4-9f91-098b4f62b403\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This new feature will be available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. If your tenant already created DLP policies at the Copilot location, the policies will automatically extend to include emails without admin action.</p><p>You may want to notify your users or admins about this change and update your relevant documentation.</p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/purview/dlp-learn-about-dlp?view=o365-worldwide\" target=\"_blank\">Learn about data loss prevention | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/dlp-microsoft365-copilot-location-learn-about\" target=\"_blank\">Learn about the Microsoft 365 Copilot location (preview) | Microsoft Learn</a> for details about DLP for Microsoft 365 Copilot</li></ul><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489221"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention will soon prevent Microsoft 365 Copilot from processing emails with sensitivity labels, effective for emails sent on or after January 1, 2025. The public preview starts in June 2025, with general availability in August 2025. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1088731",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-05T23:44:24.02Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-05T23:44:05Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Restrict Microsoft 365 Copilot from processing emails with sensitivity labels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
