{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are retiring the \"Shared with us\" feature on SharePoint Teams sites, which provided a centralized view of files and folders shared with site members.&nbsp;</p><p><b>When this will happen:</b> </p><p>We will begin retirement early April 2025 and expect to complete by early May 2025.</p><p><b>Are there any recommended alternatives to the \"Shared with Us\" feature:</b> </p><p>While there is no direct replacement for this feature, users can leverage existing tools in OneDrive and SharePoint to manage shared content effectively:\n</p><ul><li>OneDrive \"Shared with me\": Users can view files and folders that have been shared with them in <i>OneDrive </i>&gt; <i>Shared </i>for&nbsp;a personalized view of shared content.</li><li>Microsoft Teams and email notifications: When files are shared via Teams or Outlook, users receive notifications and can access shared content directly from their Teams chat and email.\n</li></ul><p><b>What you need to do to prepare:</b> </p><p>No action is required, but we recommend informing your users about this change and guiding them on how to find shared content using the recommended alternatives above.</p><p>We understand that changes to features can impact workflows, and we appreciate your understanding as we focus on improving SharePoint’s overall experience.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Retiring the \"Shared with Us\" feature in SharePoint Teams sites will begin in April 2025 and complete by May 2025. Users can use OneDrive's \"Shared with me\" and Microsoft Teams or email notifications as alternatives. No action is required, but users should be informed about the change."
    }
  ],
  "EndDateTime": "2025-06-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1019986",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-28T18:26:24.293Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T18:26:04Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retiring \"Shared with Us\" Feature in SharePoint Teams sites",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
