{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are introducing an AI-enhanced pre-meeting card in Microsoft 365 Copilot for Sales to help you prepare for customer meetings with insights on opportunities, accounts, and past interactions. This feature will reach general availability on June 16, 2025. <br><br><b>How does this affect me?</b><br>Copilot for Sales streamlines meeting preparation by providing out-of-the-box AI-generated insights in a pre-meeting preparation card delivered via the Copilot for Sales bot or chat in Teams. With a pre-meeting preparation card, you’ll stay informed about key opportunities, past interactions, and strategic insights such as action items and key risks if any, to ensure you are fully prepared for every customer conversation. The preparation card includes:<ul><li><b>Meeting essentials:</b> Key details like title, time, participant acceptance status, and agenda.</li><li><b>Matched opportunity and account:</b> Automatically identifies and connects relevant CRM records as well as key attributes of the opportunity from CRM.</li><li><b>Recent communications:</b> Summarized insights from past customer interactions for the matched opportunity.</li><li><b>Strategic insights:</b> Identifies key risks, follow-up actions, and crucial discussion points from previous interactions.</li></ul><b>What action do I need to take?</b><br>This message is for awareness and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-07-16T21:13:26Z",
  "HasAttachments": false,
  "Id": "MC1096179",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-16T21:14:14.85Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-16T21:13:26Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft 365 Copilot for Sales - Get AI-powered insights with enhanced pre-meeting card",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
