{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Viva Insights: Leaders will be able to harness the power of Microsoft 365 Copilot in Viva Insights to explore team skills insights—powered by People Skills data. Leaders can use natural language prompts to ask Copilot questions about their organization’s skill distribution and receive dynamic visual reports in response.</p><p>A Microsoft 365 Copilot license or a Viva Insights subscription is required for the manager and their teams to query People Skills data in Viva Insights. Learn more: <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/environment-requirements\" target=\"_blank\">Environment requirements for Viva Insights | Microsoft Learn</a></p><p>This message applies to Viva Insights on Windows desktop, Viva Insights on the web, and Viva Insights on iOS/Android.\n</p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415453\" https:=\"\" www.microsoft.com=\"\" microsoft-365=\"\" roadmap?filters=\"&amp;searchterms=415453\">415453</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>These changes will be available by default.</p><p>After this rollout, group managers can access People Skills data for their teams in Microsoft 365 Copilot in Viva Insights. This capability builds on the existing leader experiences in Viva Insights, allowing managers to leverage organizational context attributes already available to them. Learn more: <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/org-insights-copilot\" target=\"_blank\">Discover organizational insights quickly with Microsoft 365 Copilot in Viva Insights | Microsoft Learn</a>&nbsp;(will be updated before rollout)</p><p>Benefits of this feature:</p><ul><li>Understand team skill distribution: Gain visibility into the skills present across your team.<ul><li>Example: “How many people on my team have AI-related skills?”\n</li></ul></li><li>Identify skill holders: Quickly find individuals with specific expertise.<ul><li>Example: “Who on my team has machine learning expertise?”\n</li></ul></li><li>Dynamic reporting: Each query generates real-time tailored reports to support informed decision-making.</li></ul><p>The new leader experience in the Viva Insights app, featuring a sample skills distribution query:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/bb70b372-de5a-44e6-8db4-209dbd2c4ca3\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>An example of a report that leaders can use to discover individuals on their team with specific skillsets:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8a22137d-1643-4a8e-a1e1-50bbe950db59\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>For a leader to access skills data in Viva Insights, take these steps after rollout:\n</p><ul><li>Set up People Skills and enable the People Skills data in Viva Insights. Learn more: <a href=\"https://learn.microsoft.com/viva/skills/skills-overview\" target=\"_blank\">Overview of People Skills | Microsoft Learn</a>\n</li><li>The Viva Insights admin must assign the group manager role to relevant leaders in your organization. You may have already done that. Learn more about the group manager role: <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/manager-settings\" target=\"_blank\">Configure manager settings | Microsoft Learn</a>\n</li><li>Ensure that the leader’s entire team has been assigned required licenses: <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/assign-licenses\" target=\"_blank\">Assign licenses | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/org-insights-copilot\" target=\"_blank\">Discover organizational insights quickly with Microsoft 365 Copilot in Viva Insights | Microsoft Learn</a> (will be updated before rollout)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "415453"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights will soon allow leaders to use Microsoft 365 Copilot to explore team skills insights via natural language prompts, generating dynamic visual reports. This feature requires a Microsoft 365 Copilot license or a Viva Insights subscription and will be available by default starting mid-June 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084639",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-28T22:47:39.217Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-28T22:47:29Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights: Skills insights for leaders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
