{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Purview | Data Loss Prevention: We are including Enterprise AI apps as a category in the new collection policies communicated in MC1068273 / <i>Microsoft Purview | Data Loss Prevention: New collection policies for scoping classifiers and activity tracking</i> (published May 2025). This category will empower admins to precisely control and optimize the signals and data collected across enterprise AI apps in Purview solutions, enable better compliance with local regulations, reduce noise from SITs and user activities that aren’t relevant to your organization to improve resource efficiency, and control ingestion of prompts and responses. The enterprise AI apps category includes ChatGPT Enterprise, apps built on Microsoft Azure AI services, and Microsoft Entra-connected AI apps.\n</p><p>An Azure subscription connected to Microsoft Purview and an E5 license are required to access this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=492623\" target=\"_blank\">492623</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by early June 2025.\n</p><p>We will update this message when the plan for General Availability is finalized.\n</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization has been utilizing the Purview ChatGPT Enterprise Data Map Connector to ingest OpenAI user prompts and responses into Purview, please be advised that it will cease to function unless you have a collection policy targeted at the Enterprise AI apps category with ingestion enabled. Learn more: <a href=\"https://learn.microsoft.com/purview/archive-chatgpt-interactions\" target=\"_blank\">Connect to and manage ChatGPT Enterprise AI interactions in Microsoft Purview (preview) | Microsoft Learn</a> (will be updated before rollout)</p><p>This feature will be available by default for admins to configure.\n</p><p>[What you need to do to prepare:\n</p><p>To prepare for this upcoming enhancement to the Purview portal, we recommend you:\n</p><ul><li>Review Microsoft Learn docs on collection policies and required prerequisites: <a href=\"https://learn.microsoft.com/purview/collection-policies-solution-overview\" target=\"_blank\">Collection Policies Solution Overview (preview) | Microsoft Learn</a>\n</li><li>Understand which capabilities that leverage collection policies will incur pay-as-you-go billing: <a href=\"https://azure.microsoft.com/pricing/details/purview/\" target=\"_blank\">Pricing - Microsoft Purview | Microsoft Learn</a>\n</li><li>Help inform other Purview admins whose signal collection would be scoped, including the solutions in this message.\n</li><li>This policy can be created with the one-click policy from DSPM for AI called <i>Secure interactions from enterprise AI apps</i> or in the <i>Collection policies</i> tab in the Data Loss Prevention solution.\n</li></ul><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/collection-policies-solution-overview\" target=\"_blank\">Collection Policies Solution Overview (preview) | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "492623"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention is introducing a new \"Enterprise AI apps\" category in collection policies, available in public preview from mid-May to early June 2025. This feature requires an Azure subscription and an E5 license. Organizations must update their policies to continue ingesting data from AI apps like ChatGPT Enterprise. Further details and preparation steps are provided in the message."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1072396",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-12T23:29:23.563Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-12T23:28:54Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: New “Enterprise AI apps” option in collection policies (Preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
