{
  "ActionRequiredByDateTime": "2025-04-14T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As previously communicated in MC867664<i> (Updated) Microsoft Viva Engage: Private unlisted groups in external networks will retire and be deleted in January 2025</i> (published August 20, 2024, updated February 2025), Microsoft Viva Engage is no longer supporting private unlisted communities (sometimes called \"secret groups\"). Retirement of these private unlisted communities is in progress. Users can no longer:</p><ul><li>Create private unlisted communities in external networks</li><li>Participate in private unlisted communities in external networks</li></ul><p><b>How this will affect your organization:</b></p><p>If your organization uses external networks and has not taken action to migrate away from private unlisted communities (groups) in external networks, then you will be affected by this deletion.\n</p><p><b>What you need to do to prepare:</b></p><p>After April 14, 2025, all underlying content, including messaging and files, will be permanently deleted. There will be no exceptions.</p><p>You can export your data by following instructions in <a href=\"https://learn.microsoft.com/viva/engage/eac-as-manage-data\" target=\"_blank\">Manage data in the Viva Engage admin center | Microsoft Learn</a>.\n</p><p><b>IMPORTANT:</b> The referenced documentation is the modern admin experience that is replacing the legacy admin experience. External networks are not yet using the modern Engage admin center, so you will need to go to the legacy Yammer network admin portal in each external network.\n</p><p>You can create a link to the legacy Yammer network admin portal by replacing REPLACE_WITH_EXTERNAL_NETWORK_PATH in https://www.yammer.com/REPLACE_WITH_EXTERNAL_NETWORK_PATH/admin/success with the path of your external network.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is retiring private unlisted communities in external networks by January 2025. Users can no longer create or participate in these communities. All content will be deleted after April 14, 2025. Organizations should export their data using the legacy Yammer network admin portal."
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1046150",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-02T00:44:01.357Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-02T00:43:37Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Viva Engage: Update on deletion of private unlisted communities in external networks",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
