{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We want to announce an update to the behavior of an existing tenant setting in Fabric that allows Fabric admins to enable SQL databases in their Fabric tenant. By making SQL databases in Fabric a default option, we aim to help organizations leverage its full potential from the start. This change aligns with our commitment to improving user experience and operational efficiency.</p><p>Although the infobox displays March 8, 2025 as the enablement date, the actual change will occur on March 28, 2025, providing additional time for tenant admins to review and make selections before the setting is enabled by default.</p><p><b>When this will happen:</b></p><p>February 28, 2025: The checkbox for enabling SQL databases in Fabric was made available to tenant admins.\n</p><p>March 28, 2025: Even though the infobox displays March 8th, the actual enablement will take effect for tenants that have not opted out on March 28th.\n</p><p><b>What you need to do to prepare:</b></p><p>1.Review and Decide on Settings:\n</p><ul><li>Enable SQL database in Fabric by Default: This setting is ON by default. Please review its implications and determine if it should remain enabled for your organization.\n</li></ul><p>2.Action for M365 and Fabric Admins:\n</p><ul><li>If no action is taken, SQL databases in Fabric will remain active for all users, with the default enablement occurring on March 28, 2025.\n</li><li>If your organization prefers not to have this setting enabled by default, tenant admins must manually turn OFF this setting before March 28, 2025.\n</li><li>We encourage you to assess these new settings and make any necessary changes to align with your organization’s compliance and data storage policies.\n</li></ul><p>If you have any questions or need further assistance, please do not hesitate to contact our support team.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SQL databases in Fabric will be enabled by default starting March 28, 2025, despite the infobox showing March 8, 2025. Tenant admins should review and decide on settings before this date. If no action is taken, the setting remains active. Contact support for further assistance."
    }
  ],
  "EndDateTime": "2025-04-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1034584",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-17T23:59:23.133Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-17T23:59:13Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Updates on default checkbox changes on tenant settings for SQL database in Fabric",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
