{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft OneDrive: The new <i>Export as PDF</i> feature provides a simple method for users to transform their files into PDF format. With one click, users can create a PDF version of their file, without having to leave their workflow.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by mid-June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users can access the <i>Export as PDF</i> command in the three-dot menu or the command bar for files and <a href=\"https://support.microsoft.com/office/create-a-new-shared-library-from-onedrive-for-work-or-school-345c8599-05d8-4bf8-9355-2b5cfabe04d0\" target=\"_blank\">shared libraries</a> in OneDrive. The following filetypes are supported: Word, Excel, PowerPoint. The Export as PDF command will only appear for supported file types.\n</p><p>When a file is exported as a PDF, the resulting document will be saved in the same parent folder as the original file. For shared files, the new PDF will be created in the root of the user's OneDrive, facilitating easy access and organization.  \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2a99dd74-e343-41ef-aa9c-9e6c20c989c4\" style=\"width: 250px;\" alt=\"user controls\">\n</p><p><i>Export as PDF</i> is only allowed for files with the appropriate sensitivity label and Information Rights Management (IRM) protection settings. To use this feature, users must have permission to download the file. If you attempt to use this feature for a file that you do not have permission to download, the operation will not succeed, and users will receive an error notification:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9e0e97f9-468e-4eea-8ef0-3452a9ad62d7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update your training materials and documentation to include information on the new Export as PDF command, as well as guidance on IRM protection settings that could impact feature availability.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft OneDrive will introduce the \"Export as PDF\" feature, allowing users to convert Word, Excel, and PowerPoint files to PDF starting mid-May 2025. The feature will be accessible via the three-dot menu or command bar and will require appropriate permissions and IRM settings. No admin action is needed for the rollout."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1074098",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-14T23:43:32.77Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-14T23:43:20Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: Export files as PDF",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
