{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 15, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Purview | Data Loss Prevention (DLP): We will introduce new inline protection capabilities for Microsoft Edge for Business that prevent data leakage for the various ways that users interact with sensitive data in the browser, including typing text directly into a web application or sending a prompt to a generative AI app. Inline protection is built natively into Edge for Business, meaning it can be enabled even without deploying Endpoint DLP, and the inline protection complements <a href=\"https://learn.microsoft.com/purview/dlp-configure-endpoint-settings?tabs=purview#sensitive-service-domain-groups\">existing Endpoint DLP protections</a> for uploading or pasting sensitive content to the browser. This capability will be available starting with several top consumer generative AI apps (ChatGPT, Google Gemini, and DeepSeek), and will expand to support a growing list of unmanaged apps over time.\n</p><p>Learn more in our blog: <a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/building-layered-protection-new-microsoft-purview-data-security-controls-for-the/4395071\" target=\"_blank\">Building layered protection: New Microsoft Purview data security controls for the browser &amp; network | Microsoft Community Hub</a>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486368\" target=\"_blank\">486368</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late May 2025 (previously early April) and expect to complete by early June 2025 (previously late April).\n</p><p>We will update this message when the plan for General Availability is finalized.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, admins can block prompts typed by users containing sensitive data, starting with ChatGPT, Google Gemini, and DeepSeek. Inline protection can also leverage Adaptive Protection policy conditions for activities in generative AI apps. This rollout enables data security admins to tailor the level of enforcement to the risk level of the user interacting with the data, minimizing disruption to day-to-day AI usage.\n</p><p>This change will be available by default for Admins to configure in Purview. Features aren't activated by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. We recommended informing Security admins and Edge admins at your organization about this change to DLP features. You may want to update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486368"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is introducing new inline protection controls for AI apps in Microsoft Edge for Business, starting with ChatGPT, Google Gemini, and DeepSeek. This feature, rolling out from late May to early June 2025, allows admins to block sensitive data prompts and tailor enforcement levels. No admin action is required before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1046161",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-15T19:12:18.9Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-02T00:50:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention:  New inline protection controls for AI apps in Microsoft Edge for Business",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
