{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 28, 2025: We have updated the timeline below. Thank you for your patience.</p><p>The \"Manage what attendees see\" feature in Microsoft Teams helps organizers deliver polished events more easily by simplifying the attendee view and keeping the focus on participants who have been brought on screen. We’re introducing a new enhancement that gives organizers and presenters even more control over when shared content becomes visible to attendees.</p><p>Currently, when a presenter shares content, it is automatically displayed for attendees. With this update, shared content will first appear in the Manage screen’s left panel alongside other presenters. An organizer or presenter must manually bring it on screen, providing greater control over the attendee experience and preventing unintended interruptions.<br></p><p>Once shared content is brought on screen, the presenter sharing it will now see their content displayed instead of a text message indicating they are sharing.<br></p><p>Additionally, organizers and presenters joining from mobile will only see participants or content that has been brought on screen. Previously, users would see all organizers and presenters on their mobile devices.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/09ece2e5-3672-44e8-b0eb-0315d6e1108b\" style=\"width: 500px;\"><br></p><p>Limitations:</p><ul><li>Users joining through older Teams versions will continue to see the existing behavior, where shared content is automatically brought on screen.</li><li>PowerPoint Live will automatically be brought on screen and will not appear in the Manage screen panel.</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483486\" target=\"_blank\">483486</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early April 2025 and expect to complete by mid-April 2025.</p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by mid-May 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Any new meetings or events created or updated after mid-April 2025 will receive the new improvements to the \"Manage what attendees see\" feature by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.<br><br>We recommend you review <a href=\"https://support.microsoft.com/office/manage-what-attendees-see-in-teams-meetings-19bfd690-8122-49f4-bc04-c2c5f69b4e16\" target=\"_blank\">Manage what attendees see in Teams meetings</a> for a comprehensive overview of the feature and conduct a test session with the feature turned on to get acquainted with the new controls.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483486"
    },
    {
      "Name": "Summary",
      "Value": "The \"Manage what attendees see\" feature in Microsoft Teams is being updated to give organizers and presenters more control over when shared content becomes visible to attendees, preventing unintended interruptions. This update will roll out in April 2025 for Targeted Release and in May 2025 for General Availability. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-06-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1035709",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-28T18:58:26.707Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T00:18:14Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Control when shared content is visible to attendees in \"Manage what attendees see\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
