{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re excited to announce the upcoming launch of centralized admin role management in the Microsoft Viva Engage admin center. This new experience simplifies how Engage admins, verified admins, network admins and corporate communicator roles are assigned and managed. This rollout is part of our <a href=\"https://techcommunity.microsoft.com/blog/Viva_Engage_Blog/embracing-a-fully-modern-viva-engage-experience/4403008\" target=\"_blank\">modernization effort to phase out the legacy Microsoft Yammer admin center</a>. Overall, we are bringing greater consistency, usability and aligning our Engage admin experience to the broader M365 ecosystem.</p><p>This message applies Engage on the web, the Engage app in Teams for Windows desktop, and the Engage app in Teams for the web.</p><p> \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479407\" target=\"_blank\">479407</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, you can find the new experience in the Engage admin center at <i>Setup &amp; Configuration &gt; Admin role management.</i></p><ul><li>Admins will no longer need to navigate legacy Yammer experiences for role assignments.\n</li><li>All admin role management tasks—assigning, updating, and removing admin roles—can now be performed in the Engage admin center.\n</li><li>The new experience is modernized to provide better visibility into admin permissions and to support governance needs.\n</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/bab64cf8-0e04-4dec-a770-2bb5982c015e\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/aafe1f16-51d0-46ea-a87e-b150ee776fd2\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>The new experience will be on by default.</p><p><b>What you need to do to prepare:</b></p><p>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization.\n</p><p>Review your current admin role assignment processes and documentation.\n</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/Viva_Engage_Blog/embracing-a-fully-modern-viva-engage-experience/4403008\" target=\"_blank\">Embracing a Fully Modern Viva Engage Experience | Microsoft Community Hub</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479407"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is launching centralized admin role management in mid-May 2025, simplifying role assignments and management. This update, part of phasing out the legacy Yammer admin center, will enhance visibility and governance. The new experience will be available in the Engage admin center and will be on by default. No prior admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1072230",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-12T19:24:28.317Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-12T19:24:14Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Centralized admin role management from the Engage admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
