{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 22, 2025: We have updated the content. Thank you for your patience.\n</p><p>This message replaces MC1024398<i> (Updated) Microsoft 365 apps: We will prompt users to back up their files in Microsoft OneDrive</i> (published March 2025, updated March 2025) and includes additional details. Please refer to this new post going forward:</p><p>Coming soon: Eligible users will be prompted in the Message Bar below the toolbar in Microsoft Word, Microsoft Excel, and Microsoft PowerPoint for Windows desktops to enroll in <a href=\"https://learn.microsoft.com/sharepoint/redirect-known-folders\" target=\"_blank\">OneDrive Known Folder Move (KFM).</a> Users will be able to select the folders to back up in Microsoft OneDrive.\n</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-April 2025 and expect to complete by late April 2025. \n</p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by mid-June 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization still has users who are not enrolled in KFM, the message \"BACK UP THIS DOCUMENT: Share and work with others in this and other files using OneDrive\" will encourage them to do it while using familiar desktop apps. After users select the Open OneDrive button, they can select the folders they want to back up in OneDrive:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ca81daa5-b315-416d-966e-bed4ff8723ea\" style=\"width: 400px;\" alt=\"user message\">\n</p><p>When users are enrolled in KFM, the files in their enrolled folder benefit from the advantages of cloud files:\n</p><ul><li>Increased security and compliance: Enterprises can increase security and compliance, because all cloud files are subject to default classification, labeling, and protection (CLP) policies and auto-labeling. \n</li><li>Copilot support: Files are Copilot-enabled, making it simple and intuitive to access and leverage Copilot. (A Microsoft 365 Copilot license or a Microsoft 365 license is required to use Copilot.)</li><li>Easy collaboration: Cloud files enable sharing, commenting, and easy collaboration, with AutoSave ensuring changes are frequently and consistently saved. \n</li><li>Access from anywhere: Cloud files can be accessed from Windows, Mac, the web, iOS, and Android with synchronized changes. \n</li><li>Backup: Protection from data loss due to device failure. \n</li><li>Access to cloud-specific features like AutoSave and Version History</li></ul><p>After enrolling, users can access their files in the known folders in File Explorer or OneDrive. \n</p><p>No action required. The feature will be enabled automatically for eligible users. If KFM is blocked in your organization, the message will not be displayed. \n</p><p>If an organization has blocked KFM, we will honor that and not display the message to the organization's users.\n</p><p>This Message Bar will not appear if:\n</p><ul><li>The user is already enrolled in KFM\n</li><li>The user doesn’t have OneDrive provisioned, installed, and running\n</li><li>The existing policy to block KFM Wizard (<a href=\"https://learn.microsoft.com/sharepoint/use-group-policy#prevent-users-from-moving-their-windows-known-folders-to-onedrive\" target=\"_blank\">Prevent users from moving their Windows known folders to OneDrive</a>) is enabled and deployed\n</li><li>The new policy <i>Restrict KFM from Office</i> is enabled and deployed\n</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration and notify users about the change, explaining the benefits of OneDrive and the sync process. Consider updating any relevant documentation.\n</p><p>Based on your feedback, we created a new policy called <i>Restrict KFM from Office. </i>When this new policy is enabled and deployed, Office apps won’t show the Message Bar regardless of user eligibility. This policy is scoped only to Office apps and does not affect other OneDrive or KFM settings. This policy is available now in the <a href=\"https://www.microsoft.com/download/details.aspx?id=49030\" target=\"_blank\">Administrative Template files for Microsoft Office</a> (version 5497.1000 or newer).\n</p><p>If you don’t want the message prompting users to back up their files to display to users in your organization, you can enable and deploy the <i>Restrict KFM from Office</i> policy.</p><p>How to deploy this policy:\n</p><p>If you use  Active Directory, Microsoft Entra or hybrid environments,  you can use <b>Group Policy Objects</b>. Group policy can represent policy settings in the file system or in Active Directory Domain Services. When used with Active Directory, Group Policy settings are contained in a Group Policy Object (GPO). (<a href=\"https://learn.microsoft.com/windows-server/identity/ad-ds/manage/group-policy/group-policy-overview\" target=\"_blank\">Group Policy overview for Windows | Microsoft Learn</a>; <a href=\"https://learn.microsoft.com/entra/identity/domain-services/manage-group-policy\" target=\"_blank\">Create and manage group policy in Microsoft Entra Domain Services - Microsoft Entra ID | Microsoft Learn</a>)\n</p><p>You can also use  <b>Cloud Policy Service</b>: <a href=\"https://config.office.com/officeSettings/officePolicies\" target=\"_blank\">Cloud Policy service for Microsoft 365</a> lets you enforce policy settings for Microsoft 365 Apps for enterprise on a user's device, even if the device isn't domain joined or otherwise managed. When a user signs into Microsoft 365 Apps for enterprise on a device, the policy settings roam to that device. (<a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Microsoft 365 Apps | Microsoft Learn</a>)</p><p>For more details on how to deploy his policy visit <a href=\"https://learn.microsoft.com/sharepoint/restrict-known-folder-move-office-group-policy\" target=\"_blank\">Deploy Restrict Known Folder Move from Office Group Policy - SharePoint in Microsoft 365 | Microsoft Learn</a></p><p>\n</p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/sharepoint/redirect-known-folders\" target=\"_blank\">Redirect and move Windows known folders to OneDrive - SharePoint in Microsoft 365 | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/sharepoint/use-group-policy#prevent-users-from-moving-their-windows-known-folders-to-onedrive\" target=\"_blank\">IT Admins - Use OneDrive policies to control sync settings - SharePoint in Microsoft 365 | Microsoft Learn</a>\n</li><li><a href=\"https://www.microsoft.com/download/details.aspx?id=49030\" target=\"_blank\">Download Administrative Template Files (ADMX/ADML) for Microsoft Office</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Microsoft 365 Apps | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/windows-server/identity/ad-ds/manage/group-policy/group-policy-overview\" target=\"_blank\">Group Policy overview for Windows | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/entra/identity/domain-services/manage-group-policy\" target=\"_blank\">Create and manage group policy in Microsoft Entra Domain Services - Microsoft Entra ID | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/sharepoint/restrict-known-folder-move-office-group-policy\" target=\"_blank\">Deploy Restrict Known Folder Move from Office Group Policy - SharePoint in Microsoft 365 | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Eligible Microsoft 365 users will be prompted to back up files to OneDrive via the Message Bar in Word, Excel, and PowerPoint. The rollout starts in mid-April 2025 for Public Preview and early May 2025 for General Availability. Organizations can use new policies to manage these prompts. No action is required for the rollout."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1053121",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-22T22:01:42.797Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-11T05:36:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 apps: We will prompt users to back up their files in Microsoft OneDrive (new info)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
