{
  "ActionRequiredByDateTime": "2025-08-31T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce the General Availability of the new Message Trace in the Microsoft Exchange admin center (EAC) in Microsoft Exchange Online. This new experience, previously in Public Preview, offers improved performance, modern design, and enhanced feature parity. Admins can access it via Exchange admin center &gt; <i>Mail flow &gt; Message Trace.</i></p><p>The GA release is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=495489\" target=\"_blank\">495489</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by late July 2025.</p><p>Retirement of legacy Message Trace begins September 1, 2025. </p><p><b>How this will affect your organization:</b></p><ul><li>Like in Public Preview, the new Message Trace UX in EAC will be available by default and Microsoft PowerShell cmdlets (<code>Get-MessageTraceV2</code>, <code>Get-MessageTraceDetailV2</code>) will be available. </li><li>The legacy Message Trace experience and cmdlets (<code>Get-MessageTrace</code>, <code>Get-MessageTraceDetail</code>) will remain available in parallel for several months to support the transition.\n</li><li>Starting September 1, 2025, the following will begin deprecating:\n<ul><li>Legacy Message Trace UI in EAC.\n</li><li>Legacy cmdlets (<code>Get-MessageTrace</code>, <code>Get-MessageTraceDetail</code>).\n</li><li>Reporting Web Service support for Message Trace data</li></ul></li></ul><p><b>What you need to do to prepare:</b></p><p>This GA rollout and retirement will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your admins and/or users about this change and update internal documentation.</p><ul><li>Begin using the new Message Trace experience in the Exchange admin center.\n</li><li>Update any automation or scripts using legacy cmdlets to use the new versions by August 31, 2025.\n</li><li>If you rely on the Reporting Web Service for Message Trace data, migrate to the new PowerShell cmdlets by August 31, 2025.\n</li><li>To provide feedback on the new Message Trace, use Exchange admin center &gt; Give Feedback.</li></ul><p>Learn more about the GA rollout: <a href=\"https://techcommunity.microsoft.com/blog/exchange/announcing-general-availability-ga-of-the-new-message-trace-in-exchange-online/4420243\" target=\"_blank\">Announcing General Availability (GA) of the New Message Trace in Exchange Online | Microsoft Community Hub</a> (documentation will be linked to this blog before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "495489"
    },
    {
      "Name": "Summary",
      "Value": "The new Message Trace in Microsoft Exchange Online will be generally available from mid-June to late July 2025, with the legacy Message Trace retiring on September 1, 2025. Admins should transition to the new experience and update scripts using new cmdlets by August 31, 2025. No immediate admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1092458",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-11T23:29:29.097Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-11T23:29:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Exchange Online: New Message Trace will be GA; legacy Message Trace will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
