{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re making it easier for admins to manage GDPR data subject requests in Microsoft Viva Engage.\n</p><p>The <i>Remove User</i> feature—previously available in the legacy Microsoft Yammer admin center—is being renamed and relocated to the Microsoft Engage admin center. After this rollout, the feature will be called <i>Manage GDPR data subject requests</i> and will continue to support GDPR compliance by allowing verified admins and network admins to fulfill data subject requests directly from the new location.</p><p>This change applies to Engage on the web and Engage in Microsoft Teams (on Windows desktop, on Mac desktop, and on the web)</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by late July 2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout:</p><ul><li>You can find the feature in the Engage admin center under <i>Governance &amp; Compliance &gt; Data management.</i></li><li>The experience remains functionally the same but will be part of a modernized interface aligned with the broader Microsoft 365 ecosystem.\n</li><li>The card previously labeled <i>Data Export</i> will be called <i>Data management</i> to reflect its dual purpose of exporting data and managing GDPR requests.\n</li><li>Admins will no longer need to use the legacy Yammer admin center for GDPR data subject requests.\n</li><li>The new experience improves visibility into admin permissions and supports governance needs.</li><li><b>Important: </b>This feature is intended only for GDPR data subject requests. To remove a user’s access to Engage, use Microsoft Entra.</li></ul><p>Manage GDPR requests in the Engage admin center <i>&gt; Governance &amp; Compliance &gt; Data management &gt; Manage GDPR data subject requests:</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a6962573-1c43-4850-b5c1-72fce2a1070e\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to update internal documentation.</p><p>Ensure your admins who perform GDPR data subject requests are aware of this more convenient location.\n</p><p><i>Learn more</i></p><ul><li>The <a href=\"https://learn.microsoft.com/viva/engage/manage-viva-engage-users/add-block-or-remove-users#remove-users\" target=\"_blank\">Removing users</a><a href=\"https://learn.microsoft.com/viva/engage/manage-viva-engage-users/add-block-or-remove-users#remove-users\" target=\"_blank\"></a> section in <a href=\"https://learn.microsoft.com/viva/engage/manage-viva-engage-users/add-block-or-remove-users\" target=\"_blank\">Add, block, or remove Viva Engage users | Microsoft Learn</a> (will be updated before rollout)</li><li><a href=\"https://learn.microsoft.com/viva/engage/manage-viva-engage-users/manage-users-across-their-lifecycle\" target=\"_blank\">Manage Viva Engage users across their lifecycle from Microsoft 365 | Microsoft Learn</a> (will be updated before rollout)</li></ul><p><b>Compliance considerations:</b></p><ul><li>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights)? Yes, admins can now perform GDPR requests from the Engage admin center. </li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins can now manage GDPR data subject requests directly in the Microsoft Viva Engage admin center, with the feature renamed from \"Remove User\" to \"Manage GDPR data subject requests.\" This change will be rolled out from late June 2025 to late July 2025, affecting both the web and Teams platforms. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1092456",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-11T23:29:00.84Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-11T23:28:50Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Manage GDPR requests through the Engage admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
