{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Pulse: Organizations will be able to provide their employees with customized internal usage guidelines for all survey authors and respondents (according to your company policies), in addition to existing default Pulse privacy guidance. \n</p><p>This message applies to Pulse for Windows desktop, Pulse for Mac desktop, Pulse on the web, and Pulse for iOS/Android.\n</p><p>Viva Pulse is available for users with a license for Microsoft Viva Suite, Viva Workplace Analytics and Employee Feedback, or for tenants who are using a Pulse admin-led trial. Users with a Microsoft 365 Copilot license may also be able to access Viva Pulse, if admins have enabled access using their Copilot subscription.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=488105\" target=\"_blank\">488105</a>. \n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out late April 2025 and expect to complete by mid-May 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Before this rollout: Pulse authors and responders can view the default privacy guidelines provided by Pulse. Organizations do not have a way to show users their own internal usage guidelines for using Pulse. \n</p><p>After this rollout: Your organization's Pulse admin or global admin can add a customized organizational message (with an optional link) that will be shown to Pulse authors and responders.</p><p>Your organization's Pulse admin or global admin can configure the message and link for the usage guidelines in the Pulse admin experience at <i>Manage &gt; Privacy &gt; Customized organizational message</i>:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c1b61794-2fb5-40da-a59a-ff4ee6e9d1fc\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Pulse author view of the customized usage guidelines:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/84c0a4a9-3640-46b6-9bf1-f2ea2ad9f567\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Pulse responder view of the customized usage guidelines:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c9b8fe35-0be3-450a-93b2-743c62fe1615\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Pulse admin or global admin can configure the usage guidelines in the Pulse admin experience. Learn more: <a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/set-up-in-app-pulse-experience#customize-your-organizations-policy-statement\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Customize your organization’s policy statement</a> in <a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/set-up-in-app-pulse-experience\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Set up the in-app Viva Pulse experience | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488105"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse will soon allow organizations to customize and display internal usage guidelines for survey authors and respondents. This feature will be available across various platforms and is expected to roll out from late April to mid-May 2025. Admins can configure these guidelines in the Pulse admin experience."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060460",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T03:24:19.383Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T03:24:09Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: Customize and display your internal usage guidelines for authors and responders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
