{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 17, 2025: We have updated the content. Thank you for your patience.</p><p>Coming soon for Microsoft OneNote: The new <i>OneNote (Desktop) - Protected</i> virtual printer will roll out to all OneNote Windows desktop app users on x86 (32-bit) and x64 (64-bit) devices. We will automatically install the protected printer on all eligible devices (starting with Current Channel) with OneNote Windows app versions 2410 and later and devices running Windows 11 versions 26100 or higher. As a tenant admin, to ensure the successful installation of this printer on your organization's devices, you must configure specific group policies.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=402540\" target=\"_blank\">402540</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late February 2025 and expect to complete by early April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p></p><p>Why is Microsoft introducing this new printer when we already have a <i>OneNote (Desktop)</i> printer for the OneNote Windows app?\n</p><ul></ul><p></p><ul><li>Since October 2024, as a part of the new Modern Print platform, Windows has introduced a secure printing capability called Windows Protected Printing (WPP), which, when turned On, will uninstall and remove all non-IPP-based (Internet Printing Protocol) printers from independent hardware vendors (IHVs) and independent software vendors (ISVs) from the list of available printers, including the <i>OneNote (Desktop)</i> printer. To prevent feature issues for users of the <i>OneNote (Desktop)</i> printer, we're introducing the new protected virtual printer, which is based on Microsoft's IPP class driver and is compatible with WPP. Learn more about WPP and the Modern Print platform: <a href=\"https://support.microsoft.com/windows/modern-print-platform-4f59fa38-3419-41c7-a6a7-8ca4e21f70bc\" target=\"_blank\">Modern Print Platform - Microsoft Support</a></li></ul><p>Our organization has many regular users of the <i>Print to OneNote</i> capability using the existing <i>OneNote (Desktop)</i> printer. Should they expect any changes to their workflow?\n</p><ul></ul><p></p><ul><li>No. Like the existing <i>OneNote (Desktop)</i> printer, when users try to print a page, the new virtual printer will display in the list of printers as <i>OneNote (Desktop) - Protected</i> (refer to the screenshot in <a href=\"https://support.microsoft.com/office/print-documents-and-files-to-onenote-3b6048a9-cd98-46b8-a121-87dfe861e977\" target=\"_blank\" style=\"\">Print documents and files to OneNote - Microsoft Support</a>). Users can switch to the printer of their choice to print to OneNote. Please note that with WPP on, only the protected virtual printer will be available for printing because the existing non-IPP based printers will be uninstalled. Learn more about WPP and eligible printers: <a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/a-new-modern-and-secure-print-experience-from-windows/4002645\" target=\"_blank\">A new, modern, and secure print experience from Windows | Microsoft Community Hub</a>\n</li></ul><p>What happens to the old <i>OneNote (Desktop)</i> printer already installed on user’s devices?\n</p><ul></ul><p></p><ul><li>On the target Windows 11 builds (&gt;26100.0000) with WPP, turning WPP On will automatically uninstall the existing <i>OneNote (Desktop)</i> printer (because it is based on the v4 printer driver). When WPP is Off, the <i>OneNote (Desktop)</i> printer will continue to exist with the new protected printer on user devices when they upgrade to the target OneNote builds.\n</li></ul><p>Can users of the OneNote app turn off <span style=\"background-color: rgb(255, 255, 0);\">or </span>uninstall the new printer?\n</p><ul></ul><p></p><ul><li>Yes, if they have permission to uninstall apps on their device. The new protected virtual printer will be installed as a <a href=\"https://learn.microsoft.com/windows-hardware/drivers/devapps/print-support-app-design-guide\">Print Support App (PSA)</a> and can be completely uninstalled from the list of programs <span style=\"background-color: rgb(255, 255, 0);\">in their Windows </span><i>Settings &gt; Apps &gt; Installed apps</i>. The new printer can be seen installed as a separate app called <i>OneNote (Desktop) - Protected Virtual Printer</i>. <b>NOTE:</b> With WPP on, uninstalling the new protected virtual printer will break the <i>Print to OneNote</i> experience. To <span style=\"background-color: rgb(255, 255, 0);\">restore </span>the protected printer, users will need to uninstall and then reinstall the OneNote app. Users should ensure their notes are synced before uninstalling to avoid losing unsynchronized changes.\n</li></ul><p></p>This change will be available by default.\n<p></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>As an admin, how can you ensure all eligible devices in your organization get the new printer installed without issues?\n</p><ul><li>The <i>OneNote (Desktop) - Protected</i> virtual printer will be installed by default (starting with Current Channel) in all OneNote Windows app versions 2410 and later running Windows 11 versions 26100 or higher.\n</li><li>Please ensure that the group policy <code>AllowAllTrustedApps</code> is set to <code>Enabled</code> and the group policy <code>BlockNonAdminUserInstall</code> is set to <code>Disabled</code>. These settings are required to complete installation of the new virtual printer on your device. Learn more about other policy settings and registry keys that could prevent installation of this printer: <a href=\"https://learn.microsoft.com/windows/msix/group-policy-msix\" target=\"_blank\">How Group Policy works with packaged apps - MSIX | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "402540"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing a new \"OneNote (Desktop) - Protected\" virtual printer for OneNote Windows desktop app users, compatible with Windows Protected Printing (WPP). This will roll out from late February to early April 2025. Admins must configure specific group policies to ensure successful installation. Existing workflows will remain unchanged."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-06-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1020207",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-17T19:44:43.27Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T22:13:30Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneNote Windows app: New \"OneNote (Desktop) - Protected\" virtual printer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
