{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To improve meeting clarity and reduce confusion caused by connectivity issues, we’re adding a new Network Strength Indicator.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=414513\" target=\"_blank\">414513</a>\n</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early July 2025 and expect to complete by late July 2025.</p><p>General Availability (Worldwide, GCC): We will begin rolling out early August 2025 and expect to complete by early September 2025.</p><p><b>How this will affect your organization:</b></p><p>This feature will display your current network quality using a simple 3-bar system: Good (3 bars), Poor (2 bars), and Bad (1 bar). When your connection is limited, we’ll suggest actions to help conserve bandwidth and maintain meeting performance. You’ll also be able to see when other participants are experiencing poor or bad network conditions, providing better context for disruptions in the meeting.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/64a9f6ca-fcb6-4526-92a9-96d6bb0595d8\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "414513"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a Network Strength Indicator to improve meeting clarity by showing network quality with a 3-bar system. Rollout starts in July 2025 for Targeted Release and August 2025 for General Availability. Update your training and documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1077865",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-19T23:45:36.15Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-19T23:45:28Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Introducing the Network Strength Indicator",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
