{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 7, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Currently, SharePoint eSignature includes the capability to request eSignatures from a PDF using Microsoft’s native eSignature service.  With this update, users will also be able to create eSignature requests from Microsoft Word documents without the need to create a PDF.</p><p>The rollout may take several weeks for some regions. Check the regional availability <a href=\"https://learn.microsoft.com/microsoft-365/syntex/esignature-overview#regional-availability\" target=\"_blank\">here</a>.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486707\" target=\"_blank\">486707</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out in late May 2025 and expect to complete by late August 2025 (previously late July).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Microsoft Word users on the Microsoft 365 Beta and Current Channels will have the capability to request eSignatures from Word documents stored in sites that have been enabled with SharePoint’s native eSignature service.\n</p><p>The capability can be invoked from the Word Desktop Insert ribbon.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1accf3df-b0d1-40cd-a8f5-c9a64977251b\" style=\"width: 650px;\"><br></p><p>\n</p><p>When requesting eSignatures from Word, signers will sign a PDF copy of the Word document. \n</p><ul><li>The PDF is automatically created, and a link is shared with signers.  \n</li><li>Signers do not access the source Word document during the signing process. \n</li><li>Signer information, such as an email address, is not stored in the Word document. \n</li><li>When signing is complete, the signed PDF will be saved in the same location as the Word document. \n</li><li>The PDF document never leaves your Microsoft 365 Trust Boundary during the signing process. \n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This capability is only available to users if the native SharePoint eSignature service is enabled and a group policy is applied. \n</p><ol><li>Enable SharePoint's native eSignature service: <a href=\"https://learn.microsoft.com/microsoft-365/syntex/esignature-overview\" target=\"_blank\">Overview of SharePoint eSignature</a>.</li><li>When this rollout is available:</li></ol><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; •&nbsp;&nbsp;Ensure the Word option is toggled On for your tenant in the Microsoft admin center.</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; •&nbsp; Apply the Group Policy Allow the use of SharePoint eSignature for Microsoft Word&nbsp;to enable Word users to access the feature.</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; •&nbsp; The policy can be acquired and deployed via the standard methods of the Cloud Policy Service, Microsoft Intune, and Group Policy Manager.    \n</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 3. Inform users of the new eSignature experience available in Word.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486707"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint Online now supports requesting eSignatures directly from Word documents without converting to PDF first. Rolling out globally from late May to August 2025, users must enable SharePoint’s native eSignature service and apply a group policy to access this feature via the Word Desktop Insert ribbon."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1059671",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-07T13:44:20.213Z",
  "Services": [
    "SharePoint Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-21T23:41:22Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint Online eSignature for Microsoft Word",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
