{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 6, 2025: We have updated the timeline below. Thank you for your patience.</p><p>The Microsoft 365 Copilot Chat usage report in the Microsoft 365 admin center helps you understand the usage and adoption of Microsoft 365 Copilot Chat for Microsoft 365 Copilot unlicensed users in your organization.  With this improvement, you can now view Copilot Chat active users and last activity date by additional apps including Copilot.cloud.microsoft, Microsoft Teams, and Outlook.</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early May 2025 (previously late April) and expect to complete by mid-May 2025 (previously March 2025).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>In Reports -&gt; Usage -&gt; Microsoft 365 Copilot Chat in the Microsoft 365 admin center, new metrics are added: </p><p>Active users breakdown by Copilot.microsoft.com, Teams and Outlook</p><p>Individually record last activity date (UTC) on Copilot.microsoft.com, Teams, Outlook, Microsoft 365 Copilot (app), and Microsoft Edge for user level table&nbsp;</p><p>[What you need to do to prepare:</p><p>If you use Microsoft 365 Copilot Chat usage report in the Microsoft 365 admin center as the basis for your own custom report (i.e. by exporting information and incorporating it into a Power BI report), consider adding those new metrics for enhancement.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Additional metrics for Copilot Chat in the Microsoft 365 admin center report now include active users and last activity dates by app (Copilot.cloud.microsoft, Teams, Outlook). Rollout starts early May 2025 and completes mid-May 2025. Update custom reports to include these new metrics."
    }
  ],
  "EndDateTime": "2025-07-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060462",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-06T20:45:05.14Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T03:24:44Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Additional breakdown metrics by app for Copilot Chat in the Microsoft 365 Copilot Chat standalone report",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
