{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 15, 2025: We have updated the rollout timelines below. Thank you for your patience.</p><p>In November 2025, we will expand the passkey (FIDO2) authentication methods policy in Microsoft Entra ID to support passkey profiles in public preview. This update will enable granular, group-based control over passkey configurations and introduce new API schema changes.</p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide): We will begin rolling out early November 2025 and expect to complete by early December 2025.\n</p><p>Public Preview (GCC, GCC High, DoD): We will begin rolling out mid-November 2025 and expect to complete by mid-December 2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, you'll be able to apply different passkey configurations per user group. For example, you will be able to:</p><ul><li>Allow the use of specific FIDO2 security key models for user group A </li><li>Allow the use of passkeys in Microsoft Authenticator for user group B</li></ul><p><b>Important: </b>If your organization modifies the passkey policy via the Microsoft Azure or Entra portal during preview, the new schema will take effect. If you continue using Graph API or third-party tools to modify the policy, the schema will not change until General Availability.</p><p>These new settings will be available at Microsoft 365 admin center &gt; Home &gt; <i>Security &gt; Authentication methods &gt; Passkey (FIDO2) settings:</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/867be825-f30b-4852-a9f4-5591ba4aa359\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>As part of this update in November 2025, we will start accepting any <a href=\"https://www.w3.org/TR/webauthn-2/#sctn-defined-attestation-formats\" target=\"_blank\">WebAuthn-compliant</a> security key or passkey provider when <i>Enforce attestation</i> is disabled. This will allow a wider range of security keys and passkey providers to be accepted for registration and authentication in Microsoft Entra ID. To compare this upcoming update with the current behavior, refer to&nbsp;<a href=\"https://learn.microsoft.com/entra/identity/authentication/concept-fido2-hardware-vendor#attestation-requirements\" target=\"_blank\">Microsoft Entra ID attestation for FIDO2 security key vendors</a></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to review your current passkey configuration, notify your admins about this change, and update internal documentation.</p><p>Learn more about passkeys in Microsoft Entra ID: <a href=\"https://learn.microsoft.com/entra/identity/authentication/how-to-enable-passkey-fido2\" target=\"_blank\">Enable passkeys for your organization - Microsoft Entra ID | Microsoft Learn</a>&nbsp;(will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In November 2025, Microsoft Entra ID will support passkey profiles in public preview, enabling group-based passkey configurations and new API schema changes. Rollout occurs worldwide early November to December and mid-November to mid-December for GCC environments. No admin action is needed before rollout."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1097225",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-15T18:11:40.413Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-17T22:19:12Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Entra ID: Upcoming changes to support passkey profiles in the authentication methods policy (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
