{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re updating the default global calling policy for new tenants to allow users to transcribe or record calls. Previously, these settings were turned off by default in the host global policy. With this update, recording and transcription will be enabled by default in the global calling policy for new tenants and existing tenants who have not modified the host global policy. This change will not impact existing custom policies or modified global policies. After this rollout, recording and transcription services will be more accessible to users, allowing them to turn on and use recording and transcription as needed during Teams calls. Neither recording nor transcription will be automatically enabled in Teams calls.&nbsp;</p><p>Important: This change will not impact existing custom or modified global policies.&nbsp;</p><p>This update is designed to broaden access to AI-powered features like Calls Recap and Calling Copilot, enhancing the overall calling experience. It also brings calling policy defaults in line with Teams meetings policies, where recording and transcription are already enabled by default.</p><p><b>When this will happen:</b></p><p>Starting July 2025, we're changing the following:</p><ul><li>New tenants and tenants without customized Teams calling policies: The new default will apply automatically, allowing call recording and transcription.</li><li>Tenants with customized global or custom Teams calling policies: Any policy customizations will remain in place and will not be affected.</li></ul><p><b>How this will affect your organization:</b></p><p>After this rollout, recording and transcription services will be more accessible to users, allowing them to turn on and use recording and transcription as needed during Teams calls. Neither recording nor transcription will be automatically enabled.</p><p>This update is designed to broaden access to AI-powered features like Calls Recap and Calling Copilot, enhancing the overall calling experience. It also brings calling policy defaults in line with Teams meetings policies, where recording and transcription are already enabled by default.</p><p>For new tenants, recording and transcription will be enabled by default in the global calling policy. Existing tenants who have not modified the host global policy will also have the policy turned on by default.</p><p>Transcription policy on by default in Teams admin center. Admins can turn off the policy if needed:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/761d22b5-787f-4558-887d-ade769c7a955\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/call-recording-transcription-captions\" target=\"_blank\">Configure call recording, transcription, and captions in Teams</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting July 2025, Teams Calling global policy will enable recording and transcription by default for new tenants and those without customized policies. This change aligns with Teams meetings policies and enhances access to AI-powered features. Existing custom or modified policies remain unaffected. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084030",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-27T23:14:32.657Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-27T23:14:23Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Allow recording and transcription by default in Teams Calling global policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
