{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Once a Copilot Chat user has finished researching, creating, and collecting content in Copilot Pages, they can convert it into a Word document with the press of a button. This feature enhances productivity by streamlining the process of transferring content from Copilot Pages to Word.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=490550\" target=\"_blank\">490550</a></p><p><b>When this will happen:</b></p><p>Targeted Release (Worldwide): We will begin rolling out on late May 2025 and expect to complete by late May 2025.</p><p>General Availability (Worldwide): We will begin rolling out on late May 2025 and expect to complete by mid-June 2025.</p><p><b>How this will affect your organization:</b></p><p>Customers who have leveraged Copilot Chat to conduct research and generate content in Copilot Pages can convert that into a Word document with the press of a button.</p><p>This lets customers leverage Copilot as a new daily habit, then slip-stream right into their established working flows for formatting, reviewing, approving, or publishing.</p><p><b>What you need to do to prepare:</b></p><p>There is nothing that an IT Admin must do to prepare for this feature. Copilot Pages are on by default. If your organization has disabled Copilot Pages, they can be re-enabled using the instructions found here: <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-components-configuration?view=o365-worldwide\">Loop admin policies for Copilot Pages, Loop components, and Loop workspaces</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490550"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot users can convert content from Copilot Pages to a Word document with one button press, enhancing productivity. This feature will roll out in late May 2025 and complete by mid-June 2025. No IT admin action is required unless Copilot Pages are disabled."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060864",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T17:32:09.417Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:42:24Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Copilot (Microsoft 365): Open Copilot Pages content in a Word document",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
