{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re enhancing the contact experience in Microsoft Outlook Mobile (iOS and Android) by introducing profile-enriched contacts and automatic duplicate contact management. These improvements aim to streamline contact views and provide richer organizational context.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=493753\" target=\"_blank\">493753</a>.</p><p>This feature has previously been released to the People Hub in new Outlook for Windows. More details in MC927963<i> (Updated) New Microsoft Outlook for Windows: People Hub improvements</i> (published November 2024, updated April 2025).</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by early September 2025.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, Outlook Mobile may have displayed multiple entries for the same contact and lacked organizational profile context.</p><p>After this rollout: </p><ul><li>Contacts will be unified into a single enriched view, displaying additional profile information from your organization’s directory (where available).\n</li><li>Identical duplicate contacts will be automatically hidden.\n</li><li>These enhancements will be on by default and apply to both iOS and Android versions of Outlook Mobile. No admin controls exist.</li><li>Users can access their contact list by selecting <i>Contacts </i>from the <i>Apps </i>section in the Outlook Mobile app.</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update internal documentation.\n</p><p>After the feature is rolled out, please ensure that users have updated to the latest version of Outlook for iOS or Outlook for Android.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/manage-outlook-contacts-in-your-organization-0ecf087d-8964-49a6-ac85-956287080ee7?OCID=Outlook_ManageContacts_LearnMore\" target=\"_blank\">Manage Outlook contacts in your organization - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493753"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook Mobile for iOS and Android will introduce profile-enriched contacts and automatic duplicate contact management, rolling out from late June to early September 2025. These enhancements will unify contact views and provide additional profile information, with no admin controls required. Users should update to the latest app version."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1093912",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-13T17:25:55.977Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-13T17:25:44Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook for iOS/Android: Improved Contacts with profile enrichment and duplicate management",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
