{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Purview | Insider Risk Management (IRM): Enhancements to IRM exclusions to reduce alert noise.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486826\" target=\"_blank\">486826</a> and Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483485\" target=\"_blank\">483485</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We began rolling out mid-April 2025 and expect to complete by late April 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late April 2025 and expect to complete by early May 2025.</p><p><b>How this will affect your organization:</b></p><p>Customer can use this feature to tune down the noise</p><ul><li>Keyword logic update for email: An email will be excluded from scoring only when all the attachments match the keyword exclusions or email subject matches the keyword exclusions. This will be helpful to reduce the email signature noise that commonly contains keyword \"image.\"</li><li>Keyword exclusions on both target and source file paths: For signals like <i>File copied to removable media</i>, keyword exclusions apply on both target and source file paths. </li><li>File path exclusions for removable media: We will start supporting file path exclusions for removable media. </li><li>Exclusion support for browser: Domain exclusions will be supported for browsing indicators.</li></ul><p></p><p>These enhancements will be available by default for admins to configure.</p><p><b>What you need to do to prepare:</b></p><p></p>To get the most out of this feature, admins need to update the exclusion settings at IRM <i>Settings &gt; Global exclusions.</i><p></p><p></p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization.\n<p></p><p>Microsoft Purview | Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483485,486826"
    },
    {
      "Name": "Summary",
      "Value": "Enhancements to Microsoft Purview's Insider Risk Management (IRM) exclusions will reduce alert noise, including updates to keyword logic, file path exclusions, and domain exclusions. Public Preview starts mid-April 2025, with General Availability by early May 2025. Admins should update exclusion settings in IRM."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1058262",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-18T23:58:54.58Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-18T23:57:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Enhancements to global exclusions in IRM settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
