{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Microsoft Outlook for Windows and Microsoft Outlook for web will soon have a new Settings page called <i>Shared with me</i> where users can view and manage all shared email accounts and folders that they have been granted permission to access. Before April 30, 2025, we will update this post with new documentation.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486836\" target=\"_blank\">486836</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-May 2025 and expect to complete by mid-June 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 and expect to complete by early July 2025.\n</p><p>General Availability (GCC): We will begin rolling out early July 2025 and expect to complete by early August 2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, users will be able to access the new page in Outlook <i>Settings &gt; Accounts &gt; Shared with me:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/115a7c4c-4024-4e57-a621-4115fca4552b\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>If users have permission to access shared mailboxes or folders before this rollout, they will appear on this page. After this rollout, users can add new shared mailboxes and folders if their colleague has given them permission to access the mailbox and/or folders. User can remove shared mailboxes and folders from this page, but this action does not revoke permission granted by a colleague. If a colleague revokes a permission, the email account will remain on this page in a disabled state and will say that the user no longer has permission.\n</p><p>If your organization uses shared mailboxes, the <i>Shared with me</i> page will give users more insight into the permissions they have for shared mailboxes without needing to ask an admin or mailbox owner.\n</p><p>If your organization does not use shared mailboxes, this rollout will not impact you. The <i>Shared with me</i> page will be available for users, but it will stay empty if they do not add shared mailboxes or folders.\n</p><p>This change will be available to users by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486836"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook is introducing a \"Shared with me\" page in Settings for managing shared email accounts and folders. This feature will roll out from mid-May 2025 to early August 2025, depending on the release schedule. Users can view, add, and remove shared mailboxes and folders, enhancing permission visibility. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1056989",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-16T23:55:50.617Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-16T23:39:48Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: New \"Shared with me\" page in Settings for shared email accounts and folders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
