{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams will soon allow users to personalize the placement of notifications on their screens. Users will be able to choose from four options (bottom right, top right, bottom left, or top left) to make notifications more convenient and less disruptive, enhancing both focus and productivity. This message applies to Teams for the web.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=480720\" target=\"_blank\" style=\"\">480720</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early April 2025 and expect to complete by mid-April 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-April 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, Teams notifications were limited to the bottom right corner.\n</p><p>After this rollout, users can customize notification placement in Teams settings in <i>Settings &gt; Notifications and activity &gt; Display.</i> Select the option for notification location that best suits your needs and preferences: <i>Bottom right, Top right, Bottom left, </i>or <i>Top left:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e3a06f04-5c2b-4e16-9067-43dcab5368b8\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>This feature will be available by default for users to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/microsoft365insiderblog/customize-the-location-of-notifications-in-teams/4366056\" target=\"_blank\" style=\"\">Customize the location of notifications in Teams</a>&nbsp;(the location of the notifications will be the same as explained in this blog for Teams for Windows desktop)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "480720"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams for the web will soon allow users to customize the placement of notifications on their screens, choosing from four options: bottom right, top right, bottom left, or top left. This feature will roll out in April 2025 and will be configurable in Teams settings. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1013461",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-21T23:42:03.347Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-21T23:41:57Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Customize the location of notifications in Teams for the web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
