{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In SharePoint Online, Table toolbar is a new toolbar that allows authors to use table functionality. Table Styles was previously available on the text webpart. All the Table Styles styles are now available via the Table toolbar, including some new table features like merge, split, add space before and after, and others. With the introduction of Table toolbar, users see a menu that is always in focus when working on a table. The Table toolbar will automatically adjust by expanding or compressing based on the section layout used. When compressed, the table options move into the overflow (...) button.</p><p>The new table toolbar will be available in SharePoint and Viva Amplify. </p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394278\" target=\"_blank\">394278</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We began rolling out late February 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Within the text web part, users will be able to insert a table and, once the table is inserted, users will see the Table toolbar that is always in focus. Within Table toolbar, users can do all the table editing and formatting that is already available, including change layout, add/delete row/columns, and so on along with any new table features that may be added in the future.</p><p>Current experience</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/bc5654b1-57d3-4acc-9f87-6cbcceb9cc3a\" style=\"width: 150px;\"><br></p><p>Future experience</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c4a9653f-d143-424d-acba-f91625a957f6\" style=\"width: 500px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online introduces a new Table toolbar for table functionality, replacing Table Styles in the text web part. It includes features like merge, split, and add space. Available in SharePoint and Viva Amplify, rollout starts late February 2025 and ends late March 2025. No admin action required."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1034592",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-18T00:04:36.957Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-18T00:04:19Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "SharePoint Online: Table toolbar",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
