{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, users can apply a sensitivity label to a non-Office file or a PDF file in Microsoft Windows to apply protection that encapsulates the file into a .pfile file type that can verify user authorization and rights on the file.  A user who needs to modify and collaborate with others on a .pfile can use Microsoft Purview Information protection (MPIP) to remove the label and protection on the .pfile, make changes, and then reapply the label and protection to the updated file.\n</p><p>After this rollout, Microsoft Purview Endpoint Data Loss Prevention (EDLP) will be able to simplify and protect the collaboration experience in managed Windows devices in conjunction with the MPIP client. Non-Office files and PDF files stored on managed devices will be labeled while retaining their original file types to allow a user to modify and update the file on their device. When a user copies and uploads a labeled file to a destination external to their Windows device, EDLP will help enforce the rights protection by converting the file to a .pfile for secure sharing to other users. If the other users are also protected with EDLP, they can use MPIP to remove the label on the shared files before collaborating.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=476494\" target=\"_blank\">476494</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-March 2025 and expect to complete by mid-April 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by mid-June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>There is no change to your organization current’s use of labels on non-Office files and PDF files. This feature requires enablement by admins in the Purview portal.\n</p><p>In the Purview portal, go to the Data Loss Prevention settings to enable this feature for users.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c7f7ec5b-6eef-4056-a70a-4d4193db8521\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>After the feature is enabled, users with MPIP installed will be able to convert any .pfile that the users have permissions to access on their trusted Windows devices.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/d16a8faf-a5a9-4132-a03f-ff92dee3dff7\" style=\"width: 300px;\" alt=\"user settings\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/556cc2b3-ca88-4e71-be48-02c156b2e354\" style=\"width: 300px;\" alt=\"user settings\">\n</p><p>When users try to transfer an RMS-labeled file (Microsoft Azure Rights Management Services) to a destination outside the managed device, EDLP will notify the user that the file will be converted to a .pfile.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c929f4f8-b073-475c-a862-30177864b532\" style=\"width: 300px;\" alt=\"admin settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>There is no impact to your current Data Loss Prevention configuration in your organization.  Admins can look at public documentation to understand the feature. <b>please provide helpful inks</b></p>\n<p></p>\n<p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users and admins about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "476494"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1003342",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-11T23:56:13.003Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-11T23:55:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention: Labeling improvement for non-Office files and PDF files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
