{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: Organizers and presenters will be able to join town halls, webinars, and structured meetings seamlessly using a Public Switched Telephone Network (PSTN) code. Organizers and co-organizers can share the dial-in codes to presenters from the event scheduling form. They can also call presenters from the roster as well. Once connected, presenters will automatically join the Waiting Room for attendees and then an organizer or co-organizer can promote presenters from the roster to the green room or the live session, to help ensure a smooth and efficient experience.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.</p><p>This message is associated with MC1009929 /<i> (Updated) Microsoft Teams: Join town halls using dial-in options and join codes,</i> published February 2025 and updated April 2025.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-May 2025 and expect to complete by late May 2025.</p><p>General Availability (Worldwide): We will begin rolling out late-May 2025 and expect to complete by early June 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>This change will be available by default to your organization.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before or after the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow organizers and presenters to join town halls, webinars, and structured meetings using PSTN codes. This feature will roll out from mid-May to early June 2025. No admin action is required, but organizations should review configurations and notify users."
    }
  ],
  "EndDateTime": "2025-08-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1070183",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-08T23:10:54.363Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-08T23:10:50Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Users can join town hall and webinars using Public Switched Telephone Network (PSTN) codes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
