{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This is a reminder that we will soon update the Microsoft Secure Score improvement action for Microsoft Defender for Endpoint (MDE) to ensure a more accurate representation of security posture.<br></p><p>As communicated in 2024, we will gradually retire the MDE recommendations for SCID-84, SCID-2020, and SCID-2051 starting late March 2025 and ending by late April 2025.\n</p><p>Prior communications:</p><ul><li>MC883197 / SCID-84: Enable Local Admin password management</li><li>MC941863 / SCID-2020: Turn on all system-level Exploit protection settings</li><li>MC810408 / SCID-2051: Turn on Microsoft Defender Application Guard managed mode</li></ul><p>We are working to refine the MDE recommendations to ensure they align more accurately with recommended policies and enhance the overall security value.\n</p><p>We will remove these recommendations from the Security Score experience and appropriately adjust your score.</p><p>*SCID = Security Control ID</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Three Microsoft Secure Score SCIDs (SCID-84, SCID-2020, SCID-2051) for Microsoft Defender for Endpoint will be retired between late March 2025 and late April 2025 to ensure a more accurate security posture representation. These changes will adjust the Security Score experience accordingly."
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041962",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-26T23:38:24.027Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T23:38:18Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Defender for Endpoint: Three Microsoft Secure Score SCIDs will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
