{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 27, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>To provide a comprehensive overview of Microsoft 365 Copilot Chat's adoption among users without Microsoft 365 Copilot licenses, we are broadening the scope to include active users from Teams, Outlook, and Copilot.cloud.microsoft, in addition to its use in Edge sidebar and the Microsoft 365 Copilot (app). Moreover, the last activity date will now encompass usage data from Teams, Outlook, and Copilot.cloud.microsoft.</p><p>A breakdown of Microsoft 365 Copilot Chat active users for Teams, Outlook, and Copilot.cloud.microsoft is planned and will be available soon. We will communicate with another post once the rollout date is confirmed.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=482199\" target=\"_blank\">482199</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early April 2025 (previously late March) and expect to complete by early April 2025 (early late March).</p><p><b>How this will affect your organization:</b></p><p>In Reports -&gt; Usage -&gt; Microsoft 365 Copilot Chat in the Microsoft 365 admin center, the following metrics may be impacted: </p><ul><li>All up active users, average daily active users may increase </li><li>Last activity date (UTC) per user may change  </li></ul><p><b>What you need to do to prepare:</b>\n</p><p>If you use Microsoft 365 Copilot Chat usage report in the Microsoft 365 admin center as the basis for your own custom report (i.e. by exporting information and incorporating it into a Power BI report), consider revising historical information in that report to account for potential increases to usage of active users, average daily active users, and last activity date update in user level table. &nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "482199"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is updating the Microsoft Copilot Chat usage report to include active users from Teams, Outlook, and Copilot.cloud.microsoft. The rollout will start in early April 2025. Metrics like active users and last activity date in the admin center may change. Users should revise custom reports accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041457",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-27T20:35:43.48Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T05:03:53Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot Chat usage report improvements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
