{
  "ActionRequiredByDateTime": "2025-05-26T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are reaching out to inform you of an upcoming change affecting users who access Microsoft Planner through shared mailboxes.\n</p><p>Due to underlying permission model limitations, shared mailbox accounts will no longer be able to perform the following actions in Planner (in both Teams &amp; Web):\n</p><ul><li>Add or edit tasks and task fields (like Due date, Start date, Assignment etc.)\n</li><li>Upload attachments \n</li><li>Add task comments \n</li></ul><p>Although a temporary workaround is available to enable limited task editing capabilities for shared mailbox users, it is not a long-term solution and will be phased out in the next 30 days. Please note that the restricted behavior has already been in effect for the past several months.</p><p>To ensure uninterrupted Planner functionality, we recommend that affected users be assigned user mailboxes instead of shared mailboxes. This will allow them to fully interact with Planner tasks and related group features without encountering access issues.\n</p><p>Instructions on how to convert a shared mailbox to a user mailbox can be found here:&nbsp;<a href=\"https://learn.microsoft.com/en-us/exchange/recipients-in-exchange-online/manage-user-mailboxes/convert-a-mailbox\" target=\"_blank\">Convert a mailbox in Exchange Online</a></p><p>\n</p><p><i>If your team needs more time to complete the conversion, please reach out to us—we can enable the temporary workaround for you on request.\n</i></p><p><i>We understand this may impact your workflow and appreciate your understanding as we work to align Planner access with Microsoft 365 supported configurations.\n</i></p><p><b>Action Required:\n</b></p><p>Review and update mailbox types for any users who need to continue using Planner with full functionality.</p><p><b>\n</b></p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Shared mailbox users will no longer be able to add or edit tasks, upload attachments, or add comments in Microsoft Planner due to permission model limitations. A temporary workaround is available but will be phased out in 30 days. Convert shared mailboxes to user mailboxes for uninterrupted functionality. Instructions are provided."
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1064044",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-28T17:49:53.32Z",
  "Services": [
    "Planner"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-28T17:49:39Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Limited Microsoft Planner Functionality for Shared Mailbox Users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
