{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 14, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>We would like to inform you that the rollout of Request for Comments (RFC) compliance enforcement changes, originally announced in January 2025 (MC987329) have been postponed until May 2025.</p><p>With the compliance update in May 2025, the \"From\" field of voicemail email messages will be modified to meet the latest RFC standard. Specifically, <a href=\"https://www.rfc-editor.org/rfc/rfc6854\" target=\"_blank\">RFC 6854: Update to Internet Message Format to Allow Group Syntax in the \"From:\" and \"Sender:\" Header Fields</a>. According to this standard, the Internet message format must always include an address in the \"From\" header. For example:\n</p><ul><li>Previously: +44 28 7584 5695 &lt;442875845695&gt;  \n</li><li>After the change: +44 28 7584 5695 &lt;noreply@skype.voicemail.microsoft.com&gt;</li></ul><p>&nbsp;<b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out late May 2025 (previously early May) and expect to complete by mid-June 2025.</p><p>General Availability (GCCH, DoD): We will begin rolling out early June 2025 (previously mid-May) and expect to complete by late June 2025 (previously mid-June).<br></p><p><b>How this will affect your organization:</b>\n</p><p>Voicemails will be delivered from the email address noreply@skype.voicemail.microsoft.com to meet the latest RFC standard.</p><p><b>What you need to do to prepare:</b>\n</p><p>Please prepare for the following email address to be the sender of this messages, no later than May 2025: noreply@skype.voicemail.microsoft.com. Starting from May 2025 Voicemails will be delivered from the address noreply@skype.voicemail.microsoft.com.</p><p>If you would like to enable RFC compliance changes earlier than May 2025, please contact us by replying to this message post.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The rollout of RFC compliance changes for Microsoft Teams voicemail messages has been postponed to May 2025. Voicemails will now be sent from noreply@skype.voicemail.microsoft.com to meet RFC 6854 standards. The rollout will complete by mid-June 2025 for most users and late June 2025 for GCCH and DoD."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1028317",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-14T16:50:44.087Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-11T05:03:40Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Enhanced compliance in voicemail messages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
