{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're enhancing Content Explorer to provide greater visibility into sensitive data flagged in Exchange Online. Previously, only the message body was viewable, which limited insight into flagged content. With this update, admins will be able to preview email attachments directly within Content Explorer—without needing to download the email.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=485765\" target=\"_blank\">485765</a>\n</p><p><b>When this will happen:</b></p><p>Public Preview: Rolling out beginning of June 2025; expected completion by mid-June 2025.\n</p><p>General Availability (Worldwide): Rolling out beginning of July 2025; expected completion by mid-July 2025.</p><p><b>How this will affect your organization:</b></p><p>Admins using Content Explorer will see a new tab labeled Email Attachments when selecting an email. This allows them to preview attachments that may contain sensitive information, improving data visibility and investigation workflows.\n</p><p>Supported file types for preview include:\n</p><p>.doc, .docx, .xlsx, .xls, .xlsm, .xlsb, .pptx, .pdf, .txt, .csv, .html, .xml, .json, .rtf, .cpp, .cs, .py, .jpg, .png, .jpeg, .eml.</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required. This feature will be enabled by default.</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tYes – Enables preview of attachments flagged for sensitive data.</li><li>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?\tMaybe – May impact how DLP or eDiscovery workflows are used, depending on how attachments are flagged and reviewed.\n</li><li>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?\tYes – Improves visibility into sensitive content in attachments.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485765"
    },
    {
      "Name": "Summary",
      "Value": "Content Explorer will now allow admins to preview email attachments flagged for sensitive data in Exchange Online, enhancing data visibility without downloading emails. This feature rolls out in June 2025 (Public Preview) and July 2025 (General Availability). No action is required; it will be enabled by default."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090691",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-09T23:14:42.76Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:13:57Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection - Email Attachment Preview in Content Explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
