{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 28, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Microsoft SharePoint <i>Page Analytics</i> will soon be upgraded with new capabilities. This rollout will be targeted to SharePoint News posts only. All these capabilities will be made available to all SharePoint pages in future releases.</p><p>If you have a license for <a href=\"https://www.microsoft.com/microsoft-viva/pricing\" target=\"_blank\">Microsoft Viva Suite or Microsoft Viva Employee Communications and Communities</a>, you will have all the new capabilities. If you do not have one of these licenses, you will continue to see the existing metrics and charts in <i>Page Analytics</i> with a modern page design.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488502\" target=\"_blank\">488502</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2025 (previously late July) and expect to complete by mid-September 2025 (previously late August).</p><p><b>How this will affect your organization:</b>\n\n</p><p>This rollout will provide these new capabilities: \n</p><ul><li>Long-term data: Up to 365 days from current limit of up to 90 days.</li><li>Breakdown by distribution channels: For all <i>Page Analytics</i> charts (including <i>Unique viewers, Total views, </i>and <i>Average time spent per user)</i>, you will be able to see the breakdown by distribution channels (Microsoft Outlook, SharePoint, Microsoft Teams, Microsoft Viva Engage) where a news post was shared. \n</li><li>Two new metrics called <i>Reactions </i>and <i>Promotions</i>. <i>Reactions </i>will indicate how many times have users reacted to a post and a breakdown of reactions by positive, negative, and others to gauge user sentiment for a post. <i>Promotions </i>will indicate the total number of shares, @mentions, and email forwards that a news post has received. \n</li><li>Export analytics data: You will be able to export the analytics data to Excel or PowerPoint. \n</li><li>Audience calculation: Unique viewers as a percentage of number of users to which the post was shared. \n</li><li>Copy a chart as image\n</li><li>Upgraded page design</li></ul><p>\n</p><p>This change will be on by default.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/0b480c7b-bf92-47a8-85d7-e3d60935d489\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/view-usage-data-for-sharepoint-pages-and-news-e3186199-ccc8-4445-9162-bb1bcec8b7ee\" target=\"_blank\">View usage data for SharePoint pages and news - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488502"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint Page Analytics will upgrade starting mid-August 2025, initially for News posts, adding long-term data (365 days), channel breakdowns, new metrics (Reactions, Promotions), export options, audience calculation, chart copying, and a modern design. Available fully with Microsoft Viva licenses; no admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1069561",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-28T16:43:33.883Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-07T23:45:55Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: Updated Page Analytics",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
