{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To reduce the risk of misuse and abuse of Exchange Online resources and ensure service availability for all users, we’ll soon introduce new tenant-level outbound email limits, known as the Tenant External Recipient Rate Limit or TERRL. The TERRL restricts the number of external recipients a tenant can send email to per day. If the limit is exceeded further messages sent to external recipients from the tenant will be blocked until the volume for the last 24 hours drops below the quota. A tenant’s TERRL quota is calculated based on the number of email licenses a tenant has purchased. Here is the formula used to calculate a tenant’s quota:\n</p><p>500 * (Purchased Email Licenses^0.7) + 9500\n</p><p>To help admins plan and track their outbound email volume, you’ll find a new report in the Exchange admin center: <i>EAC &gt; Reports &gt; Mail flow &gt; Tenant Outbound External Recipients Rate</i>. This report shows the current volume of external recipients, your tenant’s daily quota, how much of the quota is used, and the number of recipients that were blocked if the limit was exceeded. The report will also show if enforcement for the limit is enabled or disabled. For example, for tenants who have more than 500 email licenses it will show “Disabled” until March 31st, the day we’ll start to enable enforcement for tenants who have more than 500 licenses.\n</p><p><b>When this will happen:</b></p><p>This change will roll out in progressive stages over the month of March as per the following rollout schedule:</p><table class=\"table table-bordered\"><tbody><tr><td>Phase</td><td>Enable enforcement for tenant group</td><td>Rollout start date</td></tr><tr><td>1</td><td>Tenants with &lt;= 25 email licenses</td><td>April 3, 2025</td></tr><tr><td>2</td><td>+ additional tenants with &lt;= 200 licenses</td><td>April 10, 2025</td></tr><tr><td>3</td><td>+ additional tenants with &lt;= 500 licenses</td><td>April 17, 2025</td></tr><tr><td>4</td><td>+ all remaining tenants</td><td>May 1, 2025</td></tr></tbody></table><p><b>How this will affect your organization:</b></p><p>If your tenant exceeds its daily outbound sending limit further messages sent to external recipients will be blocked and senders will receive one of the following bounce messages (also known as Non-Delivery Receipts or NDRs):\n</p><ul><li>Trial tenants: 550 5.7.232 - Your message can't be sent because your trial tenant has exceeded its daily limit for sending email to external recipients (tenant external recipient rate limit)\n</li><li>Non-trial tenants: 550 5.7.233 - Your message can't be sent because your tenant exceeded its daily limit for sending email to external recipients (tenant external recipient rate limit)\n</li></ul><p><b>What you need to do to prepare:</b></p><p>Check the report in the EAC to see your tenant’s quota and current daily outbound email volume and whether or not any messages will be blocked once the TERRL is enabled for your tenant. If your current outbound email volume is well below the quota, you don’t have to do anything. If your outbound email volume is near or exceeding your quota, consider using <a href=\"https://learn.microsoft.com/en-us/azure/communication-services/overview\" target=\"_blank\">Azure Communication Services email</a> for high-volume email to external recipients instead. ACS email which offers significant advantages and features for high-volume email, especially for external recipients. Messages sent using ACS email are not counted against your Tenant External Recipient Rate Limit quota.\n</p><p>For more information about the Tenant External Recipient Rate feature and report please see this blog post:\n</p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/exchange/introducing-exchange-online-tenant-outbound-email-limits/4372797\" target=\"_blank\">Introducing Exchange Online Tenant Outbound Email Limits</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New Exchange Online Tenant Outbound Email Limits (TERRL) will be introduced to restrict the number of external recipients a tenant can email daily. The limit is based on purchased email licenses. Enforcement starts in April 2025, with a phased rollout. Admins can track usage via a new report in the Exchange admin center."
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1023294",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-04T18:56:40.203Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-04T18:55:51Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "New Exchange Online Tenant Outbound Email Limits",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
