{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring the following features/ experiences from Microsoft Purview portal starting May 26, 2025. We recommend transitioning to the alternatives outlined below.\n</p><p>1.<i style=\"\">\tContent search</i> in the classic eDiscovery section will be replaced by <i>“Content search\"</i> in the Microsoft Purview portal. All your existing content searches in the classic eDiscovery section are already available in the modern Content Search in Purview eDiscovery.</p><p style=\"margin-left: 25px;\"><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/db2db86b-189a-470c-8cd0-01c9ebc2ba1a\" width=\"250\" height=\"\"></p><p>2.\t<i>Classic eDiscovery (Standard)</i> in the Purview portal will be retired and replaced by the “<i>Cases</i>” tab in Purview eDiscovery.  All your classic standard cases in eDiscovery can be managed in the Cases section in the left-navigation.&nbsp;</p><p style=\"margin-left: 25px;\"><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b8da8b71-ef93-4de4-bb19-f5f4b136156c\" width=\"250\" height=\"\"></p><p>\n</p><p>3.<i>\tExport-related PowerShell parameters</i> will be retired. Starting May 26, 2025, the export parameters for the following cmdlets will be disabled:&nbsp;</p><ul><li><i>New-ComplianceSearchAction -Export</i> parameter\n</li><li><i>Get-ComplianceSearchAction -Export</i><b> </b>parameter\n</li><li><i>Set-ComplianceSearchAction -ChangeExportKey</i> parameter\n</li></ul><p><i>The other eDiscovery PowerShell cmdlets for creating and managing cases, managing holds, searches and purges are still supported. If you have an E5 license and use eDiscovery (Premium), you can continue to automate exports using the Microsoft Graph eDiscovery APIs. If you do not use Graph APIs, the Microsoft Purview eDiscovery portal will be your only method for exports.&nbsp;</i></p><p>We strongly encourage you to begin planning your transition to help ensure a smooth migration and minimal disruption to your current processes. These changes are also part of our ongoing commitment to delivering a secure and intuitive user experience to you and your organization.&nbsp;</p><p><b>When this will happen:</b></p><p>May 26, 2025</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because one or more users in your organization are using these eDiscovery features. \n</p><p>After the retirement of these features, users will no longer be able to use the classic Content Search feature, classic eDiscovery (Standard) cases, or the Export-related PowerShell cmdlets.  \n</p><p><b>What you need to do to prepare:</b></p><p>This update will happen automatically on the specified date. Please notify your users about these changes, update relevant documentation as appropriate, and familiarize your teams with the upcoming changes and enhanced capabilities of the new unified eDiscovery experience in the Microsoft Purview Portal.&nbsp;</p><ul><li>Learn more about the new eDiscovery experience here: <a href=\"https://learn.microsoft.com/purview/edisc\" target=\"_blank\">Learn about eDiscovery solutions | Microsoft Learn</a>\n</li><li>Learn about export workflow here: <a href=\"https://learn.microsoft.com/purview/edisc-search-export\" target=\"_blank\">Export search results in eDiscovery | Microsoft Learn</a>\n</li><li>Learn about Graph API here: <a href=\"https://learn.microsoft.com/graph/api/resources/security-ediscovery-apioverview?view=graph-rest-1.0\" target=\"_blank\">Use the Microsoft Purview eDiscovery API in Microsoft Graph - Microsoft Graph v1.0 | Microsoft Learn</a>\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview will retire Classic Content Search, Classic eDiscovery (Standard) Cases, and Export PowerShell Parameters on May 26, 2025. Users should transition to the new Content Search, Cases tab in Purview eDiscovery, and Microsoft Graph eDiscovery APIs. This update will happen automatically. Notify users and update documentation accordingly."
    }
  ],
  "EndDateTime": "2025-08-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1055528",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-14T23:39:16.72Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-14T23:38:41Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Purview | Retiring Classic Content Search, Classic eDiscovery (Standard) Cases, Export PowerShell Parameters",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
