{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 17, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft SharePoint: In the <i>Automate</i> menu, users will be able to create customized quick steps for common tasks such as composing an email or starting a Microsoft Teams chat to specified <i>People</i> columns, sending an approval request, executing a flow, and setting a column value on one or more items. Users will find a simple sentence builder experience, similar to SharePoint rules.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late May 2025 (previously early April) and expect to complete by early June 2025 (previously late April).\n</p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out early June 2025 (previously early May) and expect to complete by late June 2025 (previously late May).\n</p><p>General Availability (DoD): We will begin rolling out mid-June 2025 (previously mid-May) and expect to complete by early July 2025 (previously late June).\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, SharePoint list and library users will be able to add and configure quick steps for their common scenarios. Users can go to the <i>Automate </i>menu from any list or library to configure quick steps. Learn more: <a href=\"https://support.microsoft.com/office/create-a-quick-step-for-your-list-or-library-b37c2c7f-2ae1-49f9-b4b0-a8d501f5f99e\" target=\"_blank\">Create a quick step for your list or library - Microsoft Support</a>\n</p><p>This feature will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your SharePoint admins and site owner about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint will soon allow users to create customized quick steps for common tasks via the Automate menu. The rollout will start in late May 2025 for Targeted Release and early June 2025 for General Availability. No admin action is required, but notifying SharePoint admins and updating documentation is recommended."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1025215",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-17T19:11:32.267Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-07T01:16:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: Use SharePoint quick steps to automate common tasks and workflows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
