{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 13, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Microsoft 365 Copilot responses in Microsoft Teams meetings can be shared to external apps (Word or Excel). Responses generated by Copilot in Meetings will come with a button to <i>Open in</i>&nbsp;another app. Although this will start with Word and Excel, more apps will be added in the future. </p><p>The <i>Open in</i>&nbsp;button will show up when:</p><ul><li>A response has more than the set number of characters (1,300), which will make it long enough to warrant editing in a document. Shorter responses can always be copied/pasted anywhere outside of Teams, as long as the meeting policy allows.</li><li>A response has a table, which will allow it to be exported to Excel if the meeting policy allows.</li><li>Responses will only be able to be exported if the meeting policy allows copying or exporting of Copilot responses and will respect the sensitivity label of the meeting (sensitivity labels are available to Teams Premium customers).</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481352\" target=\"_blank\">481352</a>.</p><p><b>When this will happen:</b></p><p>Targeted release: We will begin rolling out early May 2025 and expect to complete by mid-May 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late June 2025 (previously late May).</p><p><b>How this will affect your organization:</b>\n</p><p>Users will see the ability to export content when hovering over the Copilot response card.&nbsp;</p><p>When hovering on the Copilot response card and only text is present:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a1985388-fa26-4dad-b390-7aae55649dd1\" style=\"width: 300px;\"></p><p>When hovering on the Copilot response card and a table is present. Clicking on the dropdown will show <i>Edit in Word</i>&nbsp;as an option as well.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/58ab14a7-0db0-47a2-85f4-51bd1d86bf4a\" style=\"width: 300px;\"></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481352"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot responses in Teams meetings can be shared to Word or Excel via an \"Open in\" button, starting May 2025. This feature is triggered by long responses or tables and respects meeting policies and sensitivity labels. No admin action is required, but user notification is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1053653",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-13T17:07:58.847Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-11T21:43:09Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams Meetings Copilot response can be shared to external apps (Word or Excel)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
