{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To improve clarity and transparency, we’re updating the audit log messages for Microsoft Purview role group membership changes. This affects events under the SecurityComplianceRBAC workload (RecordType 87), specifically for the GrantPermission and DeletePermission operations. While the audit schema remains unchanged, the <code>PreExecutionMessage</code> and <code>PostExecutionMessage</code> fields will be refined to more accurately reflect the nature of the changes captured in the logs.</p><p></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out on early August 2025 and expect to complete by mid-August 2025.</p><p><b>How this will affect your organization:</b></p><p></p><p>If your organization consumes these audit log events programmatically (e.g., via scripts or automation tools), the updated message content may affect how these logs are parsed or interpreted. No changes are required if you do not rely on these specific fields.</p><p></p><p><b>What you need to do to prepare:</b></p><p></p><p>Review any scripts, automation, or monitoring tools that parse the <code>PreExecutionMessage</code> or <code>PostExecutionMessage</code> fields for the affected operations. Update your logic as needed once the refined messages are available in your environment.\n</p><p>For more information about audit logging in Microsoft Purview, visit: <a href=\"https://learn.microsoft.com/microsoft-365/compliance/audit-log-search\" target=\"_blank\">Search the audit log</a>.</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tYes (audit log message content is refined)</li><li>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?\tYes</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is updating audit log messages for role group membership changes to improve clarity. This affects the GrantPermission and DeletePermission operations. The rollout will occur in August 2025. Organizations using these logs programmatically should review and update their scripts accordingly. For more details, visit the provided link."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090695",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-09T23:16:38.68Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:16:26Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Upcoming Update to Audit Records for Microsoft Purview Role Group Changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
