{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing Real-Time Text (RTT) support in Microsoft Teams meetings and calls, available on both desktop and mobile platforms. RTT is an accessible communication method that transmits text character by character as it is typed, enabling more immediate and responsive text-based conversations. This enhancement supports inclusivity by providing an alternative communication channel for users who are deaf or hard of hearing, neurodiverse, or have speech-related disabilities.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484119\" target=\"_blank\">484119</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early May 2025 and expect to complete by mid-May 2025.<br></p><p>General Availability (Worldwide, GCC): We will begin rolling out early May 2025 and expect to complete by mid-May 2025.</p><p>General Availability (GCC High): We will begin rolling out early June 2025 and expect to complete by mid-June 2025.</p><p>General Availability (DoD): We will begin rolling out early July 2025 and expect to complete by mid-July 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Once this feature is enabled by your organization, users will be able to turn on Real-Time Text (RTT) during Teams meetings and calls. To access it, go to the meeting toolbar, select <i>More </i>&gt; <i>Speech and language</i> &gt; <i>Enable RTT</i>.</p><p>When RTT is turned on, it will be enabled for everyone in the meeting. As you type, your message will instantly appear on the screen - letter by letter - so others can read it in real time. This creates a faster and more natural way to communicate through text, especially compared to standard chat.</p><p>RTT is designed to improve accessibility and also supports users who prefer typing instead of speaking. It can be used together with other features like captions or chat to create a more inclusive and flexible meeting experience.</p><p>Note: Once RTT is turned on in a meeting, it stays on for the rest of the meeting and cannot be turned off unless everyone leaves and rejoins.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically, and no admin action is required. The RTT policy is enabled by default at the tenant level.</p><p>We recommend informing your users about this new feature, especially those who may benefit from enhanced accessibility options. You may also want to update any internal documentation or training materials to include guidance on how to use RTT in Teams meetings and calls.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing Real-Time Text (RTT) for meetings and calls on desktop and mobile, enhancing accessibility for users with hearing, speech, or neurodiverse conditions. The rollout starts in May 2025, with different timelines for various regions. No admin action is required; inform users and update documentation."
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1059674",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-21T23:43:24.797Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-21T23:43:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Real-Time Text (RTT) in Teams meetings and calls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
