{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 19, 2025: We have updated the content. Thank you for your patience.</p><p>Coming soon: Eligible users will be prompted in the Message Bar below the toolbar in Microsoft Word, Microsoft Excel, and Microsoft PowerPoint for Windows desktops to enroll in <a href=\"https://learn.microsoft.com/sharepoint/redirect-known-folders\" target=\"_blank\">OneDrive Known Folder Move (KFM)</a>. Users will be able to select the folders to back up in Microsoft OneDrive.\n</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-March 2025 and expect to complete by early April 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 and expect to complete by early May 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization still has users who are not enrolled in KFM, the message (\"BACK UP THIS DOCUMENT: Share and work with others in this and other files using OneDrive\") will encourage them to do it while using familiar desktop apps. After users select the <i>Open OneDrive</i> button, they can select the folders they want to back up in OneDrive:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4647607e-424c-485d-8645-92e15a30635c\" style=\"width: 400px;\" alt=\"user message\">\n</p><p>When users are enrolled in KFM, the files in their enrolled folder benefit from the advantages of cloud files:\n</p><ul><li>Copilot support: Files are Copilot-enabled, making it simple and intuitive to access and leverage Copilot.\n</li><li>Easy collaboration: Cloud files enable sharing, commenting, and easy collaboration, with AutoSave ensuring changes are frequently and consistently saved.\n</li><li>Access from anywhere: Cloud files can be accessed from Windows, Mac, the web, iOS, and Android with synchronized changes.\n</li><li>Increased security and compliance: Enterprises can increase security and compliance, because all cloud files are subject to default classification, labeling, and protection (CLP) policies and auto-labeling.\n</li><li>Backup:  Protection from data loss due to device failure.\n</li><li>Access to cloud-specific features like AutoSave and Version History</li></ul><p>After enrolling, users can access their files in the known folders in File Explorer or OneDrive.\n</p><p>No action required. The feature will be enabled automatically for eligible users. If KFM is blocked in your organization, the message will not be displayed.\n</p><p>If an organization has blocked KFM, we will honor that and not display the message to the organization's users.</p><p>This Message Bar will not appear if:\n</p><ul><li>The user is already enrolled in KFM</li><li>The existing GPO to block KFM Wizard (Prevent users from moving their Windows known folders to OneDrive) is enabled and deployed.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration and notify users about the change, explaining the benefits of OneDrive and the sync process. Consider updating any relevant documentation.</p><p>Learn more: </p><ul><li><a href=\"https://learn.microsoft.com/sharepoint/redirect-known-folders\" target=\"_blank\">Redirect and move Windows known folders to OneDrive - SharePoint in Microsoft 365 | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/sharepoint/use-group-policy#prevent-users-from-moving-their-windows-known-folders-to-onedrive\" target=\"_blank\">IT Admins - Use OneDrive policies to control sync settings - SharePoint in Microsoft 365 | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 will prompt eligible users to back up files to OneDrive via the Message Bar in Word, Excel, and PowerPoint. The rollout starts mid-March 2025 for Public Preview and early April 2025 for General Availability. No action is required from admins, and the feature will be enabled automatically."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024398",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-19T14:35:48.01Z",
  "Services": [
    "OneDrive for Business",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:52:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 apps: We will prompt users to back up their files in Microsoft OneDrive",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
