{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce the upcoming Viva Glint Tenant Administrator role for Microsoft Viva Glint in Microsoft Entra. With this role, admins will have dedicated permissions to manage Viva Glint-related settings in the Microsoft 365 admin center, without requiring the elevated privileges of Global Admin or User Admin roles. This role is essential for users who need to read and configure Viva Glint settings in the Microsoft 365 admin center, assign Viva Glint service admins, and create or manage Microsoft Azure support tickets.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479414\" target=\"_blank\">479414</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late March 2025 and expect to complete by early April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, admins will be able to assign the new Viva Glint Tenant Administrator role to users in the:\n</p><ul><li><a href=\"https://ms.portal.azure.com/#view/Microsoft_AAD_IAM/AllRolesBlade\" target=\"_blank\">Microsoft Entra portal</a>\n</li><li><a href=\"https://admin.microsoft.com/Adminportal/Home?#/homepage\" target=\"_blank\">Microsoft 365 admin center</a>\n</li></ul><p>The new role will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend admins:\n</p><ol><li>Review the Viva Glint Tenant Administrator role documentation to understand its capabilities.\n</li><li>Assess current roles to identify where the new role fits.\n</li><li>Communicate changes to staff if needed.\n</li></ol><p>This rollout will happen automatically with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/entra/identity/role-based-access-control/permissions-reference\" target=\"_blank\">Microsoft Entra: Entra built-in roles | Microsoft Learn</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/viva/glint/start/role-definitions\" target=\"_blank\">Microsoft Viva: Key Roles for Viva Glint | Microsoft Learn</a> (will be updated before rollout)</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479414"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing the Viva Glint Tenant Administrator role in Microsoft Entra, allowing admins to manage Viva Glint settings without needing Global or User Admin privileges. The rollout will occur from late March to early April 2025. Admins should review the role's documentation, assess current roles, and communicate changes to staff."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1011149",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-20T01:13:23.33Z",
  "Services": [
    "Microsoft Entra",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-20T01:13:14Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Entra: New built-in Viva Glint Tenant Administrator role",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
