{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 14, 2025: We have updated the timeline below. Thank you for your patience.</p><p><b>Note:</b> If you are not using frontline worker functionality, you can safely ignore this message.</p><p>Before this rollout: The Walkie Talkie app is pinned by default on the app bar at the bottom of the screen in Microsoft Teams for iOS/Android. After this rollout, the Walkie Talkie app will move to the three-dot <i>More</i> menu in Teams for iOS/Android if users choose to separate their chats and channels (chats and channels are combined by default in the <a href=\"https://support.microsoft.com/office/the-new-chat-and-channels-experience-in-microsoft-teams-c6f38016-d59c-4226-b0f3-caef4e60f91e\" target=\"_blank\">new chats and channels experience</a>). To keep the Walkie Talkie app in the app bar, admins can either create a custom app policy or users can choose to combine chats and channels.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by late May 2025 (previously mid-May).</p><p><b>How this will affect your organization:</b></p><p>As part of the latest update to the Frontline tailored app experience for F SKU users, the Microsoft Viva Engage app will be pinned by default on the app bar in Teams for iOS/Android, in the position formerly occupied by the Walkie Talkie app. With the new chats and channels experience, users will see chat and channel messages combined by default. </p><p>If users choose to separate chats and channels (so that <i>Chat </i>and <i>Channels </i>occupy two positions on the app bar), <b>the Walkie Talkie app will not appear on the app bar</b> for F SKU users and will move to the three-dot <i>More </i>menu on iOS/Android devices. In this case, users will see <i>Home, Activity, Chat, Channels, Engage, </i>and the three-dot <i>More </i>menu on the app bar. If they select <i>More,</i> they will find the Walkie Talkie app.</p><p>To ensure Walkie Talkie is always displayed on the app bar, admins can standardize the navigation bar across all frontline workers in their tenant by going to the Teams admin center and creating a <a href=\"https://learn.microsoft.com/microsoftteams/teams-custom-app-policies-and-settings\" target=\"_blank\">custom app policy</a> to specify which apps frontline workers should see in their app bar.\n</p><p>If users choose to keep their chats and channels combined, Walkie Talkie will be displayed on the app bar. User instructions: <a href=\"https://support.microsoft.com/office/the-new-chat-and-channels-experience-in-microsoft-teams-c6f38016-d59c-4226-b0f3-caef4e60f91e\" target=\"_blank\">The new chat and channels experience in Microsoft Teams - Microsoft Support</a>\n</p><p><b>Note</b>: We are aware that some iOS devices have already moved the Walkie Talkie app to the three-dot <i>More </i>menu. After the rollout completes, this issue on iOS devices will be resolved and the Walkie Talkie app will be displayed on the app bar if users choose to keep their chats and channels combined.</p><p>This change will be on by default\n.</p><p><b>What you need to do to prepare:</b>\n</p><p>If the Walkie Talkie app should stay in the main app bar and not appear in the three-dot <i>More </i>menu, either<a href=\"https://learn.microsoft.com/microsoftteams/teams-custom-app-policies-and-settings\" target=\"_blank\"> create a custom app policy</a> in admin center or ask users to select the option to <a href=\"https://support.microsoft.com/office/the-new-chat-and-channels-experience-in-microsoft-teams-c6f38016-d59c-4226-b0f3-caef4e60f91e\" target=\"_blank\">combine chats and channels</a>.\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/microsoftteamsblog/introducing-the-new-microsoft-teams-chat-and-channels-experience/4275674\" target=\"_blank\">Introducing the new Microsoft Teams chat and channels experience | Microsoft Community Hub</a>, which explains how users can view chat and channels separately or combined.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Walkie Talkie app in Microsoft Teams for iOS/Android will move to the three-dot menu if users separate chats and channels. Admins can create a custom app policy to keep it on the app bar. This change will roll out in May 2025. Users can combine chats and channels to retain the app on the app bar."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1068900",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-14T15:22:47.593Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-06T22:37:36Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams for iOS/Android: Walkie Talkie app will move to the three-dot menu if users separate chats and channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
