{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Edge: With multiple tabs open, the tab strip is valuable space for you to quickly find the right tabs. To increase visibility of tab titles, we will move the user Profile label&nbsp;to the toolbar.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by mid-May 2025.\n</p><p>The changes are included in Microsoft Edge version 136.  \n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, the Profile label was located in the title bar on the left side of the screen:&nbsp;\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/bcce262d-edb4-4a87-9d8f-5aeb7c8c1883\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After this rollout, the Profile label will change to a minimized icon without a text label that appears in the toolbar on the right side of the screen. These changes will be on by default.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f61d57b8-a12b-4687-9981-eb400c06d789\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Admins can use the <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-policies#profiletypeinprofilebuttonenabled\" target=\"_blank\">ProfileTypeInProfileButtonEnabled policy</a> to control whether the label for the work or school profile type is shown in the profile button. As of Microsoft Edge version 136.0.3240.45, companies with organization branding changes configured through the Edge management service will experience these Profile changes.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Edge will move the user Profile label to the toolbar to increase tab visibility. This change will roll out in May 2025 with Edge version 136. The Profile label will become a minimized icon on the right side of the toolbar. No admin action is required, but user notification is recommended."
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1070845",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-09T21:25:49.017Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-09T21:25:42Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Edge: New location for Edge profile in the toolbar",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
