{
  "ActionRequiredByDateTime": "2025-08-31T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams: As part of our updates to the attendance report service for Teams meetings, we will implement a one-year retention policy for meeting attendance reports. After this rollout, all meeting attendance reports will be stored for one year after meeting end date to align with the <a href=\"https://www.microsoft.com/privacy/privacystatement\" target=\"_blank\">Microsoft privacy policy</a>. Before this rollout, meeting attendance reports did not have a retention policy.\n</p><p>This message applies to Teams on Windows desktop, Teams on Mac desktop, Teams on the web, and Teams for iOS/Android.\n</p><p><b>When will this happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Available now.\n</p><p>Attendance reports for events created before November 1, 2024, will remain accessible until late August 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Please note that the updated retention policy will also impact on Microsoft Graph API requests for attendance reports. Data availability will align with the retention period.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>If you want to apply the one-year retention policy now, contact the Microsoft Support team.\n</p><p>To ensure you have access to attendance reports for all meetings created before November 1, 2024, we recommend that you download attendance data using the Attendance tab. <b>Note: </b>There is no bulk download option. Learn how to access the attendance report for your event: <a href=\"https://support.microsoft.com/office/manage-meeting-attendance-reports-in-microsoft-teams-ae7cf170-530c-47d3-84c1-3aedac74d310\" target=\"_blank\">Manage meeting attendance reports in Microsoft Teams - Microsoft Support</a> (will be updated before rollout)\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins and users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is implementing a one-year retention policy for meeting attendance reports, effective immediately. This applies to all Teams platforms and impacts Microsoft Graph API requests. Attendance reports for meetings before November 1, 2024, will be accessible until late August 2025. Contact Microsoft Support to apply the policy now."
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1022529",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-04T00:37:56.62Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-04T00:37:39Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Updated retention policy for meeting attendance reports",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
