{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As mentioned in MC540749, in March 2026, Microsoft Entra ID (formerly known as Azure Active Directory) and Microsoft Intune will retire the Conditional Access “Require approved client app” grant control. Instead we recommend utilizing the \"Require application protection policy\" grant control, which provides the same data loss and protection with additional benefits.</p><p><b>How this will affect your organization:</b></p><p>If you have a Conditional Access policy with \"Require approved client app\" grant control configured, after this change, you will no longer be able to enforce this control, it will be as if this grant is not selected.</p><p><b>What you need to do to prepare:</b></p><p>We recommend updating your Conditional Access policy to using the \"Require application protection policy\" grant control. For more information, see <a href=\"https://learn.microsoft.com/azure/active-directory/conditional-access/migrate-approved-client-app\" target=\"_blank\">Migrate approved client app to application protection policy in Conditional Access</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "\"Require approved client app\" control in Microsoft Entra Conditional Access will be retired in March 2026. Organizations should update their policies to use the \"Require application protection policy\" grant control. For more information, visit the provided link."
    },
    {
      "Name": "ExternalLink",
      "Value": "http://aka.ms/RetireApprovedClientApp"
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1029989",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-12T23:05:10.593Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-12T23:05:01Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Reminder: \"Require approved client app\" control in Microsoft Entra Conditional Access will be retired in March 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
