{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: We will change how users switch back from new Microsoft Outlook to classic Outlook for Windows to make it easier for users to simultaneously use classic Outlook and new Outlook.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out the default behavior to keep new Outlook minimized after a user switches out of new Outlook in mid-May 2025 and expect to complete by late May 2025.</p><p>General Availability (Worldwide, GCC): We will begin rolling out an option to open classic Outlook without switching out of new Outlook in early June 2025 and expect to complete by late July 2025.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, if users switch from classic Outlook to new Outlook, they must switch back to use classic Outlook again. </p><p>After this rollout, users will be able to use classic Outlook without switching out of new Outlook. When users select the toggle in new Outlook, they will have the option to open classic Outlook or switch back to classic Outlook.</p><ul><li>If users choose to open classic Outlook, it will launch right away without requiring the user to switch back. Learn more: <a href=\"https://support.microsoft.com/en-us/office/switch-to-new-outlook-for-windows-f5fb9e26-af7c-4976-9274-61c6428344e7\" target=\"_blank\">Switch to new Outlook for Windows - Microsoft Support</a>.</li><li>If users choose to switch back to classic Outlook, new Outlook will be minimized in the taskbar and classic Outlook will launch, allowing users to seamlessly use both apps. New Outlook notifications and reminders will be suppressed for that session and classic Outlook notifications will be shown.</li></ul><p>\n</p><p>This change will be on by default and will not change existing settings or defaults for your organization.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will update the behavior for switching between new and classic Outlook for Windows. Starting mid-May 2025, new Outlook will stay minimized when switching back to classic Outlook. From early June 2025, users can open classic Outlook without leaving new Outlook. This change requires no admin action and will be automatic."
    }
  ],
  "EndDateTime": "2025-07-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066342",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-01T22:33:30.723Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T22:32:41Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Updated behavior for switching back from new Outlook to classic Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
