{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 6, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon: The Microsoft Viva Glint admin can enable the Microsoft Copilot feature control for the Company admin user role in the Viva Glint survey <i>Program Setup.</i> Admins can enable the control in the <i>Reporting </i>tab of the <i>Program Summary</i> setup.</p><p>A license for Viva Glint, Microsoft Viva Suite, or Microsoft Viva Workforce Analytics and Employee Feedback is required to access this feature.\n</p><p>This message applies to Glint for the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489219\" target=\"_blank\">489219</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late July 2025 (previously mid-May) and expect to complete by late August 2025 (previously mid-May).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, the Copilot feature control is disabled for the Viva Glint admin user role in the Viva Glint survey <i>Program Setup.</i> Viva Glint admin users need to add themselves to another user role to enable Copilot. This restriction is a Copilot enablement blocker for customers. \n</p><p>This rollout will not impact the tenant administrator's workflow. This is an enhancement to the Viva Glint service administrator's workflow.\n</p><p>This change will be on by default.</p><p>How to enable Copilot in Viva Glint in the Program Summary &gt; <i>Reporting </i>tab:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/29c981d9-8cea-4458-b724-afb1c2b5f0a9\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/glint/copilot/admin-enable\" target=\"_blank\">Administrator enablement for Microsoft 365 Copilot in Viva Glint | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489219"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot in Viva Glint will be enabled for the Company admin user role starting late July 2025, completing by late August 2025. Admins can enable this in the Reporting tab of Program Summary. A relevant license is required. No admin action is needed before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061107",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-06T18:59:14.53Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T00:55:56Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot in Viva Glint: Viva Glint admin can enable Copilot for the Company admin user role",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
