{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Engage: We will modernize email subscription management to deliver a more intuitive, user-friendly experience. Before this rollout, unsubscribe and notification links in in Viva Engage emails opened legacy web pages with limited functionality. After this rollout, those links will take users to refreshed pages where they can more easily manage their preferences. Users will be able to unsubscribe from or resubscribe to individual email types in a cleaner, more accessible workflow.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489829\" target=\"_blank\">489829</a>.</p><p><b>When this will happen:</b> \n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, no admin actions are required. Users will experience these changes:</p><ul><li>Users who select notification links in Viva Engage emails will be taken to the modernized notification settings page in Viva Engage for the web, instead of being taken to legacy pages.\n</li><li>We will remove the legacy <i>Unsubscribe from all </i>option. Users must now subscribe or unsubscribe to individual notification types on the new settings page.\n</li></ul><p>This rollout does not change the underlying email delivery or preference management functionality.\n</p><p>Users who have bookmarked old unsubscribe URLs should remove or update those links.</p><p>The <i>Unsubscribe </i>link in a Viva Engage notification email:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/92b44412-523e-4d78-bb33-7e7adff8d0ef\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The new <i>Unsubscribe </i>screen in Viva Engage<i> &gt; Settings &gt; Notifications:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/806becd3-587b-4630-bd41-efb04eff8076\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The new <i>Resubscribe </i>screen in Viva Engage<i> &gt; Settings &gt; Notifications:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c78fee99-4445-4309-8e05-9aeed7d27ad9\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><ul><li>Review the new notification settings page in the Viva Engage web app.</li><li>Update any internal documentation or user guidance to reference the new workflow.\n</li><li>Communicate to your users that email preferences are now managed in the notification settings page.\n</li><li>No additional administration or configuration is required. Links will automatically redirect after the rollout begins.</li></ul><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/viva_engage_blog/embracing-a-fully-modern-viva-engage-experience/4403008\" target=\"_blank\">Embracing a Fully Modern Viva Engage Experience | Microsoft Community Hub</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489829"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will update email subscription management in mid-May 2025, offering a more intuitive experience. Users will manage preferences on modernized pages, with the removal of the \"Unsubscribe from all\" option. No admin actions are required, but users should update bookmarks and internal documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2026-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1068265",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-05T23:16:33.85Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-05T23:16:17Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: Updated email subscription management",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
