{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce that M365 Copilot Chat experiences can now reason over your OneNote Pages. This enhancement will significantly improve productivity and efficiency by allowing users to quickly summarize takeaways or list all action items from their OneNote Pages within any M365 Copilot Chat experience. This feature will streamline workflows, reduce the time spent on manual tasks, and enhance collaboration across your organization.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=490722\" target=\"_blank\">490722</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out on late April 2025 and expect to complete by mid-May 2025.</p><p><b>How this will affect your organization:</b></p><p>M365 Copilot Chat experiences can now reason over your OneNote Pages. Users can now ask Copilot to summarize the takeaways or list all the action items from their OneNote Pages on any M365 Copilot Chat experience.</p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate. These features are available to users with a Copilot license.</p><p>Review the following resource to understand how to manage Microsoft 365 Copilot access within your organization:</p><ul><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-page\" target=\"_blank\">Manage Microsoft 365 Copilot scenarios in the Microsoft 365 admin center</a></li><li><a href=\"https://learn.microsoft.com/copilot/faq#managing--chat\" target=\"_blank\">Frequently asked questions about Copilot Chat</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490722"
    },
    {
      "Name": "Summary",
      "Value": "M365 Copilot Chat can now reason over OneNote Pages, allowing users to summarize takeaways or list action items. This feature will roll out from late April to mid-May 2025. Organizations should update training and documentation. Features are available to users with a Copilot license."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060856",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T17:34:36.31Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:33:12Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "OneNote Pages in M365 Copilot Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
