{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 16, 2025: We have updated the content. Thank you for your patience.\n</p><p>As we continue to enhance OneNote with a unified and modern experience, we want to remind you that OneNote for Windows 10 will reach end of support on October 14, 2025. To avoid disruptions, we strongly urge you to transition to OneNote on Windows (OneNote for Microsoft 365) and recommend uninstalling OneNote for Windows 10 as part of this process to avoid user confusion. This migration will ensure your team stay up to date with the latest features, security updates, and performance improvements.</p><p><b>When this will happen:</b></p><p>OneNote for Windows 10 will reach end of support on October 14, 2025.</p><p>How this affects your organization:]</p><ul><li><b>Enhanced Security &amp; Compliance</b>: OneNote for Windows 10 will not receive new security features, such as Sensitivity Labeling, because it does not support Microsoft Information Protection (MIP). As a result, users still using OneNote for Windows 10 will be unable to access labeled content once labeling is enabled in OneNote.\n</li><li><b>Access to New Features &amp; AI-Powered Copilot</b>: OneNote on Windows (Microsoft 365) is our primary OneNote experience, with ongoing investments in AI-powered tools like Copilot to boost productivity. OneNote on Windows 10 no longer receives any new functionality.\n</li><li><b>Improved Performance &amp; Support</b>: OneNote for Windows 10 no longer receives updates or bug fixes, which may impact performance over time.\n</li><li><b>Enhanced Sync &amp; Collaboration</b>: OneNote for Microsoft 365 is continually improving sync and reliability. Starting in June 2025, users of OneNote for Windows 10 may experience changes to their sync behavior due to updates in security and services, which may require reopening notebooks to resume syncing. Additionally, the sync experience on OneNote for Windows 10 may be slower compared to OneNote on Windows.\n</li><li><b>A Smooth Transition Experience</b>: Starting in July 2025, users of OneNote for Windows 10 will receive in-app banner notifications guiding them to switch to OneNote for Microsoft 365 ensuring a smooth transition and continuity in their workflow.</li></ul><p><b>What you can do to prepare:</b></p><p>To help your users transition smoothly, we recommend starting the migration process now. Our migration guide and script are available to support you every step of the way.\n</p><p>Migration guide: <a href=\"https://learn.microsoft.com/en-us/microsoft-365-apps/deploy/onenote-for-windows-10-migration-guide\" target=\"_blank\">OneNote for Windows 10 migration guidance - Microsoft 365 Apps | Microsoft Learn</a></p><p>\n</p><p>For assistance, contact:\n</p><ul><li><b>Microsoft Support\n</b></li><li><b>OneNote In-app Support</b> via Help &gt; Support in OneNote on Windows.</li></ul><p>We appreciate your partnership in making this transition as smooth as possible for your organization. Thank you for your continued support!</p><p>\n</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneNote for Windows 10 will reach end of support on October 14, 2025. Users are urged to migrate to OneNote on Windows (Microsoft 365) to ensure access to new features, security updates, and improved performance. A migration guide is available to assist with the transition."
    }
  ],
  "EndDateTime": "2025-12-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1035701",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-16T18:58:27.947Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T00:12:34Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Immediate Action Required: 6 Months left, Migrate to OneNote on Windows Now!",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
