{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 3, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>To help you manage metered consumption costs for Microsoft 365 Copilot Chat, we will introduce a new <i>Message consumption</i> usage report in the Microsoft 365 admin center. The new report will give you visibility into billed messages associated with your Microsoft 365 Copilot pay-as-you-go billing policies and includes total messages consumed, cumulative and daily time series, and messages per user, per billing policy, per agent, and per agent-user pair. The new report will roll out in preview. During the preview stage, the report will display a maximum of 30 days of message consumption history. Usage information from prior to May 3, 2025, will not be available in the report.</p><p>This message refers to Microsoft Copilot in a pay-as-you-go model. A Microsoft Copilot license is not required.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490738\" target=\"_blank\">490738</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early May 2025 and expect to complete by late May 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late September 2025 (previously late July) and expect to complete by late September 2025 (previously late July).</p><p><b>How this will affect your organization:</b>\n</p><p>After you have set up pay-as-you-go billing for Microsoft 365 Copilot, either in the Microsoft 365 admin center or the Microsoft Power Platform admin center, and you have enabled agent usage in your organization, you will see a new report including metrics for messages consumed at the levels of tenant, users, agents, and agent-user. To help you mitigate overspending, you will see alerts when users have consumed more than 2000 billed messages.\n</p><p>This new report will be on by default and will be available in the Microsoft admin center at <i>Reporting &gt; Usage &gt; Microsoft 365 Copilot &gt; Message consumption:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/867710a2-68ce-4be5-b801-a0971a83a225\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify any admins that manage agents on the integrated apps page about this feature.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/activity-reports/message-consumption\">Microsoft 365 reports in the admin center - Message consumption</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490738"
    },
    {
      "Name": "Summary",
      "Value": "A new Message consumption usage report for Microsoft 365 Copilot Chat will be introduced in the admin center to help manage metered consumption costs. It includes detailed metrics and alerts for high usage. The preview starts in May 2025, with general availability in September 2025. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2025-11-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1069563",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-04T16:10:55.9Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-07T23:47:17Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Usage reports to manage metered consumption costs for Microsoft 365 Copilot Chat (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
