{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This feature provides the ability for organizers and presenters to quickly add a missing presenter to an ongoing Teams town hall, webinar, or structured meeting even if the missing presenter was not originally included in the event scheduling form. If the organizer or presenter realizes they've forgotten to add someone as a presenter, they can easily call them in directly from the participant roster. From the roster, organizers can choose whether to call them in as a presenter or attendee even if they are not already attending the session as an attendee. Organizers and presenters can only promote someone as a presenter if they are already in the session. With just a few clicks, the missing presenter is instantly promoted to presenter status, allowing them to join the green room, share content, control the presentation, or interact with the meeting participants.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485812\" target=\"_blank\">485812</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late May 2025 and expect to complete by early June 2025.</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.</p><p>General Availability (GCC High, DoD): We will begin rolling out late June 2025 and expect to complete by early July 2025.</p><p><b>How this will affect your organization:</b></p><p>This feature will automatically be available to use once it releases. </p><p>To use this new feature, organizers and presenters must go to the roster and call in someone into the event.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/0956cf35-8375-499a-a425-ac96b6010561\" style=\"width: 500px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485812"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will allow organizers and presenters to quickly add a missing presenter from the roster during town halls, webinars, or structured meetings. This feature will roll out between late May and early July 2025, depending on the release phase. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1059676",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-21T23:44:17.96Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-21T23:44:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Easily call in a presenter from the roster for town halls and webinars",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
