{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 26, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft SharePoint: Cards can be animated for some web parts (Editorial cards, Images, and People) in SharePoint Pages, News, and Microsoft Viva Amplify.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481510\" target=\"_blank\">481510</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late-April 2025 and expect to complete by early May 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early May 2025 and expect to complete by late May 2025. </p><p><b>How this will affect your organization:</b></p><p>This feature will be enabled by default for new cards created after the feature is released. Users can disable card animation in the web part property pane. To add animation to existing web parts, users can enable the setting in the web part property pane. To preview the card animation, view the published page or use Preview mode.\n</p><p>Pages and web parts created before this rollout are not impacted by this change.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481510"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint will introduce a new card animation feature for Pages, News, and Microsoft Viva Amplify starting late April 2025. This feature will be enabled by default for new cards and can be managed in the web part property pane. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024394",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-26T15:10:09.073Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:50:27Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: New card animation feature for Pages, News, and Microsoft Viva Amplify",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
