{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Copilot Agents are coming soon to both the Web and Work tabs of Microsoft 365 Copilot Chat in Outlook for the Web and the new Outlook for Windows.</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481558\" target=\"_blank\">481558</a>&nbsp;</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late March 2025 and expect to complete by early April 2025.</p><p><b>How this will affect your organization:</b></p><p>\n</p><p>Agents extend the capability of Microsoft 365 Copilot Chat in exciting ways, letting users customize their Copilot experience.\n</p><p>From Copilot in Outlook, the right-side panel will show agents that the user has previously installed or that their admin has previously deployed. The panel will also provide entry points to Get Copilot agents in the app store and to Create an agent.</p><p><b>What you need to do to prepare:</b></p><p>Agents in Outlook will respect the same admin controls as agents in Microsoft 365 Copilot Chat.\n</p><p>Admins can manage agents as apps in the Integrated apps section of the Microsoft 365 admin center. Admins can also enable or disable Copilot extensibility for their org, and control who can access agents within their organization.&nbsp;</p><p>Review:</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in Integrated Apps</a>.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481558"
    },
    {
      "Name": "Summary",
      "Value": "Agents for Microsoft 365 Copilot Chat in Outlook will be available on the Web and Work tabs starting late March 2025. Admins can manage these agents in the Microsoft 365 admin center. Users can customize their Copilot experience with these agents, which will appear in the right-side panel of Outlook."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1020219",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-28T22:19:07.537Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T22:18:47Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Agents in Microsoft 365 Copilot Chat in Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
