{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon in Microsoft Defender for Identity (MDI): The public preview of Active Directory domain-based scoping. This capability is a foundational step in extending role-based access control (RBAC) as part of the broader XDR unified role-based access control (URBAC) initiative.\n</p><p>This new capability enables organizations to define and refine the scope of Microsoft Defender for Identity monitoring, providing more granular control over which entities and resources are included in security analysis.\n</p><p>Many organizations using Defender for Identity operate across multiple Active Directory domains and need a way to delegate access based on responsibility or ownership. As organizations grow and manage complex identity environments, the ability to control who can access what (and where) is critical. Customers have this capability for Microsoft Defender for Endpoint with device groups and are expecting a similar capability for Defender for Identity.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early June 2025 and expect to complete by late June 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late July 2025 and expect to complete by late August 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With AD domain-based scoping currently available for Microsoft Defender for Identity, organizations can limit visibility and investigation access based on Active Directory domains using XDR URBAC. This provides more control over who can access which alerts, activities, and identity data—supporting operational separation and minimizing unnecessary exposure across teams.\n</p><p><b>What you need to do to prepare:</b></p><p>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your admins about this change and update your relevant documentation.</p><p>This feature is available by default for admins to configure. No configuration is applied by default. To enable scoped access, go to Microsoft Defender XDR &gt; <i>Permissions and roles</i>. On the <i>Assignment </i>page, select Microsoft Defender for Identity as the data source and define the relevant Active Directory domains for each role.</p><p>Learn more: <a href=\"https://learn.microsoft.com/defender-for-identity/whats-new\" target=\"_blank\">What's new - Microsoft Defender for Identity | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity will soon offer Active Directory domain-based scoping in public preview starting June 2025 and general availability by August 2025. This feature allows organizations to control access based on AD domains, enhancing security and operational separation. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1091443",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-10T23:15:06.1Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-10T23:14:59Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender XDR: Scoped access for Defender for Identity (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
