{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft SharePoint: The dashboard layout webpart will be available on all sites and pages.</p><p>Before this rollout, the dashboard webpart is limited to Home sites.\n</p><p>After this rollout, the dashboard webpart will be extended to Team sites and Communication sites.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486832\" target=\"_blank\">486832</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p>This feature will be on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486832"
    },
    {
      "Name": "Summary",
      "Value": "The dashboard layout web part in Microsoft SharePoint will be available for all sites, including Team and Communication sites, starting late May 2025. This feature will be on by default and requires no action, but notifying users and updating documentation is recommended. More details are on Microsoft 365 Roadmap ID 486832."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1074095",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-14T23:41:35.037Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-14T23:41:22Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: Dashboard web part will be available for all sites",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
