{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting mid-March 2025, Copilot Chat will be automatically pinned in the Microsoft 365 Copilot mobile app for <a href=\"https://learn.microsoft.com/copilot/manage#microsoft-365--chat-eligibility\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Copilot Chat-eligible users</a> who newly install the app or are redirected to the previously installed app while trying to access Copilot from an external source. Copilot Chat will not be automatically pinned if the admin has  blocked pinning for their users or blocked the Copilot Chat in the Microsoft 365 Copilot mobile app entirely.</p><p>Note: </p><ul><li>There is no change for Microsoft 365 Copilot-licensed users - Copilot Chat is already pinned by default in the Microsoft 365 Copilot mobile app when users are assigned the license.\n</li><li>These updates apply to mobile scenarios only. Any additional updates to pinning Copilot Chat for other surfaces will be communicated via future Message center posts.</li></ul><p><b>When this will happen:</b></p><p>General Availability (WW Production): We will begin rolling out mid-March 2025 and expect to complete by mid-April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Copilot Chat-eligible users will have Copilot Chat automatically pinned in the Microsoft 365 Copilot mobile app in the following scenarios:\n</p><ul><li>The Microsoft 365 Copilot app is newly installed\n</li><li>An eligible user is redirected to the previously installed Microsoft 365 Copilot mobile app when:\n<ul><li>Trying to sign into the Microsoft Copilot mobile app or Bing mobile app with their Entra account\n</li><li><i>(Android-only)&nbsp;</i>Selecting “Ask Copilot” from the context menu after highlighting text in an app (for example, a mobile browser).\n</li></ul></li></ul><p>Scenarios outside those listed above will continue to prompt users to pin Copilot Chat in the Microsoft 365 Copilot app via a consent dialog.</p><p><b>What you need to do to prepare:</b>\n</p><p>Copilot Chat-eligible users will have Copilot Chat automatically pinned in the Microsoft 365 Copilot mobile app in the above scenarios – no action is required.\n</p><p>To prevent Copilot Chat from being automatically pinned in the Microsoft 365 Copilot mobile app in the above scenarios, admins can use the <a href=\"https://learn.microsoft.com/copilot/manage#how-to-pin--chat-in-the-microsoft-365--app-microsoft-teams-and-outlook\" target=\"_blank\">Copilot Chat pinning control</a> or <a href=\"https://learn.microsoft.com/copilot/manage#removing-access-to--chat\" target=\"_blank\">manage Copilot Chat in the app using Intune</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting mid-March 2025, Copilot Chat will be automatically pinned in the Microsoft 365 Copilot mobile app for eligible users who newly install the app or are redirected to it. Admins can block this pinning. This update applies only to mobile scenarios, with completion expected by mid-April 2025. No action is required unless admins want to prevent automatic pinning."
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1023482",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-05T01:10:14Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T01:10:07Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Updates to pinning Microsoft 365 Copilot Chat (“Copilot Chat”) within Microsoft 365 Copilot mobile app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
