{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire <i>Organization</i> data types in Microsoft Excel effective July 31, 2025. This feature has low usage and high ongoing sustaining costs.</p><p>Instead, we recommend customers switch to the G<i>et Data &gt; From Power BI </i>import feature on the <i>Data </i>ribbon in Excel to import data from Power BI or an add-in to create custom rich entities for the organization.\n</p><p>This retirement affects Excel for Windows desktop, Excel for Mac desktop, Excel for the web, and Excel for iOS/Android.\n</p><p>After this retirement, we will remove the <i>Organization </i>option from the <i>Data Types</i> gallery on the <i>Data </i>tab on the ribbon, and users will not be able to convert values to new organization types.  Existing data in workbooks that used the <i>Organization </i>data type will be preserved but will no longer refresh. This change will have no impact on Bing data types, which we will continue to support.</p><p><i>Learn more</i></p><ul><li><a href=\"https://support.microsoft.com/office/use-organization-data-types-to-view-and-insert-data-c7686113-f906-40c8-b9eb-d97c41702469\" target=\"_blank\">Use Organization data types to view and insert data - Microsoft Support</a></li><li><a href=\"https://learn.microsoft.com/power-bi/collaborate-share/service-connect-power-bi-datasets-excel\" target=\"_blank\">Connect Excel to Power BI semantic models - Power BI | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/office/dev/add-ins/excel/excel-data-types-overview\" target=\"_blank\">Overview of data types in Excel add-ins - Office Add-ins | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Excel will retire the Organization data types feature on July 31, 2025, due to low usage and high costs. Users are advised to use the \"Get Data > From Power BI\" import feature or an add-in for custom entities. This change affects all Excel platforms, but existing data will be preserved without refresh capability. Bing data types remain supported."
    }
  ],
  "EndDateTime": "2025-10-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1072405",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-12T23:38:44.233Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-12T23:38:35Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Excel: Organization data types will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
