{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>If your organization does not support Android devices, you can safely ignore this message.\n</p><p>As part of our overall security hardening efforts, we will migrate Microsoft Entra ID device registration to be hardware-bound. Since the device identity will be hardware-bound, we will retire the ability for users to enable a feature called <i>Enable Browser Access </i>(EBA) in the Microsoft Authenticator app and the Microsoft Company Portal app for Android. After this retirement, browser access will automatically be enabled as part of device registration.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): This change will start to roll out in July 2025. We will update this message with a more specific timeline closer to July 2025.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No action or preparation is required from admins or users regarding this change. The change will occur automatically.\n</p><p>The <i>Enable Browser Access</i> feature will retire from the Company Portal and Authenticator apps for Android:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5adf2eac-6eb7-45b5-933d-334324a1dc12\" style=\"width: 300px;\" alt=\"user controls\">\n</p><p>This change was first announced in <a href=\"https://techcommunity.microsoft.com/blog/microsoft-entra-blog/whats-new-in-microsoft-entra---september-2024/4253153\" target=\"_blank\">What's new in Microsoft Entra - September 2024 | Microsoft Community Hub</a> (September 2024).\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Browser access will be enabled by default for all Android users in Microsoft Entra starting July 2025. The Enable Browser Access feature will be retired, and no action is required from admins or users. This change is part of security enhancements and will occur automatically."
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024404",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-05T23:58:44.12Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:57:40Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Entra: Browser access will be enabled by default for all Android users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
