{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft OneDrive for the web and Microsoft SharePoint Online will be able to display a table of contents if a PDF already has one. Users can select an item in the table of contents to jump directly to the location of that item in the PDF.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486859\" target=\"_blank\">486859</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-June 2025 and expect to complete by early July 2025.</p><p>\n</p><p><b>How this will affect your organization:</b></p><p>1. Open a PDF in OneDrive for the web or in SharePoint. If your PDF contains a table of contents, it will show up on the left side of your screen:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b7ddec0d-0f1c-445c-965b-e924f06f6ea2\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>2. Select any line item to jump directly to the page</p><p>3. To close the table of contents, select the X in the top right of the panel. Select the <i>View the table of contents</i> icon in the top left of the panel to open it again:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2f47441c-d063-4072-9a86-913339f723e9\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>Note: Some users may see this feature before other users within your organization. \n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486859"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft OneDrive and SharePoint will display a table of contents for PDFs that have one, allowing users to navigate directly to sections. This feature will roll out from mid-June to early July 2025 and will be enabled by default. No admin action is required, but user notification is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1077863",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-19T23:45:02.063Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-19T23:44:35Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft OneDrive and Microsoft SharePoint: Use the table of contents in a PDF to navigate",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
