{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 28, 2025: We have updated the content Thank you for your patience.</p><p>Before this rollout, Microsoft Viva Engage customers had access to 24 months of data, which displayed as year-over-year deltas in Engage analytics dashboards and \"All time\" data filters in some experiences like campaign analytics. \n</p><p>To strengthen privacy posture and data minimization, Viva Engage will no longer retain personal data in service-related data used for Viva Engage analytics or diagnostic purposes for longer than 18 months. After this rollout, we will remove any year-over-year analysis surfaced in Viva Engage analytics.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in early June 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b></p><p>No admin action is required as the change to remove year over year analysis will be removed by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p><i>Learn more</i></p><ul><li><a href=\"https://support.microsoft.com/topic/monitor-engagement-in-viva-engage-with-analytics-0d9f6fd5-6b0c-45a2-a0aa-0576ae1f6895\" target=\"_blank\">Monitor engagement in Viva Engage with analytics - Microsoft Support</a></li><li><a href=\"https://learn.microsoft.com/viva/engage/analytics\" target=\"_blank\">View and manage analytics in Viva Engage | Microsoft Learn</a><p></p></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will reduce analytics data retention from 24 months to 18 months starting in June 2025 to enhance privacy. No admin action is required, but organizations should review the impact and notify users. Year-over-year analysis will be removed."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1059672",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-28T20:20:59.25Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-21T23:42:09Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Analytics data retention will be 18 months instead of 24 months",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
