{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Viva Learning Search will soon detect and correct spelling errors in user queries, using the corrected query to perform searches and return relevant results. Users can choose to override Spell check and search with their original query.</p><p>This feature is available in all languages that Viva Learning supports and is available to customers with licenses for Viva Learning or Viva Learning Premium.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=162943\" target=\"_blank\">162943</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out late January 2025 and expect to complete by late February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, to make Spell check available for users, admins must first enable optional connected experiences in Microsoft 365 admin center. Then users must enable Optional connected experience in Viva Learning &gt; Select the gear icon &gt; <i>Settings &gt; Privacy:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/92508e45-df35-4fb3-ad9e-b36328b12986\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>When a user uses Viva Learning Search on the Home page, My Learning tab, Search engine results page, or in Content curation window), the search query is automatically checked for errors using Microsoft Bing spell check APIs. To find the language used for Spell check in Viva Learning, users can check select the three dots in the top right of the screen &gt; <i>Settings &gt; Language).</i></p><p>If the spell check corrects a phrase that should not be corrected (for example: \"Company specific terms\"), the user can override spell check by selecting “Search instead for <b>the original query</b>:\"\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/74b55dbe-6569-4744-829c-bcba6a38bcd1\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>When spell check is skipped, Viva Learning displays “Did you mean…” to quickly search using corrected queries:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/0f859cd9-e8cf-468c-9188-2f5d1116cee0\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>Pages and features that include spell check\n</i></p><ul><li>Home page Search\n</li><li>My Learning Search\n</li><li>Search features in:\n<ul><li>Learning path\n</li><li>Feature set\n</li><li>Academy\n</li><li>Learning collections\n</li><li>Permissions\n</li><li>Learning tab\n</li></ul></li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Per the <a href=\"https://www.microsoft.com/privacy/privacystatement\" target=\"_blank\">Microsoft privacy statement</a>, Spell check in Viva Learning is be governed by the optional connected experiences policy setting that can be managed by administrators and users\n.</p><ul><li>Admin documentation (includes some user documentation): <a href=\"https://learn.microsoft.com/microsoft-365-apps/privacy/optional-connected-experiences\" target=\"_blank\">Overview of optional connected experiences in Office - Deploy Office | Microsoft Learn</a>\n</li><li>User documentation: <a href=\"https://learn.microsoft.com/viva/learning/optional-connected-experiences\" target=\"_blank\">Optional Connected Experiences | Microsoft Learn</a></li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "162943"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Learning will introduce a spell check feature for search queries, correcting errors automatically. Users can override corrections if needed. Available in all supported languages, this feature requires enabling optional connected experiences. Rollout begins late January 2025 and completes by late February 2025. Admin and user documentation is provided."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1005516",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-14T01:16:42.46Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-14T01:16:28Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Learning: New Spell check feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
