{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Introducing pay-as-you-go departmental billing for SharePoint Agents in Copilot Control System.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Starting early June 2025, M365 Administrators can set up Pay-as-you-go for SharePoint Agents via Copilot Control System. Administrators can add billing polices and connect to SharePoint Agents to establish departmental chargeback and billing.</p><p><b>How this will affect your organization:</b></p><p>Admins can set up Pay-as-you-go for SharePoint Agents in Copilot under “Billing &amp; usage”. They can connect Billing Policies to SharePoint Agents, allowing end users within those policies to use SharePoint Agents.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a602f734-f754-4789-98c6-10f9db80cdfb\" width=\"400\" height=\"\"></p><br><p><b>What you need to do to prepare:</b></p><p>Before applying billing policies to SharePoint Agents in Copilot Control System, customers who have already set up SharePoint Agents for consumptive billing must:</p><ol><li>Turn off the legacy tenant-level pay-as-you-go for SharePoint Agents from Copilot -&gt; Billing &amp; usage.</li><li>Create the required Billing Policy </li><li>Connect the Billing Policy to SharePoint Agents</li></ol><p></p><br>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting June 2025, Microsoft 365 administrators can set up pay-as-you-go billing for SharePoint Agents via the Copilot Control System. Admins must disable legacy tenant-level billing, create new billing policies, and connect these policies to SharePoint Agents for departmental chargeback and billing."
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075905",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-16T22:21:48.303Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:21:40Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Onboard SharePoint agents as a Pay-as-you-go scenario",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
