{
  "ActionRequiredByDateTime": "2025-07-01T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 6, 2025: We have updated the timeline. Thank you for your patience.</p><p>We’re making some changes to DNS provisioning of A records for all new Accepted Domains provisioned after August 1st, 2025. Between early August and late August, 2025 (previously July 1st and August 1st, we will gradually switch provisioning of all A records for new Accepted Domains into the new subdomains under mx.microsoft.</p><p>We are doing this to reduce the friction of adopting DNSSEC in the long run. DNSSEC is a set of extensions to DNS that provides cryptographic verification of DNS records, preventing DNS spoofing and adversary-in-the-middle attacks to DNS.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After August 1st, 2025, all A records for new Accepted Domains will be provisioned into the new subdomains under mx.microsoft.\n</p><p>DNS resolution will safely fallback to “plain” DNS if a domain is not DNSSEC enabled. If an Accepted Domain you add to the Exchange Admin Center after August 1st is not secured with DNSSEC at the domain level (ex. contoso.com), then DNS resolution will work as usual. If an Accepted Domain you add to the EAC after August 1st is secured with DNSSEC, then DNSSEC will extend to the mx.microsoft DNS record automatically and you will get the benefits of DNSSEC without having to take any further action. Any issues with DNSSEC can be addressed by disabling DNSSEC for the Accepted Domain (ex. contoso.com) via your DNS provider.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>If you have any automation in place, for example in workflows for Domain Setup, for MX record creation that expects A records for newly provisioned Accepted Domains to be provisioned in mail.protection.outlook.com, this automation needs to be updated by August 1st to use List serviceConfigurationRecords Graph API (<a href=\"https://learn.microsoft.com/graph/api/domain-list-serviceconfigurationrecords?view=graph-rest-1.0&amp;tabs=http\" target=\"_blank\">List serviceConfigurationRecords</a>). Use List serviceConfigurationRecords to retrieve the mailExchange value for your MX record. After August 1st, List serviceConfigurationRecords Graph API will be the only source of truth for your Accepted Domains’ MX record value. You will not be able to rely on the Accepted Domain’s A record being provisioned in mail.protection.outlook.com after August 1st.</p><p>If you are using automation that expects the record to end with mail.protection.outlook.com, when you add a new Accepted Domain to the Exchange Admin Center after August 1st, mail flow may not work upon initial configuration and you will have to update your MX record to match what the Exchange Admin Center says for the domain or use the mailExchange value returned by List serviceConfigurationRecords Graph API.\n</p><p>If you expect this change to cause any issues for your organization, please share that feedback. \n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting August 1, 2025, new Accepted Domains' A records will be provisioned under mx.microsoft subdomains to support DNSSEC adoption. Automation relying on mail.protection.outlook.com must update by August 1 to use the List serviceConfigurationRecords Graph API for MX records. DNS resolution will fallback if DNSSEC is not enabled."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1048624",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-06T19:56:26.147Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T23:12:38Z",
  "Tags": [
    "Updated message",
    "Admin impact"
  ],
  "Title": "DNS Provisioning Change",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
