{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the shift bidding for customer service representatives feature for Dynamics 365 Contact Center. This feature allows schedulers to manage and release shifts for bidding, allowing customer representatives to bid on shifts that align with their preferences and availability. This feature will reach general availability on May 2, 2025.<br><br><b>How does this affect me?</b><br>Shift bidding allows customer service representatives to participate in selecting their shifts through a bidding process. This feature adds the following:<ul><li><b>Bid for shifts</b> - Allows customer service representatives to view available shifts and submit bids from <i>My Schedule</i> or via the <i>Request Management</i> sections.</li><li><b>Select preferred shifts</b> - Allows customer service representatives to place bids based on their preferred working hours, choosing shifts that fit their schedules.</li><li><b>Shift release for bidding</b> - Allows schedulers to release shift plans for bidding, which gives customer service representatives the opportunity to bid on the shifts they prefer.</li><li><b>Bidding management</b> - Allows schedulers to review and manage shift bidding requests within the shift plan or from the Request Management section to ensure appropriate staffing levels.</li></ul><b>What action do I need to take?</b><br>An administrator must install the Workforce Management for Customer Service package in the Power Platform admin center to activate this feature. To accomplish this, take the following steps:<ol><li>Log in to the Power Platform Admin Center using your administrator credentials.</li><li>In the left navigation menu, click on Environments.</li><li>Click to open the details for the environment where Workforce Management (WFM) needs to be enabled.</li><li>From the toolbar, select Resources and then choose Dynamics 365 Apps.</li><li>In the Dynamics 365 Apps section, click the Install App button.</li><li>From the list of available apps, select Workforce Management for Customer Service and click Next.</li><li>Review the terms of service, agree to them, and click Install to begin the installation process.</li></ol>If you would like more information on this feature, please visit <a href=\"https://aka.ms/10345\" target=\"_blank\">Use shift bidding to select shifts</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-26T21:42:33Z",
  "HasAttachments": false,
  "Id": "MC1062977",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-26T21:44:19.897Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-26T21:42:33Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Shift bidding for customer service representatives",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
