{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 7, 2025: We have updated the timeline below. Thank you for your patience.</p><p>The user privacy setting for optional connected experiences, already available in other Microsoft Outlook and Microsoft 365 apps, will soon be available in Microsoft Outlook on the web.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=467248\" target=\"_blank\">467248</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early March 2025 and expect to complete by late March 2025.\n</p><p>General Availability (GCC): We will begin rolling out in early April 2025 and expect to be complete by late May 2025 (previously late April).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, to configure the privacy setting for optional connected experiences, users can go to <i>Settings &gt; General &gt; Privacy and data &gt; Privacy settings:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/06aed45d-ba94-4769-8c81-d7eb228cb408\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>On the Privacy settings screen, select the toggle for <i>Turn on optional connected experiences:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/d4ede23f-7c77-450e-979e-3ee3521ccfb7\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>This privacy setting applies across all devices where users are signed in with the same work or school account.\n</p><p>As an admin, if you have already made optional connected experiences available to your users in the Microsoft 365 Apps admin center, this setting will be turned on for Outlook on the web when users receive this rollout. Learn more:</p><ul><li> <a href=\"https://learn.microsoft.com/microsoft-365-apps/privacy/office-web-privacy-controls\" target=\"_blank\">Use policy settings to manage privacy controls for Office for the web applications - Microsoft 365 Apps | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Microsoft 365 Apps | Microsoft Learn</a>\n</li></ul><p><b>NOTE:</b> If a user has already turned off this setting in another Outlook or Microsoft 365 app, this setting in Outlook on the web will also be turned off when the user receives this rollout.  \n</p><p><b>What you need to do to prepare:</b>\n</p><p><span>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</span>\n</p><p><i>Learn more\n</i></p><ul><li>About privacy controls for optional connected experiences: <a href=\"https://learn.microsoft.com/microsoft-365-apps/privacy/overview-privacy-controls#optional-connected-experiences-for-microsoft-365-apps-for-enterprise\">Overview of privacy controls for Microsoft 365 Apps for enterprise</a> (will be updated before rollout)\n</li><li>About Office on the web policy settings, including the new settings for Outlook on the web: <a href=\"https://learn.microsoft.com/microsoft-365-apps/privacy/office-web-privacy-controls\">Use policy settings to manage privacy controls for Office for the web applications</a> (will be updated before rollout)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "467248"
    },
    {
      "Name": "Summary",
      "Value": "The user privacy setting for optional connected experiences will be available in Microsoft Outlook on the web starting March 2025 for general availability and April 2025 for GCC. Users can configure this setting via Settings > General > Privacy and data > Privacy settings. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1022526",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-07T14:25:24.017Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-04T00:35:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook on the web: Optional connected experiences privacy setting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
