{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Based on your feedback, we’re simplifying the default pinning configuration for Copilot Chat in the Microsoft 365 Copilot app, Outlook, and Teams. This change only impacts users without a Microsoft 365 Copilot license.</p><p>Today, Global admins can pin Copilot Chat for their organization using the <a href=\"https://go.microsoft.com/fwlink/?linkid=2310640\" target=\"_blank\">Pin Microsoft 365 Copilot Chat admin setting</a> in the Microsoft 365 admin center. When no action is taken, the default configuration is that Copilot Chat is not pinned, but users are prompted to pin it.\n</p><p>We received feedback that this prompting can interrupt a user’s workflow as well as cause them to skip pinning. Once the prompt is skipped, users don’t know how to access Copilot in their apps. \n</p><p>To solve this, we are simplifying the admin setting to two options: “Pin” (the new default configuration) and “Do not pin.” If a tenant’s current configuration is “Allow users to be asked” (the current default configuration), it will transition to the new default configuration “Pin,” and Copilot Chat will be pinned for users.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/98b3c710-0673-41a6-9ab5-1eaa7df082b2\" width=\"400\" height=\"\">\n</p><p><b>When this will happen:</b></p><p>The rollout of this change begins May 1, 2025, and completes in the weeks following.</p><p><b>How this will affect your organization:</b>\n</p><p>There is no change to pinning for users with a Microsoft 365 Copilot license.\n</p><p>For users without this license, Copilot Chat will be pinned, as your tenant’s configuration shifts from “Allow users to be asked” to “Pin.” These users have the choice to unpin Copilot Chat in their navigation bar, which Microsoft would respect in future sessions.\n</p><p><b>What you need to do to prepare:</b></p><p>If you would like to inform users of this simplification, you could consider the following message: \n</p><p>“Copilot Chat, Microsoft’s free and secure generative AI powered by GPT-4o, is now pinned to the left navigation bar inside the apps you use like the Microsoft 365 Copilot app, Outlook, and Teams. Try it today to summarize, rewrite, or answer questions so you can work smarter and accomplish more.” \n</p><p>Learn more about pinning and managing Copilot Chat: <a href=\"https://learn.microsoft.com/copilot/manage\" target=\"_blank\">Manage Microsoft 365 Copilot Chat | Microsoft Learn.</a> \n</p><p>Discover how users can get value from Copilot Chat and agents: <a href=\"https://adoption.microsoft.com/en-us/copilot/chat-and-agent-starter-kit/\" target=\"_blank\">Microsoft 365 Copilot Chat and agent starter kit | Microsoft Adoption.</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is simplifying the default pinning configuration for Copilot Chat in Microsoft 365 apps, impacting users without a Copilot license. The default will change from prompting users to pin to automatically pinning Copilot Chat. This rollout begins May 1, 2025. Users can unpin Copilot Chat if desired."
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1045945",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-01T19:04:44.37Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-01T18:58:45Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Chat: Simplifying the default pinning configuration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
