{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce some important updates to M365\nCopilot Chat that will enhance security and user experience, following:&nbsp;</p><div><ol type=\"1\" start=\"1\" style=\"margin-top:0in\">\n <li style=\"margin: 0in 0in 8pt;\">Integration\n     with SafeLinks:&nbsp;</li>\n <ul type=\"disc\" style=\"margin-top:0in\">\n  <li style=\"margin: 0in 0in 8pt;\">M365\n      Copilot Chat will integrate with <a href=\"https://learn.microsoft.com/defender-office-365/safe-links-about?view=o365-worldwide\">SafeLinks      in Defender for Office 365</a> to provide time-of-click URL protection for\n      the hyperlinks included in its chat responses.&nbsp;</li>\n  <li style=\"margin: 0in 0in 8pt;\">This\n      change applies to users with Microsoft Defender for Office 365 Plan 1 or\n      Plan 2 service plans. No policy configuration is needed within the SafeLinks policy.</li><li style=\"margin: 0in 0in 8pt;\">Within Microsoft Defender for Office 365 Security Center, <a href=\"https://learn.microsoft.com/en-us/defender-office-365/reports-defender-for-office-365#url-protection-report\" target=\"_blank\">URL protection report</a> will show the relevant summary and trend views for threats detected and actions taken on URL clicks.</li>\n </ul>\n <li style=\"margin: 0in 0in 8pt;\">Native\n     Time-of-Click URL Reputation Check:&nbsp;</li>\n <ul type=\"disc\" style=\"margin-top:0in\">\n  <li style=\"margin: 0in 0in 8pt;\">For users\n      without SafeLinks protection (which is available as part of Microsoft Defender for Office 365), M365 Copilot Chat will natively enable time-of-click URL\n      reputation check for the hyperlinks returned in its chat responses.&nbsp;</li>\n </ul>\n <li style=\"margin: 0in 0in 8pt;\">Hyperlink\n     Redaction Changes:&nbsp;</li><ul><li>M365 Copilot Chat will no longer redact hyperlinks\nin its chat responses if they are found in the grounding data used to generate\nthe responses.</li></ul></ol><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in late March 2025 and expect to complete by late May 2025.</p><p>Rollout will start on desktop and web and will complete with mobile versions. We plan to extend these updates to Copilot Chat experiences in Office apps in the future.</p><p><b>How this will affect your organization:</b></p><p>These updates are designed to enhance the security of the links included in M365 Copilot Chat response, ensuring that users are protected from malicious URLs.</p><p><b>What you need to do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate to ensure users are aware of the change in behavior with hyperlinks in M365 Copilot Chat.</p></div>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Upcoming changes to M365 Copilot Chat include integration with SafeLinks for URL protection, native time-of-click URL reputation checks, and the cessation of hyperlink redaction. Rollout begins in late March 2025 and completes by late May 2025. These updates enhance link security in chat responses."
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1013453",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-21T23:38:32.73Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-21T23:38:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Upcoming Changes for M365 Copilot Chat with Link Safety",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
