{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 6, 2025: We have updated the content. Thank you for your patience</p><p> Do you have questions about deploying and using Teams for your frontline workers? Are you looking for ways to simplify everyday management and boost productivity? We’re the engineering team behind Microsoft Teams for Frontline, and we’re here to support you every step of the way. </p><p>Our mission is to empower your workforce with tools that streamline communication and enhance operational efficiency. </p><p>Join us during our Weekly Office Hours for real-time answers, best practices, and expert guidance on making the most of Teams for your frontline teams.</p><p><b>Note:</b> If you are not using frontline worker functionality, you can safely ignore this message.\n</p><p>We are pleased to announce new weekly Microsoft Teams Frontline Customer Office Hours: A dedicated time for you to engage directly with the product team to support Teams deployments for your frontline workers.\n</p><p><i>Objective: </i>This initiative aims to enhance live customer engagement and satisfaction by:\n</p><ul><li>Addressing deployment-related questions in real time\n</li><li>Providing direct support to ensure smooth and successful rollouts\n</li><li>Gathering customer feedback to improve frontline worker deployment features\n</li></ul><p><i>When are Customer Office Hours</i>\n</p><p></p><p>The Teams Frontline Customer Office Hours takes place every Wednesday from 9:00-9:30am PT.\n</p><p><i>What Do Office Hours Cover?</i>\n</p><p></p><ul><li>Customer Q&amp;A: Get answers to questions about deploying teams at scale for your frontline workers and overall deployment best practices.\n</li><li>Follow-ups: We will capture unresolved issues and address them after the meeting.\n</li><li>Feedback collection: Share your thoughts on recently released deployment features.\n</li></ul><p><i>Launch Timeline:</i> Teams Frontline Customer Office hours launched on January 22, 2025.\n</p><p>How to join: Join the Teams meeting with <a href=\"https://aka.ms/TeamsFrontlineCustomerOfficeHours\" target=\"_blank\">https://aka.ms/TeamsFrontlineCustomerOfficeHours</a></p><p><b>Who is this for?\n</b></p><p>This session is perfect for IT admins, managers, and anyone responsible for deploying or managing Microsoft Teams for their frontline workers.\n</p><p><b>Whether you're:\n</b></p><p><b>Deploying Teams</b> for the first time or scaling deployments for your frontline workers\n</p><p><b>Maximizing productivity</b> with Teams tools and apps\n</p><p><b>Integrating Teams into daily processes</b> to create seamless workflows\n</p><p><b>Optimizing existing setups </b>to reduce complexity and improve efficiency\n</p><p>We've got you covered.\n</p><p><b>What to Expect:\n</b></p><p><b>Real-Time Guidance</b>: Ask us anything about managing and using Teams for your frontline workers.\n</p><p><b>Best Practices &amp; Tips</b>: Learn how to streamline deployment, scale effectively, and integrate Teams into everyday processes.\n</p><p><b>Productivity Insights</b>: Discover new ways to enhance individual and team productivity with Teams.\n</p><p><b>Feature Updates</b>: Stay informed about new features and share your frontline scenarios with us.\n</p><p>Office Hours Details:\n</p><p>📅 Date: Every Wednesday\n</p><p>🕒 Time: 9:00 am - 9:30 am PST\n</p><p>📍 Location: Online (Teams Meeting)\n</p><p>🔗 Join Here: <a href=\"https://aka.ms/TeamsFrontlineCustomerOfficeHours\" target=\"_blank\">Teams Frontline Customer Office Hours&nbsp;</a></p><p>\n</p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Frontline Customer Office Hours are held every Wednesday from 9:00-9:30 am PT to assist with deploying Teams for frontline workers. The sessions provide real-time answers, best practices, and expert guidance. IT admins and managers can join online to enhance productivity and streamline workflows. Join here: https://aka.ms/TeamsFrontlineCustomerOfficeHours."
    }
  ],
  "EndDateTime": "2025-05-23T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1002406",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-06T18:58:27.63Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-11T00:23:26Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Customer Office Hours: Get help from the product team on deploying Teams for your frontline workers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
