{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 24, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Teams: When users select <i>Unread Chats</i>, by default they will land on the last message they read in the chat. This rollout will allow users to quickly continue reading new messages and eliminates manual scrolling to find their last read message. Users will also be able to quickly jump to the newest message with a jump button. A new user-level setting will allow users to decide if they want to land on the last read message or continue landing on the newest message as they do before this rollout.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early June 2025 and expect to complete by mid-June 2025.</p><p>General Availability (Worldwide, GCC): We will begin rolling out late June 2025 (previously mid-June) and expect to complete by late June 2025.</p><p>General Availability (GCC High): We will begin rolling out early July 2025 and expect to complete by late July 2025.</p><p>\n</p><p>\n</p><p>General Availability (DoD): We will begin rolling out mid-July 2025 and expect to complete by late July 2025.\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, users will land by default on their last read message when they open <i>Unread Chats</i>. Users will get a button to jump to newest message:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c8274e33-366e-4027-a02b-5bf2e643fc81\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The new user-level setting for users to choose if they want to land on the last read message or the newest message at <i>Settings &gt; Chats and channels &gt; Chat &gt; When I open a chat, take me to:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/498ba488-7c57-47ca-ad52-dd6da610abbe\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>If the user chooses the non-default setting, users will land on the newest message after selecting <i>Unread Chats. </i>Users will see a button to jump to the last read message:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/7ded8122-3c94-4652-a256-7c2a1c850133\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon update the \"Unread Chats\" feature to default to the last read message, eliminating manual scrolling. Users can jump to the newest message with a button and choose their preferred landing message in settings. Rollout starts in June 2025 and completes by July 2025, with no admin action required."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084638",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-24T15:19:24.193Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-28T22:46:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: When selecting \"Unread Chats,\" users will land on the last read message",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
