{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Fabric, workspace item events in Fabric Real-Time hub (preview) allow you to receive notification when actions (such as when new artifacts are created or existing artifacts are deleted) occur for your workspace items. These events can be consumed via Fabric Eventstreams or used to alert on other actions or workflows in Fabric, such as running a data pipeline or sending an email notification using Fabric Data Activator alerting capabilities.\n</p><p>On March 17, 2025, the event types Microsoft.Fabric.ItemReadSucceeded and Microsoft.Fabric.ItemReadFailed, which are part of workspace item events in Fabric Real-Time hub (preview) will not be available for new event subscriptions. If users in your organization try to create new subscriptions after March 17, 2025, they will not be able to select these event types.\n</p><p>On March 17, 2025, the event types Microsoft.Fabric.ItemReadSucceeded and Microsoft.Fabric.ItemReadFailed will not be available as part of workspace item events in Fabric Real-Time hub (preview) for existing event subscriptions created prior to March 17, 2025. If users in your organization consume these event types in subscriptions, they will stop receiving the events on March 17, 2025.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b5931ae9-14d6-4bab-8d55-6b905c9da5f9\" style=\"width: 300px;\" alt=\"admin controls\">\n</p><p>We will share plans to replace the retiring events in a future Message center post.\n</p><p>This change will happen automatically by the specified date. No admin action is required. Please notify your users about this change, update relevant documentation as appropriate, and share details about Workspace item events.\n</p><p>Learn more about Fabric Real-Time Hub: <a href=\"https://learn.microsoft.com/fabric/real-time-hub/real-time-hub-overview\" target=\"_blank\">Introduction to Microsoft Fabric Real-Time hub - Microsoft Fabric | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1000268",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-07T23:03:16.667Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-07T23:03:06Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Fabric: Microsoft.Fabric.ItemReadSucceeded and ItemReadFailed events will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
