{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability for marketers and journey designers to simultaneously branch on multiple marketing interactions and enhance customer journeys by using combined triggers to deliver personalized follow-ups in Dynamics 365 Customer Insights - Journeys. This feature will reach general availability on July 1, 2025.<br><br>\n<b>How does this affect me? </b><br>\nWith this feature:<ul>\n<li>Journey designers can simultaneously branch on multiple marketing interactions.</li>\n<li>Marketers can now consolidate multiple interaction outcomes into a single decision point, increasing precision in how each customer is engaged. </li>\n<li>Marketers can use the \"Wait for trigger\" tile after sending a marketing email and choose \"Previous message gets an interaction\", then configure multiple interaction triggers (such as Email Opened, Email Blocked, and Email Bounced) within a single branch to define distinct paths in the journey. </li></ul>\nPlease note, this feature is available to all users with access to real-time marketing journeys and requires no additional set-up or licensing changes.<br><br>\n<b>What action do I need to take? </b><br>\nThis message is for awareness and no action is required.<br><br>\nIf you would like more information on this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/11070/multi-interaction-branching\">Tailor follow-up strategies by leveraging multiple customer actions at once (preview)</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-07-11T03:18:43Z",
  "HasAttachments": false,
  "Id": "MC1091681",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-11T03:29:11.567Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-11T03:18:43Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Insights - Journeys - Tailor follow-up strategies by reacting to multiple customer actions at once",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
