{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re rolling out a small update to help enhance meeting content protection in Microsoft Teams. To better support organizations with compliance and privacy needs, Live Captions will now be view-only during meetings. This means you can continue to follow along with captions in real time - but without the ability to copy text directly from the caption pane. This change helps prevent sensitive meeting content from being copied and shared unintentionally — especially now that captions can be scrolled to view the full meeting conversation. It adds an extra layer of content protection for organizations that need to manage information shared during live meetings.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early June 2025 and expect to complete by mid-June 2025.<br></p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.</p><p>General Availability (GCCH, DoD): We will begin rolling out early July 2025 and expect to complete by mid-July 2025.</p><p>General Availability (Gallatin): We will begin rolling out early July 2025 and expect to complete by mid-July 2025.</p><p><b>How this will affect your organization:</b></p><p>After this change has rolled out:</p><ul><li>Live Captions will continue to support accessibility and real-time comprehension as before.</li><li>This update does not impact the transcript feature (if enabled).</li><li>There are no settings you need to change or review.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>No admin action is required. This update will apply automatically across your organization.</p><p>Live Captions will continue to function as usual for accessibility and real-time comprehension. The only change is that users will no longer be able to copy or highlight caption text during a meeting. This update helps prevent unintentional sharing of sensitive meeting content, especially now that captions support scrolling through the full meeting conversation. If your organization prioritizes content protection in real-time meetings, this update adds a helpful layer of security — without affecting the core meeting experience.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Live captions copying will be disabled in Microsoft Teams meetings to enhance content protection. The rollout will occur from June to July 2025, depending on the release schedule. This update prevents copying caption text but does not affect accessibility or the transcript feature. No admin action is required."
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1065053",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-29T23:43:34.483Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-29T23:43:27Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Live captions copying disabled for Teams meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
