{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 7, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Coming soon for Microsoft Purview | Endpoint Data Loss Prevention (DLP): Pause and Resume support for printer scenarios for customers trying to override a DLP soft warning policy tip when submitting a print job. Before this rollout, the user must reinitiate the print job for the intended result. After this rollout, the override will be stored temporarily, and the print job will execute. This rollout is a fix for the <i>Block with override action</i> described in <a href=\"https://learn.microsoft.com/purview/dlp-create-deploy-policy?tabs=purview#actions\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Create and deploy a data loss prevention policy | Microsoft Learn</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We began rolling out early April 2025 and expect to complete by early April 2025.</p><p>\n</p><p>General Availability (Worldwide): We began rolling out late May 2025 (previously late April) and expect to complete by early June 2025 (previously early May).</p><p><b>How this will affect your organization:</b>\n</p><p>This feature should reduce clicks for users and lessen frequency of alerts.\n</p><p>After this rollout, when a print job is blocked by a policy, a user will see this pop-up notice. After the user enters the <i>Business justification, </i>the justification will be stored, and the content will print:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b70bd317-1e1c-4aef-82ad-6f7bd28ca16d\" style=\"width: 344.006px;\"></p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b></p><p>Identify Endpoint DLP policies to test after rollout to ensure the new experience is in place.</p><p>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout.  You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Endpoint Data Loss Prevention will soon support Pause and Resume for printer scenarios, allowing users to override DLP soft warnings without reinitiating print jobs. This feature will reduce user clicks and alerts, rolling out from late May to early June 2025. No admin action is required."
    }
  ],
  "EndDateTime": "2025-07-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052913",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-07T20:43:01.57Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T23:34:27Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention: Pause and Resume support for printer scenarios",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
