{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 13, 2025: We have updated the content. Thank you for your patience.&nbsp; &nbsp;&nbsp;</p><p>Coming soon: Microsoft Purview | Data Loss Prevention (DLP) will be integrated in the Microsoft Edge browser to offer DLP protections that apply directly in the Edge browser and target scenarios where users on unmanaged (or bring-your-own/BYO) Windows desktop devices and Mac desktop devices are sharing data to or exfiltrating data from organization-managed cloud apps (apps that use Microsoft Entra authentication for user sign-in). \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486366\" target=\"_blank\">486366</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late May 2025 and expect to complete by mid-June 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late August 2025 (previously early June) and expect to complete by late September 2025 (previously late June).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, admins can apply protections from Purview DLP that apply directly in the Edge browser to target user activities sharing data to or from Entra-managed apps, when the user is using Edge for Business on an unmanaged device.\n</p><p>Admins can configure Purview DLP to block or audit users when they perform activities including uploading or downloading files with sensitive information.\n</p><p>Admins can configure policies in Purview DLP to apply protections in the Edge browser and view outcomes for investigation in the <a href=\"https://learn.microsoft.com/defender-xdr/incidents-overview\">Microsoft Defender portal</a>.\n</p><p>This change will be available by default for Admins to configure in Purview. Features aren't activated by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. We recommended informing Security admins and Edge admins at your organization about this change to DLP features. You may want to update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486366"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention will integrate with Microsoft Edge for Business on unmanaged Windows and Mac devices to protect data shared with Entra-managed cloud apps. Public preview starts late May 2025; general availability begins late August 2025. Admins can configure policies to block or audit sensitive data activities."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1045278",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T19:06:34.047Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-01T00:01:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: New data protection in Microsoft Edge for Business on unmanaged devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
