{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to the<i> Web</i> tab in Microsoft 365 Copilot and in Microsoft 365 Copilot Chat: Users will be able to use the <i>Attach cloud files feature</i> to access Microsoft One Drive or Microsoft SharePoint to find and insert cloud files in their prompts. Before this rollout, the <i>Attach cloud files</i> feature opened Windows Explorer.\n</p><p>This message applies to Copilot on the web and Copilot in the Windows desktop app.\n</p><p>Users can access this feature with a Microsoft 365 Copilot license or a Microsoft 365 license.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481139\" target=\"_blank\">481139</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 and expect to complete by mid-April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users will find this feature in the Copilot chat box. If users have a <i>Work </i>and <i>Web </i>tab in their Copilot experience, this feature is on the <i>Web </i>tab.&nbsp;Users can select <i>+ Add content</i> and then select the cloud icon in the top right corner to display the option to <i>Upload cloud files:</i></p><p>The <i>Attach cloud files</i> feature on the Web tab in Microsoft 365 Copilot:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/53bedd65-a781-41ee-a043-671b045643b9\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The <i>Attach cloud files</i> feature in Microsoft 365 Copilot Chat:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b04e28a9-9fe2-4df7-9466-a80ec91e8f20\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/get-started-with-microsoft-365-copilot-chat-5b00a52d-7296-48ee-b938-b95b7209f737\" target=\"_blank\" style=\"\">Get started with Microsoft 365 Copilot Chat - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481139"
    },
    {
      "Name": "Summary",
      "Value": "Users will soon be able to attach cloud files from OneDrive or SharePoint in Microsoft 365 Copilot and Copilot Chat via the Web tab. This feature will roll out in April 2025 and requires no admin action. Users need a Microsoft 365 Copilot or Microsoft 365 license. Roadmap ID: 481139."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-07-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1038686",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-21T23:33:39.79Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-21T23:33:30Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Chat and Microsoft 365 Copilot: Users can insert cloud files in Copilot chat prompts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
