{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Viva Pulse authors will be able to view a summary generated with Microsoft 365 Copilot to gain a quick understanding of their Pulse reports. The Copilot-generated summary will also be included in the notifications to Pulse authors, who can draft an author's note and share the Copilot summary and Pulse report with team members.</p><p>This message applies to Pulse for Windows desktop, Pulse for Mac desktop, Pulse on the web, and Pulse for iOS/Android.</p><p>A Microsoft 365 Copilot license or a Viva Pulse license is required to use this feature. Learn more about <a href=\"https://learn.microsoft.com/viva/pulse/get-started/licensing-requirements\" target=\"_blank\">Viva Pulse Licensing requirements | Microsoft Learn</a>.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=407863\">407863</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out late March 2025 and expect to complete by late April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Pulse authors can view an aggregated report of the responses received when the request closes and the minimum reporting threshold is met. This aggregated report contains the average scores, trends over time, selections for multiple-choice questions, and any open text responses that may have been provided. Pulse authors have to review their entire report to understand what their team members have shared with them. \n</p><p><i>After this rollout\n</i></p><ul><li>The Copilot summary of the Pulse report can help Pulse authors quickly understand the report overview, highlights and lowlights based on the responses received.\n</li><li>Pulse authors can choose to copy and edit the Copilot summary as part of an author's note and share the summary and report with their team members to promote transparency and practice acknowledgement.\n</li><li>Pulse authors can submit feedback regarding the quality of the Copilot summary using thumbs up/down buttons, as part of the report summary experience. This feedback will help us improve the quality of the summary and Pulse overall.\n</li></ul><p>The Copilot Summary of the Pulse report, with prompt to add an author's note:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e3b5349d-776b-4c31-8aa7-04e144227fff\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The Copilot Summary of the Pulse report included in email notifications:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/0053820b-36b2-487a-9ea0-4893e1e54297\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically, and the features described here are enabled by default by the specified date with no admin action required before the rollout. Tenant admins can use the <a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/granular-access-controls\" target=\"_blank\">Granular access controls for Viva Pulse</a> to configure which users in their tenant can access these features. You may want to notify your users about this change and update any relevant documentation. \n</p><p><i>Learn more  \n</i></p><ul><li><a href=\"https://learn.microsoft.com/viva/pulse/get-started/licensing-requirements\" target=\"_blank\">Viva Pulse Licensing requirements | Microsoft Learn</a>  \n</li><li><a href=\"https://support.microsoft.com/topic/frequently-asked-questions-about-responsible-ai-for-copilot-in-viva-pulse-e58b1fa5-c359-4ddf-8da0-9d45df431a21\" target=\"_blank\">FAQs about Responsible AI for Copilot in Viva Pulse</a>\n</li><li><a href=\"https://support.microsoft.com/topic/view-and-share-your-pulse-feedback-results-0e6d21e2-6d4a-445d-ab48-0f1fa3c6fce0\" target=\"_blank\">View and share your Pulse feedback results - Microsoft Support</a></li><li><a href=\"https://support.microsoft.com/topic/report-summarization-using-copilot-in-viva-pulse-c271f112-6c23-46e0-ae9c-e7b5f9584b24\" target=\"_blank\">Report summary using Copilot in Viva Pulse - Microsoft Support</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "407863"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse will use Microsoft 365 Copilot to generate summaries for Pulse reports, aiding authors in quickly understanding the feedback. This feature, available across various platforms, requires a Microsoft 365 Copilot or Viva Pulse license. The rollout will complete by late April 2025, with no admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1047239",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-03T02:04:47.893Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-03T02:04:35Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Pulse: Generate a summary for Pulse reports using Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
