{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 24, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Microsoft Purview Data Security Investigations (DSI) is a new AI-powered solution that enables data security teams to identify incident-related data, conduct deep content analysis, and mitigate risk within one unified solution.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485707\" target=\"_blank\">485707</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early April 2025 and expect to complete by mid-May 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out early August 2025 (previously mid-June) and expect to complete by late August 2025 (previously late July).\n</p><p><b>How this will affect your organization:</b>\n</p><p>DSI enables data security admins to efficiently identify incident-relevant content by searching their Microsoft 365 data estate to locate emails, Microsoft Teams messages, Microsoft Copilot prompts and responses, and documents. \n</p><p>After an admin scopes an investigation, DSI’s generative AI capabilities allow admins to gain deeper insights into the impacted data, revealing critical security risks and sensitive information. Investigative capabilities include the ability to categorize evidence, perform vector searches, and examine impacted data for security and sensitive data risks. \n</p><p>DSI visualizes correlations between investigation data, users, and their activities. To mitigate identified risks, DSI facilitates secure collaboration between partner teams. Post-investigation learnings can be used to refine existing policies to strengthen your organization's security practices.\n</p><p>Get started with DSI on the overview page with information on enrollment and enabling RBAC (role-based access control):\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/0bba51c4-19c4-4d70-815b-eba43a411b9c\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Categorize your data to identify highest risk items and plan mitigation actions accordingly:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4fc0b758-a03f-450c-bc1b-24b5c94499a9\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Understand investigation progress and insights with the Investigation summary view:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/70868998-4d9d-4361-bcae-e1b48fed3137\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/accelerate-data-security-investigations-with-ai-powered-deep-content-analysis/4396099\" target=\"_blank\">Accelerate data security investigations with AI-powered deep content analysis | Microsoft Community Hub</a></p><p>Public Preview documentation:&nbsp;<a href=\"https://learn.microsoft.com/purview/data-security-investigations\" target=\"_blank\">Learn about Data Security Investigations (preview) | Microsoft Learn</a></p><p>\n</p><p>Get started on the Purview DSI overview page (coming soon) to complete setup and get oriented in a few simple steps:\n</p><ol><li>Enable access in Microsoft Purview &gt; <i>Permission </i>for DSI admins, DSI investigators and DSI reviewers in your organization.\n</li><li>Complete the DSI first-run experience including:\n<ol><li>Enrolling your Purview subscription for non-AI storage and processing meter\n</li><li>Enrolling for AI consumption using security compute units \n</li></ol></li><li>Get started with your first investigation.</li></ol><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485707"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Security Investigations (DSI) is an AI-powered solution for data security teams to identify, analyze, and mitigate risks. Public Preview starts in April 2025, with General Availability in August 2025. DSI helps locate and analyze data, visualize correlations, and refine security policies. Learn more [here](https://techcommunity.microsoft.com/blog/microsoft-security-blog/accelerate-data-security-investigations-with-ai-powered-deep-content-analysis/4396099)."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1047912",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-24T21:11:22.59Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-04T02:26:34Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: New Purview Data Security Investigations (DSI) solution",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
