{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the Enhanced sessions management and live conversation details feature for Dynamics 365 Contact Center. This feature lets service representatives manage their sessions and live conversations in the Dynamics 365 Contact Center embedded experience with the ability to pick the conversations they would like to work on. This feature will reach general availability on April 30, 2025. \n<br><br>\n<b>How does this affect me?</b><br>\nThis feature allows service representatives to view their conversations in a more robust fashion, as well as to pick the conversations they would like to assign themselves. It also helps service representatives be the most informed in assisting customers with live details that are attached to the conversation. Moving forward, the embedded contact center experience will include conversation details, sign-out, sessions management, pick mode, and voicemail capabilities.<br><br>\nService representatives can take the following actions in the embedded experience:<ul>\n    <li>Assign conversations to themselves using the pick mode, adding more work items to their plate, along with sessions management.</li>\n    <li>See the customer and conversation details when conversing with customers, enabling them to scan the holistic picture in real time.</li>\n    <li>See voicemail and other async channels.</li>\n    <li>Sign out of the embedded app.</li>\n</ul>\n<b>What do I need to do to prepare?</b><br>\nThis message is for awareness and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-30T15:45:52Z",
  "HasAttachments": false,
  "Id": "MC1065557",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-30T15:46:55.433Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-30T15:45:52Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Enhanced sessions management and live conversation details",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
