{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire&nbsp;the 'Document name matches patterns' condition from Purview Data Loss Prevention (DLP) for Endpoint because of possible performance concerns. Instead, we recommend using the 'Document name contains words or phrases' condition, where we will continue to invest our development resources.</p><p><b>When this will happen:</b></p><p>We will begin rolling out in mid-May 2025 and we expect to complete by mid-June 2025.</p><p><b>How this will affect your organization:</b></p><p>When this change is implemented, any Endpoint DLP policy using this condition may not work as expected, and you will no longer be able to update any policy with this condition.</p><p>Note: this change will only impact Endpoints. It will not impact other workloads, including Exchange.</p><p><b>What you need to do to prepare:</b>\n</p><p><span style=\"font-size: inherit;\">This change will happen automatically by the specified date. No admin action is required. However, you may want to migrate your policy to use the 'Document name contains words or phrases' condition instead.</span><br></p><p>For more information, see <a href=\"https://learn.microsoft.com/purview/dlp-policy-reference?view=o365-worldwide#conditions-supported-for-endpoints\" target=\"_blank\">Conditions supported for Endpoints</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Purview Data Loss Prevention (DLP) for Endpoint will retire the 'Document name matches patterns' condition due to performance concerns. The rollout will occur from mid-May to mid-June 2025. Organizations should migrate to the 'Document name contains words or phrases' condition. No admin action is required."
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1042927",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-29T02:16:48.243Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-28T05:33:06Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Purview Data Loss Prevention (DLP) for Endpoint: Retiring the 'Document name matches patterns' condition",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
