{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 18, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Coming soon to Microsoft Purview | Insider Risk Management (IRM), admins will be able to select any Communication Compliance (CC) policy alerts as indicators in IRM policies. After this rollout, IRM admins can select\nany CC policies that they would like to bring into IRM and detect if a user has alerts for these selected CC policies. When an IRM alert is generated, admins can review if there are any alerts for the user in CC under the policies that are enabled as indicators. This feature will help admins and analysts view this information in IRM without switching to CC.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489838\" target=\"_blank\">489838</a>.\n</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out late July 2025 (previously late May) and expect to complete by early August 2025 (previously early June).\n</p><p>General Availability (Worldwide): We will begin rolling out mid-October 2025 (previously mid-August) and expect to complete by late October 2025 (previously early September).</p><p><b>How this will affect your organization:</b></p><p>After this rollout, admins will be able to enable this indicator in IRM’s global settings for policy indicators. When enabled, this indicator can be selected in\nany IRM policy.</p><p>Using the indicator\n</p><ol><li>In IRM, go to <i>Settings </i>&gt;<i> Insider Risk Management &gt; Policy indicat</i>ors<i> &gt;</i> <i>Built-in Indicators. </i>Open the <i>Communication Compliance indicators &gt; Detect messages matched by specific CC policies </i>drop-down menu. Check the box and choose the CC policies to bring into IRM. Save the changes. \n</li><li>To use in a policy: In the policy wizard for any IRM policy, configure the policies as applicable until you get to the <i>Indicators </i>page.\nOpen the <i>Communication Compliance indicators </i>drop-down menu and\ncheck the box for <i>Sending messages flagged by selected CC policies.</i> Configure\nthe rest of the policy as applicable.\n</li></ol><p>These changes will be available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to\nnotify your admins about this change and update any relevant documentation. \n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators?tabs=purview-portal\">Configure policy indicators in insider risk management |\nMicrosoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489838"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will soon allow admins to use Communication Compliance policy alerts as indicators in IRM policies. Rolling out from July to October 2025, this feature enables integrated alert review without switching platforms. No prior admin action is needed before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1074097",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-18T19:51:07.413Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-14T23:42:40Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Custom Communication Compliance policy as IRM indicator",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
