{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce the release of new Graph Connectors for the chat experience in Microsoft 365 Copilot (formerly BizChat) and Microsoft 365 Copilot Chat. <a href=\"https://admin.microsoft.com/Adminportal/Home#/MicrosoftSearch/Connectors/add\" target=\"_blank\">Try the new connectors</a> in the Microsoft 365 admin center.</p><p>This message is associated with MC978930 <i>(Updated) Microsoft 365 Copilot: Select Microsoft Graph Connectors when writing prompts in BizChat</i> (published January 2025, updated February 2025)</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Available now.</p><p><b>How this will affect your organization:</b></p><p> The new connectors will expand Copilot’s ability to access, analyze, and generate insights from business content across various platforms:\n</p><ul><li>Guru: Integrate Guru’s AI-powered knowledge system to quickly locate critical insights.\n</li><li>GitLab (issues, merge requests, knowledge): Enhance DevOps collaboration by quickly searching and analyzing GitLab issues, merge requests, and documentation.\n</li><li>Asana: Manage projects effectively by integrating Asana tasks directly into Microsoft 365 workflows.\n</li><li>15Five: Integrate performance management data to boost productivity and employee engagement.\n</li><li>Miro: Collaborate visually by accessing and summarizing ideas from Miro boards directly in Copilot.\n</li><li>Trello: Enhance project management by tracking tasks, deadlines, and assignments through a Trello integration.\n</li><li>Zendesk Ticket: Improve customer support efficiency with enhanced ticket tracking and analysis capabilities.\n</li><li>SmartSheet: Streamline project management by easily searching and summarizing Smartsheet data.\n</li><li>Seismic: Integrate Seismic content for efficient access to sales content, analytics, and collaborative resources.\n</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>For detailed configuration and integration instructions, learn more at <a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/overview-graph-connector\" target=\"_blank\">Build Microsoft Graph Connectors for Microsoft 365 Copilot | Microsoft Learn</a> or contact your Microsoft representative to discuss tailored use cases.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New Microsoft Graph Connectors for Microsoft 365 Copilot and Copilot Chat are now available, enhancing access to business content across various platforms like Guru, GitLab, Asana, 15Five, Miro, Trello, Zendesk, SmartSheet, and Seismic. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1047246",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-03T02:09:03.233Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-03T02:08:10Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot and Microsoft 365 Copilot Chat: New Microsoft Graph connectors for the chat experience and more",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
