{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 6, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Coming soon for Microsoft Viva Engage: We are excited to announce the launch of the new Communications Dashboard designed to inform and accelerate execution across the communications lifecycle. The dashboard is accessible to corporate communicators, network admins and higher-level roles from the left panel in Engage.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478656\" target=\"_blank\">478656</a>.\n</p><p>This message applies to:\n</p><ul><li>Engage app on the desktop (as a progressive web app)\n</li><li>Engage app in Microsoft Outlook (new Outlook for Windows desktop, Outlook for the web, and new Outlook for Mac desktop)\n</li><li>Engage app in Microsoft Teams (Teams for Windows desktop, Teams for Mac desktop, and Teams for the web)\n</li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 (previously mid-May) and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Corporate communicators access campaign and leader/audience management features through the classic Microsoft Yammer admin center.\n</p><p>After this rollout, corporate communicators will be able to access all features available to them, such as campaign management, analytics, leader and audience management, and quick links to delegate management and official communities from the Dashboard in the left panel of Engage. Also, we have introduced new features:\n</p><ul><li>A single view on the <i>Comms activity</i> tab of all <i>Featured conversations</i> in Engage with featured by dates.\n</li><li>Enhancements to the <i>Keyword monitoring</i> feature and a new Moderation agent, available to corporate communicators with access to the <i>Advanced moderation </i>tab. For more information, please refer to MC1041179 Microsoft Viva Engage: Monitoring keywords in the new Communications Dashboard (March 2025) and MC1041753 Microsoft Viva Engage: New Moderation agent (March 2025).</li><li>The ability for corporate communicators to view the list of delegates assigned to a leader through the <i>Leader and audiences </i>tab.\n</li></ul><p>The features available in the Viva Engage admin center before this rollout will continue to be available after the rollout for now. The assignment of corporate communicators will continue to be managed through the admin center.\n</p><p>This dashboard will be available by default. The dashboard will continue to evolve as we iterate and enhance its capabilities. Stay tuned for more updates.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Network admins, verified admins, and Engage admins can assign new or existing corporate communicators with<i> Advanced moderation </i>access from the <i>Role management</i> page in the Engage admin center. This granular permission to the corporate communicator role is disabled by default and must be specifically enabled to facilitate moderation.\n</p><p><i>Learn more</i>\n</p><p>We will update these documents before rollout:\n</p><ul><li><a href=\"https://learn.microsoft.com/viva/engage/eac-key-admin-roles-permissions\" target=\"_blank\">Manage admin roles in Viva Engage | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/engage/manage-security-and-compliance/manage-data-compliance\" target=\"_blank\">Manage Viva Engage data compliance | Microsoft Learn</a>\n</li></ul><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478656"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is launching a new Communications Dashboard in June 2025, accessible from the left panel in Engage. It includes features like campaign management, analytics, and enhanced moderation tools. The rollout is automatic, and no admin action is required. Documentation will be updated before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041122",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-06T16:37:32.667Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-25T18:20:43Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: New Communications Dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
