{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>At Microsoft Defender for Office 365, we are committed to providing seamless and efficient SOC workflows. One of the key areas of feedback from our users has been the latency experienced when loading certain pages within the Defender portal. To address this, our engineering team is undertaking a long-term investment initiative aimed at significantly improving page load times.\n</p><p><b>When this will happen:</b>\n</p><p>Phase 1 | General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late March 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b>\n</p><p><i>Key areas of focus</i></p><p>\n</p><p>To enhance page load performance, we are focusing on several strategic improvements, including:</p><ul><li><i>Identifying areas for performance optimization:</i> Conducting in-depth analysis to pinpoint specific bottlenecks in page load times, including network latency, backend processing delays, and inefficient data retrieval mechanisms.\n</li><li><i>Refining page design and structure: </i>Optimizing UI/UX elements, streamlining heavy components, and implementing efficient rendering techniques to ensure smoother and faster loading experiences.\n</li><li><i>Developing shared modules:</i> Building reusable components that multiple pages can leverage, reducing redundant processing and improving overall efficiency in data fetching, rendering, and caching mechanisms.\n</li><li><i>Enhancing data processing and retrieval mechanisms: </i>Optimizing database queries, API calls, and caching strategies to reduce the time required to fetch and display data on key pages.\n</li><li><i>Implementing progressive improvements: </i>Rolling out optimizations in a phased manner, starting with high-impact areas while continuously monitoring and fine-tuning performance based on real-time feedback.\n</li></ul><p><i>Phase 1: Experiences targeted for improvement\n</i></p><p>In Phase 1 of this project, we are prioritizing enhancements for these experiences:\n</p><ul><li>Submission\n</li><li>Quarantine\n</li><li>Threat Explorer\n</li><li>Email Entity\n</li><li>Policy Configuration</li></ul><p>Improvements will be introduced incrementally in a staged manner throughout the rollout period, beginning with the Submission page in late March 2025.\n</p><p>After Phase 1, our teams will be continuously monitoring the latencies and investing in further improvements to ensure seamless security operations experience to end users.\n</p><p><i>Impact on users</i></p><p>There will be no disruptions or downtimes during the rollout. </p><p>User workflows will remain unaffected while the enhancements are implemented. \n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This migration will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 is enhancing page load performance to address user feedback on latency. Phase 1, starting in late March 2025 and ending by late June 2025, targets improvements in Submission, Quarantine, Threat Explorer, Email Entity, and Policy Configuration pages. No disruptions or admin actions are required."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1042925",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-28T05:32:07.69Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-28T05:31:38Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Enhancing page load performance",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
