{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Previously, an admin logged into the M365 Admin center must have the Global Admin privileges if they want to manage and perform admin tasks related to managing agents in the Integrated Apps Page. With this change the AI Admin Role can manage Agents ensuring they comply with organizational policies and security standards.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out on late March 2025 and expect to complete by late March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>AI Admins can now view agents submitted to the admin for approval under Requested Apps tab in the integrated apps page. From here they can choose to either publish it or reject it.  When an agent is updated and sent to admin for approval, it also shows up under the requested apps tab with status as “Update Pending”. From here the admin can choose to either accept the update or reject it.</p><p>Following are the actions AI Admin Role can do -</p><ul><li>View 1st party, 3rd party, Line of Business agents.</li><li>Publish/Reject\n</li><li>Make agents available to all/specific/none users.\n</li><li>Block/Unblock agents.\n</li><li>Update tenant level settings for 1st party, 3rd party, Line of Business agents.</li><li>Remove agents\n</li></ul><p>Following are the actions AI Admin Role cannot do -</p><ul><li>Consent for permissions. This ensures that only authorized roles (Global Admin) can provide the necessary consent. This restriction is in place to maintain security protocols and compliance standards, minimizing the risk of accidental misconfigurations and cybersecurity threats.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/936e3008-c3ff-4272-b9d6-d943488f0ef2\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>AI Admin Role can familiarize themselves with the integrated app page and work alongside the Global admins to manage agents which are published to the tenant by makers in the organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "AI Admin role now has permissions to manage Copilot agents, previously requiring Global Admin privileges. This change will roll out in late March 2025. AI Admins can view, publish, reject, block, and update agents but cannot consent for permissions. They should familiarize themselves with the integrated app page."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041454",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-26T05:01:31.347Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T05:01:21Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "AI Admin role has permissions to manage Copilot agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
