{
  "ActionRequiredByDateTime": "2025-06-30T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of our ongoing efforts to enhance security, we are making a critical change to how Microsoft SharePoint and Microsoft OneDrive integrate with Microsoft Entra B2B. This change affects how external users access previously shared content.</p><p><b>When this will happen:</b></p><p>Effective July 1, 2025, external users will no longer be able to access files, folders, or sites via links that were shared before your organization enabled SharePoint and OneDrive integration with Microsoft Entra B2B.\n</p><p><b>How this will affect your organization:</b></p><p>This change only impacts organizations that have already enabled or plan to enable SharePoint and OneDrive integration with Microsoft Entra B2B.</p><ul><li>After integration, all new external sharing will use Microsoft Entra B2B Invitation Manager.\n</li><li>Previously shared links that used the SharePoint One-Time Passcode (OTP) will no longer work.\n</li></ul><p>External users attempting to use these older links will encounter the error message \"Sorry, something went wrong. This organization has updated its guest access settings. To access this item, please contact the person who shared it with you and ask them to reshare it with you.\"\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e48d62c7-f363-4d8c-8f8f-0e3d58bfaf93\" style=\"width: 400px;\" alt=\"user message\"></p><p><i>Impact to end users:\n</i></p><ul><li>External users will lose access to content shared via SPO OTP links created before Entra B2B integration.\n</li><li>To restore access, users must reshare the file, folder, or site with the intended external collaborators.\n</li><li>If the original sender is unavailable or lacks permission, another authorized user must reshare the content.\n</li><li>No changes are required to the sharing process—users can continue to share content as they always have.</li></ul><p><b>What you need to do to prepare:</b>\n</p><ol><li>Notify your users: Inform users who collaborate externally that previously shared links will no longer work after Entra B2B integration.\n</li><li>Update internal documentation: Adjust training materials and helpdesk scripts to reflect this change.\n</li><li>Plan for MFA: External users will be required to complete multi-factor authentication (MFA) registration as part of the Entra B2B onboarding process.</li></ol>\n<p></p><p>Learn more: <a href=\"https://learn.microsoft.com/sharepoint/sharepoint-azureb2b-integration\" target=\"_blank\">Microsoft Entra B2B integration for SharePoint &amp; OneDrive - SharePoint in Microsoft 365 | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Resharing to external users is required after enabling Microsoft SharePoint integration with Microsoft Entra B2B. Effective July 1, 2025, previously shared links will no longer work, and external users must be re-invited. Notify users, update documentation, and plan for MFA registration. Learn more [here](https://learn.microsoft.com/sharepoint/sharepoint-azureb2b-integration)."
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1089315",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-06T23:31:44.667Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-06T23:31:18Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Resharing to external users required after enabling Microsoft SharePoint integration with Microsoft Entra B2B",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
