{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Adobe-powered PDF viewer in Microsoft Edge for Business is now available in beta for organizations to test. Organizations can now experience the viewer by default in Edge Beta (starting in version 136) and validate how it works within their PDF workflows. This early testing period helps identify and address any issues before the viewer becomes the default in Edge Stable release in October 2025. We will retire the legacy PDF viewer in early 2026.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489231\" target=\"_blank\">489231</a>.</p><p><b>When this will happen:</b></p><ul><li>The Adobe-powered PDF viewer is now available in beta to test.\n</li><li>General Availability (Worldwide): We will begin rolling out mid-October 2025 and expect to complete by late October 2025.\n</li></ul><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, organizations have to manually configure a policy to test the new PDF viewer.\n</p><p>After this rollout:\n</p><ul><li>No policy configuration is needed. The new PDF viewer is enabled by default in Edge Beta (starting in version 136).\n</li><li>We recommend organizations proactively validate their workflows with the new viewer before October’s Edge Stable release.\n</li><li>Organizations that already adopted the new PDF viewer using the <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-policies#newpdfreaderenabled\">NewPDFReaderEnabled</a> policy do not need to take additional action and will continue using the updated viewer with ongoing improvements.\n</li></ul><p>Key enhancements include:\n</p><ul><li>Performance: Faster document load and smoother scrolling</li><li>Accessibility: Improved support for screen readers and form accessibility\n</li><li>Compatibility: Enhanced color profile support, more precise text selection, and fonts for Chinese, Japanese, and Korean languages\n</li></ul><p>Exclusive features for organizations:\n</p><ul><li>View XFA PDFs using IE (Internet Explorer) mode</li><li>Extended support for viewing Microsoft Information Protection (MIP) Protected PDF Files to different sovereignties\n</li><li>View sensitivity labels for MIP-protected PDFs\n</li><li>Enhanced digital signature verification in Edge PDF Viewer\n</li></ul><p>In October, the new Adobe-powered PDF viewer will be on by default.</p><p>The Adobe-powered PDF viewer in Edge, with the enhanced toolbar at the top of the page:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/90bd137c-763e-478f-9e41-6a65c6087b1a\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><ul><li>Organizations that have not yet moved to the new PDF viewer should test it in Edge Beta in preparation for the default enablement in October.\n</li><li>Test all your internal PDF workflows and critical documents in the new PDF viewer.\n</li><li>Report feedback and issues through the standard Microsoft support channels.\n</li><li>For organizations ready to fully migrate sooner, the <a href=\"https://learn.microsoft.com/DeployEdge/microsoft-edge-policies#newpdfreaderenabled\">NewPDFReaderEnabled</a>can be used to enable the new PDF viewer in Edge Stable release today with these settings:\n<ul><li>True: New PDF viewer enabled\n</li><li>False: Legacy viewer retained\n</li><li>Default: Current default behavior\n</li><li>No action is required if your organization is already using the new PDF viewer through policy configuration.\n</li></ul></li></ul><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more about the PDF reader change:<a href=\"https://techcommunity.microsoft.com/blog/microsoftedgeinsider/microsoft-edge-and-adobe-partner-to-improve-the-pdf-experience/3733481\" target=\"_blank\">Microsoft Edge and Adobe partner to improve the PDF experience</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489231"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Edge for Business introduces a new Adobe-powered PDF viewer available for testing in Edge Beta (version 136). Organizations should validate their workflows before the default rollout in October 2025. Key enhancements include performance, accessibility, and compatibility improvements. The legacy viewer will retire in early 2026. For more details, visit the Microsoft 365 Roadmap ID [489231](https://www.microsoft.com/microsoft-365/roadmap?filters=&searchterms=489231)."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1072406",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-12T23:39:18.337Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-12T23:39:09Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge for Business: New PDF viewer powered by Adobe engine now available for testing in Edge Beta",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
