{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 17, 2025: We are updating this message as a reminder of the upcoming end of support for TLS 1.1 on July 31, 2025. Please review and take action as appropriate to mitigate potential service interruptions.</p><p>We are writing to inform you about an important update regarding the Transport Layer Security (TLS) protocols used by the Fabric Platform. To provide secure connections and align with other Microsoft products, Fabric Platform will soon require TLS 1.2 or later versions for all outbound connections from Fabric to customer data sources.</p><p>Support for TLS 1.1 and earlier versions will end on <b>July 31, 2025</b>. After this date, TLS 1.2 or later will be required for all connections from Fabric to customer data sources.\n</p><p><b>What you need to do to prepare:</b></p><ol><li>Review Your Connections: Ensure that all your resources interacting with Azure services are using TLS 1.2 or later, especially if you are using Fabric to connect to outside data sources.\n</li><li>Update Your Systems: If any of your systems are still using TLS 1.1 or earlier, please update them to TLS 1.2 or later as soon as possible to avoid any disruptions.\n</li><li>Verify Compliance: Check that your TLS policies and configurations are compliant with the new requirements.\n</li></ol><p>For more details, please refer to the blog post on TLS deprecation for Fabric <a href=\"https://blog.fabric.microsoft.com/en-US/blog/tls-deprecation-for-fabric/\" target=\"_blank\">here</a>.\n</p><p>If you have questions, get answers from community experts in <a href=\"https://aka.ms/azureqa\" target=\"_blank\">Microsoft Q&amp;A</a>. If you have a support plan and you need technical help, please create a <a href=\"https://learn.microsoft.com/en-us/azure/azure-portal/supportability/how-to-create-azure-support-request\" target=\"_blank\">support request</a>.</p><p><br></p><p>\n</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Support for TLS 1.1 on the Fabric Platform ends on July 31, 2025. Ensure all connections use TLS 1.2 or later to avoid service interruptions. Review and update your systems and verify compliance. For more details, refer to the provided blog post and support links."
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1085131",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-17T20:32:40.657Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-29T23:12:42Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Important Notice: TLS Deprecation for Fabric Platform",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
