{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 1, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>In new Outlook for Windows and Outlook on the web, the hover actions in the message list will be moved to the Sender/From column to be more space-efficient and minimize unnecessary mouse travel for users with their Reading Pane set to Hide or Bottom. The large width occupied by the DateTime Received column will thus be reduced. For all users, a one-time shortcut to change/set your hover actions will be provided.&nbsp;After the changes to the hover actions, the first action will be replaced by a quick button (gear button) to change/set your hover actions. After that button has been triggered once, it will disappear, and your hover action settings will kick in fully.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=429868\" target=\"_blank\">429868</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-July2 025 (previously late June) and expect to complete by mid-August 2025 (previously late July).</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-September 2025 (previously late July) and expect to complete by late September 2025 (previously early August).</p><p><b>How this will affect your organization:</b>\n</p><p>For new Outlook for Windows and Outlook on the web, hover actions in the message list will be moved to the Sender/From column to reduce the large width occupied by the DateTime Received column.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/337d34e9-ecc6-49b4-b21c-d37078bb4c28\" style=\"width: 450px;\"><br></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "429868"
    },
    {
      "Name": "Summary",
      "Value": "New Outlook for Windows and Outlook on the web will move hover actions to the Sender/From column to save space and reduce mouse travel. Rollout starts mid-July 2025 for Targeted Release and mid-September 2025 for General Availability. No admin action required; notify users and update documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041465",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-01T14:42:02.593Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T05:09:54Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows and Outlook on the web: Optimized hover actions in the message list",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
