{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>New LDAP query events will be added to the IdentityQueryEvents table in Advanced Hunting to provide more visibility into additional LDAP search queries running in the customer environment.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out in early March 2025 and expect to complete by mid-March 2025. \n</p><p><b>How this will affect your organization:</b></p><p>This update may lead to an increase in activity within the Advanced Hunting IdentityQueryEvents table for LDAP queries. If you have custom detections related to these queries, you may see a higher number of triggered alerts.</p><p>This update is available by default.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p> We recommend that you review your existing custom detections to ensure they align with your objectives. If needed, you can adjust your query accordingly.</p><p>More information:&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/custom-detection-rules\" target=\"_blank\">Create and manage custom detection rules in Microsoft Defender XDR</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New LDAP query events will be added to the IdentityQueryEvents table in Advanced Hunting in March 2025, potentially increasing activity and alerts. Review and adjust custom detections as needed. More information is available [here](https://learn.microsoft.com/defender-xdr/custom-detection-rules)."
    }
  ],
  "EndDateTime": "2025-04-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1019307",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-04T18:27:19.163Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T01:24:57Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender XDR services: New LDAP query events added to the IdentityQueryEvents table in Advanced Hunting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
