{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><i>This message applies only to new Outlook for Windows and has no impact on classic Outlook for Windows.</i>\n</p><p>This is a reminder for administrators to review the policies your organization has configured to manage new Microsoft Outlook for Windows. The new article <a href=\"https://go.microsoft.com/fwlink/?linkid=2305054\" target=\"_blank\">Map classic Outlook policies to new Outlook</a> explains how key policies you may be using to control classic Outlook will map to new Outlook. We encourage admins to read the article and make the necessary policy updates in new Outlook for Windows to achieve their desired behavior.\n</p><p>Administrators should make sure to review the policies available to control whether mailboxes outside of your Microsoft 365 tenant can be connected to new Outlook for Windows. If you want to restrict the kinds of email accounts that can be connected to new Outlook, you should ensure you have configured these policies:\n</p><p>1. Set the policy to require that new Outlook must use a managed device's Windows signed-in account as the primary account. Learn more: <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/manage/policy-management#automatically-configure-account-based-on-active-directory-primary-smtp-address\" target=\"_blank\"></a>\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/manage/policy-management#automatically-configure-account-based-on-active-directory-primary-smtp-address\" target=\"_blank\">Automatically configure account based on Active Directory Primary SMTP address</a>\n</li><li>MC800501 (Updated) <i>New Microsoft Outlook for Windows: Automatically configure accounts with new policy</i> (published June 2024, updated August 2024)\n</li></ul><p style=\"margin-left: 25px;\"><b>Note:</b> Setting the policy in #1 is required to ensure that new Outlook connects to the work or school account configured with the organization’s set of policies. If you do not set this policy, a user who has not already signed into new Outlook with their work or school account will be able to connect using a personal mailbox (such as Outlook.com, Gmail, IMAP) before signing in with their work or school account. \n</p><p>2.  Set the <code>PersonalAccountsEnabled</code> policy on your organization's mailbox to control whether personal mailboxes can also be connected to new Outlook. Learn more: <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/manage/policy-management#allow-only-corporate-mailboxes-to-be-added\" target=\"_blank\">Allow only corporate mailboxes to be added</a>\n</p><p>3. Set the <code>AllowedOrganizationAccountDomains</code> policy on your organization's mailbox to control whether work or school mailboxes on a different SMTP domain can also be connected to new Outlook. Learn more: <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/manage/policy-management#allow-only-corporate-mailboxes-to-be-added\" target=\"_blank\">Allow only corporate mailboxes to be added</a>\n</p><p><b>Note:</b> To prevent your organization's mailboxes from connecting to new Outlook, along with any other mailbox, you must still set the policy in #1. Also, set the <code>OneWinNativeOutlookEnabled</code> policy to <code>false</code>. These two actions will prevent your organization's mailboxes from signing into new Outlook and will also prevent users from selecting any other mailboxes to sign in. Learn more: <a href=\"https://learn.microsoft.com/exchange/clients-and-mobile-in-exchange-online/outlook-on-the-web/enable-disable-employee-access-new-outlook\" target=\"_blank\">Enable or disable access to the new Outlook for Windows | Microsoft Learn</a>.\n</p><p>Learn more about managing policies in new Outlook: <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/manage/policy-management\" target=\"_blank\">Policy Management - Microsoft 365 Apps | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Administrators should review and update management policies for the new Microsoft Outlook for Windows. Key policies include configuring accounts based on Active Directory, controlling personal mailbox connections, and managing domain-specific mailbox connections. Detailed guidance and policy mapping from classic Outlook are available in the provided links."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1015904",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-25T00:37:49.22Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-25T00:37:39Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Review your organization's configured management policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
