{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 26, 2025: We have updated the content. Thank you for your patience.\n</p><p>Coming soon for Microsoft Teams: Organizations that do not currently use Teams will be able to join and present in Teams town halls using their own video conferencing devices. Because we have incorporated Cloud Video Interop (CVI) capabilities into the Town Hall share event dialog, organizers can receive join codes for their tenant and share the codes to presenters, allowing them to easily join the event. This rollout ensures that all presenters can join the green room and can see and hear each other without any limitations. Only trusted CVI devices can join the session. After they join, a meeting organizer or co-organizer can promote the device from attendee to presenter, and then they can communicate with other presenters in the green room before the event starts.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late May 2025 (previously early May) and expect to complete by early June 2025 (previously mid-May).</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 (previously mid-May) and expect to complete by mid-June 2025 (previously late June).&nbsp;</p><p><b>How this will affect your organization:</b></p><p>This change will be available by default to your organization.\n</p><p>On the Town Hall share event dialog, the CVI coordinates will appear in the section called <i>Join on a video conferencing device:</i></p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/27c2f8b9-ed32-47b5-b450-16a863a800bf/792d5339a77e7cef1404ea9e8aab360ad5c8ae17.png\" style=\"width: 700px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before or after the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow presenters from organizations not using Teams to join Town Halls via their own video conferencing devices using Cloud Video Interop (CVI). This feature will roll out from late May to mid-June 2025. No admin action is required, but users should be notified and documentation updated."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1070182",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-26T14:57:32.27Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-08T23:10:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: CVI coordinates enables presenters to join Town hall via VTC devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
