{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>For Teams Room customers who are moving to the Intune Company Portal version 5.0.6152 or above through firmware updates or app-only updates have to ensure that Device Administrator (DA) privilege is enabled in their Microsoft Intune Portal.</p><p>This has been called out as a known issue: <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/teams-rooms-and-devices/teams-rooms-known-issues-android\" target=\"_blank\">Known issues with Teams Rooms on Android</a>&nbsp;</p><p><b>Note: </b>If your organization does not utilize Teams Room, you can safely disregard this message.</p><p><b>How this will affect your organization:</b></p><p>Without DA being enabled, the customers will encounter the following error message on Android based Teams devices during sign-in:</p><p>\"This device isn't enrolled in device administrator. Contact your Admin.\"</p><p><b>What you need to do to prepare:</b></p><p>Ensure that Device Administrator (DA) privilege is enabled in their Microsoft Intune Portal as shared in the instructions given here: <a href=\"https://learn.microsoft.com/microsoftteams/phones/phones-deploy\" target=\"_blank\">Intune and Conditional Access for Teams Phones</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins must enable Device Administrator privilege in the Microsoft Intune Portal for Teams Rooms devices to avoid sign-in errors on Android-based Teams devices. This applies to customers updating to Intune Company Portal version 5.0.6152 or above. Organizations not using Teams Room can disregard this message."
    }
  ],
  "EndDateTime": "2025-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1020202",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-28T22:11:09.67Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T22:10:58Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Prevent/Fix: Admins to enable Device Administrator privilege in Microsoft Intune Portal for Teams Rooms devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
