{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, Microsoft Purview admins can configure restrictions on removable USB devices, network shares, and/or printer groups in Endpoint Data Loss Prevention (EDLP) policies. After this rollout, these restrictions will extend to the Microsoft Edge browser.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=486370\" target=\"_blank\">486370</a>.\n</p><p><b>When this will happen:</b></p><p>Public Preview: We have begun rolling out early April 2025 and expect to complete by early April 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p></p><div>This feature is useful for organizations who want more granular control over restricting USBs, network shares, and printer groups in Purview EDLP policies.</div><p></p>This feature will be available by default.<p></p><p>Configure networks, removable USB devices, and network share groups through Endpoint DLP settings to be extensible to Edge:</p><p></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/45fa3470-85ac-45d5-b5b8-f1a8ab511369\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before or after the rollout. Review your current configuration to identify EDLP policies that could leverage these capabilities. You may want to notify your users about this change and update relevant policies.</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/dlp-configure-endpoint-settings#printer-groups\" target=\"_blank\">Printer groups</a> in Configure endpoint DLP settings | Microsoft Learn (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1050198",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-07T23:01:48.49Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-07T23:01:33Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention supports Microsoft Edge to enforce restrictions on files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
