{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 24, 2025: We have updated the timeline below. Thank you for your patience.</p><p>We’re introducing a new setting in Viva Learning that allows learners to manually mark a course as completed when the content provider does not send completion signals. Admins will now have the ability to enable or disable this “Mark complete” feature from the Viva Learning admin settings page.</p><p><b>When this will happen:</b></p><p>This feature will be generally available in production environment on June 24, 2025.</p><p><b>How this affects your organization:</b></p><p>By default, the “Mark complete” feature will be turned on, maintaining the current learner experience. Learners will continue to see the option to manually mark a course as complete when provider signals are unavailable.\n</p><p>If your organization prefers to restrict this behavior, admins can disable the setting from the Viva Learning admin settings page. When toggled off:\n</p><ul><li>A confirmation dialog will appear before saving the change.\n</li><li>The system will log the last modified date and the admin who made the change.\n</li><li>Learners will no longer see the “Mark complete” button on applicable courses, including those in Academies and Learning Paths.\n</li></ul><p><b>What you can do to prepare:</b></p><p>No immediate action is required. The setting will appear automatically in the admin settings page. If you wish to restrict learners from manually marking courses as complete, you can disable the toggle at any time.\n</p><p>For more information, please refer to <a href=\"https://learn.microsoft.com/en-us/viva/learning/set-up-viva-learning\" target=\"_blank\">Set up Microsoft Viva Learning in the Teams admin center</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins can now enable or disable the \"Mark Complete\" feature in Viva Learning, allowing learners to manually mark courses as completed when provider signals are unavailable. This feature will be available on June 24, 2025. By default, it is enabled, but admins can disable it via the admin settings page."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090694",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-24T14:16:29.49Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:15:49Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Admin Toggle to enable/disable \"Mark Complete\" feature in Viva Learning",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
