{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Improvements to the controls for Microsoft 365 Copilot and transcripts in the Microsoft Teams admin center (TAC). This rollout aims to reduce complexity and prevent conflicting states for those controls, to help provide a smoother experience for admins and users. This rollout will help prevent issues such as Copilot requiring a transcript when Transcript is Off, resulting in error messages for users that cannot be resolved.</p><p>\n</p><p>The feature described in this message is available to all admins in the TAC, but error messages only occur for Teams users who also have a Microsoft 365 Copilot license.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We <span style=\"background-color: rgb(231, 214, 222);\">began </span>rolling out early April 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b></p><p><i>What is changing?\n</i></p><p>Before this rollout, when <span style=\"background-color: rgb(231, 214, 222);\">an admin selects </span>an invalid combination in the <span style=\"background-color: rgb(231, 214, 222);\">TAC</span>, such as Copilot requiring a transcript when <i>Transcript </i>is <i>Off</i>, meeting users with a Copilot license experience an error message in the Copilot right pane that they&nbsp;can’t recover from, <span style=\"background-color: rgb(231, 214, 222);\">because </span>the transcript is not available for them. This rollout fixes the issue by disabling Copilot options related to transcripts when <i>Transcript </i>is disabled in TAC.</p><p>After this rollout, when <i>Transcript </i>is <i>Off </i>in <span style=\"background-color: rgb(231, 214, 222);\">the </span>TAC, the only available Copilot options in the TAC will be <i>On </i>or <i>Off:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b5bd7589-90b8-4a64-9193-a740e627ea76\" style=\"width: 590.994px;\"></p><p>This rollout also applies to changes made through Microsoft PowerShell.\n</p><p>Any preexisting policies you have configured will not be affected by this rollout. However, only valid values will be available if admins try to edit their Copilot settings.\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>We encourage all tenant admins to review their current settings and make necessary adjustments to align with valid values. Our support team is ready to assist with any questions or concerns.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Improvements to Microsoft 365 Copilot controls in the Microsoft Teams admin center are rolling out from April to May 2025. These changes will prevent errors by disabling conflicting Copilot options when transcripts are off. Admins need to review and adjust settings accordingly. No action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1055552",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-15T00:28:09.38Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-15T00:26:24Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: Improvements to controls for Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
