{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 3, 2025: We have updated the timeline. Thank you for your patience.</p><p>We're introducing enhanced presenter capabilities for Teams Rooms on Windows in Microsoft Teams Town Halls. When a Teams Room is assigned as a co-organizer or presenter, it can now start or end the event, manage what attendees see, and promote attendees to presenters. This update helps ensure a smoother, more organized event experience—especially in large-scale or hybrid meetings. This feature is available with Teams Rooms Pro.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=490050\" target=\"_blank\">490050</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out late June 2025 and expect to complete by early July 2025.</p><p>General Availability (GCC High): We will begin rolling out mid-July 2025 and expect to complete by late July 2025.</p><p>General Availability (DoD): We will begin rolling out late July 2025 and expect to complete by late September 2025.</p><p><b>How this will affect your organization:</b></p><p>Organizers of Teams Town Halls can now assign a Teams Room on Windows as a co-organizer or presenter, enabling it to manage key aspects of the event. This includes controlling the attendee view, starting or ending the session, and promoting attendees to presenters. These capabilities can help streamline event management and reduce the need for manual intervention by remote producers.\n</p><p>This feature is available only with Teams Rooms Pro and is on by default once deployed.</p><p><b>What you need to do to prepare:</b>\n</p><ul><li>Review your current event workflows and determine if Teams Rooms should be included as co-organizers or presenters in Town Halls.\n</li><li>Update internal training materials and documentation to reflect the new capabilities.\n</li><li>Ensure Teams Rooms Pro licensing is in place for rooms you plan to use with this feature.</li></ul><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/overview-meetings-webinars-town-halls\" target=\"_blank\">Overview of meetings, webinars, and town halls</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490050"
    },
    {
      "Name": "Summary",
      "Value": "Teams Rooms on Windows with Teams Rooms Pro can now be assigned as co-organizers or presenters in Teams Town Halls, allowing them to start/end events, control attendee views, and promote presenters. This rollout begins late June 2025 and aims to improve large-scale event management."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090688",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-03T14:29:20.323Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:12:56Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams Town hall screen management privileges in Teams Rooms on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
