{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This feature prompts users who are signed into a personal Microsoft account on a Windows device and actively using their corporate OneDrive to also sign into OneDrive with their personal account. Once signed in, users can access both their personal and corporate OneDrive accounts on the same device—without merging content.</p><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=490064\" target=\"_blank\">490064</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in mid-June 2025 and expect to complete by early July 2025.</p><p><b>How this will affect your organization:</b></p><p>This feature prompts users who are signed into a personal Microsoft account on a Windows device and actively using their corporate OneDrive to also sign into OneDrive with their personal account. Once signed in, users can access both their personal and corporate OneDrive accounts on the same device—without merging content. The prompt is enabled by default and only appears if a personal account is already in use on the device. <i>Organizations that have previously restricted personal account usage with the DisablePersonalSync policy will not see the prompt.</i> Administrators can also suppress it using the DisableNewAccountDetection policy.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p></p><div style=\"\">To prepare for this change, it is recommended to update any support documentation. Organizations that have previously restricted personal account usage with the DisablePersonalSync policy will not see the prompt. Administrators can also suppress it using the DisableNewAccountDetection policy.</div><p></p><br>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490064"
    },
    {
      "Name": "Summary",
      "Value": "OneDrive will prompt users with a personal Microsoft account on a Windows device to sign into OneDrive with their personal account while using their corporate OneDrive. This feature rolls out from mid-June to early July 2025. Organizations can suppress the prompt using specific policies."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075910",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-16T22:24:56.367Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:24:43Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "OneDrive: Prompt to Add Personal Account to OneDrive Sync",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
