{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With this new enhancement, Microsoft Purview Data Loss Prevention (DLP) is extended to Microsoft 365 Copilot in Word, Excel, and PowerPoint on canvas surfaces. This feature update will allow DLP policies to identify sensitive documents based on sensitivity labels and exclude processing for Copilot interactions in Microsoft 365 Copilot.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=423483\" target=\"_blank\">423483</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out late mid-May 2025 and expect to complete by early June 2025.</p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by late July 2025.&nbsp;</p><p>Note: The Public Preview does not support alerts, incident reports, or policy simulation. DLP alerts and policy simulation will be supported at feature General Availability.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Users that have the required licenses will be able to go to the Microsoft Purview portal to create policies in the DLP solution.  Admins can also go to the Data Security Posture Management (DSPM) for AI to see recommendations about creating Copilot policies.</p><p><b>What you need to do to prepare:</b>\n</p><p>No preparation is required for admins other than <a href=\"https://learn.microsoft.com/purview/dlp-create-deploy-policy?tabs=purview\" target=\"_blank\">creating the DLP policy and assigning licenses to enterprise users in your organizations</a>.</p><p>Refer to <a href=\"https://learn.microsoft.com/purview/dlp-microsoft365-copilot-location-learn-about?view=o365-worldwide\" target=\"_blank\">Data Loss Prevention documentation</a> for details about DLP for Microsoft 365 Copilot.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "423483"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention (DLP) will extend to Microsoft 365 Copilot in Word, Excel, and PowerPoint, allowing DLP policies to exclude processing of labeled content by Copilot. Public Preview starts mid-May 2025, with General Availability in late June 2025. No preparation is required other than creating DLP policies and assigning licenses."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1059677",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-21T23:45:01.767Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-21T23:44:37Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | ​Data Loss Prevention: Restrict Copilot in Office from processing labeled content",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
