{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview's content explorer in the compliance portal is the centralized place for you to natively view the items that were summarized on the overview page. Before this rollout, for Microsoft Exchange Online, we only show the email message body. When attachments are flagged for sensitive data, you could not see the attachment unless you downloaded it. After this rollout, admins will be able to preview email attachments directly from content explorer.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485765\" target=\"_blank\">485765</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early June 2025 and expect to complete by mid-June 2025.</p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by early July 2025.\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, admins who select an email in <i>Data Loss Prevention &gt; Content explorer (classic) </i>can preview the attachment in the new <i>Email attachments</i> tab.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6161a256-80d3-49a9-b393-9b74c3176bb7\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>We will support previews for these attachment types: .doc, .docx, .xlsx, .xls, .xlsm, .xlsb, .pptx, .pdf, .txt, .csv, .html, .xml, .json, .rtf, .cpp, .cs, .py, .jpg, .png, .jpeg, and .eml.\n</p><p>This feature will be available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your admins about this change and update your relevant documentation.</p><p>Learn more: <a href=\" https:=\" \"=\"\" learn.microsoft.com=\"\" purview=\"\" data-classification-content-explorer\"=\"\" target=\"_blank\">Get started with content explorer | Microsoft Learn&nbsp;(will be updated before rollout)</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485765"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview compliance center will allow admins to preview email attachments directly in content explorer starting June 2025. This feature supports various file types and requires no admin action before rollout. Review your configuration and notify admins about this change. More details are available on the Microsoft 365 Roadmap ID 485765."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1089321",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-06T23:35:37.21Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-06T23:35:02Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance center: Preview email attachments in content explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
