{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 28, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Teams: Meeting organizers and schedulers will be able to add CVI (Cloud Video Interop) coordinates to Teams town hall and webinar meeting invitations. With CVI coordinates in invitations, non-Teams users—such as external customers or partners—can easily join town hall and webinar meetings using a third-party teleconferencing device.\nThis message applies to Teams on Windows desktop, Teams on Mac desktop, and Teams on the web.\n</p><p>CVI is a Microsoft Qualified third-party solution that enables third-party SIP and H.323 video room devices (VTCs) to join Microsoft Teams meetings. As an admin, you can set CVI for your org. Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/cloud-video-interop\" target=\"_blank\">Manage and set up Cloud Video Interop for Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=476487\" target=\"_blank\">476487</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early April 2025 (previously March) and expect to complete by mid-April 2025 (previously late March).\n</p><p>General Availability (Worldwide): We will begin rolling out mid-April 2025 (previously early March) and expect to complete by late April 2025 (previously late March).</p><p>General Availability (GCC): We will begin rolling out early May 2025 (previously early April) and expect to complete by late May 2025 (previously late April).</p><p>General Availability (GCC High): We will begin rolling out early May 2025 (previously early April) and expect to complete by late May 2025 (previously late April).</p><p><b>How this will affect your organization:</b></p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/plan-town-halls\" target=\"_blank\">Plan for Teams town halls - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "476487"
    },
    {
      "Name": "Summary",
      "Value": "Meeting organizers and schedulers in Microsoft Teams will soon be able to add CVI (Cloud Video Interop) coordinates to town hall and webinar invitations, allowing non-Teams users to join using third-party teleconferencing devices. The rollout will begin in April 2025 and complete by May 2025, with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1009932",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-28T17:27:28.32Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-19T00:46:17Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Add CVI (Cloud Video Interop) coordinates to town hall and webinar invitations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
