{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce a new user interface (UI) refresh for the Microsoft 365 Public Roadmap. This update is designed to enhance your experience by aligning the look and feel with the recently refreshed Azure Update site. This initiative is driven by valuable feedback from our customers, aiming to deliver cohesive and modern user experience across our platforms.</p><p>The new interface maintains the same usability features you are accustomed to, ensuring a seamless transition without significant changes to how you navigate the roadmap. However, the backend has been upgraded to be produced from our Change Communication engine. This upgrade lays the groundwork for future enhancements, providing us with the flexibility to introduce new features and improvements over time.</p><p><b>When this will happen:</b></p><p>The new UI will light up on Thursday February 13th, 2025.&nbsp; The legacy API will remain in place until March 15th, 2025.&nbsp;&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>For customers who utilize the Microsoft 365 Public Roadmap public API in automation to assist with planning, please note the upcoming change to the API endpoint. The new endpoint link will be prominently displayed on a banner on the Public Roadmap site for 30 days, facilitating a smooth transition to the updated API. This proactive measure ensures that you have the necessary information and time to make the required adjustments without disruption to your workflows</p><p><b>What you need to do to prepare:</b>\n</p><p>If you are consuming the Roadmap API, please redirect your automation to <a href=\"https://www.microsoft.com/releasecommunications/api/v1/m365\" target=\"_blank\">https://www.microsoft.com/releasecommunications/api/v1/m365</a>&nbsp;there is no change to the schema.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-04-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1004407",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-12T23:29:15.533Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-12T23:29:06Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Public Roadmap Update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
