{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Never miss key points from your meetings again. Copilot transforms your meeting recordings into actionable insights, making follow-ups a breeze. Use Q&amp;A for meeting recordings to get immediate answers—no need to watch or skim.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469500\" target=\"_blank\">469500</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late May 2025 and expect to complete by mid-June 2025.</p><p><b>How this will affect your organization:</b></p><p>Users will be able to perform the following actions on Meeting recordings that they have access to:\n</p><ol><li>Recap meetings: Users can quickly review key points and discussions from their meetings.\n</li><li>Generate meeting notes: Users can automatically create detailed notes summarizing the meeting.\n</li><li>Highlight any @mentions: Users can easily identify, and review all mentions of specific individuals during the meeting.\n</li></ol><p>To see Recap in action review this <a href=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/71b4b96f-9acd-4303-9d32-33fcce8d3f9f/74528f8222d142f472b955e05703472906b91be0.mp4\" target=\"_blank\">short video</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. Please notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469500"
    },
    {
      "Name": "Summary",
      "Value": "OneDrive will introduce Copilot for meeting recordings, providing actionable insights and immediate answers via Q&A. This feature will be available globally from late May to mid-June 2025. Users can recap meetings, generate notes, and highlight @mentions. No admin action is required; notify users and update documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061719",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-24T23:14:22.13Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T23:14:03Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "OneDrive: ask Copilot questions on meeting recordings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
