{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Purview | Data Loss Prevention: We will support adding Microsoft SharePoint sites to existing administrative units. When you assign a DLP policy for the SharePoint location to an administrative unit, the policy will only apply to the sites that are part of that administrative unit.\n</p><p>This message is associated with Microsoft 365 Roadmap ID ​<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=475970\" target=\"_blank\">475970</a>.​\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We began rolling out late April 2025 and expect to complete by early May 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by late August 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This change will be available by default for admins to configure. Users will be able to scope for the desired SharePoint sites in the Microsoft Purview compliance portal at Data loss prevention &gt; Create policy &gt; Locations:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/24c49cba-1500-4cfe-8fc0-30e8dc671be0\" style=\"width: 400px;\" alt=\"admin\" controls\"=\"\">\n</p><p>If you participated in the Private Preview for this feature, we have made a change. In the Private Preview, admins could manually add specific SharePoint sites to scope the feature. For the Public Preview and General Availability, due to underlying issues, we will revoke the specific sites option. We will only support scoping for All sites.\n</p><p>Private Preview customers: You can continue to use current policies scoped to specific sites. The policies will continue to function as before, but you won’t be able to modify those existing configurations, and any new changes must use the All-sites option.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization.\n</p><p>Learn more: The section called <a href=\"https://learn.microsoft.com/purview/dlp-policy-reference?branch=main#support-for-adding-sharepoint-sites-to-administrative-units-preview\" target=\"_blank\">Support for adding SharePoint sites to Administrative Units (preview)</a> in <a href=\"https://learn.microsoft.com/purview/dlp-policy-reference\" target=\"_blank\">Data Loss Prevention policy reference | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "475970"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention will soon support adding SharePoint sites to administrative units. Public Preview starts late April 2025, and General Availability begins mid-June 2025. Admins can configure this by default, but only the All-sites option will be supported. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066929",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-02T22:51:37.323Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-02T22:51:13Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Admin units support for Microsoft SharePoint Online (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
