{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Outlook on iOS and Android you will now be able to more easily create, delete, rename, and move folders on the mobile app. From your inbox, tap the Edit icon in the sidebar. Tap on any folder to create a subfolder, or rename, move, and delete that folder. You can also rearrange and nest your folders by dragging and dropping them.</p><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=489831\" target=\"_blank\">489831</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out on mid-May 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b></p><p>Once available, users will have the ability to create, rename, move, and delete folders more easily on mobile. To do so, users need to open the left-navigation and tap the Edit icon to open the edit favorites/folder menu.\n</p><p><i>Create </i>folders and subfolders: Users can create a folder by tapping \"+Create Folder\" or by tapping on a folder to create a subfolder.</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/27542d9a-5207-4598-bbcd-2012a1fb8c92\" width=\"400\" height=\"\"></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c97f9100-6f1a-4503-85af-a69d258e7f8f\" width=\"400\" height=\"\"></p><p><i>Rename </i>existing folders: User should open the Edit menu, tap on a folder, and tap rename.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c97f9100-6f1a-4503-85af-a69d258e7f8f\" width=\"400\" height=\"\"></p><p><i>Move </i>folders: Users can move folders into other folders by tapping on a folder, selecting Move, and then choosing the destination folder. Drag and drop a folder into another folder by pressing and holding the folder row, then dragging it to where you want it. Reorder folders by simply dragging and dropping them in your preferred order.\n</p><p style=\"margin-left: 25px;\">Note: Drag handles (three horizontal lines) will be added next to each folder to make reordering more accessible. These handles are the same ones currently used for reordering items in your Favorites list, although they are not shown for the Folders section in these mocks. \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5cc24bdb-56b3-468f-84f3-d88de9d7903d\" width=\"400\" height=\"\"></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/55cd3abd-20ca-4aa3-af03-80270cbb1394\" width=\"400\" height=\"\"></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/d2e79ca2-582a-48f8-96b6-a13f6cc6dc27\" width=\"400\" height=\"\"></p><p><i>Delete </i>folders: User should open the Edit menu, tap on a folder, and tap delete.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/329db0cb-ce88-4ffb-9cc2-3f730ad24ce3\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook for iOS and Android will allow users to create, delete, rename, and move folders more easily starting mid-May 2025. Users can manage folders by tapping the Edit icon in the sidebar. This update will be available worldwide, including GCC, GCC High, and DoD. No admin action is required."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1068276",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-05T23:23:20.673Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-05T23:23:06Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Create, Delete, Rename, and Move Folders in Outlook for iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
