{
  "ActionRequiredByDateTime": "2025-07-31T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring the classic eDiscovery including classic Content Search, eDiscovery (Standard), and eDiscovery (Premium) from the Microsoft 365 Purview portal starting August 1, 2025, and ending September 1, 2025. Instead, we recommend the new unified eDiscovery, which is faster and easier to use, combining standard and premium features, in a simpler workflow with robust reporting. We will continue to invest our development resources in the new unified eDiscovery.\n</p><p>Classic eDiscovery experience (red box) will retire. We recommend the new unified eDiscovery (green box) experience:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/beab823b-f150-49d3-bfa1-44295cd97360\" style=\"width: 245px;\" alt=\"admin controls\">\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates one or more users in your organization may be using classic eDiscovery. Users will no longer be able to access classic eDiscovery after it retires. Users are defined as members of the eDiscovery administrator or manager role group or users with any of the <a href=\"https://learn.microsoft.com/purview/edisc-permissions?view=o365-worldwide#ediscovery-roles-and-role-groups\" target=\"_blank\">eDiscovery relevant roles</a>.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically by the specified date. No admin action is required. Please notify your users about this change, update relevant documentation, and share the new experience and capabilities in the new unified eDiscovery.\n</p><p><i>Learn more</i>\n</p><ul><li>About the new eDiscovery: <a href=\"https://learn.microsoft.com/purview/edisc?view=o365-worldwide\" target=\"_blank\">Learn about eDiscovery (preview) solutions | Microsoft Learn</a>\n</li><li>Configuring the new eDiscovery experience for your tenant: <a href=\"https://learn.microsoft.com/purview/edisc-settings-experience\" target=\"_blank\">Learn about user experience settings in eDiscovery (preview) | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1002399",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-11T00:16:17.44Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-11T00:16:06Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Purview: Classic eDiscovery experience will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
