{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 17, 2025: We have updated the content. Thank you for your patience.</p><p>We're updating the default setting for the Text Prediction feature in Outlook to improve user control and reduce unintended suggestions. This change affects New Outlook for Windows, Outlook on the web, and Outlook for iOS and Android.\n</p><p><b>When this will happen:</b></p><p>This change will begin rolling out on July 1, 2025.\n</p><p><b>How this affects your organization:</b></p><p>Text Prediction will be turned off by default for all users of New Outlook for Windows and Outlook on the web, including those who currently have it enabled. On Outlook for iOS and Android, only new users will have the default set to off. After the change, users will no longer see predictive text suggestions while composing email messages unless they manually re-enable the feature in Outlook settings.</p><p>This change cannot be reverted at the admin level; only individual users can enable the Text Prediction setting again.</p><p><b>What you can do to prepare:</b></p><p>Admins should be prepared to inform users of this change and guide them to re-enable Text Prediction if desired. Users can turn the feature back on by navigating to:\n</p><ul><li>Outlook on the web: Settings &gt; Mail &gt; Smart suggestions &gt; Text predictions\n</li><li>New Outlook for Windows: Settings &gt; Mail &gt; Smart suggestions &gt; Text predictions\n</li><li>Outlook mobile: Settings &gt; Mail &gt; Text predictions</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Text Prediction will be turned off by default in Outlook starting July 1, 2025. This affects New Outlook for Windows, Outlook on the web, and new users on Outlook for iOS and Android. Users can manually re-enable it in settings. Admins should inform users about this change."
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1093235",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-17T14:53:37.803Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-12T23:12:05Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Text Prediction turned off by default in Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
