{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To create a case, Insider Risk Management analysts must manually select “Confirm all alerts &amp; create case” in the Purview portal after confirming an alert in the Defender XDR portal (security.microsoft.com). Once a case is created, related content such as online files and emails will be available in the Content explorer tab.</p><p>New content that contributes to alerts will continue to be added to the Content explorer for up to 30 days from the case creation date. After this period, any new alert-related content will not be added to the existing case. To access new content, analysts must close the current case and create a new one.\n</p><p>This change is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=489228\" target=\"_blank\">489228</a>.\n</p><p><b>When this will happen:</b></p><p>Public Preview: Rolling out mid-June 2025; expected completion by late June 2025.\n</p><p>Targeted Release: Rolling out late July 2025; expected completion by mid-August 2025.\n</p><p>General Availability: Rolling out mid-September 2025; expected completion by late September 2025.\n</p><p><b>How this affects your organization:</b></p><p>Insider Risk Management analysts and investigators will need to manually create cases in the Purview portal for alerts confirmed in Defender XDR. This change may impact existing workflows and requires awareness among security and compliance teams.\n</p><p><b>What you can do to prepare:</b></p><ul><li>Inform and train Insider Risk Management and SOC teams about the new manual case creation process.\n</li><li>Review internal documentation and update any automated workflows or playbooks that assume automatic case creation.\n</li></ul><p><b>Compliance considerations:</b></p><ul><li>Changes to data processing/storage/access?\tYes – changes how confirmed alerts are handled and stored in cases</li><li>Modifies Purview capabilities (DLP, labels, audit, etc.)?\tMaybe – affects case content visibility and retention\n</li><li>Changes to compliance monitoring/reporting?\tMaybe – may impact how case data is reviewed or reported</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489228"
    },
    {
      "Name": "Summary",
      "Value": "Insider Risk Management analysts must manually create cases in the Purview portal after confirming alerts in the Defender XDR portal. New alert-related content will be added for 30 days post-case creation. The change impacts workflows and requires training. Public Preview starts mid-June 2025, with General Availability by late September 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1099690",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-20T22:16:34.837Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-20T22:16:27Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Changes to case creation process in Purview portal when confirming alerts from Defender XDR portal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
