{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 2, 2025: We have updated the timeline below. Thank you for your patience.</p><p>When town hall was released in Microsoft Teams, some columns of data related to each town hall event were missing in the Microsoft Teams admin center usage reports for admins. This rollout fixes that issue by adding all relevant usage related data to the town hall usage reports.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486706\" target=\"_blank\">486706</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late May 2025 (previously mid-May) and expect to complete by late June 2025 (previously late May).</p><p><b>How this will affect your organization:</b>\n</p><p>This rollout will have no impact on the existing experience for setting up town hall events. </p><p>Admins will have access to more usage data as part of reports available in Teams admin center.\n</p><p>Admins can access the usage data reports in the Teams admin center at <i>Analytics &amp; reports &gt; Usage reports.</i> On the <i>View reports</i> tab, under <i>Report,</i> select <i>Town hall usage reports.</i></p><p>This change will be on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before or after the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your admins about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/teams-analytics-and-reports/teams-town-hall-usage-report\" target=\"_blank\">Microsoft Teams town hall usage report - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486706"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams usage reports will now include all town hall usage data. The rollout begins late May 2025 and completes by late June 2025. No admin action is required. Admins will have access to more detailed usage data in the Teams admin center. This change is automatic and on by default."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1053648",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-02T14:18:39.103Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-11T21:40:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Usage reports will include all town hall usage data in your tenant",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
