{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce that we will add the Microsoft 365 Copilot in Viva Glint feature to Feature Access Management in Viva.  This will allow global admins and AI admins to control the rollout and availability of Copilot in Viva Glint.\n</p><p>Copilot in Viva Glint is enabled for all users in Viva Feature Access Management by default. If users have access at the Feature Access Management in Viva level, you will also need to grant access in the Viva Glint product as it is disabled for all users by default in Viva Glint.\n</p><p>Subscription plans of Viva suite or Viva Glint are required for using Microsoft Viva Glint.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;amp;searchterms=478655\" target=\"_blank\">478655</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling late February 2025 and expect to complete by late March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Microsoft 365 global admins and AI admins can use the Copilot page in the Microsoft 265 admin center <i>Settings</i>, the Feature Access Management page in Viva, the Viva Glint page in the Microsoft 365 admin center, or Microsoft PowerShell cmdlets to create granular policies and access policies for Copilot in Viva Glint:\n</p><ul><li>Tenant policy: Automatically includes all users in the tenant.</li><li>Group/user-level policy: Admins can choose individual users/groups that should be part of the access policy.\n</li><li>Admins can use both tenant and group policies for restricting or enabling access to both Copilot and Summarization.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>As a global admin:\n</p><ul><li>If you wish to leave Copilot in Viva Glint enabled for all users in your organization, no action is needed.\n</li><li>If you choose to limit the availability of Copilot in Viva Glint to certain users/groups in your organization, create group/user policies through Feature Access Management in Viva to turn off Copilot in Viva Glint by tenant, group, or user.\n</li><li>If you choose to disable Copilot in Viva Glint for your entire tenant, you can create a separate tenant policy in Feature Access Management in Viva to turn off the feature.\n</li></ul><p>Learn more about Feature Access Management in Viva and Copilot in Viva Glint:\n</p><ul><li><a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Microsoft Viva - Feature access management | Microsoft Learn</a> (will be updated before rollout)</li><li><a href=\"https://learn.microsoft.com/viva/glint/copilot/copilot-admin-intro\" target=\"_blank\">Microsoft Glint - Introduction to Microsoft 365 Copilot in Viva Glint | Microsoft Learn</a> (will be updated before rollout)</li><li><a href=\"https://learn.microsoft.com/viva/glint/copilot/admin-enable\" target=\"_blank\">Microsoft Glint - Administrator enablement for Microsoft 365 Copilot in Viva Glint | Microsoft Learn</a> (will be updated before rollout)</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478655"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1004409",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-12T23:30:25.413Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-12T23:30:04Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Glint: Use Feature Access Management in Viva for Microsoft 365 Copilot in Glint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
