{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 27, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are excited to announce the addition of a new graph called \"average time spent per user\" (dwell time) to Amplify reporting. The dwell time graph will indicate the average time users spent reading a publication, providing important insights into user engagement with the Amplify campaign. Dwell time will be available at the campaign level as well as for every publication in the campaign. This metric will be supported from Microsoft SharePoint and Microsoft Outlook channels.</p><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421193\" target=\"_blank\">421193</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-April 2025 (previously mid-March) and expect to complete by late April 2025 (previously mid-April).</p><p><b>How this will affect your organization:</b></p><p>This new metric will be added as a card to the Amplify reporting tab.</p><p><b>What you need to do to prepare:</b></p><p></p><div style=\"font-family: Arial; font-size: 10pt;\">This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421193"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Amplify is introducing a new \"average time spent per user\" graph in reporting, available mid-April to late April 2025. This metric will provide insights into user engagement at the campaign and publication levels, supported by SharePoint and Outlook channels. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1025211",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-27T20:18:07.383Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-07T01:14:54Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Amplify: New \"average time spent per user\" graph in reporting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
