{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Data Security Posture Management for AI apps and agents enables administrators to view a dashboard of agents used across the organization and identify any potential data security risks.</p><p>This message is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=489492\" target=\"_blank\" style=\"\">489492</a></p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide): We will begin rolling out on late May 2025 and expect to complete by late May 2025.</p><p>General Availability (Worldwide): We will begin rolling out on late September 2025 and expect to complete by late September 2025.</p><p><b>How this will affect your organization:</b></p><p>Administrators can access detailed insights into sensitive data that specific agents have accessed and see how these agents are protected by Purview data security policies. The detailed agent view also indicates what policies are applied to the agent and provides options for administrators to create a policy directly from this view to address any coverage gaps.</p><p><b>What you need to do to prepare:</b></p><p>This page will be added to Microsoft Purview Data Security Posture Management by default. You may consider updating your documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Security Posture Management for AI apps and agents provides a dashboard for administrators to identify data security risks. Public preview starts in late June 2025, and general availability in late September 2025. Administrators can view and manage data security policies for agents. Update documentation as needed."
    }
  ],
  "EndDateTime": "2025-11-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060869",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T18:48:29.933Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:48:56Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview Data Security Posture Management for AI Apps and agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
