{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: An enhanced agent engagement experience in Chats and Channels.\n</p><p>Some Teams users in your organization may see a new experience for engaging with agents in Chats and Channels. This new feature will be available to a randomized subset of Teams users as an experiment to collect data and feedback before a broader rollout.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p><b>When this will happen:</b></p><p>Targeted Release (Worldwide): We will begin rolling out in early June 2025 and expect to complete in late June 2025.\n</p><p>We will communicate the plan for General Availability in a future post.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, when users select the people roster icon in the top right corner of a Chat or Channels window, a pop-up window opens to provide a list of agents and bots that users can add to the Chat or Channel.</p><p>After this rollout, when users select the people roster icon and choose <i>Add agents and bots</i> from the menu. An <i>Agents and bots</i> panel will open on the right side of Teams where users can select apps or agents without leaving the Chat or Channel. This ensures users continue to have an unobstructed view of their conversations while engaging with agents and bots.</p><p>1. A user selects the People icon, notices two apps that are already available in the <i>Agents and bots</i> section, and selects <i>Add agents and bots</i> from the menu:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/49cbc461-2fac-4d9a-ba24-34a12ea23415\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>2. A user selects a new agent to add to the Chat from the <i>Agent and bots </i>panel:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/23327d3f-4a43-415d-b09d-2d773038a882\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>Why did we do this?</i></p><ul><li>We received feedback that the current experience is obstructive and disrupts user flow, especially when they are in the middle of a Chat or Channel conversation.\n</li><li>The current experience limits the amount of time users have to choose an app.\n</li></ul><p>Adding apps to a Tab in Teams</p><p>Based on feedback from previous experiments, users will continue to be able to add apps by selecting the + sign at the top of the Teams Chat or Channels window for the duration of this experiment.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce an enhanced agent engagement experience in Chats and Channels for a subset of users starting in June 2025. This update will allow users to add agents and bots via a side panel without leaving their current conversation. No admin action is required, but user notification is recommended."
    }
  ],
  "EndDateTime": "2025-12-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1093236",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-30T20:29:52.333Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-12T23:12:36Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: An enhanced agent experience in Chats and Channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
