{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of the Microsoft Entra Conditional Access <a href=\"https://learn.microsoft.com/entra/identity/conditional-access/concept-token-protection#known-limitations\" target=\"_blank\">Token Protection</a> feature rollout, we're notifying you of potential impacts to Power Query in Excel. This feature enhances token security but may block certain data import scenarios in Excel when applied.</p><p><b>When this will happen:</b></p><p>This feature is currently available in Public Preview, as outlined in the <a href=\"https://www.microsoft.com/licensing/terms/product/ForOnlineServices/all\" target=\"_blank\">Microsoft Product Terms</a>.\n</p><p><b>How this affects your organization:</b></p><p>When Conditional Access Token Protection is applied to a user, Power Query in Excel will block data import or refresh operations from sources that require Azure Active Directory (AAD) authentication. This includes, but is not limited to:\n</p><ul><li>SharePoint\n</li><li>Microsoft Exchange\n</li><li>Other AAD-authenticated sources, depending on the broker configuration\n</li></ul><p>This may affect users who rely on Power Query to connect to organizational data sources.\n</p><p><b>What you can do to prepare:</b></p><p>Review your Conditional Access policies before enabling Token Protection for users who depend on Power Query in Excel.\n</p><p>Inform your helpdesk and update internal documentation to reflect these changes.\n</p><p>For more information, refer to:\n</p><ul><li><a href=\"https://learn.microsoft.com/entra/identity/conditional-access/concept-token-protection#known-limitations\" target=\"_blank\">Microsoft Entra Conditional Access: Token protection (Preview)</a></li><li><a href=\"https://support.microsoft.com/office/import-data-from-data-sources-power-query-be4330b3-5356-486c-a168-b68e9e616f5a#ID0EBH=Newer_versions\" target=\"_blank\">Import data from data sources (Power Query) - Microsoft Support</a></li></ul><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? Yes</li><li>Does the change modify, interrupt, or disable any of the following capabilities (Purview)? Maybe – depending on how Power Query is used in conjunction with DLP or Information Protection policies\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Important Update: Token Protection Policy for Power Query in Excel may block data import scenarios requiring Azure Active Directory authentication, affecting sources like SharePoint and Microsoft Exchange. Review Conditional Access policies and update documentation. The feature is in Public Preview."
    }
  ],
  "EndDateTime": "2025-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1093233",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-12T23:10:35.887Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-12T23:10:29Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Important Update: Token Protection Policy for Power Query in Excel",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
