{
  "ActionRequiredByDateTime": "2025-06-30T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are writing to inform you about an upcoming change regarding the <code>MeetingInitiator</code> value in the <code>MeetingRecordingOwnership</code> from PowerShell. Starting June 30, 2025, recording initiator policy will be retired. By default, recordings will be saved to the meeting organizer's OneDrive without needing <code>MeetingRecordingOwnership</code> setting.\n</p><ul><li><code>MeetingInitiator</code> value will be retired. \n</li><li><code>MeetingRecordingOwnership </code>setting will be retired.\n</li></ul><p><b>When this will happen:</b></p><p>June 30, 2025</p><p><b>How this affects your organization:</b></p><p>We understand the importance of governance and predictability in managing recordings, which is why we have introduced the Recordings saved to Organizers OdB in GCC, GCCH, and DOD by default, enabling recordings to be saved to the organizer's OneDrive, even if the organizer did not attend the meeting or event. Co-organizers have the same editing permissions as organizers for recording files.</p><p>When the organizer does not have a OneDrive account such as meetings scheduled using a shared mailbox, a fallback logic will be in place to determine the recording owner, following the sequence: <i>Organizer -&gt; Co-organizer(s) -&gt; Initiator -&gt; Async Media Storage</i> (AMS).\n</p><p>Furthermore, we have introduced new features that provide more compliant control, available exclusively on the Organizer's ODB. Here is a quick comparison between the Initial's Policy and the Organizer's Policy:</p><table class=\"table table-bordered\"><tbody><tr><td>Aspect</td><td>Initial's Policy</td><td>Organizer's Policy</td></tr><tr><td>Default value<br></td><td><p><code>MeetingRecordingOwnership</code> is set to <code>MeetingInitiator</code></p></td><td><p><code>MeetingRecordingOwnership</code> is set to <code>MeetingOrganizer</code></p></td></tr><tr><td>Fallback path</td><td>Initiator -&gt; Async Media Storage (AMS).</td><td>Organizer -&gt; Co-organizer (s) -&gt; Initiator -&gt; Async Media Storage (AMS).&nbsp;</td></tr><tr><td><p>Who can access recording/transcription meeting option</p><p>*see more for <a href=\"https://support.microsoft.com/en-us/office/meeting-options-in-microsoft-teams-53261366-dbd5-45f9-aae9-a70e6354f88e\" target=\"_blank\">Teams meeting option</a></p></td><td>No</td><td><p>Yes</p><br></td></tr></tbody></table><p>No action is required on your part as the Meeting Organizer will be the default value for Recording Ownership. \n</p><p><b>What you can do to prepare:</b></p><p>Before June 30 2025, we encourage you to proactively set the <code>MeetingRecordingOwnership</code> as <code>MeetingOrganizer</code> to benefit earlier from better fallback coverage under the Organizer’s ODB policy.  When the organizer doesn’t have a OneDrive account such as meetings scheduled using a shared mailbox, fallback logic is automatically enable <i>Organizer -&gt; Co-organizer (s) -&gt; Initiator -&gt; Async Media Storage (AMS)</i> to determine the recording owner. We also support Who keeps recording feature to display recording owner in the chat to help you identify the recording owner in any situation.&nbsp;</p><p>You can find more information by visiting related documentation to understand convenience recording in Teams meeting experience:\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/teams-recording-policy\" target=\"_blank\">Introduction to recording Microsoft Teams calls and meetings - Microsoft Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/tmr-meeting-recording-change\" target=\"_blank\">Teams meeting recording and transcript storage and permissions in OneDrive and SharePoint - Microsoft Teams | Microsoft Learn</a>\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will retire the recording initiator policy by June 30, 2025. Recordings will default to the meeting organizer's OneDrive. The fallback sequence will be Organizer -> Co-organizer(s) -> Initiator -> Async Media Storage. No action is required, but proactive adjustments are recommended. More information is available in the provided links."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1085569",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-30T19:24:35.69Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-30T19:24:17Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Upgrade to Meeting Recording Organizer Policy by 30 June 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
