{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams admin center has brought security and compliance information directly into the Teams admin center app detail pages. In the security and compliance tab, users can find information on an app's security and compliance posture to help them make more informed decisions about which apps they choose to trust. Information may include things such as assessments for data security, vulnerability scanning, Service Organization Controls (SOC), Payment Card Industry (PCI), and more. Furthermore, admins will now have the ability to view the count of apps that have completed the Microsoft 365 Certification or the publisher attestation portion of the Microsoft 365 app compliance program. Admins who may not have explored these new experiences will be notified within the Teams admin center upon the release of this feature.</p><p>This feature will bring a notification to Teams admin center that helps inform and direct admins via a click-through experience from the Teams admin center dashboard into the manage apps page. There, they will be given a quick tutorial on the fastest way to access the security and compliance info for an app. In the Manage apps page, they will also find a new tile that gives a live count of the number of Teams apps that have completed the Microsoft 365 Certification or Publisher attestation.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/cb91d5ec-9fa6-4b98-839c-41c3d7fb37e4\" style=\"width: 500px;\"></p><p><br></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5819ed69-fadb-4967-a996-f9971036e99d\" style=\"width: 500px;\"></p><p><br></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4ecf14f4-cb67-4126-b5b3-5012d2c07170\" style=\"width: 500px;\"></p><p><br></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/91d07797-5a6c-4cae-b3d4-e31c7df9e84b\" style=\"width: 500px;\"><br></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late February 2025 and expect to complete by mid-March 2025</p><p><b>How this will affect your organization:</b>\n</p><p>Admins will have increased awareness of app security and compliance information in Teams admin center and a view into the current number of apps that have completed the Microsoft 365 Certification or the publisher attestation.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams admin center will now display security and compliance information for apps directly on their detail pages. Admins can view data security assessments, vulnerability scans, and certification statuses. This feature will roll out from late February to mid-March 2025, requiring no action from admins."
    }
  ],
  "EndDateTime": "2025-04-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1009926",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-19T00:41:01.853Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-19T00:40:46Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center highlights additional security and compliance information available for apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
