{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: The Microsoft Copilot Academy will be accessible to all Microsoft 365 users. Admins will have the option to select their preferred access settings for Copilot Academy. Before this update, Copilot Academy is available to users with a Microsoft 365 Copilot license.\nThis message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479415\" target=\"_blank\">479415</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early April 2025 and expect to complete by mid-April 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-April 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, Copilot Academy will be accessible by default to all Microsoft Viva Learning users under the <i>Academies</i> tab or at <a href=\"https://aka.ms/copilot-academy\" target=\"_blank\">https://aka.ms/copilot-academy</a>, regardless of their Microsoft 365 Copilot license status. Monthly personalized Copilot Academy notifications will be sent only to Microsoft 365 Copilot licensed users.\n</p><p>Viva Learning Premium admins will be able to duplicate Copilot Academy, its Learning path or Feature set without a Microsoft 365 Copilot License.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins can restrict access to Copilot Academy to Microsoft 365 Copilot licensed users at <i>Copilot Academy &gt; Manage permissions</i> &gt; Select <i>Microsoft 365 Copilot licensed users</i>. To edit Copilot Academy permissions, admins should have the roles Global admin, Knowledge admin, or Knowledge manager or have access through Viva Learning's <a href=\"https://learn.microsoft.com/viva/learning/feature-access-management\" target=\"_blank\">feature access management</a>.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3c8ca25a-f019-4300-a00e-d493b0f31084\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2073cb00-7b0d-45b1-9d07-67ccd873dcb1\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p></p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n<p></p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/learning/academy-copilot\" target=\"_blank\">Microsoft Copilot Academy | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479415"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Learning: Copilot Academy will be available to all Microsoft 365 users starting April 2025. Admins can manage access settings. Notifications will be sent to licensed users only. Admins can duplicate Copilot Academy features without a Copilot license. No immediate admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-07-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1038683",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-21T23:32:28.917Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-21T23:32:21Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Learning: Copilot Academy will be available for all Microsoft 365 users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
