{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 16, 2025: We have updated the content. Thank you for your patience.</p><p>We are excited to announce several enhancements to the recently launched modernized eDiscovery experience. These updates include:</p><ul><li>Case Level Data Source View: Users can now access the case level data source view, which allows them to add data sources to the current case. These sources can be utilized in any searches or holds within the case. </li><li>Enhanced Search and Hold Capabilities: Users will have the ability to duplicate a search, create a search from an existing hold, or create a hold from an existing search within the current case. </li><li>Retry Failed Locations: The search statistics view now includes the option to retry failed locations, providing a more comprehensive search estimate. </li><li>Detailed Process Reports: We are adding information related to compliance boundaries, case/export/search names, and decryption settings into the relevant process report CSVs.</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=482558\" target=\"_blank\">482558</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-March 2025 and expect to complete by late April 2025&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>eDiscovery users will start to see the relevant enhancements in the product, so internal documentation updates may be needed.&nbsp;&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Evaluate how this feature will impact your organization’s eDiscovery process and, if needed, modify your internal documents accordingly.&nbsp;</p><p>For more information, see <a href=\"https://learn.microsoft.com/purview/edisc?view=o365-worldwide\" target=\"_blank\">Learn about eDiscovery solutions | Microsoft Learn</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "482558"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview compliance portal has announced enhancements to the modern eDiscovery experience, including a case level data source view, enhanced search and hold capabilities, retry failed locations option, and detailed process reports. These updates will roll out from mid-March to late April 2025. Internal documentation updates may be needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024388",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-16T19:53:23.467Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:45:34Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Modern eDiscovery enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
