{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re excited to announce that image generation in Microsoft 365 Copilot will become generally available (GA). This AI-powered capability enables users to create high-quality images directly within Microsoft 365 apps, helping to enhance creativity and streamline content creation workflows.</p><p><b>When this will happen:</b></p><p>General availability (Worldwide): Rollout will begin in late June 2025 and is expected to complete by late July 2025.</p><p><b>How this will affect your organization:</b></p><p>Users in your organization with access to generally available features will now be able to generate images using Microsoft 365 Copilot.\n</p><ul><li>A Microsoft 365 Copilot license is required for full access to image generation capabilities.\n</li><li>Commercial users without a Copilot license may have limited access to this feature, depending on their subscription and app context.\n</li></ul><p>This feature is on by default and will be available in supported Microsoft 365 apps once rollout is complete.</p><p><b>What you can do to prepare:</b></p><p>No admin action is required. This change will roll out automatically.\n</p><p>We recommend:\n</p><ul><li>Informing your users about the upcoming availability of image generation in Copilot.\n</li><li>Updating internal documentation or training materials to reflect this new capability.\n</li></ul><p>For more information about Microsoft 365 managing Copilot image generation, visit the <a href=\"https://learn.microsoft.com/en-us/copilot/microsoft-365/microsoft-365-copilot-page#copilot-image-generation\" target=\"_blank\">Manage Microsoft 365 Copilot scenarios in the Microsoft 365 admin center</a>.</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tMaybe (image prompts and outputs may be processed by AI services)</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?\tYes\n</li><li>Does the change provide end users any new way of interacting with generative AI?\tYes</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Image generation in Microsoft 365 Copilot will be generally available from late June to late July 2025. Users with a Copilot license can generate images within Microsoft 365 apps. No admin action is required, but informing users and updating documentation is recommended. Compliance considerations involve AI data processing and interaction."
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1087096",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-02T23:44:06.52Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-02T23:43:49Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: GA for Image Generation in Copilot Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
