{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 17, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>To enhance security and reduce potential data exposure, we are updating the behavior of the <code>Get-FederationInformation</code> cmdlet in Exchange Online. This change limits the scope of domain data returned by the cmdlet.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC-High, DoD): Rollout will begin in late June 2025 (previously mid-June) and is expected to complete by late August 2025 (previously early July).</p><p>\n</p><p><b>How this affects your organization:</b></p><p>Previously, the <code>Get-FederationInformation</code> cmdlet returned all federated domain information in the DomainNames field. After this update, the cmdlet will only return domain information that is explicitly passed as a parameter. This change may impact scripts or tools that rely on retrieving all federated domains by default.\n</p><p>There is no change to the cmdlet’s availability or core functionality—only the scope of data returned is affected.\n</p><p><b>What you can do to prepare:</b></p><ul><li>Review any automation, scripts, or tools that use the <code>Get-FederationInformation</code> cmdlet to ensure they explicitly pass the required domain(s) as parameters.\n</li><li>Communicate this change to your Exchange Online administrators and support teams to avoid confusion or unexpected results.\n</li><li>For more details, refer to the official blog post: <a href=\"https://techcommunity.microsoft.com/blog/exchange/important-update-to-the-get-federationinformation-cmdlet-in-exchange-online/4410095\" target=\"_blank\">Important Update to the Get-FederationInformation Cmdlet in Exchange Online</a>&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "To enhance security, the `Get-FederationInformation` cmdlet in Exchange Online will now only return domain information explicitly passed as a parameter. This update, affecting scripts and tools, will roll out from late June 2025 to late August 2025. Review and update any automation accordingly. More details are available in the official blog post."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1081538",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-17T15:26:59.363Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-23T22:23:20Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Important Update to the Get-FederationInformation Cmdlet in Exchange Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
