{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 19, 2025: We have updated the timeline. Thank you for your patience.</p><p>Coming soon for Microsoft Teams: A new setting that allows users to view incoming calls in a small window in Teams to prevent disruptions. Users will be able to take a call in the small window and continue to see what they were working on before the call.</p><p>This message applies to Teams on Windows desktop, Teams on Mac desktop, Teams for the web, and Teams for iOS/Android.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=482747\" target=\"_blank\">482747</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early May 2025 and expect to complete by mid-May 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.\n</p><p>General Availability (GCC): We will begin rolling out early June 2025 and expect to complete by mid-June 2025.</p><p></p><p>General Availability: (GCC High, DoD): We will begin rolling out early June 2025 and expect to complete by early October 2025.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout: Teams users are disrupted by the larger Teams screen when viewing an incoming call.</p><p>After this rollout: Teams users can turn on this setting to view calls in a small window. Note that both large and small windows are resizable:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b4e236c2-758f-46e9-a1bb-7a6c2a8284ea\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>This feature will be on by default.</p><p><b>What you need to do to prepare:</b> </p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "482747"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce a default setting allowing users to view incoming calls in a small, resizable window to reduce disruption. Rollout begins May 2025 for most users, with GCC and DoD completing by October 2025. No admin action is needed, but user notification is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1045221",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-19T20:11:50.987Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-31T22:38:16Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: New user setting to view incoming calls in a small window",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
