{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 6, 2025: We have updated the content. Thank you for your patience.&nbsp;</p><p>Coming soon for Microsoft Defender for Office 365: We are excited to announce the new CampaignInfo and FileMaliciousContentInfo data tables in Advanced hunting under <i>Email &amp; collaboration schema</i>.</p><p><b>When this will happen:</b>\n</p><p>\n</p><p>Public Preview: We will begin rolling out early June 2025 and expect to complete by late June 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): General Availability: We will begin rolling out early July 2025 and expect to complete by late November 2025, covering both Advanced Hunting and Sentinel availability.</p><p>\n<b>How this will affect your organization:</b></p><p>The new tables will be available by default. SOC teams will be able to see two new data tables in Defender &gt; <i>Advanced hunting &gt; Email &amp; collaboration schema.</i></p><p>1. CampaignInfo</p><p>The CampaignInfo table in the Advanced hunting schema contains information about email campaigns identified by Defender for Office 365. The table will have this schema to help the security teams to investigate threats targeting their users and organization:  \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/047abf98-ef74-4f81-a0d3-81c8c421bca5\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>2. FileMaliciousContentInfo</p><p>The FileMaliciousContentInfo table in the Advanced hunting schema contains information about files that were processed by Defender for Office 365 in Microsoft SharePoint Online, Microsoft OneDrive, and Microsoft Teams. The table will have this schema to help the security teams to investigate threats targeting their users and organization: \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6d5f9803-4165-4ad0-83ab-de4d42b2ad30\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Here are a few sample queries to get you started:\n</p><p><code>//Emails sent as part of phishing campaigns \n</code></p><p><code>CampaignInfo \n</code></p><p><code>| where Timestamp &gt; ago(7d) \n</code></p><p><code>| where CampaignType has \"Phish\" \n</code></p><p><code>| project NetworkMessageId, RecipientEmailAddress, CampaignName, CampaignId, CampaignType \n</code></p><p><code>| join (EmailEvents | where Timestamp &gt; ago(7d)) on NetworkMessageId, RecipientEmailAddress \n</code></p><p><code>| project Timestamp, NetworkMessageId, Subject, SenderMailFromAddress, RecipientEmailAddress, LatestDeliveryLocation, LatestDeliveryAction, CampaignId, CampaignName, CampaignType</code></p><p><code> \n</code></p><p><code>//Files identified as Malware modified in last 1 day\n</code></p><p><code>FileMaliciousContentInfo</code>\n</p><p><code>| where ThreatTypes == \"Malware\"\n</code></p><p><code>| where LastModifiedTime &gt; ago(1d)</code></p><p><code>\n</code></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update your relevant documentation.</p><p>After the Public Preview rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 will add two new Advanced hunting data tables, CampaignInfo and FileMaliciousContentInfo, rolling out from June to November 2025. These tables help security teams investigate email campaigns and malicious files across email, SharePoint, OneDrive, and Teams, with no admin action needed."
    }
  ],
  "EndDateTime": "2026-01-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1088729",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-06T14:17:50.617Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-05T23:43:06Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Two new data tables in Advanced hunting (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
