{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 31, 2025: We have updated the rollout timeline below. Thank you for your patience</p><p><a href=\"https://learn.microsoft.com/microsoft-365/bookings/bookings-overview?view=o365-worldwide\" target=\"_blank\">Microsoft Bookings</a> is an online scheduling tool (included in your Microsoft 365 subscription) that enables businesses to manage their appointments seamlessly. Bookings allows users to create customizable booking pages where customers, clients, or colleagues can easily schedule time with them or their team without the usual back-and-forth communication.\n</p><p>Coming soon: We will launch Queue as a new functionality in Bookings. Queue will be available in Bookings for users with a Microsoft Teams Premium license.\n</p><p>Queue is a powerful feature that provides real-time visibility and control over incoming appointments. Queue provides schedulers and admins with a consolidated view of each day's appointments in chronological order for the booking pages they manage, so they can better manage the load of incoming appointments and reassign delayed appointments to available staff. Staff can also self-serve on busy days by assigning the unassigned appointments to themselves, helping to balance workloads across teams or specific services. Users can send SMS and email reminders from the queue view and keep customers informed, helping to enhance overall transparency and ensure a smooth appointment experience for everyone involved.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470136\" target=\"_blank\">470136</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early May 2025 and expect to complete by mid-May 2025.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>The Queue functionality in Bookings will be available by default for Teams Premium users.\n</p><p><a href=\"https://cxcs.microsoft.net/file/ccp/en-us/ae721b4e-4cb7-4aae-83d9-535529c23898\" target=\"_blank\">Watch a short view about Queue</a> (00:09 min)\n</p><p><b>NOTE:</b> Microsoft Bookings users without Teams Premium license will have access to the Queue tab with this banner: \"This feature requires a Teams Premium license. Contact your administrator to request one\":\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4f5be8e5-f205-4a91-a6d7-79727af4e098\" style=\"width: 400px;\" alt=\"user message\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change, share details about Microsoft Bookings, and update any relevant documentation.\n</p><p>If you want Queue functionality in Bookings to be available in your organization, ensure your users have a Teams Premium license.\n</p><p>No action is required if you do not wish to provide access to this functionality to your users.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/bookings/bookings-overview?view=o365-worldwide\" target=\"_blank\">Microsoft Bookings | Microsoft Learn</a> (will be updated with more details about Queue functionality before rollout)\n</li><li><a href=\"https://techcommunity.microsoft.com/blog/microsoftteamsblog/teams-premium-enhances-scheduling-in-microsoft-bookings/4292193\" target=\"_blank\">Teams Premium enhances scheduling in Microsoft Bookings | Microsoft Community Hub</a>\n</li></ul><p>Before rollout, we will update this post with additional documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470136"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Bookings will introduce a new Queue functionality for Teams Premium users, providing real-time visibility and control over appointments. The rollout will begin in early May 2025 and complete by mid-May 2025. No admin action is required, but users need a Teams Premium license to access Queue."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-07-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1030013",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-31T19:51:32.61Z",
  "Services": [
    "Microsoft Bookings"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-12T23:17:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Bookings: New Queue functionality to manage appointments for Teams Premium users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
