{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview | Insider Risk Management will roll out enhancements to user scoping features in policies,</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412942\" target=\"_blank\">412942</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by early July 2025.</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out early October 2025 and expect to complete by early November 2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, Insider Risk Management admins with appropriate permissions can select combinations of users, groups, and adaptive scopes to include or exclude from Insider Risk Management policies in the <a href=\"https://purview.microsoft.com/informationprotection/purviewmipoverview\" target=\"_blank\">Microsoft Purview portal</a> at<i> New insider risk policy &gt; Users and groups &gt; Exclusions (optional):</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/80caa22f-7b13-429f-a6d5-f32b31c0a857\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>Learn more about <a href=\"https://learn.microsoft.com/purview/insider-risk-management-configure#step-6-required-create-an-insider-risk-management-policy\" target=\"_blank\">creating policies in Microsoft Purview Insider Risk Management</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412942"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will enhance user scoping features in policies, rolling out globally from late June to early July 2025, and for GCC, GCC High, and DoD from early October to early November 2025. Admins can select users, groups, and adaptive scopes for policies. No action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-26T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075907",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-16T22:23:10.95Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:22:11Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Updated user scoping features in policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
