{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We have introduced a new configuration option in Microsoft Purview called collection policies for targeted signal discovery and collection. Collection policies will allow administrators to fine tune the signals and data collected for Purview solutions at the tenant level. This includes specifying which Sensitive Information Types (SITs) are classified and what activities are collected on Windows endpoint devices.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=479760\" target=\"_blank\">479760</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: Available now.</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p><i>Key benefits of collection policies</i></p><ul><li>Granular control: Align with regulatory, regional, and organizational requirements that specify what types of data can be collected. \n</li><li>Noise reduction: Focus on the most relevant data security risks by tailoring data discovery and signals to what’s important for your organization \n</li></ul><p><i>Purview solutions impacted \n</i></p><ul><li>Unlike traditional Purview Data Loss Prevention (DLP) or Microsoft Purview Information Protection policies, collection policies are designed to streamline discovery of relevant information, rather than apply enforcement or take action on that information. There is no action taken from these policies to block content, as policies are meant to scope what content is collected and surfaces to administrators.</li><li>Using collection policies to scope signal collection will impact what is surfaced in several Purview solutions, including Insider Risk Management (IRM), Data Security Posture Management (DSPM), eDiscovery, Data Lifecycle Management (DLM), Activity Explorer, and more. Learn more: <a href=\"https://learn.microsoft.com/purview/collection-policies-solution-overview\" target=\"_blank\">Collection Policies Solution Overview (preview) | Microsoft Learn</a></li></ul><p>There is no immediate impact of this feature release. If you choose to leverage collection policies, admins can now choose which signals to discover in devices.\n</p><p>After you enable collection policies, you may see various updates to the Purview DLP audit experience. These updates may affect your organizations current configuration in the following ways: \n</p><ul><li>Activities to audit on your tenant will be scoped to the selected SITs and user activities \n</li><li>A new Location picker experience will be used to scope users and groups \n</li><li>To use collection policies for endpoints, the DLP <i>Always audit </i>setting will still need to be enabled. However, once created, collection policies for endpoint devices adjust from an open policy to an allowlisting policy that supports inclusion and/or exclusion of specific users, groups, and specified activities to reduce load and address customer requirements. \n</li></ul><p><span style=\"background-color: rgb(255, 255, 0);\">This feature is available by default for admins to configure.</span></p><p><b>What you need to do to prepare:</b>\n</p><p>There is no immediate impact of this feature release until you create an initial collection policy and <i>Always audit</i> is enabled in DLP (Windows endpoint devices only). To prepare for this upcoming enhancement to the Purview portal, we recommend you:</p><ul><li>Review Microsoft Learn docs on collection policies and required prerequisites: <a href=\"https://learn.microsoft.com/purview/collection-policies-solution-overview\" target=\"_blank\">Collection Policies Solution Oerview (preview) | Microsoft Learn</a></li><li>Help inform other Purview admins whose signal collection would be scoped, including the solutions in this message. \n</li></ul><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479760"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview introduces collection policies for targeted signal discovery and collection, allowing administrators to fine-tune data collection at the tenant level. Public preview is available now, with general availability in June 2025. These policies provide granular control and noise reduction, impacting several Purview solutions. No immediate action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1068273",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-05T23:20:09.313Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-05T23:19:48Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: New collection policies for scoping classifiers and activity tracking",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
