{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 28, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>We’re updating the Microsoft SharePoint site header and footer to deliver a more modern, customizable, and brand-aligned experience. This visual enhancement introduces new options for customizing the header, footer, and navigation links—empowering site owners to better reflect their organization’s identity and create more engaging, connected SharePoint sites.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489225\" target=\"_blank\">489225</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late August 2025 (previously mid-August) and expect to complete by early September 2025 (previously late August).\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out early September 2025 (previously late August) and expect to complete by mid-September 2025 (previously early September).\n</p><p>General Availability (GCC High, DoD): We will start rolling out mid-September 2025 (previously early September) and expect to complete by late September 2025.\n</p><p><b>How this will affect your organization:</b></p><p>These updates will enhance the visual consistency and usability of SharePoint sites, making it easier to deliver visually compelling, on-brand experiences across your organization.</p><p><i>For site viewers:</i></p><ul><li>The command bar will be hidden in <i>View </i>mode for a cleaner, more immersive experience. \n</li><li>Teaching tips will help users locate previously available command bar buttons in the header. \n</li></ul><p><i>For site owners: \n</i></p><p>New design flexibility will include:\n</p><ul><li>Set an image as the header or footer background and customize the overlay color. \n</li><li>Change fonts for the site title, navigation links, footer name, and footer links using a set of predefined font families. \n</li><li>Adjust footer alignment, including support for left alignment. \n</li></ul><p>This change will be on by default.\n</p><p>After this rollout, site admins can customize the header background under the new <i>Design </i>tab in the Header configuration panel:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5787072f-27c1-4e92-a172-2ae1cfcd7b63\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Site viewers will have a cleaner, more immersive experience with the command bar hidden in <i>View </i>mode.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4afd2fae-37ef-4b28-ab22-4ce415db0427\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate. \n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489225"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint is updating its header and footer for a modern, customizable, and brand-aligned experience, rolling out from late August to late September 2025. Enhancements include customizable backgrounds, fonts, footer alignment, and a cleaner view mode with hidden command bars for site viewers. No admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098935",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-28T19:31:15.02Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-19T22:59:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: Header and Footer enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
