{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Purview eDiscovery: We will increase the limits for Hold policies for eDiscovery Premium. You will be able to add more locations into a single Hold policy within a case.\nThis message applies to the <a href=\"https://learn.microsoft.com/purview/purview-portal\" target=\"_blank\">new Purview portal</a> only. Classic eDiscovery and Microsoft Graph are not currently supported.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-February 2025 and expect to complete by late February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout:\n</p><ul><li>We will increase the maximum number of mailboxes in a single case hold from 1000 to 2000. This limit includes the combined total of user mailboxes and the mailboxes associated with Microsoft 365 groups, Microsoft Teams, and Microsoft Viva Engage groups.\n</li><li>We will increase the maximum number of sites in a single case hold from 100 to 2000. This limit includes the combined total of Microsoft OneDrive sites, Microsoft SharePoint sites, and the sites associated with Microsoft 365 groups, Teams, and Viva Engage groups.\n</li><li>Overall, the maximum allowed locations in a premium case hold policy in a premium case is 4000.\n</li><li>The limits for holds for a standard case remain the same as before this rollout: The maximum number of mailboxes is 1000 and the maximum number of sites is 100.\n</li></ul><p>No other settings for eDiscovery hold will change after this rollout.\n</p><p>If your organization downgrades its eDiscovery license from premium to standard, we will not remove existing holds, but you will not be allowed to add new holds. For example, for a policy with a high number of locations (such as 1500 mailboxes and 1500 sites), if the case setting or the license is downgraded to E3, you will not be able to add more locations (based on E3 limits), but you will be able to remove locations.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a45eaa07-e809-405d-8c49-1f5ab1c7d921\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/ediscovery-premium-limits\" target=\"_blank\">eDiscovery (Premium) limits | Microsoft Learn</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No changes needed from the customer side for this change. The change will be available via backend enhancement and will apply to new as well as existing hold policies.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1003343",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-11T23:56:49.83Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-11T23:56:34Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery: Hold limits increased per Hold policy for eDiscovery Premium",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
