{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 24, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Coming soon for the Microsoft SharePoint usage report in the Microsoft 365 admin center: A new <i>Storage </i>tab will provide a high-level view of your overall SharePoint quota consumption and recommended actions for storage management.</p><p><b>Note:</b> This report is available to non-Education tenants. Education tenants should refer to their pooled storage report. Learn more about viewing the pooled storage report: <a href=\"https://learn.microsoft.com/microsoft-365/education/deploy/pooled-storage-management\" target=\"_blank\">Pooled storage management - M365 Education | Microsoft Learn</a>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=482200\" target=\"_blank\">482200</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-May 2025 and expect to complete by late June 2025 (previously mid-June).&nbsp;</p><p><b>How this will affect your organization:</b></p><p>The SharePoint storage report provides an overview of your tenant’s storage profile across multiple geographies. It will help you understand your tenant’s storage growth trend and make informed decisions on when to buy more storage or clean up usage. The report will include suggestions for optimizing storage, such as setting file history limits, archiving inactive sites, and creating site lifecycle management policies.  Also, banner notifications will appear when your tenant is approaching or over the storage quota.</p><p>To start using the SharePoint storage report:</p><ol><li>In the Microsoft 365 admin center, go to <i>Reports &gt; Usage </i>page\n</li><li>From the homepage dashboard, under <i>Reports,</i> select<i> SharePoint.</i></li><li>Select the <i>Storage </i>tab.</li></ol><p>The new <i>Storage </i>tab on the SharePoint storage report in the Microsoft 365 admin center:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f634d68c-960d-44bc-9610-2f58499a151d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p> <b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/activity-reports/sharepoint-storage-reports?view=o365-worldwide\" target=\"_blank\">Microsoft 365 Reports in the admin center – SharePoint storage - Microsoft 365 admin | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "482200"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint will soon include a new Storage tab in the Microsoft 365 admin center usage reports, providing an overview of SharePoint quota consumption and storage management recommendations. This feature will roll out from mid-May to late June 2025. It is available to non-Education tenants. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1072408",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-24T20:21:56.407Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-12T23:39:58Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint: Storage insights will be included in Microsoft 365 admin center usage reports",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
