{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: The <i>Report conversations</i> feature configuration will soon be available in the new Microsoft Engage admin center, moved from the legacy Microsoft Yammer admin center. This feature allows admins to set up a reporting mechanism for Engage conversations in their network. There are no functional changes with this release to the new Microsoft Engage admin center. This rollout will not affect or change the user experience for end-users looking to report conversations.</p><p>\n</p><p>This message applies to Viva Engage for the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486831\" target=\"_blank\">486831</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late June 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, the <i>Report conversations</i> feature will let users proactively raise awareness about content in an Engage network. Admins configure the feature for their networks, including selecting an email inbox to receive report notifications and the explainer text that displays to users when they submit content for review.</p><p>The migration to the new admin center maintains all features and functionality from the previous location. This new feature is off by default. No opt-in is needed. Network admins and higher levels of admin will continue to have access to feature configuration.</p><p>Before the rollout, network admins, verified admins, and Engage admins can check their admin center to confirm the feature is available and set up in their tenant. After the rollout, check the new Engage admin center for further configuration. The migration will not affect existing configurations in your tenant.</p><p>The migration only affects the location and general look-and-feel of the admin configuration feature\n</p><p>Admins can configure the feature in the new location in Viva Engage Admin center &gt; <i>Tenant settings &gt; Conversation settings &gt; Report conversations:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/177260f3-3cb7-4ac0-b46f-ad15e1464295\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>Admins can select an email inbox to receive report notifications and the explainer text that displays to users when they submit content for review:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/794697b6-42a8-4767-9a67-bb1706b9121d\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more about the migration of Engage features to the new admin center in this blog: <a href=\"https://techcommunity.microsoft.com/blog/viva_engage_blog/embracing-a-fully-modern-viva-engage-experience/4403008\" target=\"_blank\">Embracing a Fully Modern Viva Engage Experience | Microsoft Community Hub</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486831"
    },
    {
      "Name": "Summary",
      "Value": "The \"Report conversations\" feature will move from the legacy Yammer admin center to the new Microsoft Engage admin center in mid-May to late June 2025. This migration does not change functionality or user experience. Admins can configure the feature in the new location without affecting existing settings. More details are available [here](https://www.microsoft.com/microsoft-365/roadmap?filters=&searchterms=486831)."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1061721",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-24T23:15:58.263Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-24T23:15:11Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Report conversations feature in new admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
