{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "Microsoft Viva Learning now supports Date Format selection and numerals support across the application. The new Date Format feature under Settings helps users select a date format that suits their preference. Also, depending on the language selected, the numeral values across Viva Learning will also change to those values that are local to the user. These changes are applicable to Viva Learning in Microsoft Teams for Windows desktop, Teams on the web, and the Viva Learning web app.<p></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=380187\" target=\"_blank\">380187</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users may not see a standardized date format across the app, nor do they have the option to change how dates are displayed depending on their language preference.</p><p>After this rollout: A Date Format feature is added under Settings so users can select a date format that suits their preference. Additionally, depending on the language selected, the numeral values across Viva Learning will also change.</p><p>When a user lands on Viva Learning for the first time, they will be able to see the default language and date format set. However, if they wish to change it, they can navigate to the Settings option in the application where they can see a Language &amp; Date setting option. When they select the Language &amp; Date setting, they get two options:\n</p><ul><li>Language: A dropdown menu containing all language options a user can select, which will apply to all static data content on the Viva Learning app.\n</li><li>Date Format: A dropdown menu of all the date formats that are available for the user. All occurrences of dates in the app will follow the format selected here.</li></ul><p>The date formats available are dependent on the language selected and may vary from language to language.</p><p>Once the date format and/or language are selected, the user can click on the <i>Save and Refresh&nbsp;</i>button to reload the application, then the language, date, and numeral changes will be applicable across the application.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/7e2fd104-d8a6-4b69-af27-79db4f5e7d31\" style=\"width: 450px;\"></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f4e4680e-1117-4362-84e3-64c143de775e\" style=\"width: 450px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "380187"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Learning will support Date Format selection and numeral changes based on language preferences starting mid-March 2025. Users can select their preferred date format and language under Settings. This update applies to Teams for Windows desktop, Teams on the web, and the Viva Learning web app. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1034588",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-18T00:01:28.997Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-18T00:01:22Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Learning: Date Format selection and numerals support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
