{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing view and manage shift schedules with My Schedule calendar feature for Dynamics 365 Contact Center. This feature allows customer representatives to review their shifts, time off, and schedules, offering views in daily, weekly, monthly, and agenda formats for easy planning and management. This feature will reach general availability on May 2, 2025.<br><br><b>How does this affect me?</b><br>The My Schedule calendar provides customer service representatives with a clear and accessible view of their shifts, time off, and schedule details. It offers flexible viewing options: daily, weekly, monthly, and agenda formats to help representatives manage their time efficiently and reduce scheduling conflicts. This feature adds the following views:<ul><li><b>Day view</b> - Allows customer service representatives to see their shifts and activities scheduled for the current day.</li><li><b>Week view</b> - Displays the entire week’s shifts, helping representatives plan and manage their time effectively.</li><li><b>Month view</b> - Provides a high-level overview of the month's schedule, including shifts and time-off requests.</li><li><b>Agenda view</b> - Displays a list of scheduled shifts and activities for easy viewing of upcoming tasks.</li></ul><b>What action do I need to take?</b><br>An administrator must install the Workforce Management for Customer Service package in the Power Platform admin center to activate this feature. To accomplish this, take the following steps:<ol><li>Log in to the Power Platform Admin Center using your administrator credentials.</li><li>In the left navigation menu, click on Environments.</li><li>Click to open the details for the environment where Workforce Management (WFM) needs to be enabled.</li><li>From the toolbar, select Resources and then choose Dynamics 365 Apps.</li><li>In the Dynamics 365 Apps section, click the Install App button.</li><li>From the list of available apps, select Workforce Management for Customer Service and click Next.</li><li>Review the terms of service, agree to them, and click Install to begin the installation process.</li>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-06-01T02:40:41Z",
  "HasAttachments": false,
  "Id": "MC1065863",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-01T02:42:29.48Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T02:40:41Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - View and manage shift schedules with My Schedule calendar",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
