{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: We will migrate the hosting of Microsoft SharePoint Online assets to a new content delivery network (CDN) service, Microsoft Azure Front Door (AFD). \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489230\" target=\"_blank\">489230</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 and expect to complete by late July 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>As part of this migration, we will introduce a new public CDN domain, <code>public-cdn.sharepointonline.com</code>. To ensure your SharePoint Online (SPO) sites and pages are fully prepared, please review these guidelines:\n</p><ul><li><i>Add the new domain to your network allow list:</i> If you enable domain-based allow lists in your network configurations, please ensure that the new domain <code>public-cdn.sharepointonline.com</code> is also included.\n</li><li><i>Avoid hardcoding CDN URLs: </i>To ensure seamless integration and for future proofing, please refrain from hardcoding the CDN URLs in your applications and scripts.\n</li><li><i>Do not block the old domain:</i> The old CDN domain <code>publiccdn.sharepointonline.com</code> is still in use. Please continue to allow access to the existing CDN domain until further notification from us.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Review your current configuration to assess the impact on your organization. This rollout will happen automatically by the specified dates with no other admin action required before the rollout.&nbsp;</p><p>We appreciate your cooperation and understanding as we work to enhance the performance and reliability of SharePoint Online. If you have questions or need further assistance, please do not hesitate to reach out to our support team.\n</p><p>Thank you for your attention to this important update.\n</p><p>Learn more about CDN for SPO: <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/use-microsoft-365-cdn-with-spo?view=o365-worldwide\" target=\"_blank\">Use Office 365 Content Delivery Network (CDN) with SharePoint Online - Microsoft 365 Enterprise | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489230"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint Online will migrate to a new CDN service, Microsoft Azure Front Door, starting June 2025 and completing by July 2025. Organizations should add the new domain `public-cdn.sharepointonline.com` to their allow list, avoid hardcoding CDN URLs, and continue allowing the old domain. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1066155",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-01T17:09:47.557Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T17:09:34Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint Online: [Important update] Enabling a new Public Content Delivery Network (CDN) domain",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
