{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 26, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Provide a meaningful name to first channel of the team, with no restrictions on the name. The first channel, if named \"General\" (in English), will follow the behavior as General in any other teams.&nbsp;</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability: We will begin rolling out mid-July 2025 (previously early June) and expect to complete by late July 2025 (previously late June).</p><p><b>How this will affect your organization:</b></p><p>Team owners on desktop client will now be able to name the first channel as General while creating the team or can rename the existing first channel as General by manually typing the string \"General\" or using the more options button in the text field. Naming the channel \"General\" will pin it to the top of the team in the channel list, however, no other first channel name will pin the channel. No other channels will be allowed to use the name General.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate.&nbsp;</p>\n<p></p>\n<p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490064"
    },
    {
      "Name": "Summary",
      "Value": "Team owners can now name the first channel \"General\" or rename it to \"General,\" pinning it to the top. This change will roll out from mid-July to late July 2025. Update your training and documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-09-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1075910",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-26T16:27:05.967Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-16T22:24:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "OneDrive: Prompt for permitted users to sign in to OneDrive app with personal Microsoft account",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
