{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Users can share Microsoft Teams apps or agents from the app or agent profile and from the app side panel in Teams.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop and Teams on the web.\n</p><p>A Microsoft 365 Copilot license is not required to share agents as described in this message. If a user has access to the agents, the users will be able to share them.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483355\" target=\"_blank\">483355</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early May&nbsp;2025 and expect to complete by mid-May 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2025 and expect to complete by late May 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout:\n</p><ul><li>Users can select the <i>Share </i>option when hovering on the app or agent icon in 1:1 chat mode with the app or agent.\n</li><li>After a user selects the <i>+Apps</i> icon from the three-dot menu in the top right of any chat, the user can right-click to share the app or agent.</li></ul><p>Share option from hovering on app/agent icon:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8c967284-fc8a-4e09-a963-5136568596ad\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Sharing from right panel:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3b30533e-d6d9-41ff-b33b-164dc9962ee1\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483355"
    },
    {
      "Name": "Summary",
      "Value": "Users will soon be able to share Microsoft Teams apps and agents from their profile or the Teams side panel on Windows, Mac, and web. This feature will roll out in May 2025 and does not require a Microsoft 365 Copilot license. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1037767",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-20T23:00:48.137Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-20T23:00:40Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Share Teams apps and agents from their profile or the Teams side panel",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
