{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We heard that customers would like to be able to\nreference more data, more quickly, when creating, reviewing, and finalizing Word\ndocuments using the Draft feature with Copilot in Word. We’re happy to share three improvements, developed based on your\nfeedback.</p><ul><li><i style=\"\">Reference folders when using Copilot:</i>&nbsp;Up\nuntil now, when using Copilot, you could reference files, emails, and even\nmeetings, but had to add them one by one. Today, we are enabling you to\nreference a whole folder (stored on OneDrive or SharePoint). <p style=\"margin-left: 50px;\"><b>NOTE:</b> Copilot\nwill use the 10 most recent files as the basis of the content it generates.</p></li><li><i>Support for larger documents in Word Copilot:</i><b>&nbsp;</b>We\ncontinue to expand the size limits of what we support, and we are expanding our\nability to referencing large documents up to 1.5 million words or 3000 pages.</li><li><i>More files can be referenced in Draft with\nCopilot in Word:</i>&nbsp;You\ncan now reference up to 20 items such as files, emails, and meetings when using\nthe <span>Draft with Copilot</span><span> command.</span></li></ul><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout has begun and expected to complete by early December 2025.</p><p><b>How this will affect your organization:</b></p><p>This further extends the richness of grounding support for customers, enabling more complex scenarios with Copilot in Word that support a broader set of customer document and folder reference needs.</p><p><b>What you need to do to prepare:</b></p><p>The ability to reference a folder\nis available to all <a href=\"https://word.cloud.microsoft/?wdOrigin=COMMUNITY.WORD.1PBLOG\">Word for the web</a> users and coming to Word for Windows and\nWord for Mac users with an Enterprise Copilot license (learn more about\nlicenses for <a href=\"https://www.microsoft.com/microsoft-365/copilot/business\">businesses</a>) in July 2025.</p><p>Other capabilities coming later in\nApril 2025 in Word for the web, Word for Windows, and Word for Mac: </p><ul><li>The ability to reference up to 20 files when\ndrafting a document with Copilot</li><li>The ability to reference larger files (up to 1.5\nmillion words or 3,000 pages</li></ul><p>You can manage Copilot for specific apps or users through either the Microsoft 365 Admin center or Group Policy.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot in Word now allows referencing entire folders, supports larger documents up to 1.5 million words or 3000 pages, and can reference up to 20 items. These features will be generally available by early December 2025. Folder referencing is available now for Word for the web and coming to other platforms in July 2025."
    }
  ],
  "EndDateTime": "2026-02-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060858",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T16:35:52.173Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:35:26Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Expanding reference capabilities with Microsoft 365 Copilot in Word",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
