{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 18, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are updating the storage location for Whiteboards created from the Teams Channel Tab App. Previously, these whiteboards were saved on the initiator's OneDrive, which caused access issues due to sharing settings, information barriers, or conditional access policies. To resolve these issues and align with the behavior of other M365 apps, whiteboards initiated from the Teams Channel Tab App will now be stored in the corresponding SharePoint site of the Teams Channel (also known as the channel site). This change ensures seamless access for all channel members while adhering to set policies.\n</p><p><b>When this will happen:</b></p><p>We will begin rolling out in early May 2025 (previously early April) and expect to complete by late May 2025 (previously late April).</p><p><b>How this affects your organization:</b></p><p>This update will allow whiteboard files to work seamlessly for all channel members, ensuring they continue to adhere to the set policies. All channel members who have access to these whiteboards will be able to discover them from their board picker. No action is required from tenant admins as this change is managed by the Microsoft Whiteboard product team.\n</p><p><b>What you can do to prepare:</b></p><p>No action is required from tenant admins.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Whiteboards created in Teams Channels will transition from being stored on the initiator's OneDrive to the corresponding SharePoint site to resolve access issues. The rollout will start in early May 2025 and complete by late May 2025. No action is required from tenant admins."
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1024395",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-18T16:38:11.117Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-05T23:51:22Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Transitioning from user's OneDrive to SharePoint for Whiteboards created in Teams Channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
