{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to customize the formatting and headers of Case and Custom Record Summaries. This will help structure and present the content in the way you want to so that your users can get up to speed quickly. This feature will reach general availability on May 28, 2025. <br><br><b>How does this affect me?</b><br>Summarization in Dynamics 365 Customer Service is receiving the ability to have content formatted in a structured manner, in addition to the existing paragraph format of summaries.<br><br>This applies to both the Case Summary and Custom Record Summary features.<ul><li>There are now two modes of formatting for case summaries and custom record summaries: <i>Paragraph</i> and <i>Structured</i></li><ul><li>The \"<i>Paragraph</i>\" formatting remains as is</li><li>For the \"<i>Structured</i>\" formatting option, admins can now specify up to 5 custom headers that can be used to structure the summary</li></ul><li>The custom headers can have a short description that helps specify what information from the record should be leveraged to generate the summary</li><li>Admins can even deselect some of the configured Headers without deleting them completely</li></ul>This feature will help with readability of the summaries for support representatives. Additionally, it will also help surface out critical information from cases as customers want, so that support agents can be much more efficient as they work on cases or other records.<br><br><b>What do I need to do to prepare?</b><br>This message is for awareness and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-06-01T01:31:24Z",
  "HasAttachments": false,
  "Id": "MC1065842",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-01T01:33:18.653Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-01T01:31:24Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Service – Customize formatting and headers for Case and Custom Record Summaries",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
