{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are adding two new email indicators to Microsoft Purview Insider Risk Management:</p><ol><li> Sending email with attachments to free public domains: This alerts when business-sensitive data is potentially leaked from a work email account to a free public domain email, potentially leading to a data security incident. \n</li><li>Sending email with attachments to self: This alerts when business-sensitive data is potentially leaked from a work email account to a user's personal email account or emailing self, potentially leading to a data security incident.</li></ol><p>Admins with Insider Risk Management permissions can enable these indicators from the Settings page and use these new indicators in the Data Leaks or Data Theft policy template.\n\nMicrosoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=483520\" target=\"_blank\">483520</a>.</p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide): We began rolling out in late March 2025 and expect to complete by mid-April 2025.</p><p>General Availability (Worldwide): We will begin rolling out in mid-June 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b></p><p></p><div style=\"font-family: Arial; font-size: 10pt;\">This feature helps customers to detect sensitive content being exfiltrated via emails to self or free public domains.</div><p><b>What you need to do to prepare:</b></p><p></p><div style=\"font-family: Arial; font-size: 10pt;\">Admins need to enable the indicators from policy indicators in Insider Risk Management (IRM) settings. These indicators can be added to any existing policy or admins can create a new policy with these indicators.&nbsp;</div><div style=\"font-family: Arial; font-size: 10pt;\"><span style=\"font-size: 10pt;\"><br></span></div><div style=\"font-family: Arial; font-size: 10pt;\"><span style=\"font-size: 10pt;\">For more information, see </span><a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators\" target=\"_blank\" style=\"font-family: Arial; font-size: 10pt; background-color: rgb(255, 255, 255); font-weight: 400;\">Configure policy indicators in insider risk management</a><span style=\"font-size: 10pt;\">.</span></div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "483520"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1051101",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-08T22:47:01.03Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-08T22:46:41Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: New email indicators to Insider Risk Management",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
