{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire the <a href=\"https://learn.microsoft.com/microsoft-365/ms-feed/m365-feed?view=o365-worldwide\" target=\"_blank\">Microsoft Feed</a> app from Microsoft Outlook for iOS and Android starting May 1, 2025 and ending by late May, 2025.\n</p><p>Users of your organization will no longer be able to access the <i>Feed </i>tab in Microsoft Outlook for iOS and Android. The <i>Feed</i> app will disappear from the bottom of the screen for users who had pinned it there. The <i>Feed</i> app will no longer be available in the Apps list for pinning.\n</p><p>As an alternative to the Feed, we recommend using Copilot in Microsoft Outlook. Other alternatives that recommend content similar to the <i>Feed</i>:\n</p><ul><li>The <i>Files </i>app in Microsoft Outlook\n</li><li>The Microsoft OneDrive app for iOS and Android\n</li><li>The <i>Recommended</i> section on <a href=\"https://www.microsoft365.com/\" target=\"_blank\">Microsoft365.com</a>\n</li><li>The <i>For you</i> section in OneDrive on web\n</li></ul><p>This change will happen automatically on the specified dates and no specific actions are required. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will retire the Feed tab from Outlook for iOS and Android between May 1 and late May 2025. Users will no longer access the Feed tab, and it will be removed from the app. Alternatives include Copilot in Outlook, the Files app, OneDrive, and the Recommended section on Microsoft365.com."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1019303",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-28T01:24:40.13Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T01:21:24Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Outlook for iOS and Android: The \"Feed\" tab will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
