{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the Use capacity planning to predict your staffing needs feature for Dynamics 365 Contact Center. This feature enables organizations to accurately predict staffing needs through both short-term and long-term planning by analyzing demand trends across channels and queues, supporting informed, data-driven staffing decisions. This feature will reach general availability on May 2, 2025.<br><br>\n<b>How does this affect me?</b><br>\nThis feature supports effective capacity planning by forecasting staffing needs based on historical and projected demand. It allows organizations to model various demand scenarios, analyze staffing requirements by channel and queue, and maintain service levels without over- or under-staffing. With both short-term and long-term visibility, it empowers data-driven decisions to optimize workforce allocation and operational efficiency. With this feature, you can do the following:<ul>\n<li><b>Short-term planning</b> - Forecast staffing needs in 15-minute intervals for up to six weeks, allowing real-time adjustments.</li>\n<li><b>Long-term planning</b> - Plan daily staffing requirements for up to six months to support strategic workforce decisions.</li>\n<li><b>Scenario analysis</b> - Model different workload scenarios to assess the impact of changes in demand.</li> \n<li><b>Data slicing</b> - View staffing projections by specific channels and queues for deeper insights.</li></ul>  \n<b>What action do I need to take?</b><br>\nAn administrator must install the Workforce Management for Customer Service package in the Power Platform admin center to activate this feature. To accomplish this, take the following steps:<ol>\n<li>Log in to the Power Platform Admin Center using your administrator credentials.</li>\n<li>In the left navigation menu, click on Environments.</li>\n<li>Click to open the details for the environment where Workforce Management (WFM) needs to be enabled.</li>\n<li>From the toolbar, select Resources and then choose Dynamics 365 Apps.</li>\n<li>In the Dynamics 365 Apps section, click the Install App button.</li>\n<li>From the list of available apps, select Workforce Management for Customer Service and click Next.</li>\n<li>Review the terms of service, agree to them, and click Install to begin the installation process.</li></ol> \nIf you would like more information on this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/10339\">Create and manage capacity planning</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-26T21:19:21Z",
  "HasAttachments": false,
  "Id": "MC1062971",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-26T21:20:02.38Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-26T21:19:21Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Use capacity planning to predict your staffing needs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
