{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 27, 2025: We have updated the content. Thank you for your patience.&nbsp;</p><p>&nbsp;Coming soon: Microsoft Purview | Data Loss Prevention (DLP) policy support for Microsoft Fabric allows admins to scope DLP policies to lakehouses, in addition to Microsoft Power BI (also supported today). In other words, in Fabric lakehouses, DLP policies can help audit and notify users through policy tips based on sensitive content. We will also extend DLP policy support Fabric KQL databases and mirrored databases.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420332\" target=\"_blank\">420332</a>.</p><p><b>When this will happen:</b> \n</p><p>Public Preview: </p><ul><li>DLP policy support for Fabric lakehouses is available in Public Preview as of October 2024. </li><li>For KQL databases and mirrored databases, we will begin rolling out mid-April 2025 and expect to complete by late April 2025&nbsp;</li></ul><p>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2025 (previously mid-August) and expect to complete by early October 2025 (previously early September).</p><p><b>How this will affect your organization:</b></p><p>After this rollout, when admins configure DLP policies on Fabric workspaces, DLP policies will scan and identify sensitive information (as well as semantic models) in lakehouses, KQL databases, and mirrored databases. Mirrored databases include Mirrored Azure Cosmos databases, Mirrored Azure databases for PostgreSQL, Mirrored Azure SQL databases, Mirrored Azure SQL Managed Instance, Mirrored databases, Mirrored Snowflake, and Mirrored SQL Server databases.  \n</p><p>If you already have a Fabric or Power BI location selected in your DLP policy today, the policy will automatically start applying to these assets as well (as long as the lakehouse, KQL, and mirror database is in the scope of the DLP policy).</p><p>You can configure a policy to apply to Fabric in Purview at <i>Data Loss Prevention &gt; Create policy &gt; Locations:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/93da23d4-5a32-4fea-9abc-231fa7f6c430\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b> \n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>No action is required from admins. Both existing and new DLP policies will be on by default and will automatically start evaluating Fabric lakehouses, KQL, and mirrored databases.</p><p>If you do not want to include Fabric lakehouses, KQL, and mirrored databases in your DLP policies, please review your policies and update the location scopes appropriately.  \n</p><p>DLP policy support for Fabric is subject to the new <a href=\"https://learn.microsoft.com/purview/purview-billing-models\" target=\"_blank\">Microsoft Purview pay-as-you-go billing model</a>&nbsp;(will be updated before rollout).</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/dlp-powerbi-get-started\" target=\"_blank\" style=\"\">Get started with DLP for Fabric and Power BI | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420332"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention (DLP) now supports Microsoft Fabric lakehouses, KQL, and mirrored databases. Public preview began October 2024; full rollout is expected by October 2025. DLP policies will automatically apply to these Fabric assets, requiring no admin action unless policy scopes need adjustment."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1050193",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T15:40:15.903Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-07T22:57:59Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Support for Microsoft Fabric lakehouses & KQL and mirrored databases (preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
