{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft OneDrive: OneDrive web users can protect their PDF files with User Password and Owner Password. The User Password is required to open and view a PDF file. The Owner Password is used to set operation permissions on a PDF file, such as allow printing, copying, or modifying the content. This enhancement provides an additional layer of security for sensitive documents, ensuring that only authorized individuals can access the content.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=482193\" target=\"_blank\" style=\"\">482193</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early March 2025 and expect to complete by mid-March 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-March 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b>\n</p><ul><li>Before this rollout: Users cannot setup passwords to protect their PDF files.&nbsp;</li><li>After this rollout: Users can set a User Password to protect the PDF from being opened by non-authorized users or set Owner Password to grant certain operations like printing, copying, or modifying the content.&nbsp;</li></ul><p>Users will be able to use the password protection function by following these steps in OneDrive for web:&nbsp;</p><ol><li>Open the PDF file, click the&nbsp;<i>Set password</i> button on the upper left toolbar.&nbsp;</li><li>User Password can be set under <i>Security</i>. With this password, the user can open the PDF.&nbsp;</li><li>Owner Password can be set under <i>Protection</i>. By selecting different permission levels, together with the permission password, the user having this password will be able to perform relevant actions such as print, copy, or modify contents.&nbsp;</li></ol><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.&nbsp;</p><p>Before rollout, we will update this post with any relevant documentation.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft OneDrive will soon allow web users to protect PDF files with User and Owner Passwords, enhancing security. The rollout starts in March 2025. Users can set passwords to restrict access and permissions. No admin action is required, but notifying users and updating documentation is recommended."
    }
  ],
  "EndDateTime": "2025-04-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1017119",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-26T00:30:15.347Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-26T00:29:57Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft OneDrive: Protect PDF with Password on OneDrive for web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
