{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 24, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>We are rolling out enhanced agent discovery via the App Store in Microsoft Teams, Microsoft 365, and Microsoft Outlook. This rollout allows users visiting the Store to view the entire catalog of agents available within their organization, regardless of whether they have a Microsoft 365 Copilot license.</p><p>This message applies to:</p><ul><li>Teams on Windows desktop, Teams on Mac desktop, and Teams on the web</li><li>Outlook for Windows desktop, Mac desktop, the web, and iOS/Android\n</li><li>Microsoft 365 (Office.com) on the web</li><li>Microsoft Word, Microsoft Excel, and Microsoft PowerPoint for Windows desktop, Mac desktop, and iOS/Android</li></ul><p>A Microsoft 365 license or a Microsoft 365 Copilot license is required to use this feature.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late May 2025 (previously end-April)) and expect to complete by late July 2025 (previously mid-July).</p><p><b>How this will affect your organization:</b></p><p><i>Before this rollout:\n</i></p><p>Users without a Microsoft 365 Copilot license who visit the App Store in Teams, Microsoft 365, and Outlook can only view a subset of the agent catalog. Specifically, users without a Microsoft 365 Copilot license could only discover agents grounded in instructions and public websites that are available at no additional cost. These agents were and are available by default and shown in the Store based on your existing Store settings for Teams and Microsoft 365 apps. Learn more about <a href=\"https://learn.microsoft.com/copilot/agents#manage-agents\" target=\"_blank\">managing agents</a>.</p><p><i>After this rollout:</i></p><p>Users who visit the App Store in Teams, Microsoft 365, and Outlook will be able to learn about the growing catalog of agents and view each agent's details, regardless of the user's Microsoft 365 Copilot license status. All users will be able to discover and learn about all types of agents, including:\n</p><ul><li>Agents grounded in instructions and public websites that are available at no additional cost\n</li><li>Agents that can access shared tenant data, such as SharePoint or Microsoft Graph connector content, which are billed based on metered consumption </li><li>Agents that require a Microsoft 365 Copilot license to use\n</li></ul><p>Although users will be able to view the details of all agents, users will still only be able to install agents for which they are eligible, based on their license tier and/or pay-as-you-go billing plan. Learn more about <a href=\"https://learn.microsoft.com/copilot/agents#enable-agents\" target=\"_blank\">enabling agents</a>.</p><p>Users who visit the Store will be able to view the entire catalog of agents enabled in their organization and will be able to click into each agent tile to view its details.\n</p><p>If the user is eligible to install an agent, the user can click the <i>Add </i>button to install the agent:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5882e4ad-3a0c-4e4c-9958-d6b0535be878\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>If the user is ineligible to install an agent, the <i>Add </i>button will be disabled and greyed out, like this:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a1e74db6-239d-4b76-9e95-3ec7c2526592\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Enhanced agent discovery will be available by default.</p><p><b>What you need to do to prepare:</b></p><p>No additional admin configuration is needed for this feature.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Admins can control and configure access to agents the Microsoft 365 admin center. Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in Integrated Apps - Microsoft 365 admin | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is rolling out enhanced agent discovery in the App Store for Teams, Microsoft 365, and Outlook by late July 2025. Users can view all organizational agents regardless of Copilot license, but installation depends on eligibility. No admin action is needed; admins can manage agent access via Microsoft 365 admin center."
    }
  ],
  "EndDateTime": "2025-09-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052915",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-24T19:30:56.283Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T23:35:35Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Enhanced Agent catalog available in the App Store in Teams, Microsoft 365, and Microsoft Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
