{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 2, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Microsoft Purview Insider Risk Management (IRM) will be adding a new role--Data Security Investigation Contributor--to the Insider Risk Management Investigators role group. This will allow members of the Insider Risk Management Investigators role group to launch   a Data Security Investigation (DSI) from an IRM case. \n</p><p>DSI is a new AI-powered solution that enables data security teams to identify incident-related data, conduct deep content analysis, and mitigate risk within one unified solution. DSI enables data security admins to efficiently identify incident-relevant content by searching their Microsoft 365 data estate to locate emails, Teams messages, Copilot prompts and responses, and documents. Once the investigation is scoped, DSI’s generative AI capabilities allow admins to gain deeper insights into the impacted data, revealing critical security risks and sensitive information. Investigative capabilities include the ability to categorize evidence, perform vector searches, and examine impacted data for security and sensitive data risks. DSI visualizes correlations between investigation data, users, and their activities. To mitigate identified risks, DSI facilitates secure collaboration between partner teams. Post-investigation learnings can be used to refine existing policies to strengthen an organization's security practices.  \n</p><p>The integration between IRM and DSI allows an IRM investigator to identify when a risky user needs deeper investigation to launch a pre-scoped investigation directly from the user activity pane, allowing them to view content analysis related to that user and better assess post-incident data impact.  \n</p><p>This message is associated with roadmap ID  <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=485707\" target=\"_blank\">485707</a>.&nbsp;</p><p>\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview (Worldwide): We will begin rolling out early April 2025 and expect to complete by late April 2025.</p><p>General Availability (Worldwide): We will begin rolling out in mid-July 2025 (previously mid-June) and expect to complete by mid-August 2025 (previously mid-July).</p><p> \n</p><p><b>How this will affect your organization:</b> \n</p><p>With this update, members of the Insider Risk Management Investigators role group will be able to create Data Security Investigations from an Insider Risk Management case. Members of the Insider Risk Management Investigators role group will not be able to view the Data Security Investigation unless they are assigned the Data Security Investigation Investigator role.</p><p>\n</p><p><b>What you need to do to prepare:</b> \n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the Microsoft Purview compliance portal.  \n</p><p><b><br></b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485707"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will add a new role, Data Security Investigation Contributor, to enable deeper investigations using the new AI-powered Data Security Investigation (DSI) tool. The public preview starts in April 2025, with general availability in July 2025. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041756",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-02T19:08:36.653Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T16:53:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: IRM RBAC Change (related to Data Security Investigations) Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
