{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 16, 2025: We have updated the timeline below. Thank you for your patience.</p><p>We are excited to announce the new Viva Learning Culture Report in Microsoft Viva Insights. This report will provide business leaders with deep insights into how employees are engaging with Viva Learning content. It offers breakdowns by departments and time periods, helping organizations identify opportunities to upskill their workforce more strategically.</p><p>Licensing requirements to access this feature</p><p>All premium tenants (tenants with at least one Viva Learning license) will have access to this feature. In addition, the tenants must have one of the following:</p><ul><li>A Viva Insights license, a Viva Suite license, or a Microsoft 365 Copilot license</li><li>A Viva Insights subscription with a Microsoft 365 license </li><li>Learn more: <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/environment-requirements\" target=\"_blank\">Environment requirements for Viva Insights | Microsoft Learn</a></li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by early July 2025 (previously late June).</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, Viva Insights analysts will be able to set up and access the Learning Culture Report in Viva Insights. The report enables tracking of three core learning metrics:\n</p><ul><li>Learning usage: Employees launching the Viva Learning app</li><li>Learning culture: Number of non-assigned trainings played</li><li>Content played: Total content viewed by employees</li></ul><p>These insights are visualized in Microsoft Power BI and can be filtered by organizational attributes such as department, region, or role.</p><p>\n</p><p>This report will be available by default. The Viva Learning knowledge admin or global admin needs to switch on the toggle in In the Microsoft 365 admin center to send data to Viva Insights:</p><p><b>What you need to do to prepare:</b>\n</p><p>To prepare for this rollout, ensure eligible users have the required licenses.\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your Viva Insights analysts and business leaders about this new report, and update any relevant documentation.</p><p>Additional Resources:</p><ul><li>Viva Learning documentation on licensing - <a href=\"https://www.microsoft.com/en-in/microsoft-viva/learning?rtc=1#tabs-oc43c4_tab0\" target=\"_blank\">Employee Learning and Training Platform | Microsoft Viva</a> \n</li><li>Live documentation of this report - <a href=\"https://learn.microsoft.com/en-us/viva/insights/advanced/analyst/templates/learning-culture\" target=\"_blank\">Learning Culture report | Microsoft Learn</a></li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Viva Learning Culture Report in Microsoft Viva Insights provides business leaders with insights into employee engagement with learning content. It includes metrics on learning usage, culture, and content played, visualized in Power BI. Premium tenants with specific licenses can access this feature, rolling out from mid-June to early July 2025."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1084029",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-16T21:09:57.46Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-27T23:13:53Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights: New Viva Learning Culture report",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
