{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft OneDrive and Microsoft SharePoint for web will soon let users add text or images as watermarks to PDF documents. Users can place the watermark in front of their content and choose the desired location and angle for the watermark.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=485796\" target=\"_blank\">485796</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-June 2025 and expect to complete by early July 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>To add text as a watermark: \n</p><ol><li>Open a PDF stored in OneDrive or SharePoint and then select <i>Edit </i>at the top right of the screen. \n</li><li>Select <i>Watermark </i>from the top menu, enter your text, customize the formatting and color, and place the watermark in the desired position. Choose from nine positions: top left, top center, top right, middle left, middle center, middle right, bottom left, bottom center, and bottom right. Text formatting options include bold, italic, color, size, transparency, and rotation.</li><li>Preview changes on the right side of the screen, and then select <i>Apply</i> to save changes. \n</li></ol><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2d734bcd-d409-4253-af28-9a751f6c2b5b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/48bd07d4-8ba2-4ca6-8dad-0f3a34721557\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>To add an image as a watermark:</p><ol><li>From the <i>Watermark</i> dialog box, select <i>Picture</i> to insert an image as a watermark. Adjust scale, transparency, and rotation if desired. Set the image in the desired position. Choose from nine positions: top left, top center, top right, middle left, middle center, middle right, bottom left, bottom center, and bottom right. \n</li><li>Preview changes on the right side of the screen, and then select <i>Apply</i> to save.\n</li></ol><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3929d70b-2f87-458d-bcfd-ca5de8b6579c\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>To edit an existing watermark:</p><ol><li>Select <i>Watermark </i>from the top menu, and then select the watermark to edit. \n</li><li>Follow the same steps for adding text or images to modify text or images in the watermark. \n</li></ol><p>To add another watermark, select <i>Add new</i> under the <i>Watermark</i> toolbar.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1bc4122a-7cb3-42c1-a03a-8a2756c896a3\" style=\"width: 400px;\" alt=\"user controls\">\n\n</p><p>To remove a watermark:</p><ol><li>Select <i>Watermark</i> from the top menu, and then select the watermark to remove.\n</li><li>Select the <i>Remove</i> button at the bottom of the screen.</li></ol><p><i>FAQs</i></p><p>Can I modify watermarks using other PDF tools? \n</p><ul><li>Watermarks added in OneDrive or SharePoint will be visible in other PDF tools but cannot be edited or removed with third-party tools. \n</li></ul><p>Does applying a watermark change my original PDF? \n</p><ul><li>Yes, applying a watermark will change your PDF document. The watermark is superimposed on the PDF content. Users can easily remove any watermark applied in OneDrive or SharePoint.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p><b>Note:</b> Some users may see this feature before other users in your organization.</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Before rollout, we will update this post with new documentation.</p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485796"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft OneDrive and SharePoint will allow users to add text or image watermarks to PDFs starting mid-June 2025. Users can customize the watermark's position, formatting, and transparency. Watermarks will be visible but not editable in other PDF tools. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1079736",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-21T22:48:11.61Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-05-21T22:47:59Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint and Microsoft OneDrive: Apply watermark to PDFs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
