{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing a new entry point for Copilot Chat in Microsoft Teams to simplify navigation and enhance the user experience. This update applies only to users who do not have a Microsoft 365 Copilot license.\n</p><p><b>When this will happen:</b></p><ul><li>Public Preview: June 23 – June 26, 2025\n</li><li>General Availability (Worldwide): June 30 – July 7, 2025</li></ul><p><b>How this affects your organization:</b></p><p>If Global Admins have pinned Copilot Chat using the Pin Microsoft 365 Copilot Chat setting in the Microsoft 365 admin center, users currently see Copilot Chat pinned to the Teams app bar.\n</p><p>Starting June 30, a new “Copilot” shortcut will appear at the top of the Teams chat list (just above “Discover”) for users without a Microsoft 365 Copilot license. This provides a more intuitive way to access Copilot Chat in the context of conversations.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/8d554189-a2cb-49e3-a235-cd3634cb97d0\" width=\"400\" height=\"\"></p><p>\n</p><p>There is no change to default pinning behavior. The new entry point respects existing admin and user pinning preferences. Users and admins can continue to unpin Copilot Chat from the app bar and chat list, and those preferences will persist.\n</p><p><b>What you can do to prepare:</b></p><p>No action is required. However, you may wish to inform users of this update with a message like:\n</p><p>“Copilot Chat, Microsoft’s free and secure generative AI solution, is now pinned to the chat list inside Microsoft Teams. Try it today to summarize, rewrite, or answer questions so you can work smarter and accomplish more.”\n</p><p><b>Compliance considerations:</b></p><ul><li>New or modified AI/ML capabilities: Yes – introduces a new way to access existing generative AI features</li><li>New user interaction with generative AI: Yes – new shortcut improves access to Copilot Chat</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat will be accessible from the Teams chat list for users without a Copilot license starting June 30, 2025. This new entry point simplifies navigation without changing default pinning behavior. No action is required, but informing users about this update is recommended."
    }
  ],
  "EndDateTime": "2025-09-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1098161",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-18T23:08:33.623Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-18T23:08:23Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Chat: Now Easily Accessible from the Teams Chat List",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
