{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 23, 2025: After further review, we are not able to continue rolling this out at this time.  We apologize for any inconvenience.</p><p>We're excited to announce a new Microsoft Engage feed card in Microsoft Viva Connections dashboard called <i>Stay Engaged.</i></p><p>This message applies to Viva Engage, Viva Connections, and Microsoft Teams on Windows desktop, on the web, and on iOS/Android.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=471446\" target=\"_blank\">471446</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release:&nbsp; We will communicate via Message center when we are ready to proceed.</p><p>General Availability (Worldwide):&nbsp; We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b>\n</p><p>Viva Connections users will be able to view and interact with their Viva Engage feed through the new <i>Stay Engaged</i> card in the dashboard under these conditions:\n</p><p>\n</p><ul><li><i>Unconfigured or default state:</i> If the Connections dashboard is in an unconfigured or default state and Viva Engage is enabled for the tenant, this card will be added to the Connections dashboard by default in the fourth position for all users.</li><li><i>Configured dashboard: </i>If the dashboard has already been configured and Viva Engage is enabled for the tenant, the card will not be added to the dashboard by default. Connections editors can add the card to the dashboard for their users.</li></ul><p>When the card is available on your company dashboard, a user can select the card to load Engage app in Teams, where the user can view and engage with feed conversations. User can select <i>Back</i> to return to Connections.\n</p><p>The new<i> Stay Engaged </i>card in the Connections dashboard on desktop:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/188a5e5d-27ec-4462-8fd6-1128b4c73912\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>A desktop user who selects the <i>Stay Engaged</i> card will be redirected to the Engage app in Teams where the user can view and engage with feed conversations:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/02839c4b-cf71-465a-8f29-12b539c80026\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The new <i>Stay Engaged</i> card in the Connections dashboard on iOS/Android and the redirection experience in Teams:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9ca3bb9b-a1e6-43db-bed6-23d5f8e5a618\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current Viva Connections dashboard and Viva Engage configuration to determine the impact for your organization. </p><p>You may want to notify your users about this change and update any relevant documentation.</p><p><a href=\"https://learn.microsoft.com/viva/connections/available-dashboard-cards\" target=\"_blank\">Available dashboard cards in Viva Connections | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "471446"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft paused the rollout of the new \"Stay Engaged\" Engage feed card in the Viva Connections dashboard. When available, it allows users to interact with Viva Engage feeds via Teams. The card auto-adds in default dashboards if Viva Engage is enabled; configured dashboards require manual addition by editors."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-07-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1052164",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-23T20:55:38.617Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-10T01:45:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Connections: New Engage card in Connections dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
