{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>You will soon see a new service plan associated\nwith your Microsoft 365 Copilot or Viva license: People Skills (Foundations). A new service plan, People Skills (Advanced), will be added to your Microsoft 365 or Office 365 license. This service plan enables you to set up People Skills, an AI-powered service that delivers personalized skills-based experiences across Microsoft 365. Using advanced inferencing, it helps organizations identify skill gaps and promote upskilling. With People Skills, individuals can easily share a current view of their skills and more easily connect with others. People Skills data enriches people-based experiences in Microsoft 365 Copilot and in the Microsoft 365 profile card and editor. Review MC1060842 to learn more about People Skills in our <a href=\"https://techcommunity.microsoft.com/blog/microsoft365copilotblog/announcing-people-skills-general-availability-and-new-skills-agent/4406364\">General Availability announcement. </a></p><p><b>When this will happen:</b></p><p>We will begin rolling late May 2025.</p><p><b>How this will affect your organization:</b></p><p>Starting in late June, you can launch People Skills for your\norganization. <a href=\"https://go.microsoft.com/fwlink/?linkid=2313228&amp;clcid=0x409\">Learn\nmore about how to set up People Skills. </a></p><p><b>What you need to do to prepare:</b></p><p>Ensure the Service plan is enabled as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New service plans, People Skills (Foundation) and People Skills (Advanced), will be added to Microsoft 365 licenses. These AI-powered services help identify skill gaps and promote upskilling. The rollout begins in late May 2025, with availability starting in late June. Ensure the service plan is enabled."
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1060845",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-23T16:15:05.023Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-23T16:09:03Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "New Service Plan: People Skills (Foundation)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
