{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft 365 Copilot Chat: To enhance the organization and discoverability of the user's Copilot chat sessions, we will use a large language model (LLM) to generate titles for new chat sessions.\n</p><p>A Microsoft 365 license is required to use this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=388373\" target=\"_blank\">388373</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early March 2025 and expect to complete by late March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: The default title is the same as the first prompt.\n</p><p>After this rollout: After Copilot responds to the first prompt, titles will be generated by LMM for all new chat sessions. Users will still be able to delete session chats and rename their sessions.\n</p><p><b>Note:</b> Titles generated before this rollout will not be changed.\n</p><p>Chat titles generated by LMM on the Copilot tab display in all products that include a Copilot tab: Microsoft 356/Office, Microsoft Teams, new Microsoft Outlook for desktop and web, and the Microsoft 365 for Windows desktop and web:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c1d73599-ef90-41b2-8c8b-d917f81c9c60\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be enabled by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>If you prefer to disable Copilot Chat for your tenant, review these <a href=\"https://learn.microsoft.com/copilot/manage#removing-access-to-microsoft-\" target=\"_blank\">instructions</a> in Manage Copilot | Microsoft Learn.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/frequently-asked-questions-about-microsoft-365-copilot-chat-500fc65e-9973-4e42-9cf4-bdefb0eb04ce\" target=\"_blank\">Frequently asked questions about Microsoft 365 Copilot Chat - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388373"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will use large language models to generate titles for chat sessions starting March 2025. This feature, requiring a Microsoft 365 license, will enhance organization and discoverability. Users can still rename or delete sessions. For more details, refer to the provided roadmap ID 388373."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1018343",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-27T00:41:24.82Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-27T00:40:33Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Chat sessions will have titles generated by large language models (LLM)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
