{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 6, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>This message applies to Microsoft Teams for iOS/Android.</p><p>Microsoft is updating its policies regarding the sharing of user location data to enhance privacy, improve data security, and ensure compliance with evolving regulatory standards. To enhance transparency and user control, Teams will introduce a new location consent experience that gives users the choice of when and how Teams can use their location data <b>specifically, the <a href=\"https://learn.microsoft.com/windows/win32/nativewifi/wi-fi-access-location-changes\" target=\"_blank\">SSID (service set identifier) and the BSSID (basic service set identifier</a>)</b>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-May (previously late April) and expect to complete by late May (previously early May).\n</p><p>General Availability (GCC High, DoD): We will begin rolling out late May 2025 (previously early May) and expect to complete by early June 2025 (previously mid-May).\n</p><p><b>How this will affect your organization:</b></p><p>All new and existing Teams for Work users in your organization will be prompted to specify if they want to keep location detection on for emergency calls only or if they consent to allowing location access used for <i>IT Admin Insights</i>, for troubleshooting (with a tool such as the <a href=\"https://learn.microsoft.com/microsoftteams/cqd-what-is-call-quality-dashboard\" target=\"_blank\">Call Quality Dashboard</a>) or for <a href=\"https://learn.microsoft.com/microsoftteams/configure-dynamic-emergency-calling\" target=\"_blank\">Network and Location matching through BSSID</a> for emergency calling location.\n</p><p><b>NOTE: </b>The new Teams location consent flow does not apply to fully managed devices where users are restricted from user-granted location access. You can expect current policies for managed devices to continue working as expected, and users will not receive the new location consent prompts.\n</p><p>The new Teams location consent changes will impact these Teams features:\n</p><ul><li><i>Emergency calling</i></li><li><i>Location-based routing\n</i></li><li><i>Network </i>and <i>Location </i>matching through BSSID</li><li><i>Call Quality Dashboard </i></li></ul><p>This change will be available by default.\n</p><p>All new Teams for Work users on iOS and Android will first be prompted to allow location permission at the operating system level:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f1af9c7e-c484-469e-94cc-5f9491f48a54\" style=\"width: 280px;\" alt=\"user settings\">\n</p><p>Existing Teams for Work users who previously accepted or denied location permission at the operating system level will not see this prompt a second time.\n</p><p>If a user allows location access, dynamic emergency calling policies will work as configured, and users enabled for <i>Location Based Routing</i> will be able to make and receive PSTN calls.</p><p>If a user disallows location access, several Teams <i>Call Quality Dashboard</i> metrics will be impacted, and <i>Network </i>and <i>Location </i>matching through BSSID from dynamic emergency calling policies will not work. Users can still manually add their physical address for emergency calls in the Teams Calls app if an admin has enabled <code>ExternalLocationLookupMode</code> for their users. \n</p><p>Immediately after users consent to allow location access at the operating system level (and for users who previously consented to location access), both new and existing Teams for Work users will be prompted to allow location access at the Teams app level:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/85081194-9eca-47e8-b165-cf6ba502e4c5\" style=\"width: 280px;\" alt=\"user settings\">\n</p><p>At the Teams level, users must choose between <i>Allow all,</i> which grants Teams full location access (that can be used for emergency calls, IT Admin Insights, or troubleshooting), or<i> Allow emergency only, </i>which restricts location usage to emergency calling. <b>NOTE:</b> Only users who are configured for a dynamic emergency calling policy through <code>ExternalLocationLookUpMode</code> will see this version of the dialog. Users without <code>ExternalLocationLookUpMode</code> enabled will see a slightly different version of this consent prompt that excludes emergency calling. Users can modify their location detection preferences at the operating system level or app level at any time in Teams <i>Settings &gt; Privacy &gt; Location.</i> On fully managed devices, these settings will be on by default and can only be disabled at the operating system level. \n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend that you educate your users on these selections and what works best for your tenant. \n</p><ol><li>If you regularly use the Call Quality Dashboard or leverage Network and Location matching through BSSID, you may want to recommend that users allow location access for those options, or user location data will no longer flow to these services. </li><li>For emergency calling, you can communicate these changes by setting the emergency service disclaimer with a custom message that will display in the Calls app in Teams. Ensuring that users have location turned on is crucial for proper functioning of emergency calls and their safety. Learn more about sending a custom message: <a href=\"https://learn.microsoft.com/MicrosoftTeams/manage-emergency-calling-policies\" target=\"_blank\">Manage emergency calling policies in Microsoft Teams - Microsoft Teams | Microsoft Learn</a></li></ol><p>Learn more about the changes to location services and privacy policies:</p><ul><li><a href=\"https://support.microsoft.com/windows/windows-location-service-and-privacy-3a8eee0a-5b0b-dc07-eede-2a5ca1c49088\" target=\"_blank\">Windows location service and privacy - Microsoft Support</a>\n</li><li><a href=\"https://support.microsoft.com/office/manage-location-sharing-in-microsoft-teams-583dd649-87fc-4b23-aed6-f4e2279297f9\" target=\"_blank\">Enable location sharing - Microsoft Support</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/windows/win32/nativewifi/wi-fi-access-location-changes\" target=\"_blank\">Changes to API behavior for Wi-Fi access and location - Win32 apps | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/MicrosoftTeams/privacy/user-location-data\" target=\"_blank\">User location consent experience in Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</li></ul><p>\n</p><p>For more detailed information and how this will affect each user in your organization, please refer to the public documentation that will be updated here shortly. Before rollout, we will update this post with links to new documentation.\n</p><p> This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams for iOS/Android is updating its location sharing settings to enhance privacy and user control. Users will be prompted to choose location access settings for emergency calls, IT Admin Insights, and troubleshooting. The rollout begins mid-May 2025 and completes by early June 2025. Fully managed devices are exempt from these changes."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1041451",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-06T15:08:04.253Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-26T04:59:30Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams for iOS/Android: New location sharing settings for emergency calls and more",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
