{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Data Loss Prevention (DLP) for Endpoint is extending support to Mac devices managed by additional third-party endpoint/mobile device management (MDM) solutions other than the currently supported Jamf and Microsoft Intune.</p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484137\" target=\"_blank\">484137</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out on mid-April 2025 and expect to complete by late April 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b></p><p></p><div style=\"font-family: Arial; font-size: 10pt;\">Admins can now use their choice of MDM solutions to deploy endpoint DLP to their managed Mac devices.</div><p><b>What you need to do to prepare:</b></p><p></p><div style=\"font-family: Arial; font-size: 10pt;\">There is no impact to any existing deployment to Mac devices. Users that are not using Intune or Jamf can now deploy Purview DLP for Endpoint with their MDM solution.</div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "484137"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention (DLP) for Endpoint will support Mac devices managed by additional third-party MDM solutions beyond Jamf and Microsoft Intune. Public preview starts mid-April 2025, with general availability in mid-June 2025. Existing deployments are unaffected."
    },
    {
      "Name": "Platforms",
      "Value": "Mac"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1036570",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-19T23:04:46.99Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-19T23:04:27Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview Data Loss Prevention (DLP) for Endpoint: Mac device management support for additional MDM solutions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
