{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As communicated in four previously published posts for Microsoft Defender and Microsoft Exchange Online starting in 2022 and ending with MC960818 <i>(Updated) Microsoft Outlook for iOS/Android: New reporting buttons integrated with Microsoft Defender for Office 365</i> (February 2024), the built-in <i>Report </i>button is available for all Microsoft Outlook platforms. Learn more:&nbsp;<a href=\"https://learn.microsoft.com/defender-office-365/submissions-outlook-report-messages#use-the-built-in-report-button-in-outlook\" target=\"_blank\" style=\"\">Report phishing and suspicious emails in Outlook for admins - Microsoft Defender for Office 365 | Microsoft Learn</a>. </p><p>This message announces the maintenance mode status of the Report Message add-in and Report Phishing add-in and explains how to disable all add-ins so users only see one reporting option in Outlook.</p><p>This message applies to new Outlook for Windows desktop, Outlook for Mac desktop, Outlook for the web, and Outlook for iOS/Android.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Available now.\n</p><p><b>How this will affect your organization:</b></p><p>Before this change: The Report Message add-in and Report Phishing add-in were available for Outlook.\n</p><p>After this change, the built-in <i>Report </i>button provides these advantages over the add-ins:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3966367c-a60d-484b-857f-86182a1bfe45\" style=\"width: 400px;\" alt=\"admin documentation\">\n</p><p>The Report Message add-in and Report Phishing add-in are now in maintenance mode, which means we will not make improvements to them. The add-ins will remain functional until we eventually retire them. Any new improvement requests for the add-ins will be rejected. Learn more: <a href=\"https://learn.microsoft.com/defender-office-365/submissions-users-report-message-add-in-configure#frequently-asked-questions\" target=\"_blank\">Transition from Report Message or the Report Phishing add-ins - Microsoft Defender for Office 365 | Microsoft Learn</a> (includes Frequently Asked Questions).\n</p><p>If you have the Report Message add-in and Report Phishing add-in, users will see two reporting options in Outlook: The Report Message add-in and the built-in <i>Report</i> button. It is not possible to remove the built-in <i>Report</i> button and keep the Report Message add-in. Learn more about <a href=\"https://learn.microsoft.com/defender-office-365/submissions-users-report-message-add-in-configure#remove-the-report-message-or-report-phishing-add-ins\" target=\"_blank\">removing the add-in</a>.</p><p>If you are using a third-party add-in, end users might see two reporting options in Outlook. Follow these steps to remove the in-built report button:\n</p><ol><li>Go to Microsoft Defender &gt; <a href=\"https://security.microsoft.com/securitysettings/userSubmission\" target=\"_blank\">User reported settings</a>\n</li><li>Select <i>Monitor reported messages in Outlook</i>.\n</li><li>Select <i>Use a non-Microsoft add-in button.\n</i></li><li>In the <i>Reported message destination</i> section, configure these options:\n<ol><li>For <i>Send reported messages to:,</i> select one of these values:\n<ul><li><i>My reporting mailbox only</i>\n</li><li><i>Microsoft and My reporting mailbox</i>\n</li></ul></li><li>For <i>Add an Exchange Online mailbox to send reported messages to:,</i> specify an existing internal reporting mailbox to hold user reported messages from the third-party add-in.\n</li></ol></li></ol><p><b>What you need to do to prepare:</b>\n</p><p>Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant training materials.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/defender-office-365/submissions-users-report-message-add-in-configure\" target=\"_blank\">Transition from Report Message or the Report Phishing add-ins - Microsoft Defender for Office 365 | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/defender-office-365/submissions-outlook-report-messages\" target=\"_blank\">Report phishing and suspicious emails in Outlook for admins - Microsoft Defender for Office 365 | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/defender-office-365/submissions-user-reported-messages-custom-mailbox\" target=\"_blank\">User reported settings - Microsoft Defender for Office 365 | Microsoft Learn</a></li></ul><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Disable add-in user reporting buttons in Microsoft Outlook as the built-in Report button is now generally available across all platforms. The Report Message and Report Phishing add-ins are in maintenance mode and will not receive improvements. Review your configuration and notify users of this change."
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1030003",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-12T23:13:28.127Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 suite",
    "Microsoft 365 for the web",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-03-12T23:13:21Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Disable add-in user reporting buttons now that built-in Report button is GA for all platforms",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
