{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 22, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft 365 Copilot Dashboard in Microsoft Viva Insights. We are expanding the permissions of the new AI Administrator role to manage Microsoft Copilot dashboard settings. This role allows organizations to delegate Copilot dashboard administration without requiring Global admin privileges, enhancing security and aligning with least-privilege best practices.\n</p><p>The Microsoft Copilot Dashboard in Viva Insights is available to any customer with a Microsoft 365 or Office 365 subscription for business or enterprise, and who has an active Exchange Online account. Neither a paid Viva Insights license nor a Microsoft 365 Copilot license is required to view the dashboard. However, for tenants with at least 50 Copilot licenses or tenants with at least 50 Viva Insights licenses, the dashboard includes full capabilities with metrics and advanced filters. <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/copilot-dashboard#feature-availability-based-on-licenses\" target=\"_blank\">Learn more about which features are available based on your tenant’s assigned license.</a>\n\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=486700\" target=\"_blank\">486700</a>.\n</p><p><b>When this will happen</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-April 2025 and expect to complete by late April 2025.</p><p><b>How this will affect your organization</b></p><p>Before this rollout, Global admin privileges were required to manage Microsoft Copilot dashboard settings, leading to potential security concerns and administrative overhead.\n</p><p>After this rollout, organizations can assign the AI administrator role to users who need access to only Copilot-specific administrative functions, allowing them to manage Microsoft Copilot dashboard settings while restricting access to other Microsoft 365 admin functionalities. Global admins will continue to have full access to Microsoft Copilot dashboard settings.\n</p><p>The AI admin role will enable organizations to:</p><ul><li>Manage <i>Copilot Exclusion Lists</i> and <i>Copilot Dashboard Access Management</i></li><li>Manage <i>Manager </i>settings in the Viva Insights admin portal</li><li>Configure <i>Minimum group size</i> for privacy protection\n</li><li>Control feature toggles such as <i>Copilot Dashboard, Copilot Dashboard Auto Enablement, Copilot Dashboard Delegation, </i>and <i>Copilot Assisted Value.</i></li></ul><p> \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f8d57d92-fabd-4b84-bff3-8727ce443e5a\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This role will be available by default to all Microsoft 365 Copilot customers.</p><p><b>What you need to do to prepare</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout.</p><ul><li>Review your admin role assignments and determine which users should receive AI admin privileges.\n</li><li>Update internal documentation and training materials to reflect this new role.\n</li><li>Monitor the Microsoft 365 admin center for updates on role assignment and availability.\n</li></ul><p>We will update this message with additional documentation before rollout begins.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva is expanding the AI Administrator role to manage Microsoft Copilot Dashboard settings without requiring Global admin privileges. This change, enhancing security and adhering to least-privilege practices, will roll out globally from mid to late April 2025. No action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1046167",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-22T18:47:04.24Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-02T00:54:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Expanded AI admin role to manage Microsoft Copilot Dashboard settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
