{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 22, 2025: We have updated the content. Thank you for your patience.</p><p>ASP.NET DISCO and WSDL pages were the web service APIs for customers who wanted to create a proxy for their web services. The retirement of ASP.NET web services was announced in 2013 and should not be used. We recommend using <a href=\"https://learn.microsoft.com/graph/use-the-api\" target=\"_blank\">Microsoft Graph</a> for remote operations where possible.\n</p><p>We will remove these pages from Microsoft SharePoint Online starting mid-August 2025 and ending in mid-September 2025.</p><p>Please refer to the following information regarding the DISCO and WSDL endpoints\n</p><ul><li>These  endpoints were originally designed for use with development tools from the early 2000s and were never a preferred or widely adopted method for generating proxy classes in SharePoint development.\n</li><li>&nbsp;These endpoints are not tenant-specific and are not associated with any individual tenant’s configuration or ownership.\n</li><li>Usage across the SharePoint Online service is extremely rare. In fact, most of these endpoints show zero usage.\n</li><li>These endpoints were primarily used in legacy development scenarios and are not required for modern SharePoint development practices.</li><li> If your organization has an internal development team, we recommend consulting with them to confirm whether these endpoints are in use. However, it is extremely unlikely that they are being used in any current development workflows.</li></ul><p>Learn more: <a href=\"https://devblogs.microsoft.com/microsoft365dev/removal-of-deprecated-disco-wsdl-aspx-pages-from-sharepoint-online/\" target=\"_blank\">Removal of deprecated DISCO &amp; WSDL aspx pages from SharePoint Online - Microsoft 365 Developer Blog</a></p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint Online will remove retired DISCO and WSDL web pages between mid-August 2025 and mid-September 2025. These endpoints, announced for retirement in 2013, are rarely used and not needed for modern SharePoint development. Organizations should consult their development teams to confirm non-usage."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1055555",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-22T13:32:04.21Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-04-15T00:30:11Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft SharePoint Online: We will remove retired DISCO and WSDL web pages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
