{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Agent UX, previously available on Microsoft 365 Copilot desktop and web, is now being enabled on mobile endpoints. This new feature will allow end-users to discover installed agents, add new agents, and chat with agents in mobile Copilot on Microsoft Teams, Microsoft Outlook, and the Copilot app (formerly Microsoft 365 app).</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in mid-March 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b></p><p></p><div style=\"font-family: Arial; font-size: 10pt;\">Copilot users will be able to discover, add, and use agents.</div><ul><li style=\"font-family: Arial; font-size: 10pt;\">Discover: Users can now easily find and interact with agents that are already installed from Copilot desktop and web.\n</li><li style=\"font-family: Arial; font-size: 10pt;\">Add: The new Agent UX allows users to add new agents from the store on mobile.\n</li><li style=\"font-family: Arial; font-size: 10pt;\">Use: Users can interact and chat with agents in mobile Copilot on Teams, Outlook, and the Microsoft 365 Copilot app.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/32859ef5-1c74-4a23-91f8-d063273bdd9e\" style=\"width: 450px;\"></p><p>This new feature is available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Agent UX in Microsoft 365 Copilot is now available on iOS/Android, allowing users to discover, add, and chat with agents in mobile Copilot on Teams, Outlook, and the Copilot app. The rollout will occur from mid-March to late March 2025, with no admin action required."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1019988",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-28T18:26:54.24Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-28T18:26:37Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Discover agents in Microsoft Copilot iOS/Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
