{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re excited to announce that the Copilot adoption community is now available to all customer tenants, no Copilot license required. Previously, this community template was only available to networks with at least one Copilot license. This update removes that barrier, enabling more organizations to prepare for and support Copilot adoption.</p><p>What is the Microsoft Viva Engage adoption community for M365 Copilot?&nbsp;Since GA in August 2024, this community has helped organizations facilitate the rollout and adoption of Copilot. It enables employees to ask questions, share best practices, and learn from curated content and peer support, all in one place.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=392100\" target=\"_blank\">392100</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Available now.</p><p><b>How this will affect your organization:</b></p><p>Organizations that have not purchased Copilot licenses can now enable the Copilot adoption community in Viva Engage. Viva Engage Admins and Corporate Communicators can enable the community from the Viva Engage admin center or banner in Home Feed.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5b1508af-1b82-4305-891e-5ab8039c3b5f\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "392100"
    },
    {
      "Name": "Summary",
      "Value": "The Copilot adoption community in Microsoft Viva Engage is now available to all customer tenants without requiring a Copilot license. This community helps organizations with the rollout and adoption of Copilot by providing a platform for questions, best practices, and peer support. Available now."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1090697",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-10T16:14:54.44Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-09T23:17:49Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: Copilot adoption community now available to all tenants",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
