{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p></p><p><b><b>Introduction</b></b></p><p>As part of our ongoing efforts to simplify and modernize the Viva Connections experience, we will retire the <b>Assignments and Courses adaptive card extensions (ACEs)</b> for Education customers. ACEs are modular components built using the SharePoint Framework (SPFx) that allow developers to create rich, interactive dashboard cards in Viva Connections. These cards surface data and actions from Microsoft 365 services or custom sources, helping users engage with content directly from their dashboard. The equivalent SharePoint dashboard webparts will also be retired. This change is intended to streamline the experience and reduce redundancy across platforms.</p><p><b>\n<b>When this will happen:</b></b></p><p></p><p></p><ul><li>New installations will be disabled on <b>December 31, 2025</b>.</li>\n<li>Existing components will reach end of support on <b>June 30, 2026</b>.</li>\n</ul>\n\n<b><b>How this affects your organization:</b></b></p><p><ul><li><b>Who is affected:</b> Education tenants using Viva Connections and SharePoint dashboard webparts for Assignments and Courses.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users and admins will no longer be able to access Assignments and Courses ACE cards in Viva Connections.</li>\n    <li>Equivalent SharePoint dashboard webparts will also be inaccessible.</li>\n    <li>No reporting is available to identify which users are currently using these components.</li>\n  </ul>\n</li>\n</ul>\n\n<b>What you can do to prepare:</b></p><p><ul><li>No admin action is required.</li>\n<li>Please notify your users about this change.</li>\n<li>Update any internal documentation that references these components.</li>\n<li>Share alternate capabilities with your users, if applicable.</li>\n</ul>\n<p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2026-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1184647",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-11T00:36:57.523Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-11T00:36:32Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of Assignments and Courses adaptive card extensions (ACE) in Viva Connections and SharePoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
