{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b><br>\nWe’re upgrading the Copilot experience in <i>Microsoft Loop</i> to align with Microsoft 365 Copilot Pages. In the interim, some of the Copilot integrations will be temporarily removed. Once fully completed, this update replaces older Copilot integrations with a consistent, high-quality model—reducing user confusion and improving reliability across chat and page contexts.</p>\n\n<p><b><b>When this will happen:</b></b><br>\n</p><ul>\n<li>Temporary removal of older Copilot integrations: Rolled out on September 9, 2025.</li>\n<li>Upgraded experience: Currently in development. More details will be shared in a future post.</li>\n</ul><p></p>\n\n<p><b><b>How this affects your organization:</b></b><br>\n<b>Who is affected:</b> All Microsoft 365 tenants using Microsoft Loop.<br>\n<b>What will happen:</b>\n</p><ul>\n<li>Older Copilot integrations will be removed from Loop.</li>\n<li>Users will see a consistent set of Copilot entry points that match the Microsoft 365 Copilot Pages experience.</li>\n<li>Prompts will return results consistent with Microsoft 365 Copilot Pages.</li>\n<li>During the transition, users can still access Copilot via the chat button or create a Recap on a page, using older integrations.</li>\n<li>Once the upgrade is complete, Copilot Shortcuts, Ask Copilot in the context menu, improved chat performance, and updated model capabilities will be restored.</li>\n</ul><p></p>\n\n<p><b><b>What you can do to prepare:</b></b>\n</p><ul>\n<li>Remove references in training materials to:<ul><li>Slash menu commands like <b>Draft page content</b> or <b>Summarize page</b></li><li>Ask Copilot context menu</li><li>Copilot integration during page creation</li></ul></li><li>Update documentation to reflect that:<ul><ul></ul><li>Page creation and summarization will be fully integrated into the Copilot chat experience.</li><li>Users will be able to interact with Copilot on selected content using Ask Copilot context menu when functionality is restored.</li></ul></li></ul><p></p>\n\n<p><b><b>Compliance considerations:</b></b><br>No compliance considerations identified, all <a href=\"https://learn.microsoft.com/microsoft-365/loop/cpcn-compliance-summary?view=o365-worldwide\" target=\"_blank\">compliance capabilities</a> will be the same as the <a href=\"https://support.microsoft.com/topic/get-started-with-microsoft-365-copilot-pages-6674bd51-9ff5-42c4-9256-44d9428a726f\" target=\"_blank\">Microsoft 365 Copilot Pages experience</a>.&nbsp;</p><p>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Loop is upgrading its Copilot experience to align with Microsoft 365 Copilot Pages, temporarily removing older integrations starting September 9, 2025. The update will provide consistent, improved Copilot features across chat and pages. Users should update training materials accordingly; no compliance changes are expected."
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1169068",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-09T23:25:39.69Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-09T23:25:04Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Loop: Copilot experience upgrade",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
