{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring the <a href=\"https://support.microsoft.com/office/speaker-coach-in-microsoft-teams-meetings-30f50d15-5f62-4e09-b3bf-cadeb806386a\" target=\"_blank\">Speaker Coach</a> feature in Microsoft Teams, which was previously available as a Preview. After evaluating feedback and usage during the Preview phase, we have decided not to move this feature to general availability. Speaker Coach will be removed from Teams starting mid-August 2025, with full retirement expected by late August 2025.\n</p><p>We sincerely appreciate the feedback from users who explored the Preview. Your input has been instrumental in guiding future product development.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p>\n</p><p><b>How this will affect your organization:</b></p><p>Please inform users in your organization who may have been using Speaker Coach.</p><p>This change will happen automatically by the specified date. No admin action is required before the change. Consider updating relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will retire the Speaker Coach (Preview) feature starting mid-August 2025, with full retirement by late August 2025. Users should be informed, but no admin action is required. This applies to Teams for Windows, Mac, and the web."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1101903",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-24T00:00:01.523Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-23T23:59:48Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Speaker Coach (Preview) will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
