{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 26, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p>We’re excited to announce the change from fixed limits to capacity-based access for some capabilities in Microsoft 365 Copilot. Starting early August, Copilot Chat users without a Microsoft 365 Copilot license get standard access to tools like image generation and file upload based on service capacity. The access could vary during the time of the day based on the available capacity. Users will be notified in-product if the service capacity is not available and the task in progress will not be interrupted. Microsoft 365 Copilot users are offered priority access to these tools.</p><p><b>When this will happen</b></p><p>This change will start rolling out early August and be completed by late October 2025 (previously mid-September).</p><p><b>How this will affect your organization</b>\n</p><p>This change will provide a more flexible and scalable experience for our users.\n</p><p>Users will be notified in product with a message, if service capacity is not available at this moment. </p><p><b>What you need to do to prepare</b></p><p>No admin action is required. If your users need more than standard access to these tools, you can upgrade them to Microsoft 365 Copilot. The maximum size per uploaded file continues to be 512mb for both Copilot Chat and Microsoft 365 Copilot.</p><p>\n</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early August 2025, Microsoft 365 Copilot shifts to capacity-based access for some features. Non-licensed Copilot Chat users get standard access subject to availability, while licensed users have priority. Rollout completes by late October. No admin action is needed; upgrades enable priority access."
    }
  ],
  "EndDateTime": "2025-12-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1117101",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-26T15:54:09.793Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-17T22:51:23Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Standard and Priority access to Copilot capabilities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
