{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We’re updating how you manage user exclusions in <i>Viva Insights</i> and <i>Copilot Analytics</i>. Starting early December 2025, exclusions will be controlled through Viva Feature Access Management (VFAM) policies instead of the current list-based method in the <i>Microsoft 365 admin center</i>. This new approach lets admins create user-, group-, or tenant-level policies to exclude users from all Viva Insights measurement (Copilot Dashboard, Advanced Insights, Organizational Insights), using the same scalable policy framework as other Viva features.</p><p><b><b>When this will happen:</b></b></p><p>The VFAM-based exclusion feature will begin rolling out in <b>early December 2025</b>. Exact rollout dates may vary by region.</p><p><b><b>How this affects your organization:</b></b></p><p><b><i>Who is affected:</i></b> Admins managing Viva Insights and Copilot Analytics exclusions.</p><p><i><b>What will happen:</b></i></p><ul><li>Existing exclusion lists will be automatically migrated to VFAM; no admin action is required.</li><li>Users already excluded will remain excluded across all Viva Insights experiences.</li><li>VFAM will become the default and only method for managing exclusions.</li><li>Admins will use VFAM policies to configure new exclusions at the user, group, or tenant level.</li><li>The exclusion behavior remains unchanged; only the configuration method is updated.</li></ul><p><i>Screenshot - Viva Feature Access Management feature for Exclusion management:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/6a3af982-5fe9-4bf6-b1c4-dedce91aa913/1a4cb948028e9c043a78413396a20e2e3a7a356f.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b><b>What you can do to prepare:</b></b></p><ul><li>No immediate action is required.</li><li>Inform your Viva admins about the upcoming change.</li><li>Once VFAM is live, review your exclusion settings in the <i>Microsoft 365 admin center</i> (under <i>Viva Insights</i>).</li><li>Use the VFAM policy interface for any future updates.</li></ul><p>Learn more about VFAM access:&nbsp;<a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Control access to features in Microsoft 365 | Microsoft Viva | Microsoft Learn</a></p><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting December 2025, Viva Insights and Copilot Analytics user exclusions will shift from list-based management to Viva Feature Access Management (VFAM) policies. Existing exclusions migrate automatically; admins will use VFAM for future exclusions. No immediate action is needed, but admins should prepare for this update."
    }
  ],
  "EndDateTime": "2026-03-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188597",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-21T00:16:11.113Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-21T00:15:55Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Transition to VFAM-based exclusion management",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
