{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>he following features/ experiences will be retired from the Microsoft Purview portal starting August 31, 2025. We strongly recommend transitioning to the alternative management method outlined below.  \n</p><p>The Premium Cases experience in the classic eDiscovery section of the Microsoft Purview portal will be retired and replaced by Cases in Microsoft Purview eDiscovery.  All your existing eDiscovery (premium) cases in the classic eDiscovery experience will be managed in the Cases section in the left-navigation.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/87c352bd-0e6b-4ce1-be15-c6fc4e29e9be \" width=\"300\" height=\"\">\n</p><p>We strongly encourage you to begin planning your transition to help ensure a smooth migration and minimal disruption to your current processes. These changes are part of our ongoing commitment to delivering a secure and intuitive user experience to you and your organization.  \n</p><p><b>How this will affect your organization:</b> \n</p><p>You are receiving this message because one or more users in your organization are using these eDiscovery features.  \n</p><p>After the retirement of these features, users won’t be able to use the classic eDiscovery (Premium) experience to manage cases.   \n</p><p><b>What you need to do to prepare:</b> \n</p><p>This update will start on August 31, 2025. Please notify your users about these changes, update relevant documentation or guidance in your organization, and familiarize your teams with the upcoming changes and enhanced capabilities of the new unified eDiscovery experience in the Microsoft Purview Portal.  \n</p><p>To learn more about the new eDiscovery experience in the Microsoft Purview portal, see <a href=\"https://learn.microsoft.com/en-us/purview/edisc\" target=\"_blank\">Learn about eDiscovery solutions</a>.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The classic eDiscovery (Premium) experience in Microsoft Purview will retire on August 31, 2025, replaced by the unified Cases section. Users must transition to the new eDiscovery experience to avoid disruption, update documentation, and prepare for enhanced capabilities."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129711",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-06T19:47:14.907Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-05T22:47:00Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Purview | ​Retirement of the classic eDiscovery (Premium) experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
