{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>We’re <b>retiring the Designer bot and Designer banners in Microsoft Teams</b> to streamline image generation capabilities. Moving forward, Copilot in Teams will provide enhanced image generation features, where we will continue to invest and improve functionality.</p>\n\n<p><b>When this will happen:</b></p>\n<p>Retirement begins mid-January 2026 and completes by February 27, 2026.</p>\n\n<p><b>How this affects your organization:</b></p>\n<ul>\n<li><b>Who is affected:</b> All Microsoft Teams users who currently use Designer bot or Designer banners.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Users will no longer be able to install or use the Designer bot in Teams chat.</li>\n<li>Users will no longer be able to create channel announcement banners using Designer.</li>\n<li>Users can generate images using Copilot in Teams instead.</li>\n<li>No admin configuration changes are required.</li>\n</ul>\n</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>No admin action is required; this change happens automatically.</li>\n<li>Recommended steps:\n<ul>\n<li>Notify your users about the retirement of Designer bot and banners.</li>\n<li>Update internal documentation to reflect this change.</li>\n<li>Share guidance on using Copilot in Teams for image generation.</li>\n</ul>\n</li>\n</ul><p>Learn more: <a href=\"https://m365.cloud.microsoft/ai-image-generator\" target=\"_blank\">AI Image Generator in Copilot</a></p><ul>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Designer bot and Designer banners in Microsoft Teams will be retired between mid-January and February 27, 2026. Users can no longer use these features but can generate images via Copilot in Teams. No admin action is needed; notify users and update documentation accordingly."
    }
  ],
  "EndDateTime": "2026-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1197104",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-15T19:05:01.177Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-15T19:04:46Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Deprecation of Designer bot and Designer banners in Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
