{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Microsoft Fabric is introducing a new workspace-level scope for workload assignment, enabling Workspace Admins to add workloads directly to their workspaces without requiring capacity-level configuration. This enhancement simplifies workload onboarding and promotes broader adoption across your organization.</p><p><b>When this will happen</b></p><p>Public Preview rollout begins mid-September 2025.</p><p><b>How this affects your organization</b></p><ul><li>A new tenant setting titled <i>Allow workspace admins to add workloads</i>&nbsp;will appear under <i>Tenant Settings</i> &gt; <i>Additional Workloads</i>.</li><li>This setting is enabled by default.</li><li>When enabled, Workspace Admins can add workloads from the <i>More workloads gallery</i> directly to their workspace.</li><li>This capability is independent of capacity-level settings. Workloads added at the workspace level will persist even if removed from capacity-level assignment.</li><li>You can disable this behavior at any time via the <i>Fabric Admin Portal</i>.</li><li>Disabling the setting does not remove existing workspace-level workloads.</li><li><b>Important:</b> Even when workspace-scope workload assignment is enabled, users and/or tenant admins must still provide Entra ID consents according to tenant policies to add and interact with workloads. This ensures user-level permissions and security boundaries are respected.</li></ul><p><b>What you can do to prepare</b></p><ul><li>Review the new tenant setting once available.</li><li>If your organization prefers centralized governance, disable the setting to maintain current controls.</li><li>Notify Workspace Admins if you choose to keep the setting enabled.</li><li>Ensure users are aware of Entra ID consent requirements:<ul><li>Consent must be provided per tenant policies.</li><li>This applies to both adding workloads and interacting with their items.</li><li>Consent ensures workloads operate within authorized access boundaries.</li></ul></li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/fabric/workload-development-kit/more-workloads-add\" target=\"_blank\">Add a workload in the workload hub</a>&nbsp;(will be updated soon)</p><b>Compliance considerations</b>\n<table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n<tbody><tr>\n<th>Compliance Area</th>\n<th>Explanation</th>\n</tr>\n<tr>\n<td>Does the change alter how existing customer data is processed, stored, or accessed?</td>\n<td>Workloads added at workspace scope may access user data, subject to Entra ID consent.</td>\n</tr>\n<tr>\n<td>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights)?</td>\n<td>Access to workloads and their items is gated by Entra ID consent, which aligns with GDPR access controls.</td>\n</tr>\n<tr>\n<td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td>\n<td>&nbsp;Admins can toggle the feature in the Fabric Admin Portal, and workload access can be scoped via Entra ID policies.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Fabric will allow Workspace Admins to assign workloads directly at the workspace level starting mid-September 2025, simplifying onboarding without capacity-level settings. This feature is enabled by default but can be disabled by admins. Entra ID consent remains required for security and compliance."
    }
  ],
  "EndDateTime": "2025-10-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1137612",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-18T23:15:17.243Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-18T23:14:43Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Workspace-level workload assignment in Microsoft Fabric",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
