{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce that starting today, GPT-5—OpenAI’s AI system— begins rolling out to Copilot Chat across Microsoft 365 Copilot app endpoints. Powered by <b>GPT-5's real-time router</b>, Copilot selects the right model for each prompt—using a <b>high-throughput model</b> for quick responses and a <b>deeper reasoning model</b> for complex, multi-step tasks. Users with a Microsoft 365 Copilot license will have access today to GPT-5 in Copilot Chat work and web tabs, while a phased rollout for users without a Microsoft 365 Copilot license will follow over the coming weeks, starting today. GPT-5 is also available in Copilot Studio, enabling makers to build with the latest model in Early release cycle environments.</p><p>This rollout aligns with our commitment to make OpenAI’s latest models available in Microsoft 365 Copilot and Microsoft Copilot Studio within 30 days of release, with enterprise-grade security, compliance, and privacy.</p><p>Learn more about this announcement:  \n</p><ul><li><a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/?p=278895\" target=\"_blank\">Available today: GPT-5 in Microsoft 365 Copilot</a>&nbsp;</li><li><a href=\"https://www.microsoft.com/en-us/microsoft-copilot/blog/?p=5762\" target=\"_blank\">Available today: GPT-5 in Microsoft Copilot Studio</a>&nbsp;</li></ul><p><b>When will this happen:</b> \n</p><p><b>Microsoft 365 Copilot: \n</b></p><ul><li>General availability: \n<ul><li><b>Users with a Microsoft 365 Copilot license</b> (Web, Windows, Mac, mobile): GPT-5 is available starting today in Copilot Chat for work- and web-grounded prompts across Microsoft 365 Copilot app endpoints. \n</li><li><b>Users without a Microsoft 365 Copilot license</b> (Web, Windows, Mac, mobile) - GPT-5 begins rolling out today and is expected to reach full availability in the coming weeks across Microsoft 365 Copilot app endpoints.</li></ul></li></ul><p><b>Microsoft Copilot Studio: \n</b></p><ul><li><b>Early release cycle environments:</b> For Copilot Studio users, GPT-5 can be used at the agent level or in custom prompt tools, for agents built in Early release cycle environments.  \n</li></ul><p>Learn more about these environments: <a href=\"https://learn.microsoft.com/power-platform/admin/early-release\" target=\"_blank\">Early release cycle environments</a>&nbsp;</p><p><b>How will this affect your organization:</b> \n</p><p><u><b>Copilot Chat users: \n</b></u></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6f358fe6-62de-460f-802f-b31770c4f4d8 \" width=\"400\" height=\"\"></p><p>Copilot Chat users will see a new <b>“Try GPT‑5”</b> toggle in the Copilot Chat interface. When enabled, this toggle allows users to opt into enhanced capabilities powered by GPT‑5 for the current Copilot conversation. If a new chat is started, the toggle will need to be selected again to activate GPT-5.\n</p><p>\n</p><p>Access levels vary by license:</p><ul><li>Users with a Microsoft 365 Copilot license receive priority access to GPT-5\n</li><li>Users without a Copilot license receive standard access\n</li></ul><p>Learn more about standard and priority access: <a href=\"https://aka.ms/StandardVsPriorityAccess\" target=\"_blank\">Standard versus priority access in Microsoft 365 Copilot Chat</a>&nbsp;</p><p>There are <b>no changes to existing controls, settings, configurations, or user permissions</b>. GPT-5 integration maintains Microsoft commitments to security, compliance, and privacy.&nbsp;</p><p>Learn more: <a href=\"https://aka.ms/Copilot/UnderstandingModelUpdates\" target=\"_blank\">Understanding foundation model changes in Microsoft 365 Copilot</a>&nbsp;</p><p><u><b>Copilot Studio users:</b></u></p><p>Copilot Studio users will see <b style=\"\">a new toggle in the agent settings page</b> to select agent models and additional options in the model dropdown for custom prompt tools.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/69cfa1ef-72d1-440b-924b-700e9288a24a  \" width=\"400\" height=\"\"></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/23e8d71a-eb8c-4b56-9027-7d6c29315100 \" width=\"400\" height=\"\"></p><p><b>What do you need to do to prepare:</b></p><p>No admin action is required. However, we recommend:\n</p><ul><li>Informing users about the new GPT‑5 capabilities\n</li><li>Updating internal documentation and training materials\n</li></ul><p><b>Additional resources:</b></p><ul><li>Microsoft 365 Copilot overview: <a href=\"https://learn.microsoft.com/en-us/copilot/microsoft-365/microsoft-365-copilot-overview\" target=\"_blank\">Microsoft 365 Copilot overview</a>&nbsp;</li><li>Copilot Studio early release cycle environments: <a href=\"https://learn.microsoft.com/en-us/power-platform/admin/early-release\" target=\"_blank\">Early release cycle environments</a>&nbsp;</li><li>Copilot Studio agent model selection: <a href=\"https://learn.microsoft.com/en-us/microsoft-copilot-studio/authoring-select-agent-model\" target=\"_blank\">Select a primary AI model for your agent</a></li></ul><p><b>Compliance considerations:</b></p>\n<table>\n<tbody><tr>\n<td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td>\n<td>GPT-5 introduces new model routing capabilities in Copilot Chat and Copilot Studio, which dynamically select models based on prompt complexity. These models interact with user data to generate responses.</td>\n</tr>\n<tr>\n<td>Does the change provide end users any new way of interacting with generative AI?</td>\n<td>Users can now opt into GPT-5 via a toggle in Copilot Chat and Copilot Studio, enabling enhanced generative AI capabilities.</td>\n</tr>\n<tr>\n<td>Does the change allow a user to enable and disable the feature themselves?</td>\n<td>Users can manually toggle GPT-5 on or off in Copilot Chat and Copilot Studio interfaces.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "GPT-5 is now available in Microsoft 365 Copilot and Copilot Studio, offering dynamic model selection for faster or deeper responses. Users with a Copilot license get priority access via a toggle in Copilot Chat. No admin action is needed, but informing users and updating documentation is recommended."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130809",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-07T17:14:57.39Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-07T17:14:21Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "GPT-5—OpenAI’s latest generative-AI system—is now available in Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
