{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 4, 2025: We have updated the timeline and content. Thank you for your patience.</p><p><b>Introduction</b></p><p>We hear your feedback about ways we can improve the notifications experience in Viva Engage. It's always a fine balance between ensuring your users are notified of relevant content without notifications feeling too overwhelming or noisy. In response to your feedback, we're rolling out an intelligent notifications experience. Specifically, this change will improve how <i>Community Announcement</i> notifications are delivered. This smarter delivery approach optimizes notifications delivery based on a user’s engagement behavior, helping to reduce notifications fatigue while ensuring timely visibility of announcements.&nbsp;</p>\n\n<p><b>When this will happen</b><b></b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out this change in mid-September 2025 and expect to complete the rollout by early November 2025.</p>\n\n<p><b>How this affects your organization</b>\n</p><p>Previously, when an admin created a new Community Announcement, this would send a notification in Teams and Mobile Push immediately, followed by an email notification two hours later if the announcement was not opened already in Teams and/or Mobile Push.&nbsp;\nWith this new update:\n</p><ul>\n<li>Users will now receive the notification in <b>one channel only</b>—either Teams, Mobile Push, or Email. This notification channel may differ by user and is selected based on where a user has opened Engage notifications most frequently in the past 30 days.&nbsp;</li><li>If the announcement is not opened within two hours in the first notification channel, a <b>secondary notification channel</b> will be sent, also determined by where a user opens Engage notifications most frequently.&nbsp;</li></ul><p>We will continue to respect all user notification preferences and settings where applicable. If a notification channel is disabled or the app is not installed, it will not be selected as a potential notification channel for the Community Announcement delivery.</p><p>Note that this change applies only to<b> regular Community Announcements in Viva Engage</b> and does not affect the \"immediate\" Community Announcement feature (where admins can still select the checkbox to send emails immediately —this functionality remains unchanged).</p><p><b>Can I still notify Community users via email immediately (along with other notification channels)?&nbsp;</b></p><p>Yes! In Viva Engage, we offer an option to send an “immediate” Community Announcement. With this feature, Community admins can choose to send email notifications immediately after posting a Community Announcement, even if a user has opted out of receiving emails. All other notification channels will also send immediately along with email, including Teams and Mobile Push. Therefore, we recommend admins to use this feature when there is a Community Announcement that requires immediate attention from users.&nbsp;</p><p>Community Admins can find this “immediate” Community Announcement option by firstly navigating to the announcement publisher and selecting the hyperlinked <b><i>“option to send emails immediately” </i></b>at the bottom of the publisher. Upon clicking this option, an additional pop-up box will open called <i><b>“Immediate email delivery”</b></i>. By selecting this checkbox, this will ensure that all three notification channels – Email, Teams, and Mobile Push – will send to customers immediately after a Community Announcement is made.&nbsp;</p><p><b>\n&nbsp;What you can do to prepare</b>\n</p><p>No admin action is required. However, we recommend:\n</p><ul>\n<li>Informing your users about the new notifications change to reduce confusion</li>\n<li>Monitoring user feedback and engagement with <i>Community Announcements' notifications delivery</i></li>\n<li>Reviewing internal communication strategies to align with the new notification's behavior</li></ul><p></p><p></p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Yes. Notification delivery logic now uses user behavior data (last 30 days of notification engagement) to determine delivery channels. This data is used to personalize delivery but is not stored permanently.</td></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. The system uses behavioral data to determine the most effective notification channel, which is a form of machine learning-based personalization.</td></tr>\n<tr><td>Does the change provide a new way of communicating between users, tenants, or subscriptions?</td><td>Yes. The change modifies how users receive communications (Community Announcements) by introducing a dynamic, behavior-based delivery method.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is updating Community Announcement notifications to use a smarter, behavior-based delivery system starting mid-September 2025. Users will receive notifications via their most engaged channel first, with a secondary channel if unopened. Immediate email notifications remain available for urgent announcements. No admin action is required."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143276",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-04T20:26:57.047Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T21:41:19Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Smarter delivery of Community Announcement notifications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
