{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 17, 2025: We have updated the title and content. Thank you for your patience.</p><p>We’re expanding Microsoft 365 Copilot Search capabilities within Microsoft 365 Admin Center to AI admin and Global reader roles. This is to provide organizations with enhanced control and flexibility in managing AI-powered search experiences. AI admin role enables designated admins to configure, monitor, and govern Copilot Search capabilities across their tenant. Global reader roles provide read-only capabilities to Acronyms and Bookmarks configuration in Copilot Search.&nbsp;</p>\n\n<b>When this will happen:</b>\n<p><b>General Availability (Worldwide): </b>Rollout begins late September 2025.&nbsp;</p>\n\n<b>How this affects your organization:</b>\n<ul>\n<li>Admins assigned AI Admin Role will be able to manage Copilot Search settings and capabilities for their organization.\n</li><li>Admins assigned Global Reader Role will be able to have read-only capability Copilot Search settings for their organization.\n</li><li>This feature is <b>on by default</b> for tenants with eligible licenses and assigned roles.\n</li><li>No changes will be made to existing admin roles unless explicitly assigned.</li>\n</ul>\n\n<b>What you can do to prepare:</b>\n<ul>\n<li>Ensure that designated admins are assigned the <b>AI Admin Role </b>and <b>Global Reader</b> role. \n</li><li>Confirm that your organization has the <b>Microsoft 365 Copilot license</b>.\n</li><li>Review role assignment practices in <b>Microsoft Entra ID </b>to manage access.</li>\n</ul>\n\n<p></p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/admin/add-users/about-admin-roles?view=o365-worldwide\" target=\"_blank\">About admin roles in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a></p><p><b>Compliance considerations:</b></p><p></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?&nbsp;</td><td>Yes. This update introduces the AI Admin Role and Global reader role, which enables designated administrators to manage or give read-only capability to AI-powered Copilot Search experiences that interact with customer data across Microsoft 365 services.</td></tr><tr><td>Does the change alter how existing customer data is processed, stored, or accessed (e.g., documents, emails, chats, etc.)?</td><td>Yes. AI-powered search may surface data across services based on user permissions, potentially altering how data is accessed and presented.</td></tr><tr><td>&nbsp;=Does the change provide end users any new way of interacting with generative AI?&nbsp;</td><td>Yes. Copilot Search enhances the user experience by enabling generative AI-powered search capabilities across Microsoft 365.</td></tr><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities (e.g., Purview or admin reporting)?</td><td>No.  There is no new governance and monitoring capabilities for Copilot Search. But, with this role AI admins will be able to manage the existing Acronyms and Bookmark configurations with Copilot Search. Global Reader will give them read-only capabilities to the same.&nbsp;</td></tr><tr><td>Does the change include an admin control, and can it be controlled through Entra ID group membership?&nbsp;</td><td>Yes. AI Admin Role and Global Reader access to Copilot Search capabilities can be assigned and controlled through Microsoft Entra ID group membership.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Search admin experience is expanding to AI Admin and Global Reader roles, allowing designated admins to manage or view Copilot Search settings. This rollout begins late September 2025, is enabled by default for eligible tenants, and access is controlled via Microsoft Entra ID."
    }
  ],
  "EndDateTime": "2025-11-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1152322",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-17T21:49:16.973Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-12T23:10:21Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Expanding Microsoft 365 Copilot Search admin experience to AI admin role",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
