{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to enable Intent group and Agent group metrics for real-time analytics in Dynamics 365 Contact Center. This feature will reach public preview on November 14, 2025.<br><br>\n<b>How does this affect me?</b><br>\nThis feature provides several key improvements to our contact center analytics and reporting:<ul>\n    <li><b>Filters and Auto Refresh:</b><ol type=\"a\">\n        <li>The landing page displays real-time operational metrics with intent group and user group filters.</li>\n        <li>The auto-refresh feature ensures supervisors have continuous access to the most up-to-date information.</li>\n    </ol>\n    </li>\n    <li><b>Bot Real-Time Analytics:</b><ol type=\"a\">\n        <li>Real-time analytics for agent performance, highlighting crucial metrics such as containment rate and abandon rate.</li>\n        <li>These metrics are viewable by intent group.</li>\n    </ol>\n    </li>\n    <li><b>Voice Report Enhancements:</b><ol type=\"a\">\n        <li>The voice report includes features such as voicemail and in-queue callback options.</li>\n        <li>Additionally, it will track Average Handling Time (AHT) specific metrics like talk time, wrap time, and hold time.</li>\n    </ol>\n    </li>\n    <li><b>Ongoing Conversation Dashboard:</b><ol type=\"a\">\n        <li>This dashboard incorporates Line of Business (LOB), Intent Group, and Agent Group concepts.</li>\n        <li>Provide a comprehensive view of ongoing conversations with these new categorizations.</li>\n    </ol>\n    </li>\n    <li><b>Backlog Conversation Dashboard:</b><ol type=\"a\">\n        <li>This dashboard now includes LOB, Intent groups, and Agent groups.</li>\n        <li>Enable supervisors to manage and prioritize backlog conversations more effectively.</li>\n    </ol>\n    </li>\n</ul>\n<b>What action do I need to take?</b><br>\nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-12-13T15:53:34Z",
  "HasAttachments": false,
  "Id": "MC1185736",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-13T15:58:36.837Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-13T15:53:34Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center – Improve real-time analytics with intent group and agent groups",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
