{
  "ActionRequiredByDateTime": "2025-10-12T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Viva Engage (previously known as Yammer) networks are being upgraded. The retirement of 'legacy' networks and enforcement of mandatory upgrades were first announced via the Message center on September 1, 2022 (MC424414). Additional notification arrived via the Message center in 2023, 2024, and 2025, with Service Health Dashboard alerts indicating the need to upgrade networks as soon as possible.\n</p><p>Legacy networks that have not upgraded will become inaccessible to users on <b>October 13, 2025.\n</b></p><p><b>How this will affect your organization:</b>\n</p><p>If your network is not in <i>Native Mode</i>, you will lose access to all network content. Users will be unable to login to your legacy network, and your network will be scheduled for deletion at a future date.&nbsp;</p><p>If you lose access to your network, please open a support case with Microsoft as soon as possible. Microsoft's support team will help guide you through the upgrade process.</p><p><b>What you need to do to prepare:</b></p><p>For networks created before January 16, 2020:</p><p>To determine whether your network is in Native Mode, an Engage admin must log into the Engage admin center and navigate to \"Network admin -&gt; Native Mode for Microsoft 365.\" Networks in Native Mode will have a green banner announcing the completion of the upgrade process. If you do not see a green banner, please follow the steps in <a href=\"https://learn.microsoft.com/viva/engage/native-mode-guide\" target=\"_blank\">this guide</a>&nbsp;as soon as possible.</p><p>For networks created after January 16, 2020:</p><p>Your network was automatically created in Native Mode. No action is necessary.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Access to legacy Viva Engage (Yammer) networks ends October 13, 2025. Networks not upgraded to Native Mode will become inaccessible and scheduled for deletion. Admins should verify and upgrade networks created before January 16, 2020, via the Engage admin center to avoid data loss."
    }
  ],
  "EndDateTime": "2025-11-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1166851",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-06T23:01:04.087Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-06T23:00:44Z",
  "Tags": [
    "Retirement"
  ],
  "Title": "Access to Non-Native Viva Engage Network Ending October 13 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
