{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Empower your organization with proactive governance. The new <b>site attestation policy</b> ensures that site owners regularly validate critical details like ownership, membership, and sharing settings. By automating periodic reviews and enforcement actions, this policy helps reduce compliance risks, prevent oversharing, and maintain a secure, well-governed SharePoint Online experience.</p><p><b>When this will happen:</b>\n</p><p>This feature is now generally available to all customers.</p><p><b>How this will affect your organization:</b></p><p>\n</p><ul><li><b>Who is affected: </b>SharePoint administrators and site owners.</li><li><b>What will happen:</b><ul><li>SharePoint admins can enable site attestation policy in the SharePoint Admin Center.</li><li>Site owners will receive periodic prompts to confirm site details such as ownership, membership, and sharing settings.</li><li>Enforcement actions (such as restricting access or archiving) can be configured if attestations are not completed.</li><li>The feature is off by default and requires admin configuration.</li></ul></li></ul><p><b>What you can do to prepare:</b>\n</p><ul><li>Notify your SharePoint administrators about the new policy.\n</li><li>Update internal documentation and workflows to account for this capability.</li><li>Review governance policies and determine enforcement actions for non-compliance.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/request-site-attestations\" target=\"_blank\">Request recurring site attestations for SharePoint sites</a></p><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Site attestation policy is now generally available, enabling SharePoint admins to require site owners to periodically verify site ownership, membership, and sharing settings. This helps reduce compliance risks and prevent oversharing. The feature is off by default and requires admin setup with configurable enforcement actions."
    }
  ],
  "EndDateTime": "2026-02-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1198075",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-16T23:38:57.53Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-16T23:38:16Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Site attestation policy is now generally available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
