{
  "ActionRequiredByDateTime": "2026-01-11T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’d like to inform you that threat actor attribution details will soon be removed from the alert page in <i>Microsoft Defender for Endpoint</i>. This change is designed to improve clarity and focus in alert content. Threat actor attribution is more meaningful and actionable when viewed in the context of the broader incident rather than at the individual alert level.</p><p>After this change, attribution details will be available on the <i>Incident page</i> and in the <i>Threat Intelligence section</i> within the <i>Microsoft Defender portal</i>.</p><p><b>When this will happen</b></p><p><b>January 12, 2026: </b>Threat actor attribution information will be retired from alert pages.</p><p><b>How this affects your organization</b></p><p><i>Who is affected:&nbsp;</i>Admins and security teams using Microsoft Defender for Endpoint.</p><p><i>What will happen:</i></p><ul><li>Threat actor attribution will no longer appear on individual alert pages.</li><li>Attribution details will be available on the<i> Incident page</i> and in the <i>Threat Intelligence experience</i>.</li><li>No impact to alert generation, detection logic, or security effectiveness.</li></ul><p><b>What you can do to prepare</b></p><ul><li>No admin action is required; this change will occur automatically.</li><li>If your workflows currently rely on alert-level actor attribution, review incident-based investigation processes to ensure continuity.</li><li>Update internal workflows, playbooks, or automation rules to retrieve attribution from the Incident page or Threat Intelligence section.</li><li>Inform SOC and threat intelligence teams about this change.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Threat actor attribution will be removed from Microsoft Defender for Endpoint alert pages on January 12, 2026, and moved to the Incident page and Threat Intelligence section. This change improves alert clarity without affecting detection or security. No admin action is needed, but update workflows accordingly."
    }
  ],
  "EndDateTime": "2026-02-12T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187397",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-17T23:52:56.953Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-17T23:52:43Z",
  "Tags": [
    "Retirement"
  ],
  "Title": "Microsoft Defender for Endpoint: Threat actor attribution information will be removed from alert page",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
