{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 23, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\nWe are excited to announce the upcoming rollout of <b>Microsoft 365 Copilot Chat Adoption Metrics in Microsoft Copilot Dashboard</b> to tenants that have at least one Microsoft 365 Copilot license assigned. This feature has been previously released to tenants that have at least 50 assigned Viva Insights licenses, or 50 assigned Microsoft 365 Copilot licenses.<p></p>\n\n<p>This feature empowers organizations with powerful insights into the adoption and usage of M365 Copilot Chat by users who are not licensed for M365 Copilot. Insights include usage trends, retention and usage intensity insights, app-level breakdowns, and filtering by organizational attributes.</p><p>Screenshot: <i>Copilot chat adoption in Copilot Dashboard</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b98840da-d87c-4786-8247-218c7ea26232\" style=\"width: 400px;\" alt=\"user settings\"></p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501581\" target=\"_blank\">501581</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide):\nWe will begin rolling out in mid-February 2026 (previously mid-January) and expect to complete by late February 2026 (previously end of January).</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p><ul><li>Tenants with at least one Microsoft 365 Copilot license assigned.</li><li>Admins and users enabled for Microsoft Copilot Dashboard.</li></ul>\n\n<p><b style=\"\">What will happen:</b></p>\n<ul>\n<li>Feature will be <b>enabled by default</b>; no admin action required.\n</li><li>New analytics cards and visualizations will appear in the Copilot Dashboard adoption tab.</li>\n<li>Insights will include:\n<ul>\n<li><b>Usage Trends Over Time:</b>&nbsp;Visualize how Microsoft 365 Copilot Chat adoption evolves at your organization, by measuring the number of active users over time.</li>\n<li><b>Adoption by Group:</b>&nbsp;Compare adoption across organizational attributes, such as organization or job function to uncover where Copilot Chat is gaining traction and where further engagement may be needed.</li>\n<li><b>Usage intensity and retention insights:</b>&nbsp;Analyze how consistently users return to Copilot Chat and how many Copilot actions are being taken, with metrics on recurring usage and usage intensity.</li>\n<li><b>App-Level Breakdowns:</b> Identify which entry points and applications are driving Copilot Chat adoption.</li><li>Filtering and drilldown capabilities will be available for both Microsoft 365 Copilot Chat and Microsoft 365 Copilot views on the adoption and impact tabs.</li>\n<li><b>Filtering and Drilldown:</b>&nbsp;Filter by org attributes to explore adoption patterns, enabling Copilot Dashboard users to tailor their change management and support approaches for maximum impact.</li>\n</ul>\n</li>\n</ul><p><b>Administrator Controls:</b></p><p>Global administrators, Viva Insights Administrators, and AI administrators will continue to have the following controls:&nbsp;&nbsp;</p>\n<ul>\n<li>Create a policy for the Microsoft 365 Copilot Chat in Copilot Dashboard feature through Viva Feature Access Management (VFAM) in Microsoft Admin Center or PowerShell. </li><li>Create a policy for access to the Viva Insights web app through Viva Feature Access Management (VFAM) in Microsoft Admin Center or PowerShell.&nbsp;</li><li>Exclude certain users or groups of users of Microsoft 365 Copilot chat from being included in the aggregated insights through the exclusion feature.&nbsp;</li></ul><p>Learn more:&nbsp;</p><ul></ul><p></p><ul><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/manage-settings-copilot-dashboard#manage-access-to-the-viva-insights-web-app-for-individual-users-and-groups\" target=\"_blank\">Manage access to Viva Insights web app for individual users and groups in Microsoft 365 admin center</a></li><li><a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Control access to features in Microsoft 365</a></li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Read the <a href=\"https://www.microsoft.com/microsoft-365/blog/2025/01/15/copilot-for-all-introducing-microsoft-365-copilot-chat/\" target=\"_blank\">Microsoft announcement regarding Microsoft 365 Copilot Chat</a>.</li><li>Review and assess the impact on your organization.</li>\n<li>Update training and documentation as appropriate.</li>\n<li>No additional configuration is required; metrics will be enabled by default.</li>\n\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\nNo compliance considerations identified; review as appropriate for your organization.<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501581"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat Adoption Metrics will roll out globally by late February 2026 to tenants with at least one Copilot license. Enabled by default, it provides admins with detailed usage insights, trends, adoption by group, app-level data, and filtering options via the Copilot Dashboard, with admin controls for access and exclusions."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-23T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191915",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-23T22:31:56.297Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-03T21:38:04Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Copilot Dashboard - Broader access to M365 Copilot Chat insights",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
