{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing <i>Teams Collaborative Notes</i> (powered by Loop) in group chats across desktop and web experiences. This feature enables users to co-create and edit notes, agendas, and action items directly within the Teams chat interface, enhancing real-time collaboration without switching contexts.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498159\" target=\"_blank\">498159</a>.</p><p><b>When this will happen</b></p><ul><li>Public Preview: Rollout begins late September 2025 and completes by early October 2025.&nbsp;&nbsp;</li><li>General Availability: Rollout begins late September 2025 and completes by early October 2025.</li></ul><p><b>How this affects your organization</b></p><p>Users will see a new <i>Notes </i>tab in group chats, allowing them to create and collaborate on Loop components such as agendas and action items. These components are editable inline, supporting synchronous collaboration directly within Teams.&nbsp;&nbsp;</p><p>This feature is on by default for all tenants. Users do not need to install anything to begin using it.</p><p><b>What you can do to prepare</b></p><ul><li>You can manage this feature via the Teams Admin Center. If desired, Collaborative Notes can be disabled at the tenant level.</li><li>Review internal documentation and training materials to ensure users are aware of the new Notes tab and its capabilities.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498159"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce Collaborative Notes in group chats, enabling real-time co-creation of notes, agendas, and action items via a new Notes tab. Rolling out from late September to early October 2025, the feature is on by default and manageable through the Teams Admin Center."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-11-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1148543",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-05T22:05:19.117Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-05T22:05:07Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Collaborative Notes in Chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
