{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 24, 2025: We have updated the timeline. Thank you for your patience.</p><p><b><b>Introduction:</b></b>\n</p><p>We are expanding inline protections for uploads in <i>Microsoft Edge for Business</i> to cover more unmanaged consumer generative AI (GenAI) apps. With this update, admins can apply Microsoft Purview collection policies and Purview Data Loss Prevention (DLP) policies to detect and prevent sensitive data sharing in the <i>Edge browser </i>when users interact with these additional unmanaged app locations.\nInline protections are built directly into <i>Edge for Business</i> and work for users on Intune-managed Windows devices. This enhancement complements existing capabilities, giving organizations greater flexibility to enforce data security controls across a broader set of GenAI apps.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=518643\" target=\"_blank\">518643</a>.\n</p>\n\n<p><b><b>When this will happen:</b></b>\n</p><ul>\n<li><b>Public Preview:</b> Begins late November 2025 (previously mid-November), expected to complete by early December 2025.</li>\n<li><b>General Availability (Worldwide):</b>&nbsp;Begins in early December 2025 (previously late November) and is expected to complete by mid-December 2025 (previously end of December).</li>\n</ul>\n<p></p>\n\n<p><b><b>How this affects your organization:</b></b>\n</p><p><b>Who is affected:</b>\n</p><ul>\n<li>Admins managing Microsoft Purview DLP and collection policies for Edge for Business</li>\n<li>Users on Intune-managed Windows devices using Edge for Business</li>\n</ul>\n<b>What will happen:</b>\n<ul>\n<li>Admins can extend current Purview collection and DLP policies to include new unmanaged GenAI app locations for inline protection.</li>\n<li>No additional deployment steps are required.</li>\n<li>Inline protections are built directly into<i> Edge for Business</i>.</li>\n<li>Automated behaviors will block use of unprotected browsers for users included in policies that block activities in unmanaged GenAI apps.</li>\n</ul>\n<p></p>\n\n<p><b><b>What you can do to prepare:</b></b>\n</p><p>No action is required to enable this feature. To learn more or update your policies, review the following resources:</p><ul><li><a href=\"https://learn.microsoft.com/purview/collection-policies-policy-reference#cloud-apps-detection\" target=\"_blank\">Cloud apps detection - Collection policy reference | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/dlp-policy-reference\" target=\"_blank\">Data Loss Prevention policy reference | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/dlp-browser-dlp-learn\" target=\"_blank\">Learn about Data Loss Prevention for Cloud Apps in Edge for Business | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Question</td><td>Answer</td></tr><tr><td>Does this change modify, interrupt, or disable any Data Loss Prevention (DLP) policies or enforcement in Microsoft Purview?</td><td>Yes. This update expands DLP enforcement by allowing admins to apply existing policies to additional unmanaged GenAI app locations in Edge for Business.</td></tr><tr><td>Does this change alter how admins can monitor, report on, or demonstrate compliance activities using Microsoft Purview or admin reporting tools?</td><td>Yes. Admins will gain expanded visibility and control over data sharing activities in Edge for Business, enabling more comprehensive reporting and compliance oversight.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "518643"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview DLP in Edge for Business will expand inline protections to cover more unmanaged GenAI apps, allowing admins to apply existing policies without extra deployment. Public preview starts late November 2025, with general availability in early December 2025, enhancing data security and compliance monitoring."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-26T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1182684",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-24T20:47:18.87Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-04T00:35:04Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "(Update)Microsoft Purview DLP and Edge for Business: Inline data security controls for more unmanaged GenAI apps in Edge",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
