{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re simplifying the answer verification experience in Viva Engage by consolidating the options available to community experts into a single, streamlined action. This update reduces decision fatigue and promotes consistency in how answers are validated across communities.</p><p>This message applies to the following platforms: Teams and Surface Devices, and Web.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 and expect to complete by late July 2025.</p><p><b>How this will affect your organization:</b></p><p>Currently, community experts in Viva Engage can choose between marking a response as a “best answer” or a “verified answer.” To streamline the experience and reduce confusion, this update will consolidate these options for community experts.</p><ul><li>Community experts will now see only the “verified answer” option when responding to questions.\n</li><li>Question askers will continue to see the “best answer” option, as currently implemented.\n</li><li>Community admins will retain the ability to choose between both options.</li><li>Users with multiple roles:\n<ul><li>If a user is both a question asker and a community expert, they will see only the “verified answer” option.\n</li><li>If a user is both a community expert and an admin, they will see both options, with admin privileges taking precedence.\n</li></ul></li></ul><p>This change is designed to simplify workflows and ensure a consistent answer validation experience across communities.</p><p><b>What you need to do to prepare:</b></p><p>No admin action is required before rollout; the feature will be enabled automatically.</p><p>\n</p><p>We recommend notifying your community admins and designated experts about this change so they are aware of the updated experience and can adjust their workflows accordingly.</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/viva_engage_blog/introducing-verified-answers-in-viva-engage/4386315\" target=\"_blank\">Introducing Verified Answers in Viva Engage</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408165"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is consolidating the answer verification options for community experts into a single \"verified answer\" action to reduce decision fatigue and promote consistency. This update will roll out from mid-July to late July 2025 across Teams, Surface Devices, and Web. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108837",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-03T23:34:20.733Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:34:14Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva | Viva Engage: Streamlined verified answers for community experts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
