{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re providing standard access to the generative AI features of <b>Create in Microsoft 365 Copilot </b>to users without a Microsoft 365 Copilot license, enabling all Copilot Chat users in your organization to generate images and edit visual content—such as posters, banners, infographics, and images—using AI-powered tools. This update makes visual creation more accessible across your organization, helping users communicate ideas with the help of Copilot.</p><p>Learn more about standard vs. priority access to Copilot features: <a href=\"https://support.microsoft.com/en-us/topic/standard-versus-priority-access-to-features-in-microsoft-365-copilot-chat-12c8d9f8-db32-4f99-8ebe-d8d85879137f\" target=\"_blank\">Standard versus priority access to features in Microsoft 365 Copilot Chat</a>&nbsp;</p><p><b>When this will happen</b></p><ul><li>General availability (Web, Windows, macOS): Began rolling out mid-August and is expected to complete in the coming weeks. </li><li>Mobile availability: will follow in mid-October 2025 after the desktop rollout.</li></ul><p><b>How this will affect your organization:</b></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f886b68e-75a8-47de-90bb-32406aff3664 \" width=\"400\" height=\"\"></p><p>\n</p><p><br></p><p>Users without a Microsoft 365 Copilot license will now see options to create content with Copilot, enabling them to generate and edit <b>posters, banners, infographics, and images</b> using AI-powered tools with standard access. Existing admin controls for image generation apply to these AI capabilities.\n</p><p><b>Feature limitations</b>:</p><ul><li>These users <b>will not be able to generate videos, surveys, </b>and<b> will not have access to brand kits&nbsp;</b>in Create&nbsp;</li><li>If image generation<b> is disabled by tenant admins</b>, the following features will be hidden for both licensed and unlicensed users: Image, Poster, Banner, Infographic, Story, and Edit an image</li><li><b>No additional admin action is required</b>. Existing admin controls for image generation apply to these capabilities.</li></ul><p>&nbsp;<b>What you need to do to prepare:</b></p><ul><li>Review your current <b>image generation settings</b> in the Microsoft 365 admin center.</li><li>If needed, update your tenant configuration using the guidance here: <a href=\"https://learn.microsoft.com/en-us/copilot/microsoft-365/microsoft-365-copilot-page#copilot-image-generation\" target=\"_blank\">Copilot image generation</a>&nbsp;</li><li>Inform your users about the generative AI features in the <b>Create experience</b>: <a href=\"https://support.microsoft.com/en-us/topic/get-started-with-microsoft-365-copilot-create-6e0c616d-69fb-42f2-a4cb-c59e006ec4f5\" target=\"_blank\">Get started with Microsoft 365 Copilot Create</a>&nbsp;</li><li>Consider updating internal documentation or training materials to reflect this change.</li></ul><p>\n<b>Compliance considerations</b></p>\n<table border=\"1\">\n<tbody>\n<tr><td>Introduces or modifies AI/ML capabilities</td><td>Enables generative AI image creation and editing for unlicensed users, expanding access to AI tools that interact with user-generated content.</td></tr>\n<tr><td>Provides new way of interacting with generative AI</td><td>Users without a Copilot license can now use Create to generate and edit visual content using AI.</td></tr>\n<tr><td>Includes an admin control</td><td>Image generation can be disabled by tenant admins, which hides related features for all users.</td></tr>\n<tr><td>Can be controlled through Entra ID group membership</td><td>Admins can manage access to Create features via Entra ID group membership settings.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot's Create module now offers generative AI image and visual content creation to all Copilot Chat users without a license, with standard access and existing admin controls applying. Video, survey, and brand kit features remain restricted. Rollout began mid-August for desktop, with mobile following in October 2025."
    }
  ],
  "EndDateTime": "2025-12-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1136035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-15T22:45:30.693Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-15T22:45:13Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Gen AI capabilities in the Create module of Microsoft 365 Copilot app coming to all Copilot Chat users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
