{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 5, 2026: Agent Mode in Excel and Word are starting to roll out across web, Windows, and Mac and are expected to complete in the following weeks. Additionally, Anthropic has onboarded as a Microsoft subprocessor and we have updated the related information below.</p><p>Updated January 20, 2026: The change to Copilot Chat in Outlook to expand reasoning to include a user's entire inbox, calendar, meetings, and other enterprise data is starting to roll out across web, new Outlook for Windows, Classic Outlook for Windows, Mac and mobile and is expected to complete in the following weeks. For more information on the data Copilot Chat in Outlook will be able to access, please see <a href=\"https://learn.microsoft.com/copilot/privacy-and-protections#organizational-data\">Organizational Data</a> in our documentation. Users can learn more about this change from the <a href=\"https://support.microsoft.com/topic/use-copilot-chat-in-microsoft-365-apps-676db5e8-9568-4bdb-bf0b-e207e29e056b\">Use Copilot Chat in Microsoft 365 apps</a> article. There is no update at this time regarding Agent Mode and the Word, Excel, and PowerPoint Agents availability.</p><p><b>Introduction</b></p><p>We’re introducing new capabilities for Microsoft 365 Copilot Chat users (without a Microsoft 365 Copilot license) to help them better manage their day in Outlook and create and refine Word documents, Excel workbooks, and PowerPoint presentations. These updates include:\n</p><ul><li><b>Copilot Chat in Outlook</b> will expand from reasoning over a single email thread to reasoning over a user’s entire inbox, calendar, meetings, and other enterprise data. \n</li><li><b>Agent Mode in Word, Excel, and PowerPoint </b>uses web data and referenced files to help users create and refine content in the apps. \n</li><li><b>Word, Excel, and PowerPoint Agents</b> allow users to create high-quality documents, workbooks, and presentations in Copilot Chat using web data and referenced files.</li></ul><p>Please find our Microsoft Ignite announcements <a href=\"https://aka.ms/ABSIgnite2025\" target=\"_blank\">here</a>.</p><p><b>When this will happen:</b></p><p>We will begin rolling out early January 2026 and expect to complete by late March 2026.</p><p><b>How this will affect your organization:</b>\n</p><ul><li><b>Who is affected: </b><a href=\"https://learn.microsoft.com/en-us/copilot/manage#microsoft-365--chat-eligibility\" target=\"_blank\">Eligible Copilot Chat users</a> with a Microsoft 365 or Office 365 subscription. There is no change for users with a Microsoft 365 Copilot license.</li><li><b>What will happen:\n</b><ul style=\"\"><li style=\"\">Copilot Chat in Outlook will understand the entire inbox, calendar, meetings, and other enterprise data for a user. Additional documentation will be provided closer to rollout. Users will be able to ask Copilot to source information across their inbox, uncover action items, or manage their calendar. \n</li><li style=\"\">Users will be able to access Agent Mode in Word, Excel, and PowerPoint through the Tools menu in the Copilot Chat input box in each individual app. Agent Mode lets users create and refine content as they are working. Agent Mode will use web data and referenced files but will not have access to work data.\n</li><li style=\"\">Users will be able to access the Word, Excel, and PowerPoint Agents in Copilot Chat from the Tools menu in the input box or by typing “@” and selecting the agents. These agents use several models, including Anthropic’s Claude model, to help create high-quality documents, spreadsheets, and presentations. These agents will use web data and referenced files but will not have access to work data.</li></ul></li></ul><p><b>What you need to do to prepare:</b>\n</p><ul><li>No admin action is required for Copilot Chat in Outlook. If you’d like to manage Copilot Chat in Outlook, you can use Integrated Apps in the Microsoft 365 admin center. Learn more <a href=\"https://learn.microsoft.com/en-us/copilot/manage#manage--chat-on-the-web-in-the-microsoft-365--app-and-in-outlook\" target=\"_blank\">here</a>.\n</li><li>No admin action is required for Agent Mode in Word, Excel, and PowerPoint. If you’d like to manage Copilot Chat in Word, Excel, and PowerPoint, you can use the Pin Microsoft 365 Copilot Chat setting. Learn more <a href=\"https://learn.microsoft.com/en-us/copilot/manage#pinning-settings-for--chat\" target=\"_blank\">here</a>.\n</li><li>To provide access to Word, Excel, and PowerPoint Agents, you must connect to Anthropic’s Claude model. Learn how to connect <a href=\"https://learn.microsoft.com/en-us/copilot/microsoft-365/connect-to-ai-models\" target=\"_blank\">here</a>.</li></ul><p><b>Compliance considerations:</b></p><p>The following considerations are relevant to the use of Word, Excel, and PowerPoint Agents.</p><ul><li>Anthropic has onboarded as a Microsoft subprocessor: Learn more <a href=\"https://learn.microsoft.com/copilot/microsoft-365/connect-to-ai-subprocessor\">here</a>.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat is expanding: Outlook will analyze entire inboxes, calendars, and meetings; Agent Mode in Word, Excel, and PowerPoint will assist content creation using web data and referenced files. Rollout began January 2026, completing by March, with no admin action required for most features."
    }
  ],
  "EndDateTime": "2026-05-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187671",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-05T23:22:04.92Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T16:07:00Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "New features coming to Microsoft 365 Copilot Chat for Outlook, Word, Excel, and PowerPoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
