{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>Coming soon to SharePoint: Site owners and admins will be able to apply two new Microsoft-designed multi-color dark themes. These official themes offer modern dark color palettes with multiple colors combinations, enabling richer visual experiences and consistent branding across sites. Both themes are available out-of-the-box and can be configured via site settings.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=526788\" target=\"_blank\">526788</a>.</p><p>\n</p><p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Targeted Release (Worldwide):</b>&nbsp;Rollout begins mid-December 2025, completes early January 2026</li>\n<li><b>General Availability (Worldwide, GCC, GCC High, DoD):</b>&nbsp;Rollout begins mid-January 2026, completes early February 2026</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b>&nbsp;SharePoint Site owners and SharePoint admins across all Microsoft 365 environments (Worldwide, GCC, GCC High, DoD)</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Two new Microsoft-designed dark themes (Dark Teal, Dark Blue) will be available out-of-the-box</li>\n    <li>Themes can be applied via “Change the look” in site settings</li>\n    <li>The themes update site headers, footers, section design, Text web part, and Design Ideas</li>\n    <li>Designed for low-light environments and compliant with Microsoft accessibility standards</li>\n    <li>No impact to existing themes or site functionality</li></ul></li></ul><p></p><ul></ul><p></p><p><b>Note:</b> Previously applied PowerShell settings that disable all out-of-box themes from Microsoft remain effective, and the PowerShell command can still be used to manage the Microsoft theme availability.</p>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No admin action is required prior to rollout. After rollout:</li>\n  <ul>\n    <li>Notify site owners and users about the new dark themes</li>\n    <li>Encourage exploration of the new options for improved branding and visual comfort</li>\n    </ul></ul><p>Learn more: </p><ul><li><a href=\"https://learn.microsoft.com/sharepoint/site-theme\" target=\"_blank\">Site theme</a></li><li><font color=\"#000000\" style=\"\"><a href=\"https://learn.microsoft.com/powershell/module/microsoft.online.sharepoint.powershell/set-spohidedefaultthemes?view=sharepoint-ps\" target=\"_blank\">Set-SPOHideDefaultThemes</a></font></li><ul>\n  </ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "526788"
    },
    {
      "Name": "Summary",
      "Value": "Two new Microsoft-designed dark themes (Dark Teal, Dark Blue) will be available for SharePoint sites starting mid-December 2025. They enhance visual experience, support accessibility, and can be applied via site settings without affecting existing themes or functionality. No admin action is needed before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187401",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-17T23:55:54.917Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-17T23:55:46Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft dark themes for SharePoint sites",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
