{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b><b>Introduction</b></b></p><p>We're simplifying the behavior of Copilot Chat in the Microsoft 365 Copilot app by removing the Microsoft 365 Copilot app from the scope of the <b>Pin Microsoft 365 Copilot Chat</b> admin setting.&nbsp;</p><p></p><p>Screenshot 1: <i><b>Pin setting</b> before and after this change</i></p>\n<p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/aeb6d2da-ae4e-4401-9214-c32af4321d59/635925c607df10e5d2804203601baf84ed4c40db.png\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<p>We're also making Copilot Chat availability state transparent in the Microsoft 365 Copilot app. Users blocked by Admin policy from Integrated apps will now see <b>Chat</b> in the Microsoft 365 Copilot app navigation. Their access will remain restricted, and their default landing page stays on&nbsp;<b>Search</b>. When these users access <b>Chat </b>in Microsoft 365 Copilot, a message will notify them that <b>Chat </b>is unavailable.&nbsp;&nbsp;</p>\n<p>Screenshot 2: <i>User experience in the M365 Copilot app for a user blocked from accessing Copilot</i></p>\n<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/984c2be2-62a6-461e-b36c-0bb3915745c8\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Users ineligible for Copilot due to age, region, or environment won’t see Chat in the app navigation. If users attempt to access the Chat URL directly, a pop-up message will appear letting them know they are not eligible to use Copilot.</p>\n<p><b><b>When this will happen:</b></b></p><p><b>General Availability:</b>&nbsp;Rollout will begin in late January 2026 and complete by late February 2026.</p>\n\n<p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:</b></p><ul>\n<li>Organizations using the Microsoft 365 Copilot app.</li>\n<li>Users without a Microsoft 365 Copilot license who have Chat pinning in the Microsoft 365 Copilot app disabled.</li>\n<li>Users blocked from Copilot by admin policy.</li>\n<li>Users ineligible for Copilot due to age, region, or environment restrictions.</li>\n</ul>\n<p><b>What will happen:</b></p>\n\n<ul>\n<li>The <b>Pin Microsoft 365 Copilot Chat</b> setting will no longer control Chat visibility in the Microsoft 365 Copilot app for unlicensed users.</li>\n<li>For users without a Copilot license, <b>Chat </b>appears as the app's default landing page.</li>\n<li>Users blocked by admin policy:\n<ul>\n<li>Will see <b>Chat</b> in navigation but remain restricted.</li>\n<li>The landing page remains on <b>Search</b>, while <b>Chat</b> displays a restriction notice.</li></ul></li><li>Users ineligible for Copilot (due to age, region, or environment):<ul><li>Won’t see <b>Chat</b> in navigation.</li><li>If they access <b>Chat </b>via direct URL, a pop-up message will appear letting them know they are not eligible to use Copilot.</li></ul></li>\n<li>No changes for licensed Microsoft 365 Copilot users or those with default pinning already set.</li>\n</ul>\n\n\n<p><b><b>What you can do to prepare:</b></b></p><ul>\n<li>No admin action is required.</li>\n<li>Optional:<ul>\n<li>Review documentation for managing the Microsoft 365 Copilot app and Copilot Chat:\n<ul>\n<li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-app-admin-settings\" target=\"_blank\">Microsoft 365 Copilot app features that admins can control | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/copilot/manage\" target=\"_blank\">Manage Microsoft 365 Copilot Chat | Microsoft Learn</a></li></ul></li></ul></li></ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot app will no longer use the \"Pin Microsoft 365 Copilot Chat\" setting to control chat visibility for unlicensed users. Blocked users see Chat in navigation but with restricted access, while ineligible users won't see Chat and get a pop-up if accessing directly. Rollout starts January 2026."
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1197289",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-16T01:59:14.32Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-15T23:51:25Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Chat visibility in the Microsoft 365 Copilot App",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
