{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 10, 2025: We have updated the timeline below. Thank you for your patience.</p><p>We’re introducing a new feature—Multi-admin notifications for Microsoft 365 Backup. This feature enables organizations to configure a centralized backup notifications list to ensure key stakeholders are regularly alerted about important backup events and routine actions. This feature enhances visibility and administrative awareness by sending email notifications to designated admins and stakeholders, helping protect against malicious or accidental changes to backup settings and restores.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=464993\" target=\"_blank\">464993</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early August 2025 (previously early July) and expect to complete by mid-August 2025 (previously mid-July).</p><p><b>How this will affect your organization:</b></p><p>This feature applies only to the Microsoft 365 Backup tool. If your organization is not currently using or planning to use this tool, no action is required.\n</p><p>After this rollout, if you are using Microsoft 365 Backup, you’ll be able to configure the notification list in one of four ways:\n</p><ul><li>Include all global and Microsoft 365 Backup admins\n</li><li>Include only global admins\n</li><li>Include only Microsoft 365 Backup admins\n</li><li>Define a custom list (individual users, distribution lists, or security groups)\n</li></ul><p>Notifications will be triggered for important backup events, such as:\n</p><ul><li>Backup disablement\n</li><li>Offboarding\n</li><li>Restore initiation\n</li><li>Policy updates\n</li></ul><p>You can also choose to receive notifications for routine backup job completions.\n</p><p>To access this feature:</p><ol><li>Go to the <i><a href=\"https://admin.microsoft.com/Adminportal/Home#/orgsettings/payasyougo/storage/Backup\" target=\"_blank\">Backup enablement</a></i><a href=\"https://admin.microsoft.com/Adminportal/Home#/orgsettings/payasyougo/storage/Backup\" target=\"_blank\"> page</a> in the Microsoft 365 admin center.\n</li><li>Configure the backup notification list to include the appropriate stakeholders.</li></ol><p>This feature will be available by default but requires configuration to activate notifications.\n\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your admins and/or users about this change and update internal documentation.</p><p><i>Learn more</i></p><p>\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/backup/backup-setup?view=o365-worldwide\" target=\"_blank\">Set up Microsoft 365 Backup | Microsoft Learn</a> (will be updated before rollout begins)</li><li><a href=\"https://learn.microsoft.com/microsoft-365/backup/backup-overview?view=o365-worldwide\" target=\"_blank\">Overview of Microsoft 365 Backup | Microsoft Learn</a> (will be updated before rollout begins)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "464993"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is introducing Multi-admin notifications for Microsoft 365 Backup, allowing centralized backup notifications for key stakeholders. The rollout starts in early August 2025 and completes by mid-August 2025. Organizations can configure notification lists for important backup events. No action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102791",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-10T19:33:43.557Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-25T00:16:11Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: New Multi-admin notifications for Microsoft 365 Backup",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
