{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>To help reduce accidental message sends, Outlook mobile is updating the placement of the Send button in the compose view. The button will move from the bottom toolbar to the header area, placing it in a less crowded location. This change supports a more intentional and error-free messaging experience for mobile users by minimizing the likelihood of accidental taps.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499900\" target=\"_blank\">499900</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide, GCC, GCC High, and DoD):&nbsp;</b>We will begin rolling out in early September 2025 and expect to complete by early March 2026.</p><p><b>How this will affect your organization</b></p><p>Once this change is deployed, users on <b>Outlook mobile clients (Android and iOS)</b> will see the Send button relocated to the top of the compose view. This update is designed to reduce accidental taps and improve usability. The feature will be <b>enabled by default</b>.</p><p>The following screenshots illustrate the updated Send button placement in the compose view on Outlook mobile.</p><p><i>Image 1 - New Send button placement in Outlook for iOS – full compose view:</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/c33e40e1-d34f-486a-896a-1d5c7ee1ff7b/09c2ffc6070adc243487147ca8cc483802da9856.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>Image 2 - New Send button placement in Outlook for iOS – small compose view:&nbsp;</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/58e48622-30d3-44ab-8a7e-b5a4892c0892/45010350909549feed85806c99cd2f43b101a58c.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>Image 3 - New Send button placement in Outlook for Android – full compose view:&nbsp;</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/6511f543-36b4-495a-be61-6ce85eea12e6/e146f0b843e6e9ca7f73bc3b4bbbaf8af87d43a9.png\" alt=\"user settings\" style=\"width: 400px;\"></p><p>\n</p><p>This change does <b>not affect Outlook on the web or desktop clients</b>.</p><ul><li><b>Add-ins and customizations: </b>This change does not affect existing add-ins or customizations in the compose view.\n</li><li><b>Accessibility tools and keyboard shortcuts:</b> There will be no impact.\n</li><li><b>Consistency: </b>The new placement is consistent across screen sizes and supported browsers.</li></ul><p><b>What you can do to prepare</b></p><p>No admin action is required.\n</p><p>We recommend notifying your users about this change and updating any relevant training materials or documentation to reflect the new button placement.</p><p>If applicable, test any custom add-ins or UI extensions in the compose view to ensure compatibility, although no known impact is expected.</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499900"
    },
    {
      "Name": "Summary",
      "Value": "The Send button in Outlook mobile (iOS and Android) will move from the bottom toolbar to the top header in the compose view to reduce accidental sends. This change, rolling out from September 2025 to March 2026, is enabled by default and does not affect desktop or web clients."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2026-04-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134176",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T23:04:31.967Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-12T23:04:26Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Outlook for iOS and Android: Send button relocated to reduce accidental sends",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
