{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Starting in October 2025, Microsoft is rolling out a refreshed licensing experience in Microsoft admin center. This update improves visibility into license assignments and introduces new tools to help administrators manage licenses more efficiently across their organization.</p><p><b>When this will happen:</b></p><p>General availability (Worldwide): Rollout begins mid-October 2025 and will complete by the end of the calendar year.</p><p><b>How this affects your organization:</b></p><p>Who is affected: Admins managing licenses in Microsoft admin center.</p><p>What will happen:</p><ul><li>A unified licensing view will show both user-based and group-based license assignments in a single list.</li><li>A new “Licensing Errors” tab will surface user-level errors from group-based license assignments, categorize them (e.g., missing prerequisites), and offer resolution options.</li><li>A new “Users without licenses” page will display users in licensed groups who haven’t received licenses due to insufficient availability.</li><li>Existing license assignments remain unchanged.</li><li>No impact to PowerShell scripts or API integrations.</li><li>The new interface will be enabled by default for all tenants.</li></ul><p><i>Screenshot 1 - The License List Page lists all products the customer has licenses for in the tenant:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/f8918f2f-7a84-45cd-85f3-7a36395250ed/0ca0b341134efc9b4cec99f0304efadb36db178b.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>&nbsp;</i></p><p><i>Screenshot 2 - View of the License Detail Page:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/1519ee31-2180-4f42-92bd-0ba18910ea6b/4445aba20fbb30d8b99adfdeaa652e8822c7405c.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>&nbsp;</i></p><p><b>What you can do to prepare:</b></p><p>No action is required. The new experiences will appear automatically.</p><p>You may wish to:</p><ul><li>Inform helpdesk staff of the upcoming interface changes.</li><li>Update internal documentation if you detail license management workflows.</li><li>Review the new licensing pages once available to familiarize yourself with the changes.</li></ul><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 2025, Microsoft admin center will launch a unified licensing view with new tools like a “Licensing Errors” tab and “Users without licenses” page, improving license management. Existing assignments and integrations remain unchanged. The update is automatic; admins should inform helpdesk and update documentation."
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1160187",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-26T18:16:42.947Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-26T18:16:34Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft admin center: New licensing experiences",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
