{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p></p><p><b>Planned maintenance: Cloud voicemail</b></p><p>We would like to inform you that the Microsoft cloud voicemail service is now migrating to a new infrastructure. As part of this transition, tenants who have allowlisted specific IP addresses for Cloud Voicemail and blocked all other IP addresses may experience exceptions in service connectivity.</p><p>If you encounter any issues or exceptions related to this migration, please open a support ticket with Microsoft for prompt assistance.</p><p><b>When this will happen</b></p><p>Migration began in mid-August 2025 and is projected to be completed by late September 2025.</p><p><b>How this will affect you organization</b></p><p>As part of this planned maintenance, Tenants who have allowlisted specific IP addresses for Cloud Voicemail and blocked all other IP addresses may experience exceptions in service connectivity.&nbsp;</p><p><br></p><p></p><p></p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is migrating the Cloud Voicemail service to new infrastructure from mid-August to late September 2025. Tenants who allowlist specific IPs for Cloud Voicemail may face connectivity issues. If problems occur, users should contact Microsoft support for assistance."
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1137595",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-18T22:57:09.013Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-18T22:56:37Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Planned maintenance: Cloud Voicemail is migrating to a new infrastructure",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
