{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 16, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We're introducing two updates to Microsoft Authenticator that simplify the sign-in experience and improve onboarding for Microsoft Entra users. These changes aim to reduce friction during same-device sign-ins and make it easier for users to get started with the app.</p><p><b>When this will happen</b></p><p>\n</p><p>\n</p><p><b>General Availability (Worldwide, GCC): </b>We will begin rolling out by<b> late September or&nbsp;early October</b>&nbsp;<b>2025 </b>(previously mid-September) and expect to complete by<b>&nbsp;mid-October 2025</b>&nbsp;(previously early October).</p><p><b>How this will affect your organization</b></p><p>Streamlined same-device number matching</p><ul><li>Today, users signing in on the same mobile device as their Microsoft Authenticator app often encounter a blocker: the notification appears over the sign-in screen, hiding the number they need to enter. This forces them to tap <b>“I can’t see the number”</b> to proceed.\n</li><li>With this update, that friction is removed. Users will no longer be required to enter a number when signing in on the same device. Instead, they’ll simply confirm the sign-in by tapping <b>Yes</b> or <b>No</b>.\n</li><li>On <b>Android</b>, all same-device sign-in flows will support this streamlined experience. No number entry required.</li><li>On<b> iOS</b>, users will also benefit from this change. When the SSO extension is involved, users will still need to switch to the Authenticator app to complete the sign-in, but number entry will not be required.\n</li><li>Users signing in from a different device will continue to use number matching as usual.</li></ul><p>Improved First Run Experience (FRX)</p><ul><li>The updated FRX consolidates privacy screens and prioritizes adding a <b>Microsoft Entra account</b> over a personal Microsoft account.\n</li><li>The <b>“Scan a QR code”</b> option will also be more prominently displayed to simplify account setup.</li></ul><p><b>What you need to do to prepare</b></p><p>No admin action is required. These changes will roll out automatically as users update their Microsoft Authenticator app.</p><p></p>\n<p><b>Compliance considerations </b></p><p>No known compliance impacts. Please review internally to ensure alignment with your organization's policies.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Authenticator will streamline same-device sign-ins by removing number entry, requiring only a Yes/No confirmation, and improve onboarding by prioritizing Microsoft Entra accounts and highlighting QR code scanning. Rollout begins late September to mid-October 2025, with no admin action needed."
    }
  ],
  "EndDateTime": "2025-11-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1117816",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-16T17:54:21.067Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-18T23:39:55Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Entra | Streamlined Same-Device Number Matching and First Run Experience (FRX) in Microsoft Authenticator",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
