{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:</b></p><p>We’re introducing a new Posts tab in the Microsoft Viva Communications dashboard. This enhancement provides corporate communicators and network administrators with a centralized location to manage communications across their lifecycle. The tab allows users to view drafts, scheduled posts, and published history, filter by ownership, and initiate new communications—all without leaving the dashboard.</p>\n\n<b>When this will happen:</b>  \n<p>We will begin rolling out in mid-September 2025 and expect to complete by the end of October 2025.</p>\n\n<b>How this affects your organization:</b>  \n<ul>\n</ul><p>The new Posts tab will be available to all Microsoft 365 tenants using Viva Engage. Published posts will be retroactively visible from May 2025 onward. </p><p>Users can:</p><ul><li>View drafts, scheduled posts, and published history.\n</li><li>Filter posts by ownership using the “Owned by” filter to view content created by themselves or others.\n</li><li>Initiate new communications directly from the dashboard.\n</li></ul><p>This feature is <b>on by default</b> and does not require admin configuration.</p><p><i>New Posts tab - Manage drafts, scheduled posts, and published history in one place:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/274232b0-9a59-4af1-a6fb-dfc8a1230427/2ba019f08df7cb4864ecaf1a437175647680a2d7.png\" style=\"width: 400px;\" alt=\"user settings\"></p><ul>\n</ul>\n\n<b>What you can do to prepare:</b>  \n<ul>\n<li>No action is required to enable the feature.</li>\n<li>Admins may wish to inform communications teams about the new functionality and encourage adoption.</li>\n</ul>\n\n<b>Compliance considerations:</b>  \n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva is adding a new Posts tab to the Communications dashboard, allowing users to manage drafts, scheduled, and published posts, filter by ownership, and create posts directly. Rolling out mid-September to October 2025, it’s on by default with no admin action needed."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1141953",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-25T22:48:51.523Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-25T22:48:45Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva : New Posts tab added to Communications dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
