{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Starting September 15, 2025, the <i>Tonal Rewrite</i> preview feature in Outlook Web Access (OWA) will be retired.&nbsp;</p><p><b>Why This Change?</b></p><p>The <i>Tonal Rewrite</i> experimental feature was introduced to help users improve sentences tone in emails by proactively offering AI-generated alternatives. While it has been a valuable tool for many, we are evolving our writing assistance capabilities to better align with how users write and revise content today using modern Copilot capabilities.</p><p><b>When this will happen</b></p><p>This feature will no longer be supported after September 15, 2025.</p><p>\n</p><p><b>How this affects your organization</b></p><p>Tonal Rewrite was introduced as an experimental feature to help users improve the tone of their email content using AI-generated suggestions. With its retirement, users will no longer see tonal suggestions in OWA.</p><p>Instead, users can leverage Copilot in Outlook, which offers:</p><ul><li><b>Context-aware rewriting: </b>Highlight text and generate refined alternatives.</li><li><b>Prompt-based editing: </b>Ask Copilot to rewrite, summarize, or adjust tone using natural language.</li><li><b>Iterative refinement: </b>Use <i>Fine tune your rewrite</i>&nbsp;to guide Copilot through multiple revision rounds.</li></ul><p>These enhancements provide greater flexibility and control, improving writing efficiency and confidence.</p><p><b>What you can do\n</b></p><p>No admin action is required.</p><p>We recommend encouraging users to explore the Auto-Rewrite capability via Copilot in Outlook:</p><ul><li>Highlight the text to revise.</li><li>Click the Copilot icon.</li><li>Select <i>Auto-Rewrite</i> or <i>Change Tone</i>.</li><li>Review and apply the suggestion.</li></ul><p>We appreciate your feedback and look forward to supporting your writing journey with even more powerful tools.</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Tonal Rewrite feature in Outlook Web Access will retire on September 15, 2025. Users will transition to using Copilot in Outlook for advanced, context-aware rewriting and tone adjustments, requiring no admin action. This change enhances writing flexibility and efficiency with AI-powered tools."
    }
  ],
  "EndDateTime": "2025-10-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1139486",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-22T00:05:12.773Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-22T00:05:06Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Feature Retirement: Tonal Rewrite in Outlook Web Access (OWA)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
