{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: Keep meetings efficient and on schedule with the new countdown timer in Microsoft Teams. This feature allows any meeting participant to add a visual timer (up to 100 minutes) directly within the meeting window, helping teams manage time effectively without external tools.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=494842\" target=\"_blank\">494842</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-June 2025 and expect to complete by early July 2025.</p><p>General Availability (Worldwide): We will begin rolling out early July 2025 and expect to complete by late July 2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, the new timer will be available by default and accessible from the <i>More </i>menu in the meeting controls. The timer is visible to all participants once started.</p><p>Key capabilities include:\n</p><ul><li>Set timers up to 100 minutes.\n</li><li>Start, pause, stop, reset, or cancel the timer.\n</li><li>Visual and audio alerts when the timer ends.\n</li><li>Color changes as time runs out to help speakers stay on track.\n</li><li>Option to hide the timer from personal view without affecting others.</li><li>The timer continues counting negatively after reaching zero, encouraging timely wrap-up of discussions.</li></ul><p>A meeting participant can open the timer by navigating to the <i>More </i>(three-dot) menu at the top of the screen, can set the timer duration up to 100 minutes, and start the timer:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6bd03ab5-079b-4d3f-b9d5-62433e335930\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Limitations:</p><ul><li>Available only in scheduled meetings.\n</li><li>Not supported in instant meetings, Teams calls, webinars, town halls, or structured meetings with defined roles.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>\n</p><p>This rollout will happen automatically with no admin action required. No admin controls are available for this feature. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494842"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a countdown timer feature for meetings, allowing participants to set timers up to 100 minutes to manage time effectively. Rolling out from mid-June to late July 2025, the timer includes visual and audio alerts, color changes, and continues counting negatively after zero. Available only in scheduled meetings. No admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102785",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-25T00:13:38.01Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-25T00:13:09Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Countdown timer for Teams Meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
