{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:</b></p><p>We’re enhancing Microsoft Secure Score by introducing new improvement actions based on Microsoft Defender for Identity posture recommendations for PingOne. These updates provide a more accurate reflection of your organization’s identity security posture and help strengthen your overall security configuration.</p><p><b>When this will happen:</b></p><ul><li>Public Preview: Rollout begins in late October 2025 and completes by mid-November 2025.</li><li>General Availability (Worldwide, GCC, GCC High, and DoD): Rollout begins in late November 2025 and completes by mid-December 2025.</li></ul><p><b>How this affects your organization:</b></p><p>Who is affected: Tenants with a PingOne connector configured for Microsoft Defender for Identity.</p><p>What will happen:</p><p>New posture recommendations will appear in <i>Microsoft Secure Score</i> as improvement actions:</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/96b77189-0b55-41fa-9754-7b6949595fdf/0a89be155db746aa06931f2c4c771ac7d06ec939.png\" style=\"width: 400px;\" alt=\"user settings\"></p><ul><li>Limit the number of PingOne accounts with organization admin role</li><li>Assign multi-factor authentication for PingOne privileged user accounts: <p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/8c587983-6275-4514-bc02-f9ea6141f028/e0c86d3639106eda058b39e358889044819d594f.png\" style=\"width: 400px;\" alt=\"user settings\"></p></li><li>Change password for PingOne privileged user accounts</li><li>Remove stale PingOne privileged accounts</li><li>High number of PingOne accounts with a privileged role assigned</li></ul><p>These recommendations are enabled by default and require no configuration changes.</p><p><b>What you can do to prepare:</b></p><ul><li>No admin action is required before or after rollout.</li><li>Review your current identity configuration to assess potential impact.</li><li>Notify relevant administrators and update internal documentation as needed.</li><li>Regularly review Microsoft Secure Score to monitor and act on new improvement suggestions.</li></ul><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Secure Score will add new improvement actions based on Microsoft Defender for Identity recommendations for PingOne, rolling out from October to December 2025. These default-enabled actions target PingOne privileged account security, requiring no admin changes but encouraging review and monitoring by organizations with PingOne connectors."
    }
  ],
  "EndDateTime": "2026-01-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1155429",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-18T23:50:27.207Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-18T23:50:20Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity: New recommendations added to Microsoft Secure Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
