{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re updating the user interface for Copilot Chat in Outlook to improve usability and streamline navigation. The navigation pane will move from the right side to the left, aligning with layout patterns across Microsoft 365 apps. This update maintains access to agents and conversation history while introducing a new <i>All Conversations</i> page for a comprehensive view of chat history.\n</p><p><b>When this will happen\n</b></p><ul><li>General Availability (Worldwide): Rollout begins mid-August 2025 and is expected to complete by mid-August 2025</li></ul><p><b>How this affects your organization\n</b></p><p>This update introduces a redesigned navigation pane for Copilot Chat in Outlook. Previously located on the right side of the interface, the pane will now appear on the left side, aligning with familiar layouts used in apps like Teams and OneNote.</p><p><i>Figure i. Before this update</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/3269f150-3dd5-4da3-b62c-90129b650d1d/f353c1da38a6af7077e795eec71e0e06ef3b9815.png\" style=\"width: 400px;\" alt=\"user settings\"><i><br></i></p><p><i>Figure ii. After this update</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/80173885-0802-4bca-b60e-18a8e8882f9d/3f1838e75c4ff01c481103a761c850812fc31062.png\" style=\"width: 400px;\" alt=\"user settings\"><i><br></i></p><p>\n</p><p>The left-side navigation pane includes:\n</p><ul><li>Copilot agents: Access to available AI assistants.\n</li><li>Conversation history: A scrollable list of recent chats.\n</li><li>New <i>All Conversations page</i>: A centralized view of all past interactions, searchable and filterable.\n</li></ul><p>This repositioning is intended to improve discoverability and reduce cognitive load. The feature is on by default and does not require admin configuration. Users may need a brief adjustment period, but the change is designed to enhance productivity and consistency across Microsoft 365 experiences.\n</p><p><b>What you can do to prepare\n</b></p><p>No admin action is required. We recommend informing users of the upcoming UI change to reduce confusion and potential help desk inquiries.</p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Outlook Copilot Chat interface is updated with the navigation pane moved from right to left, aligning with other Microsoft 365 apps. It includes access to agents, conversation history, and a new All Conversations page. The rollout begins mid-August 2025, requires no admin action, and aims to improve usability."
    }
  ],
  "EndDateTime": "2025-09-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1138240",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-20T00:34:41.083Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-20T00:34:24Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Updated Copilot Chat interface with new conversation view",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
