{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 11, 2025: We have updated the timeline. Thank you for your patience.\n</p><p><b>What and Who</b></p><p>To enhance the security and integrity of Microsoft Teams meetings, we are introducing a new feature that validates Teams meeting join URLs. This update helps ensure that meeting links are not altered or rewritten by security products in ways that could render them unusable or flagged as malicious. This is applicable only when user Joins a meeting from Teams old calendar.</p><p><b>Rollout Schedule</b></p><p></p><ul><li><b>Worldwide:</b> September 30, 2025</li>\n<li><b>GCC, GCC High, DoD:</b> November 30, 2025</li>\n</ul>\n\n<p></p><p><b>Impact on Your Organization</b><b><br></b></p><ul><li><b>Who is affected:</b><ul><li>Organizations that use security solutions to inspect or rewrite URLs, as well as users who join Microsoft Teams meetings through the Teams platform, will be affected by this update.</li></ul></li></ul><p><b>What will happen:</b></p><ul><li><b>Users using New Calendar App:<br></b>\n  <ul>\n    <li>For new calendar app in Teams, Meeting joins will not be blocked instead users will be redirected to a outlook safelinks provider and again redirected to the destination rewritten Join url\n</li><li>This feature is enabled by default and does not require admin configuration.\n</li><li>For more information on New calendar in app in Teams follow this link: <a href=\"https://support.microsoft.com/en-us/office/get-started-with-the-new-calendar-in-microsoft-teams-98f3b637-5da2-43e2-91b3-f312ab3e4dc5\" target=\"_blank\">https://support.microsoft.com/en-us/office/get-started-with-the-new-calendar-in-microsoft-teams-98f3b637-5da2-43e2-91b3-f312ab3e4dc5</a>&nbsp;</li></ul></li></ul><p style=\"margin-left: 50px;\"><b><u>Old Teams Calendar App:</u></b></p><ul></ul><p></p><ul><li>Microsoft Teams will validate join URLs to ensure they have not been modified.</li><li>If a join URL is rewritten or altered by a security product, it may be marked as malicious.\n</li><li>Users will be prevented from joining meetings if URLs are not in their original format.\n</li><li>This feature is enabled by default and does not require admin configuration.\n</li><li>Microsoft's advanced email security platform, including Safe Links (URL inspection/rewriting), will not be impacted by this update.</li><li><b>Safe Links Behavior:</b><ul style=\"\"><li style=\"\">Does not rewrite the URLs behind the “Join Teams meeting” or “Join” buttons.</li><li style=\"\">Only rewrites URLs within the meeting invitation body.\n</li><li style=\"\">Any temporary rewriting (if applied) is removed by Exchange Online upon send/receive.\n</li></ul></li><li><b>Outlook Add-in Behavior\n</b><ul><li>If meeting links are rewritten via Outlook add-ins during meeting creation, there is no impact.\n</li></ul></li><li><b>Potential impact:\n</b><ul><li>This change may affect third-party security services that rewrite both the body URLs and the “Join” button URLs.\n</li></ul></li><li><b>Action required:\n</b><ul style=\"\"><li style=\"\">No action is needed for customers using Safe Links. There is no requirement to add Teams meeting URLs to the Safe Links “allowed list.”\n</li><li style=\"\">For the customer using 3P solutions, they must ensure Teams join links are excluded from rewriting.\n</li><li style=\"\">Compliance Considerations: No compliance considerations identified, review as appropriate for your organization.\n</li></ul></li><li><b><u>Workaround</u>:</b> Switch to New calendar to unblock users from joining the Meeting.</li></ul><p><b>Platforms affected\n</b></p><ul><li>Only Microsoft Teams affected, other platforms like outlook web and win32, outlook mac remain unaffected.</li></ul>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will validate meeting join URLs starting September 30, 2025, to prevent altered or rewritten links from blocking access, affecting users of the old Teams calendar app. The new calendar app redirects safely without blocking. No admin action is needed for Safe Links users; third-party URL rewriting must exclude Teams links."
    }
  ],
  "EndDateTime": "2026-01-12T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1120871",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-11T15:40:58.297Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-24T00:28:12Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Important Update: Teams Meeting Join URL Validation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
