{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of our ongoing security efforts, we have made a recent change to Certificate-Based Authentication (CBA) behavior for Exchange ActiveSync. The enhancement is designed to support TLS 1.3, strengthening security and reliability for our customers. \n</p><p>With this change all Exchange ActiveSync CBA traffic will be routed to new, dedicated endpoints based on tenant location\n</p><p><b>How this will affect your organization:</b> \n</p><p>This change has already begun to roll out in the worldwide multi-tenant cloud and will start rolling out in other clouds starting November 2025. As a result of this change all Exchange ActiveSync CBA traffic will be routed to new, dedicated endpoints based on tenant location: \n</p><ul><li>Multi-tenant (Worldwide and GCC): outlook-cba.office365.com \n</li><li>DoD: outlook-dod-cba.office365.us \n</li><li>GCC-High: outlook-cba.office365.us</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>For most Exchange ActiveSync clients, this change will be seamless. The client traffic will be implicitly redirected to the new CBA endpoints without any user action required. \n</p><p>However, if your organization uses a Secure Email Gateway (SEG) or similar gateway that filters or inspects ActiveSync traffic, you may need to update your firewall or gateway configuration to allow traffic to and from the new CBA endpoints listed above.  \n</p><p>If you have questions or concerns on this change, please contact your SEG vendor.  We appreciate your cooperation and commitment to maintaining a secure environment.  \n</p><p>Learn more:</p><p><a href=\"https://aka.ms/EASTLS13\" target=\"_blank\">Upcoming TLS Changes for Certificate Based Auth ActiveSync Traffic.</a>&nbsp;</p><p><a href=\"https://datatracker.ietf.org/doc/html/rfc8446\" target=\"_blank\">RFC 8446 - The Transport Layer Security (TLS) Protocol Version 1.3</a> \n</p><p>\n</p>\n<p>Specified at <a href=\"https://learn.microsoft.com/openspecs/exchange_server_protocols/ms-ashttp/7b7fabb9-910c-4f1c-9396-57d7ca579a31\" target=\"_blank\"><b>MS-ASHTTP</b>: Authorization | Microsoft Learn ActiveSync official documentation</a>, EAS requests without authorization header will be treated as a CBA request.&nbsp;&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Exchange ActiveSync Certificate-Based Authentication now supports TLS 1.3, routing traffic to new tenant-location-based endpoints. Most clients will redirect seamlessly, but organizations using Secure Email Gateways may need to update firewall settings. Rollout began globally, expanding to other clouds by November 2025."
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1169566",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-10T15:51:29.637Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-10T15:51:20Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Exchange ActiveSync TLS 1.3 Certificate Based Authentication Change",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
