{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 12, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re introducing a new way to quickly summarize email threads in Outlook using Copilot chat. With a single click, users can generate a summary of the current email conversation directly from the reading pane. This feature enhances productivity by helping users quickly understand long or complex threads.\n</p><p>This capability will be available to users with Copilot chat enabled—even if they don’t have a Microsoft 365 Copilot license—provided they have pinned Copilot chat to the navigation bar. It will be available in both Classic and New Outlook for Windows.</p><p><b>When this will happen</b></p><p>Targeted Release (Worldwide): We will begin rolling out in late August 2025 (previously early August) and expect to complete by mid-September 2025 (previously mid-August).</p><p>General Availability (Worldwide)<b>: </b>We will begin rolling out in mid-September 2025 (previously mid-August) and expect to complete by mid-November 2025 (previously mid-October).</p><p><b>How this will affect your organization</b></p><ul><li>Users without a Microsoft 365 Copilot license who have Copilot chat and pinning enabled will see a new <b>Summarize</b> button in the reading pane. Selecting this button will open Copilot chat and generate a summary of the current email thread.\n</li><li>This feature is <b>on by default for eligible users</b> and does not require additional configuration.</li><li>Usage can be viewed in the Microsoft 365 admin center.\n</li><li>Audit logging may apply if summaries are saved or shared.\n</li><li>Data is processed according to Copilot chat’s privacy terms.</li></ul><p><b>What you can do to prepare\n</b></p><p>Admins can manage access to the Summarize feature by controlling access to Copilot chat:\n</p><ul><li>Use policy settings and Entra ID group membership to manage access.\n</li><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/pin-copilot-chat-navbar\" target=\"_blank\">Pin Copilot chat</a> to the navigation bar to enable the feature.</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/pin-copilot-chat-navbar\" target=\"_blank\">Pin Microsoft 365 Copilot Chat to the navigation bar | Microsoft 365 Copilot | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/activity-reports/microsoft-365-copilot-usage?view=o365-worldwide\" target=\"_blank\">Microsoft 365 reports in the admin center – Microsoft 365 Copilot usage | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/copilot/privacy-and-protections\" target=\"_blank\">Privacy and protections | Copilot | Microsoft Learn</a></li><li>Entry point overview -&nbsp;<a href=\"https://support.microsoft.com/office/summarize-an-email-thread-with-copilot-in-outlook-a79873f2-396b-46dc-b852-7fe5947ab640\" target=\"_blank\">(video) Summarize an email thread with Copilot in Outlook | Copilot in Outlook | Microsoft Support</a></li></ul><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change store new customer data, if so, where, and is the data cached or permanently stored?</td><td>The AI-generated summary data is processed in the Microsoft cloud. It may be temporarily stored or cached to support the summarization experience, but it is not permanently retained unless explicitly saved by the user.</td></tr><tr><td>Does the change alter how existing customer data is processed, stored, or accessed (e.g. documents, emails, chats, etc.), if so how and to what extent?</td><td>The feature uses existing email content to generate summaries via Copilot chat, which introduces a new processing layer for user data. This does not alter the original data but adds a temporary AI-generated output.</td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data, if so summarize changes?</td><td>This feature introduces a new AI-powered summarization capability via Copilot chat that interacts with email threads to generate contextual summaries.</td></tr><tr><td>Does the change provide users any new way of interacting with generative AI, if so how?</td><td>Users can now interact with Copilot chat directly from the reading pane to generate summaries of email threads, even without a Microsoft 365 Copilot license (if Copilot chat and pinning are enabled).</td></tr><tr><td>Does the change modify, interrupt, or disable any of the following capabilities (Purview): Data Loss Prevention (DLP), eDiscovery, retention policies, etc.?&nbsp;</td><td>While the feature does not disable existing Purview capabilities, administrators should review DLP, eDiscovery, and retention policies to ensure they apply appropriately to AI-generated content, especially if summaries are saved or shared.</td></tr><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities e.g. Purview or admin reporting, if so summarize the changes?</td><td>If summaries are saved or shared, they may be subject to audit logging and reporting through Microsoft Purview. Admins should verify whether usage of the Summarize feature is captured in audit logs.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?&nbsp;</td><td>Access to Copilot chat and the Summarize feature can be managed via policy settings and Entra ID group membership.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?&nbsp;</td><td>Users with access to Copilot chat and pinning can choose whether to use the Summarize button in Outlook.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498320"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook will roll out a Copilot chat feature to summarize email threads with one click, available to users with Copilot chat pinned, even without a Copilot license. Deployment starts late August 2025, is on by default, and admins can manage access via policies and Entra ID groups."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-12-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1124564",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T22:05:13.203Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T00:01:40Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Copilot chat now available to summarize emails for more users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
