{
  "ActionRequiredByDateTime": "2025-11-27T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To streamline data export processes and improve security, Microsoft is <b>retiring the Viva Insights export capability</b> <b>via Microsoft Graph Data Connect (MGDC)</b>. This change does not impact other export alternatives via Viva Insights.</p>\n\n<b>When this will happen</b><ul>\n<li>Onboarding of new customers and scenarios to Viva Insights export via MGDC will stop 30 days from this announcement.</li>\n<li>Existing customers will retain access to current MGDC data export pipeline until full retirement. Final timelines will be shared in future communications.</li>\n</ul>\n\n<b>How this affects your organization</b><p><i>Who is affected:</i> Organizations using Viva Insights export via Microsoft Graph Data Connect.</p>\n<p><i>What will happen:</i></p>\n<ul>\n<li>Starting in late&nbsp;<b>November 2025</b>, onboarding of new customers and Viva Insights datasets to MGDC will no longer be available.</li>\n<li>Existing users will retain access to current datasets until full retirement.</li>\n<li>Customers are encouraged to transition to supported export alternatives:</li>\n<ul>\n<li><b>Viva Insights Power BI Connector to Microsoft Fabric</b></li>\n<ul>\n<li>This connector allows you to export Viva Insights data into Microsoft Fabric for advanced analysis and reporting. Learn more:<a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/power-bi-connector\" target=\"_blank\">Export query data using the Power BI connector</a></li><li>All Viva Insights query types supported: Yes</li>\n<li>Automated exports: Yes</li>\n<li>Row-level data export: Yes</li>\n<li>Charges: Yes (Fabric usage). Learn more:&nbsp;<a href=\"https://learn.microsoft.com/fabric/data-factory/pricing-dataflows-gen2\" target=\"_blank\">Dataflow Gen2 pricing for Data Factory in Microsoft Fabric</a></li><li>&nbsp;Setup: Refer to setup steps outlined in <a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/power-bi-connector#use-the-power-bi-connector-with-microsoft-fabric-dataflows\" target=\"_blank\">Export query data using the Power BI connector</a>.</li><li>Access query results: Refer to <a href=\"https://learn.microsoft.com/fabric/data-factory/dataflow-gen2-data-destinations-and-managed-settings\" target=\"_blank\">Dataflow Gen2 data destinations and managed settings</a>.</li></ul><li>Flat file export option available.</li><ul><li>CSV Export</li></ul></ul></ul><p style=\"margin-left: 125px;\">Note: Customers who prefer a flat file export can use the CSV export feature. Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/query-results#download-and-import-results-in-excel\" target=\"_blank\">Download and import results in Excel</a>.</p><p><b>What you can do to prepare</b></p><ul><li>If you are an existing MGDC customer, select an alternative export method.</li><li>To offboard from MGDC-based export:<ol><li>Check access to output folders from previous runs.</li><li>Stop and delete all Data Factory Copy activity pipelines.</li><li>Delete MGDC app registrations.</li><li>MGDC admin should deselect “Viva Insights” from enabled datasets:<ul><li>In <i><a href=\"https://admin.microsoft.com/adminportal\" target=\"_blank\">Microsoft 365 Admin portal</a></i>, go to <i><b>Settings &gt; Org setting</b></i>s.</li><li>Under <i>Services</i>, select <b><i>Microsoft Graph data connect</i></b>.</li><li>Deselect <i><b>Viva Insights</b></i>.</li></ul></li></ol></li></ul><p>For additional questions, raise a support ticket.</p><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/fabric/data-factory/dataflow-gen2-data-destinations-and-managed-settings\" target=\"_blank\">Dataflow Gen2 data destinations and managed settings | Data Factory | Microsoft Fabric | Microsoft Learn</a><br></li><li><a href=\"https://learn.microsoft.com/fabric/data-factory/pricing-dataflows-gen2\" target=\"_blank\">Dataflow Gen2 pricing for Data Factory in Microsoft Fabric | Data Factory | Microsoft Fabric | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/query-results#download-and-import-results-in-excel\" target=\"_blank\">Download and import results in Excel - Access query results and modify existing queries | Viva Insights | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/dynamic-metric-load\" target=\"_blank\">Export Viva Insights data using MGDC | Viva Insights | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/power-bi-connector\" target=\"_blank\">Export query data using the Power BI connector | Viva Insights | Microsoft Viva | Microsoft Learn</a></li></ul><p>Compliance considerations</p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed (e.g. documents, emails, chats, etc.), if so how and to what extent?</td><td>Yes. This change retires the Microsoft Graph Data Connect (MGDC) export method for Viva Insights, which alters how customers access and export their existing datasets. Customers must transition to alternative export methods such as the Power BI Connector or CSV export.</td></tr><tr><td>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights), if so summarize the changes?</td><td>Yes. The retirement of MGDC affects how users export personal data from Viva Insights. Users will need to use supported alternatives like the Power BI Connector or CSV export to access and manage their data.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes. Admins can manage dataset access by deselecting “Viva Insights” in the Microsoft Graph Data Connect settings within the Microsoft 365 Admin Portal. This control can be scoped using Entra ID group membership.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Admins can disable the MGDC export feature by offboarding and updating settings in the Microsoft 365 Admin Portal. End users cannot enable or disable the feature directly.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring Viva Insights export via Microsoft Graph Data Connect (MGDC). New onboarding stops 30 days after the announcement; existing users keep access until full retirement, starting late November 2025. Customers should switch to the Power BI Connector to Microsoft Fabric or CSV export. Admins must update settings in the Microsoft 365 Admin Portal."
    }
  ],
  "EndDateTime": "2026-01-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1180889",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-27T22:46:55.9Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-27T22:46:42Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Viva Insights: Retirement of Export via Microsoft Graph Data Connect (MGDC)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
