{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>Community admins can now broadcast live events using the enhanced Microsoft Teams town hall experience, a more powerful and flexible way to connect with your audience. Teams town hall brings forward familiar features from Teams live events while introducing new advanced capabilities designed to support high-quality, large-scale event delivery with greater ease. \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499896\" target=\"_blank\">499896</a>.\n</p><p><b>When this will happen\n</b></p><p>General Availability (Worldwide): We will begin rolling out on early September 2025 and expect to complete by mid-September 2025.\n</p><p><b>How this affects your organization\n</b></p><p>Community admins will find Teams town hall as a new default option when creating live events, alongside the legacy Teams live events. You can choose between the two options based on your needs. Users may benefit from a higher-quality viewing experience and additional engagement options when events are hosted using the new Teams town hall experience.\n</p><p><b>What you can do to prepare\n</b></p><p>Once available, Teams town hall will appear by default as an option for community admins when creating live events in your community, alongside the legacy Teams live events option. This update requires no configuration or action from admins or tenants.&nbsp;</p><p><b>Compliance considerations</b></p><h3><table border=\"1\" style=\"color: rgb(0, 0, 0); font-family: sans-serif; font-size: 14px;\"><tbody><tr><th>Compliance Area</th><th>Explanation</th></tr><tr><td>New communication method</td><td>The enhanced Teams town hall introduces a new way for community admins to broadcast live events, offering advanced capabilities for large-scale communication.</td></tr><tr><td>Admin control</td><td>The feature is enabled by default and appears as a selectable option for community admins. While no configuration is required, admins can choose between legacy Teams live events and the new Teams town hall experience.</td></tr><tr><td>User control</td><td>Community admins can choose whether to use the new Teams town hall or continue with legacy Teams live events when creating live events.</td></tr></tbody></table></h3>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499896"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is rolling out an enhanced Teams town hall experience in Viva Engage for live events starting September 2025. Community admins can choose between the new Teams town hall and legacy live events, offering higher-quality, large-scale event broadcasting with no required admin configuration."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-10-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1136040",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-15T22:48:51.007Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-15T22:48:45Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Live events using Microsoft Teams town hall in Viva Engage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
