{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 15, 2025: We have updated the timing of this change to provide additional time for customers to take action as appropriate. Thank you for your feedback.</p><p>We're making some changes to Exchange Web Services (EWS).</p><p>Starting June 30, 2026, we will start to block EWS access for all mailboxes without license rights to EWS. This is another step in our ongoing commitment to enhance the security and control mechanisms of EWS.</p><p><b>How this will affect your organization:</b></p><p>The impacted licenses are:\n</p><p>\n</p><ul><li>Exchange Online Kiosk</li><li>Microsoft 365 and Office 365 F1</li><li>Microsoft 365 and Office 365 F3</li></ul><p>As stated in the Service Descriptions, these licenses do not provide access to mailboxes via EWS, but these restrictions were never enforced. With this change, EWS access for users with only these license types will be blocked.</p><p><b>What you need to do to prepare:</b></p><p>If you wish these users to continue to use EWS, and your users are licensed with one of these noted above, you’ll need to assign a new license, one containing EWS access rights. For example, you could assign an Exchange Online Plan 1 or 2 license, or a Microsoft 365 or Office 365 E3 or E5 license.\n</p><p>\n</p><p>Starting June 30, 2026, requests to use EWS without a suitable license will result in a HTTP 403 response. </p><p>Learn more: <a href=\"https://aka.ms/EWSLicenseChanges\" target=\"_blank\">Update to EWS Access for Kiosk / Frontline Worker Licensed Users</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting June 30, 2026, EWS access will be blocked for mailboxes licensed only with Exchange Online Kiosk, Microsoft 365/Office 365 F1, or F3. To maintain EWS access, users must be assigned licenses with EWS rights, such as Exchange Online Plan 1/2 or Microsoft 365 E3/E5."
    }
  ],
  "EndDateTime": "2026-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191578",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-15T19:15:20.717Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-02T20:55:40Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Update to EWS Access for Kiosk / Frontline Worker Licenses",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
