{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re pleased to announce the rollout of the Microsoft Entra ID Free subscription, an initiative designed to enhance Microsoft’s service offerings and improve your experience with Microsoft.&nbsp;</p><p>What is Microsoft Entra ID Free?\n</p><p style=\"\"><a href=\"https://aka.ms/MicrosoftEntraIdFree\" target=\"_blank\">Microsoft Entra ID Free</a> is a no-cost subscription that represents the Entra Tenant you own and use to access Microsoft products and services. Over the coming weeks, this subscription will appear under <a href=\"https://aka.ms/M365Subscriptions\" target=\"_blank\" style=\"\">Billing &gt;&nbsp;Your Products</a> in the Microsoft 365 Admin Center, and <a href=\"https://aka.ms/AzurePortalSubs\" target=\"_blank\" style=\"\">Cost Management + Billing &gt; Products + services &gt; All billing subscriptions</a> in the Microsoft Azure portal. This subscription cannot be modified or deleted while you’re an active customer with Microsoft.</p><p>No action is required from you.</p><p>Why are we doing this?\n</p><p>As part of Microsoft’s <a href=\"https://aka.ms/MSFTSecureFutureInitiative\" target=\"_blank\">Secure Future Initiative</a>, we’re improving how ownership of Microsoft Entra tenants is tracked. By linking tenant ownership to a Microsoft billing account, customers can clearly see which tenants they own. The Microsoft Entra ID Free subscription will manage new tenants under the same billing account, helping customers keep an inventory and prove ownership if administrative access is lost.&nbsp;</p><p>If you have questions or need help, contact <a href=\"https://go.microsoft.com/fwlink/?linkid=2083458\" target=\"_blank\">support</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): The rollout is scheduled to begin early to mid-October and will be completed over phases.</p><p><b>How this will affect your organization:</b></p><p>A new no-cost subscription, Microsoft Entra ID Free, will appear underneath your account. There is no impact to your billing, or existing functionality.</p><p><b>What you need to do to prepare:</b>\n</p><p>There is no action required.</p><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is rolling out the no-cost Microsoft Entra ID Free subscription to track Entra tenant ownership via billing accounts. It will appear in Microsoft 365 and Azure portals starting October, requires no action, does not affect billing or functionality, and helps manage tenant ownership securely."
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1156361",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-20T05:10:16.257Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-20T05:10:00Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Update: Rollout of the Microsoft Entra ID Free subscription",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
