{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>The <b>Learning agent</b> is now available in Frontier. This agent helps employees build skills through personalized microlearning and structured learning experiences embedded directly into Microsoft 365 tools. These experiences include personalized task-based Copilot tips to augment workflows, learning recommendations tailored to user skills, curated learning paths, and interactive role-play exercises powered by LinkedIn Learning.</p>\n<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fb85de82-4a01-4754-901f-d618ce1f525f\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490154\" target=\"_blank\">490154</a>.</p><p><b>About Frontier</b></p>\n<p>The Frontier program gives customers early, hands-on access to experimental Microsoft 365 Copilot innovations in their own environment. The agents and AI features designated as “Frontier” are previews, built for evaluation and feedback purposes. As these features are still in development, their availability and capabilities may change at any time.</p>\n<p><b><b>When this will happen:</b></b></p>\n<p><b>Frontier Availability (Worldwide):</b> Available now.</p>\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> Customers with Microsoft 365 Copilot and the Microsoft 365 Copilot in <b>Productivity Apps service plan</b> (excluding faculty and student SKUs).</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Learning agent (Frontier) will be available to deploy in the <b>Copilot Control Center</b> within Microsoft 365 admin center.</li>\n<li>Users will be able to install and use the <b>Learning agent</b> within Microsoft 365 Copilot or Teams.</li>\n<li>Admins have controls to manage deployment, including install, restrict, or remove the agent.</li>\n<li>Feature is opt-in; admins must deploy or allow access.</li>\n</ul>\n</li>\n</ul>\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Ensure People Skills is set up in your tenant: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-overview\" target=\"_blank\">People Skills Overview</a></li>\n<li>Confirm licensing: Users must have an active Microsoft 365 Copilot license.</li>\n<li>Approve or deny access at tenant or user level in Microsoft Admin Center under <b>Copilot </b>&gt; <b>Settings</b>.</li>\n<li>Review admin controls for agents: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide#settings-for-agents\" target=\"_blank\">Settings for Agents</a></li>\n</ul>\n<p>Frontier features are experimental and subject to change. Participation in the Frontier program is optional.</p>\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490154"
    },
    {
      "Name": "Summary",
      "Value": "The Learning agent is now available in Frontier, offering personalized microlearning and Copilot tips within Microsoft 365 tools. It’s deployable via the Copilot Control Center, requires Microsoft 365 Copilot licensing, and is opt-in for admins. Frontier features are experimental and subject to change."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-12-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187676",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-26T18:25:55.117Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T16:17:27Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Learning agent in Frontier",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
