{
  "ActionRequiredByDateTime": "2025-11-01T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 2, 2025: We have updated the title. Thank you for your patience.</p><p><b><b>Introduction</b></b></p><p>We will soon introduce a new limit on dynamic distribution groups (DDGs) in <i>Microsoft Exchange Online</i>. Each organization will be limited to a maximum of 3,000 DDGs. After this limit is reached, admins will need to remove existing DDGs before creating new ones.&nbsp;</p><p><b><b>When this will happen:</b></b></p><p>General Availability: We will begin rolling out in early November 2025 and expect to complete by mid-November 2025.</p><p><b><b>How this will affect your organization:</b>\n</b></p><p>If your organization has fewer than 3,000 DDGs, this change will not impact you. However, after your organization reaches this limit, you will not be able to create new DDGs until some existing DDGs are removed.\n</p><p>This change will be<b> on by default</b> and cannot be turned off by admins.</p><p><b><b>What you need to do to prepare:</b>\n</b></p><ul><li>The enforcement of the DDG limit will happen automatically by the specified date with no admin action required before the rollout. </li><li>You may want to notify your admins about this change and update any relevant documentation.\n</li><li>We recommend reviewing the usage of Dynamic Distribution Groups (DDGs) in your organization and removing any DDGs that are no longer needed. </li><li>You can use the Dynamic distribution groups report in the<i> Exchange admin center (EAC) </i>to see the number of DDGs in your organization and insights into their usage. </li><li>To access this report, go to the <b>EAC &gt; Reports &gt; Mail flow &gt; Dynamic distribution group report</b>. </li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/exchange/monitoring/mail-flow-reports/mfr-dynamic-distribution-groups-report\" target=\"_blank\">Dynamic Distribution Groups report in the new EAC in Exchange Online | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/office365/servicedescriptions/exchange-online-service-description/exchange-online-limits#dynamic-distribution-group-limits\" target=\"_blank\">Exchange Online limits - Service Descriptions | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange Online will limit each organization to 3,000 dynamic distribution groups (DDGs) starting November 2025. Once the limit is reached, new DDGs cannot be created until existing ones are removed. The change is automatic and cannot be disabled. Admins should review and manage DDG usage accordingly."
    }
  ],
  "EndDateTime": "2025-12-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1163757",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-02T16:45:19.393Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-01T22:34:18Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online: New limit for dynamic distribution groups (DDGs)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
