{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 10, 2025: We have updated the timeline. Thank you for your patience.</p><p><b><b>Introduction</b></b></p><p>We’re introducing a new <b>pay-as-you-go (PAYG) experience</b> in the <b>Microsoft 365 Admin Center (MAC)</b>. This update provides a centralized way to manage metered services such as <b>Microsoft 365 Backup</b> and <b>Copilot </b>under the <b>Billing node</b>.</p>\n\n<p><b><b>When this will happen:</b></b></p><p><b>General Availability:</b></p>\n<ul>\n<li>Available to new <b>Microsoft 365 Backup </b>and all&nbsp;<b>Copilot customers</b> starting December 15, 2025 (previously early December).</li>\n<li>Migration path for existing <b>Backup customers</b> will be announced later.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:</b> Admins in Worldwide and GCC environments managing Microsoft 365 Backup and Copilot PAYG services.</p><p><b>What will happen:</b></p>\n<ul>\n<li>A new <b>PAYG page</b> will appear under the<b> Billing node</b> in MAC.</li>\n<li>Admins can create and manage billing policies directly in MAC.</li>\n<li>Services can be linked to billing policies, with support for departmental billing. <i>Note:</i> departmental billing for <b>Backup customers</b> will become available in Q1 2026.</li>\n<li>Budgets can be set, and notifications triggered when thresholds are met.</li>\n<li>Usage and spending can be viewed at the billing policy level.</li>\n<li>Subscriptions and resource groups can be created in MAC without navigating to Azure.</li>\n<li>PAYG setup for other services remains under <b>Org Settings</b> &gt; <b>PAYG </b>until transitioned.</li>\n<li>Additional PAYG-enabled services will be added to the<b> Billing node</b> over time. Until then, the PAYG setup for other products (besides <b>Backup</b>) will continue to remain under <b>Org Settings</b> &gt; <b>PAYG</b>.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p><p>No action is required.</p><p>Admins may decide to:</p>\n<ul>\n<li>Review the new <b>PAYG page</b> under <b>Billing </b>in MAC.</li>\n<li>Monitor announcements for migration timelines for existing <b>Backup customers</b>.</li>\n<li>Refer to Microsoft documentation for guidance on billing policies and budget notifications.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/services/?view=o365-worldwide\" target=\"_blank\">Microsoft 365 pay-as-you-go services documentation | Microsoft Learn</a> (will be updated before rollout)</p><ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 introduces a new pay-as-you-go experience in the Admin Center starting December 15, 2025, for Backup and Copilot customers. It centralizes billing management, policy creation, budgeting, and usage tracking under the Billing node, with additional services to be added over time. No immediate action required."
    }
  ],
  "EndDateTime": "2026-01-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1186367",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-10T20:56:43.71Z",
  "Services": [
    "SharePoint Online",
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-14T23:57:44Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Announcing the new pay-as-you-go experience in Microsoft 365 Admin Center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
