{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n</p><p>We’re introducing a new way to interact with your files in <i>OneDrive</i>: <b>the Copilot floating button.</b> This feature provides quick access to Copilot-powered actions, helping users work more efficiently by surfacing relevant tools and suggestions directly within the <i>OneDrive interface</i>.</p>\n\n<b><b>When this will happen:</b></b>\n<p><b>General Availability (Worldwide):</b>&nbsp;We will begin rolling out this feature starting <b>October 15, 2005</b>, and full rollout is expected to finish by <b>early November 2025</b>. During the rollout period, some users may not see the floating Copilot button in <i>OneDrive</i>.</p><p>Note: This is a gradual rollout, so not all users will see the feature at the same time.</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> All Microsoft 365 tenants with Copilot-eligible users using OneDrive for Business.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>A <b>new floating Copilot button</b> will appear in the <i>OneDrive web interface</i>.</li>\n<li>Users can ask questions about files, summarize documents, or compare content directly from OneDrive.</li>\n<li>The button will offer contextual recommendations based on selected files.</li>\n<li>Navigation is streamlined by surfacing relevant Copilot tools without needing to search through menus.</li>\n<li>The feature is <b>enabled by default</b> for eligible users.</li>\n</ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Communicate this change to helpdesk and support teams.</li>\n<li>Drive internal awareness of the new Copilot experience in <i>OneDrive</i>.</li>\n<li>No configuration changes are required unless you wish to disable Copilot features for specific users.</li></ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/office/get-started-with-copilot-in-onedrive-7fc81e10-e0cf-4da8-af2e-9876a2770e5d\" target=\"_blank\">Get started with Copilot in OneDrive | Microsoft Support</a></p><ul>\n</ul>\n\n<b><b>Compliance considerations:</b></b><p></p><p>No compliance considerations identified, review as appropriate for your organization.\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneDrive will introduce a floating Copilot button starting October 15, 2025, providing quick access to AI-powered file actions like summarizing and comparing documents. Enabled by default for eligible users, it streamlines navigation and offers contextual recommendations within the OneDrive web interface."
    }
  ],
  "EndDateTime": "2025-12-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1173929",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-16T22:56:09.547Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-16T22:55:53Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: floating Copilot button simplifies Copilot discovery",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
