{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 5, 2025: We have updated the timeline. Thank you for your patience.</p><p>Microsoft Purview eDiscovery (Premium) is introducing support for pre-authorized and non pre-authorized export download links, to enhance the reliability and performance of export download. \n</p><p><b>Introduction\n</b></p><p>A new capability in Microsoft Purview eDiscovery (Premium) enables organizations to configure export download links as either pre-authorized or non pre-authorized.\n</p><ul><li>Pre-authorized links offer faster downloads and maintain session continuity for a specified duration configurable by eDiscovery administrators.\n</li><li>Non pre-authorized links require re-authentication after each connection loss and are needed for restricted environments that allow access only to limited Microsoft 365 IP ranges.</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498160\" target=\"_blank\">498160</a>.</p><p></p><p><b><b>When this will happen:</b>\n</b></p><p>General Availability (Worldwide): Rollout begins mid-September 2025 and completes by end of September 2025.\n</p><p>General Availability (GCC, GCC High, DoD): Rollout begins early October 2025 and completes by end of October 2025</p><p></p><p><b>How this will affect your organization\n</b></p><p>This update allows organizations to maintain strict control over data access while optimizing download performance based on environment needs.\n</p><p><b>What you need to do to prepare\n</b></p><p>Admins should:\n</p><ul><li>Review organizational policies and familiarize themselves with new export configuration options, including link type selection and duration settings.\n</li><li>Update internal documentation and training materials to reflect this capability.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498160"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview eDiscovery (Premium) will support pre-authorized and non pre-authorized export download links starting mid-September 2025, enhancing download reliability and control. Pre-authorized links enable faster downloads; non pre-authorized require re-authentication for restricted environments. Admins should review policies and update documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1147383",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-08T21:48:27.783Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-03T23:23:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Export download with pre-authorized link support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
