{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b>Introduction</b>\n</p><p>Scoped knowledge is now supported in declarative agents (DA) for VIP connectors such as Azure DevOps (ADO) Work Items, Jira, and Confluence. This enhancement enables organizations to define precise boundaries for agent-accessible information, improving relevance, reducing noise, and aligning with organizational policies and user permissions.</p><p>This feature is available to tenants with a Microsoft 365 E5 license.</p>\n\n<b>When this will happen</b>\n<p><b>General Availability (Worldwide): </b>We will begin rolling out in late August 2025 and expect to complete by early September 2025.</p>\n\n<b>How this affects your organization</b>\n<p>Once configured, scoped knowledge allows users to prompt Copilot with more personalized queries. This is especially useful for creating targeted agents tied to specific repositories or locations, helping reduce irrelevant results and improving agent performance. This helps you create agents that are scoped to your team's knowledge, enabling more personalized responses to queries.</p><p>Tenants without Microsoft 365 E5 will not have access to this feature unless they upgrade.</p><p></p><p><b>What you can do to prepare</b></p><p>To configure scoped knowledge in declarative agents:\n</p><ol>\n<li>Under <i>Choose other data sources</i>, select the connector tile (such as Jira, Confluence).</li>\n<li>Add relevant connections.</li>\n<li>Return to the <i>Knowledge</i> main menu.</li>\n<li>Select a scoping attribute (such as Project, Space, Folder).</li>\n<li>Search or type the attribute name and add the desired scope.</li></ol><p><i>Screenshot - Scoped knowledge configuration options in declarative agents for VIP connectors:</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/5367a54c-1716-4b57-95b5-7311b54be7f9/a6dbc77c6c14cbc874744773b84d4c3f51269e6c.png\" style=\"width: 400px;\" alt=\"admin settings\"></p><ul>\n</ul>\n<p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/copilot-studio-agent-builder-knowledge?branch=main&amp;branchFallbackFrom=pr--1060\" target=\"_blank\">Add knowledge sources to your declarative agent by using agent builder | Extensibility | Microsoft 365 Copilot | Microsoft Learn</a></p>\n\n<b>Compliance considerations</b><p></p><p>No compliance considerations identified, review as appropriate for your organization.\n</p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Scoped knowledge support in Microsoft 365 Copilot's declarative agents for VIP connectors (Azure DevOps, Jira, Confluence) enables precise, personalized query responses by limiting accessible information. Available to Microsoft 365 E5 tenants, it rolls out globally from late August to early September 2025. Configuration involves selecting connectors and scoping attributes."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143299",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T22:05:00.307Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T22:04:22Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot | Scoped knowledge support for declarative agents in VIP connectors",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
