{
  "ActionRequiredByDateTime": "2025-12-07T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Retirement of Visio Data Visualizer Add-in for Excel</b></p>\n<p>We’re retiring the Visio Data Visualizer add-in for Excel to streamline diagramming experiences and focus development efforts on Visio Plan 2 and the Visio desktop app. This change aligns with our commitment to delivering more robust, data-connected diagramming capabilities through supported platforms.</p>\n\n<p><b>When this will happen:</b></p>\n<ul>\n<li><b>December 8, 2025</b>: The Visio Data Visualizer add-in will be removed from the Excel add-in store, templates, and ribbon.</li>\n<li><b>March 2, 2026</b>: The service powering the add-in will be shut down. Existing diagrams created with the add-in will no longer render or refresh.</li>\n</ul>\n\n<p><b>How this affects your organization:</b></p>\n<p><b>Who is affected:</b> All Microsoft 365 users who use the Visio Data Visualizer add-in in Excel, and admins managing centralized deployment of Office add-ins.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Starting December 8, 2025, the add-in will be removed from the Excel add-in store, templates, and ribbon. Users will no longer be able to create new Data Visualizer diagrams using the add-in.</li>\n<li>By March 2, 2026, the service powering the add-in will be shut down. Existing Data Visualizer add-in diagrams embedded in Excel will no longer load or refresh after this date, though the underlying Excel table data will remain intact.</li>\n<li>In November, users will start seeing a business bar in the Data Visualizer add-in frame notifying them of the upcoming retirement. The business bar will include a link to a detailed, user-facing article explaining how to save their diagrams as Visio (.vsdx) files.</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>If your tenant does not use centralized deployment of add-ins, no action is required. The change will be applied automatically on the specified dates.</li>\n<li>If your tenant uses centralized deployment of add-ins in the Microsoft 365 admin center:\n  <ul>\n    <li>Turn off the Data Visualizer add-in by December 8, 2025.</li>\n    <li>After the service shuts down on March 2, 2026, delete the add-in.</li>\n    <li>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-deployment-of-add-ins?view=o365-worldwide\">Manage add-ins in the Microsoft 365 admin center</a></li>\n  </ul>\n</li>\n<li>Inform your users about this change and its timelines.</li>\n<li>Encourage users to save any existing Data Visualizer diagrams as Visio (.vsdx) files before March 2, 2026. After that date, diagrams embedded in Excel will no longer be accessible or refreshable.</li>\n<li>Update any relevant user documentation to reflect that the add-in will no longer be available after December 8, 2025 and that the service will be fully decommissioned on March 2, 2026.</li>\n<li>Share information about alternate options, such as <a href=\"https://www.microsoft.com/microsoft-365/visio/visio-plan-2\" target=\"_blank\">Visio Plan 2</a> and <a href=\"https://support.microsoft.com/office/create-a-data-visualizer-diagram-17211b46-d144-4ca2-9ea7-b0f48f0ae0a6\" target=\"_blank\">creating data-backed diagrams via the Visio desktop app</a>.</li>\n</ul>\n\n<p><b>Steps for users (Microsoft 365 subscribers):</b></p>\n<ul>\n<li>Open the Excel file containing the Data Visualizer diagram.</li>\n<li>In the diagram area, select the More options menu (…) and choose <b>Open in web</b>.</li>\n<li>If prompted, sign in with a Microsoft 365 work or school account.</li>\n<li>A Visio (.vsdx) file corresponding to the diagram will be created and saved to OneDrive or Visio for the web.</li>\n<li>After March 2, 2026, the data connection and refresh features will no longer function, but the saved Visio file will remain accessible.</li><li>Learn more: <a href=\"https://aka.ms/visio-dv-add-in-retirement\" target=\"_blank\">Retirement of the Visio Data Visualizer add-in for Excel and next steps</a></li></ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Visio Data Visualizer add-in for Excel will be retired: removed from the store on December 8, 2025, and its service shut down on March 2, 2026. Users must save existing diagrams as Visio files before then. Focus will shift to Visio Plan 2 and the Visio desktop app."
    }
  ],
  "EndDateTime": "2026-04-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1182535",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-03T17:57:14.953Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-03T17:57:02Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of Visio Data Visualizer Add-in for Microsoft Excel",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
