{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re expanding Microsoft 365 Copilot extensibility in<i> Office apps</i>. <b>Custom Engine Agents (CEAs)</b> are now available in <i>Word, Excel, PowerPoint,</i> and <i>OneNote</i>. CEAs are partner-built agents that run on a developer’s service engine and connect into Copilot in <i>Office apps</i>. This release completes support for all Copilot agent types in Word, Excel, PowerPoint, and OneNote, joining Declarative Agents (DAs) already available.</p>\n\n<b><b>When this will happen:</b></b>\n<p><b>General Availability (Worldwide)</b> is currently available, with<b> full rollout expected by October 13, 2025</b>.</p>\n\n<b><b>How this affects your organization:</b></b>\n<p><b>Who is affected:</b> All users with Microsoft 365 Copilot licenses in <i>WXP</i> (<i>Word, Excel, PowerPoint)</i>&nbsp;and <i>OneNote</i>.</p><p><b>What will happen:</b></p>\n<ul>\n<li>Users will see installed CEAs in the <i>Copilot pane</i> of Word, Excel, PowerPoint, and OneNote.</li>\n<li>CEAs can be installed and opened directly within these apps if allowed in the agent store for your tenant.</li>\n<li>CEAs appear alongside other agents in the <i>Copilot experience</i>.</li>\n<li>Users can insert generated content (text, tables, images) directly into documents or presentations using the Insert action in response cards.</li>\n<li>CEAs honor existing app management policies for discovery and installation.</li>\n<li>Declarative Agents and Custom Engine Agents are now both supported in WXP + OneNote.</li><li>CEAs are built using the Microsoft 365 AI Toolkit or Copilot Studio Full version. While the user experience is the same, CEAs differ in how they are orchestrated and built, offering more customization.</li><li>CEAs are additive. They do not replace existing agents or change the experience for Declarative Agents. Users may simply notice more agents available inside Office apps that were previously only accessible in the Microsoft 365 Copilot app.</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>No admin action is required.</li>\n<li>Inform helpdesk and champions about CEAs arriving in WXP + OneNote.</li>\n<li>Review app and agent policies to ensure approved agents are discoverable.</li>\n<li>CEAs will appear automatically for users with Microsoft 365 Copilot licenses.</li>\n<li>Developers cannot opt out of CEAs appearing in WXP hubs.</li>\n<li>For EU tenants, CEAs will appear when underlying Copilot experiences are available.</li></ul><p><i>Screenshot - View of new UX with a Custom Engine Agent (CEA) in PowerPoint:</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/40e10913-df05-46cc-8fce-56417255cb91/6e89115daecf06a702735089f40bbc191625ffa0.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/agents-overview\" target=\"_blank\">Agents for Microsoft 365 Copilot | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/overview-custom-engine-agent?source=recommendations\" target=\"_blank\">Custom engine agents for Microsoft 365 overview | Microsoft Learn</a></li>\n</ul>\n\n<b><b>Compliance considerations:</b></b>\n<table border=\"1\">\n<tbody><tr><th>Question</th><th>Answer</th><th>Explanation</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes</td><td>CEAs are agent-based extensions that interact with Copilot and may generate content based on user input.</td></tr>\n<tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes</td><td>Users can interact with CEAs to generate and insert content (text, tables, images) into documents and presentations.</td></tr>\n<tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes</td><td>CEAs respect existing app management policies for discovery and installation, which can be scoped via Entra ID group membership.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Custom Engine Agents (CEAs) are now available in Word, Excel, PowerPoint, and OneNote, expanding Microsoft 365 Copilot extensibility. CEAs run on partner services, appear in the Copilot pane, and allow users to generate and insert content. Full rollout is expected by October 13, 2025, with no admin action required."
    }
  ],
  "EndDateTime": "2025-11-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1168289",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-08T22:02:10.63Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-08T22:01:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 apps: Custom Engine Agents now available in Word, Excel, PowerPoint, and OneNote",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
