{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 2, 2026: We have updated the content and timeline. Thank you for your patience.&nbsp;</p><p><b>Introduction</b></p><p>We're introducing support for <i>Microsoft Purview sensitivity labels</i> in <i>OneNote</i>. This update enables users to manually classify and protect OneNote sections using the same compliance standards available across Microsoft 365 apps. Labels can be applied to each&nbsp;OneNote Section, helping ensure sensitive content is encrypted, access-controlled, and aligned with organizational policies. This change supports consistent data protection across platforms and endpoints.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=500020\" target=\"_blank\">500020</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide, GCC, GCCH, and DoD):</b>&nbsp;We expect to complete the rollout by late January 2026.</p><p><b>How this affects your organization</b></p><p>This update enhances data protection and compliance capabilities by introducing sensitivity labeling to <i>OneNote </i>sections. Admins will gain greater control over how sensitive information is handled within <i>OneNote</i>, aligning it with other Microsoft 365 apps. This is particularly beneficial for organizations in regulated industries, helping mitigate risk and enforce compliance policies across endpoints.</p><p><b>Who is affected:</b></p><p>All users of supported OneNote clients across platforms, including organizations in regulated industries and those with compliance requirements.</p><p><b>What will happen:</b></p><ul><li><i>Sensitivity labels</i> will be available in supported <i>OneNote</i> clients:<ul><li>OneNote Win32 (Desktop)</li><li>OneNote for Web</li><li>OneNote for iOS</li><li>OneNote for Android</li><li>OneNote for Mac</li></ul></li><li> OneNote for Windows 10 (UWP) will not support this feature.</li><li>Users will be able to manually apply sensitivity labels directly to OneNote sections.</li><li>Labeled sections will be encrypted and access-controlled based on organizational policies.</li><li>Admins can enforce labeling policies and monitor usage via Microsoft Purview.</li><li>Label policies can be scoped using Entra ID group membership.</li><li>Manual Labeling capability will be supported with this rollout. Other Sensitivity Label capabilities such as auto labeling, mandatory labels, default labeling and user defined permissions (UDP) labels will be rolled out at a future date.</li></ul><p><b>What you can do to prepare</b></p><p>To prepare for this rollout:</p><ul><li>Ensure endpoints are using supported OneNote clients: Win32, Web, iOS, Android, and Mac.</li><li>Transition away from OneNote for Windows 10 (UWP), which will not support sensitivity labels.</li><li>No additional setup is required beyond maintaining updated builds.</li><li>Admins may want to validate readiness and communicate expected changes to users.</li><li>Review and update internal documentation to reflect supported platforms.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/purview/sensitivity-labels\" target=\"_blank\">Learn about sensitivity labels | Microsoft Purview | Microsoft Learn</a></p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed (e.g., documents, emails, chats, etc.)?</td><td>Yes. This change enables encryption and access control for OneNote sections, modifying how sensitive customer data is processed and accessed within OneNote.</td></tr><tr><td>Does the change modify Information Protection labels or sensitive information types?</td><td>Yes. It extends the applicability of Microsoft Purview sensitivity labels to OneNote sections, modifying how labels are used across Microsoft 365 apps.</td></tr><tr><td>Does the change modify Conditional Access policies, Data Loss Prevention (DLP), or other Purview capabilities?</td><td>Yes. Admins can enforce labeling policies in OneNote, which may interact with existing DLP and Conditional Access configurations.</td></tr><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities (e.g., via Purview or admin reporting)?</td><td>Yes. Admins will be able to track and report on sensitivity label usage in OneNote through Microsoft Purview compliance solutions.</td></tr><tr><td>Does the change include an admin control, and can it be controlled through Entra ID group membership?</td><td>Yes. Label policies can be scoped and enforced using Entra ID group membership, allowing targeted deployment and control.</td></tr></tbody></table><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "500020"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft OneNote will support Microsoft Purview sensitivity labels on Win32, Web, iOS, Android, and Mac by late January 2026, enabling manual labeling of sections for encryption and access control. This enhances compliance and data protection, with admin controls via Entra ID; OneNote for Windows 10 (UWP) is not supported."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1157712",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-02T19:09:00.353Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-22T22:54:11Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneNote | Sensitivity labels now available on desktop, web, iOS, Android, and Mac",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
