{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re introducing enhancements to OneDrive that simplify the process of managing files when employees leave your organization. These updates improve visibility, streamline bulk transfers, and help ensure important content remains accessible and shared appropriately.</p><p>This feature is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=493946\" target=\"_blank\">493946</a>.</p><p><b>When this will happen\n</b></p><p><b>General Availability (Worldwide, GCC, GCCH, DoD):</b> We will begin rolling out in mid-October<b>&nbsp;</b>and expect to complete by early November 2025.\n</p><p><b>How this affects your organization\n</b></p><p>Managing OneDrive content for departing employees is now more efficient. Key improvements include:\n</p><ul><li><b>Redesigned notifications</b>:<b> </b>Account cleanup emails are now more prominent, reducing the chance of being overlooked.\n</li><li><b>Improved filtering</b>: New filters help managers quickly locate shared or important files.\n</li><li><b>Bulk file transfer with preserved sharing</b>: The “Move and keep sharing” feature allows multiple files to be transferred while retaining existing sharing permissions.\n</li><li><b>Consolidated alerts</b>: When six or more files are moved, collaborators receive a single streamlined notification.\n</li></ul><p>These updates help ensure a smooth handover and reduce the risk of losing critical files.\n</p><p>When a user account is deleted, OneDrive access is automatically granted to the manager or designated secondary owner. The recipient receives an email notification with access details and information about the OneDrive retention period. Seven days before the retention period ends, a second reminder email is sent, stating that the OneDrive will be permanently deleted in seven days.</p><p><b>Steps to transfer files:\n</b></p><ol><li>From the email, click <b>View files</b> to access the departing user’s OneDrive. <p></p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/499605f3-db65-4f78-8916-b3ff7b9749c8/57ab653a3004340bbfa7c2fb0c7a24aa550e4210.png\" style=\"width: 400px;\" alt=\"user settings\"></li><li>Use the <b>Shared</b> filter to view only shared files, or <b>All </b>to see everything.</li><li>Select files using the checkbox in the table header.<p></p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/0e70dacb-37a9-4f11-b26c-18873c4ee653/28bd8067457929c04fb85a6a55773d088a681570.png\" style=\"width: 400px;\" alt=\"user settings\"></li><p></p><li>Click <b>Move to,</b>&nbsp;choose a destination, and check <b>Keep sharing with the same people.</b></li><p><b> </b><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/efb0519c-40ec-43af-81b4-5706bbf3dff3/e85be3188a5d490d7c19d7099195a7a01c53d211.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>Click <b>Move to</b> again to complete the transfer.\n</li></ol><p>Collaborators will receive a single notification once the move is complete:</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/33fb6bcf-92cc-4cf2-aa0a-f9445dd93be8/6ba428c1fd5a9e07b038bef071ecc23f5111a2c5.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>\n</p><p><b>What you can do to prepare\n</b></p><p>No admin action is required before rollout. You may want to:\n</p><ul><li>Inform managers and secondary owners about the new experience.\n</li><li>Update internal documentation to reflect the new transfer process.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/retention-and-deletion\" target=\"_blank\">OneDrive retention and deletion - SharePoint in Microsoft 365 | Microsoft Learn</a></p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493946"
    },
    {
      "Name": "Summary",
      "Value": "OneDrive enhancements simplify file management for departing employees by improving notifications, filtering, and enabling bulk file transfers that preserve sharing. Access transfers automatically to managers with email alerts. Rollout begins mid-October 2025, requiring no admin action but recommending informing stakeholders and updating documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1164381",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-02T22:15:19.387Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-02T22:15:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "OneDrive: Simplified file transfer for departing employees",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
