{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b>Introduction</b></p>\n<p><i>Live captions</i> in Microsoft Teams meetings are now available on mobile devices with enhanced customization options. Users can personalize captions by adjusting font color, background color, and caption height—making captions easier to read and follow, especially in varying lighting conditions or while on the go. This update aligns mobile capabilities with Teams on desktop and web, supporting a consistent experience across platforms.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499620\" target=\"_blank\">499620</a>.</p>\n\n<p><b>When this will happen</b></p>\n<ul>\n  <li><b>Targeted Release:</b>&nbsp;We will begin rolling out in early September 2025 and expect to complete by mid-September 2025.</li>\n  <li><b>General Availability (Worldwide, GCC):</b>&nbsp;We will begin rolling out in mid-September 2025 and expect to complete by late September 2025.</li>\n  <li><b>General Availability (GCC High):</b>&nbsp;We will begin rolling out in early October 2025 and expect to complete by mid-October 2025.</li>\n  <li><b>General Availability (DoD):</b>&nbsp;We will begin rolling out in late October 2025 and expect to complete by early November 2025.</li>\n</ul>\n\n<p><b>How this affects your organization</b></p>\n<p>Teams' mobile users will be able to customize live captions during meetings. These settings include:</p>\n<ul>\n  <li>Font color</li>\n  <li>Caption background color</li>\n  <li>Caption height</li>\n</ul>\n<p>Changes made on mobile will sync across Teams Desktop and Web, ensuring a consistent experience.</p><p>These settings are saved locally and persist across sessions, so users do not need to reconfigure them each time they join a meeting. Additionally, caption customization respects mobile OS accessibility preferences such as system font size and contrast settings, helping users maintain a consistent experience across apps.</p><p>Caption style settings are only available when captions are turned on during a meeting.</p>\n<p>This feature is <b>on by default</b> and requires <b>no admin action</b>. Caption customization is managed at the user level, and existing caption policies will continue to apply across all platforms.</p><p><i><b>Screenshot 1</b> - Customized live captions displayed during a Teams meeting on mobile demonstrating enhanced accessibility:&nbsp;</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/fc95b04e-29cd-4a0a-b695-cd51e9fe03d6/69e3e3671869671cba2985609ffcfe1ee6c828e1.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i><b>Screenshot 2</b> - Live caption customization settings on mobile showing options to adjust font color, background color, and caption height for improved readability:&nbsp;</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/a25ef725-07ef-4b93-b3af-d66d1ed947f1/72c8b80f3905aa1896ac4f3daff939083be47142.png\" alt=\"user settings\" style=\"width: 400px;\"></p>\n\n<p><b>What you can do to prepare</b></p>\n<p>No admin preparation is required. We recommend informing your users about the new customization options to help them take advantage of improved accessibility and viewing comfort when joining meetings from mobile devices.</p><b>Compliance considerations</b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams mobile now allows users to customize live captions by adjusting font color, background color, and caption height for better readability. These settings sync across devices, persist across sessions, and respect mobile accessibility preferences. The feature rolls out from September to November 2025 and requires no admin action."
    }
  ],
  "EndDateTime": "2025-12-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1146825",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-02T23:25:19.703Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-02T23:25:06Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams | Customize live captions on mobile for improved accessibility",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
