{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p>\n<p>By the end of October 2025, Microsoft Copilot Studio will receive an updated product icon across both the full-featured <a href=\"https://copilotstudio.microsoft.com/\" target=\"_blank\">web</a>&nbsp;experience and within <a href=\"https://www.microsoft365.com/copilot\" target=\"_blank\">Microsoft 365 Copilot</a>. This visual update aligns Copilot Studio more closely with the Microsoft 365 Copilot brand and reinforces its role as the platform for building and managing agents.</p><p><b><b>When this will happen:</b></b></p>\n<p>The updated icon will begin rolling out at the end of October and will appear across in-product experiences and product documentation. Rollout is expected to complete by mid-November 2025.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:&nbsp;</b>All users who use Copilot Studio for creating agents, including those who create agents via the Microsoft 365 Copilot integration.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Users will see an updated product icon in the Copilot Studio interface and related documentation.</li>\n<li>This is a visual-only update; there are no changes to functionality, workflows, or agent management.</li>\n<li>No admin settings or policies are impacted.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No admin action is required.</li></ul><p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "By October 2025, Microsoft Copilot Studio will have an updated icon across its web and Microsoft 365 Copilot interfaces. This visual change aligns with the Microsoft 365 Copilot brand, affects all users, involves no functional changes, requires no admin action, and has no compliance impact."
    }
  ],
  "EndDateTime": "2025-12-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162285",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-29T23:10:15.05Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T23:09:51Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Copilot Studio icon update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
