{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>To improve threat detection accuracy and responsiveness, Microsoft Defender for Cloud Apps is expanding its dynamic model for threat protection. This update enhances the signal-to-noise ratio (SNR) of detections and enables faster adaptation to emerging threats, helping security teams stay ahead of evolving risks.</p><p>This rollout continues the migration of legacy threat detection policies, following the first batch announced in Message center post MC1061724. The second batch introduces new detections that replace several legacy policies, further aligning with our goal of delivering more precise, research-driven protection.</p><p><b><b>When this will happen:</b></b></p><p><b>General Availability (Worldwide, GCC, GCC High, DoD): </b>Rollout begins early November 2025 and is expected to complete by the end of November 2025.</p><p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:</b></p><p>Organizations using Microsoft Defender for Cloud Apps, including tenants in Worldwide, GCC, GCC High, and DoD environments.</p><p><b>What will happen:</b></p><ul><li>The dynamic model will be expanded to include additional research-driven detections.</li><li>These detections are continuously updated by Microsoft security researchers to reflect the evolving threat landscape.<ul><li>Detections may be added, removed, or modified dynamically to ensure optimal protection.</li><li>These are research-driven and enabled by default, requiring no manual configuration.</li></ul></li><li>The second batch of legacy policies being migrated includes:<ul><li>“<i>Unusual ISP for an OAuth App</i>”</li><li>“<i>Suspicious file access activity (by user)</i>”</li></ul></li><li>These will be replaced with the following detections:<ul><li>Replacing “Unusual ISP for an OAuth App”:<ul><li>“<i>OAuth application activity from an unknown ISP (Preview)</i>”</li></ul></li><li>Replacing “Suspicious file access activity (by user)”:<ul><li>“<i>Suspicious file access from untrusted ISP and user agent with malicious IP indicator (Preview)</i>”</li><li>“<i>Suspicious file access indicative of lateral movement (Preview)</i>”</li></ul></li><li>Adding new detection \"<i>Activity from a password-spray associated IP address (Preview)</i>”</li></ul></li></ul><p></p><ul><li>These new detections are already available to you in Preview; the \"(Preview)\" suffix will be removed once legacy policies are disabled.</li><li>Governance actions configured on legacy policies will be disabled. Admins can re-enable them manually after 24 hours.</li><li>Migrated policies will be listed in <a href=\"https://learn.microsoft.com/defender-cloud-apps/anomaly-detection-policy\" target=\"_blank\">Create Defender for Cloud Apps anomaly detection policies | Microsoft Learn</a>.</li><li>Eventually, all other out-of-the-box (OOTB) activity-based policies will be migrated to the new dynamic model. Future Message center posts will provide details as additional policies are transitioned.</li></ul><p>By applying the new dynamic model, we aim to deliver more accurate and timely threat detections, enhancing your organization’s overall security posture. </p><p>In some cases, legacy policies may be split into multiple detections and alerts to provide deeper visibility and context for SOC teams.</p><p>During the gradual migration of OOTB policies, disabled policies will remain temporarily visible in <i>Defender for Cloud Apps</i>. Once migration is complete, these legacy policies will be removed from the legacy policies page. A separate Message center post will be published to confirm their removal.</p><p><b><b>What you can do to prepare:</b></b></p><p>No admin action is required before rollout.</p><p>To prepare:</p><ul><li>Review your current policy configurations to assess impact.</li><li>Notify SOC and helpdesk teams about the updated detections.</li><li>Update internal documentation if referencing legacy policies.</li><li>If you wish to retain governance actions:<ul><li>Wait 24 hours after disablement.</li><li>Re-enable policies from the legacy policies page at: <b>Defender portal &gt; Cloud apps &gt; Policy management</b>.</li></ul></li></ul><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/acb9be4f-4740-4042-9793-863ead9ee7c1/98a19f36d640efc1eefcbd8a96699266cbd4b371.png\" style=\"width: 400px;\" alt=\"user settings\"><b></b></p><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><b>\n</b>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Cloud Apps will expand its dynamic threat detection model in November 2025, replacing legacy policies with more accurate, research-driven detections. This update improves threat detection accuracy and responsiveness, requires no admin action before rollout, and includes new detections enabled by default."
    }
  ],
  "EndDateTime": "2025-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1169078",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-09T23:33:51.267Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-09T23:33:25Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Cloud Apps: Improvements to threat protection capabilities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
