{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p><b>Express voice enrollment</b> in Microsoft Teams makes registering your voice profile quick and seamless. A voice profile enables features such as voice isolation, speaker recognition, identification in meeting rooms, improved transcripts, and enhanced meeting recaps and insights powered by Microsoft 365 Copilot. If you haven’t enrolled, you’ll receive an in-product prompt to opt in and enroll simply by speaking during a meeting. <b>Admins can enable or disable this feature for their organization.</b></p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=537269\" target=\"_blank\">537269</a>.</p>\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Targeted Release: </b>Rollout begins early April 2026 (previously early March) and is expected to complete by mid-April 2026 (previously mid-March).</li>\n<li><b>General Availability:</b> Rollout begins mid-April 2026 (previously mid-March) and is expected to complete by end of April 2026 (previously end of March).</li>\n</ul>\n\n<p><b><b>How this will affect your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>All enterprise Microsoft Teams customers except Education (EDU) tenants.</li>\n</ul>\n<p><b>What will happen:</b></p>\n<ul>\n<li>A new voice enrollment experience will be available in Teams.</li>\n<li>Users will receive an in-product prompt to enroll their voice profile by speaking during a meeting.</li>\n<li>The feature will be<b> ON by default</b> for enterprise tenants.</li>\n<li>EDU tenants are excluded from this rollout.</li>\n<li>If your organization previously disabled voice enrollment policies, this feature will not apply.</li>\n<li>Admins can manage this setting using new PowerShell cmdlets under the <code>PassiveVoiceEnroll</code> configuration in the <code>csTeamsAIPolicy</code> policy.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Review your organization’s Teams AI policy settings before rollout.</li>\n<li>If you want to disable this feature, update the <code>PassiveVoiceEnroll</code> configuration using PowerShell.</li>\n<li>Communicate this change to your helpdesk and end users as needed.</li>\n<li>Update internal documentation to reflect this new capability.</li>\n</ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "537269"
    },
    {
      "Name": "Summary",
      "Value": "Express voice enrollment in Microsoft Teams enables quick voice profile registration for enhanced features like voice isolation and improved transcripts. Rolling out April 2026 for enterprise tenants (excluding EDU), it’s on by default but can be managed by admins via PowerShell. Review policies and communicate changes accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2026-06-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1197146",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-20T22:58:05.85Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-15T20:39:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Express voice enrollment in Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
