{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We want to inform you that the <b>Rewrite Suggestions</b> preview feature in Microsoft Word—previously available via right-click on selected sentences—is being deprecated and will no longer be supported after <b>October 1, 2025</b>.\n</p><p><b>Why This Change?\n</b></p><p>The Rewrite Suggestions feature was introduced to help users improve sentence clarity, grammar, and tone by offering AI-generated alternatives. While it has been a valuable tool for many, we are evolving our writing assistance capabilities to better align with how users write and revise content today.\n</p><p><b>What’s Replacing It?\n</b></p><p>We are transitioning to a more advanced and integrated experience through Copilot in Word, which offers:\n</p><ul><li><b>Context-aware rewriting:</b> Highlight text and use Copilot to generate refined alternatives.\n</li><li><b>Prompt-based editing:</b> Ask Copilot to rewrite, summarize, or adjust tone using natural language.\n</li><li><b>Iterative refinement:</b> Use “Fine tune your rewrite” to guide Copilot through multiple revision rounds \n</li></ul><p>These enhancements provide greater flexibility, accuracy, and control—empowering you to write with confidence and efficiency.\n</p><p><b>What You Need to Do\n</b></p><p>No action is required. If you currently use Rewrite Suggestions, we encourage you to explore the Auto-Rewrite capability via Copilot in Word:\n</p><ol><li>Highlight the text you want to revise.\n</li><li>Click the Rewrite with Copilot icon in canvas.\n</li><li>Choose Auto-Rewrite.\n</li><li>Review and apply the suggestion.\n</li></ol><p>For more guidance, visit the <a href=\"https://support.microsoft.com/word\" target=\"_blank\">Word help &amp; learning.</a><font color=\"#000000\" style=\"\">&nbsp;</font></p><p>We appreciate your feedback and look forward to supporting your writing journey with even more powerful tools.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Rewrite Suggestions feature in Microsoft Word will be deprecated after October 1, 2025, and replaced by the more advanced Copilot experience, offering context-aware rewriting, prompt-based editing, and iterative refinement. Users are encouraged to transition to Copilot's Auto-Rewrite for enhanced writing assistance."
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129729",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-05T23:17:40.023Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-05T23:17:32Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Sentence-Level Rewrite Suggestions Deprecation in Microsoft Word",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
