{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing support for certified <i>Universal Touch Consoles</i> in Microsoft Teams Rooms on Windows <i>Touchboards</i>. This update enables a <i>center-of-table console experience</i>, bringing the same familiar controls and features available on standard Teams Rooms systems to <i>Touchboard</i> configurations.</p><p><b>When this will happen</b></p><p>General Availability: Rollout begins in late September 2025 and completes by late October 2025.</p><p><b>How this affects your organization</b></p><p>This update enhances the in-room experience for users of <i>Teams Rooms on Windows Touchboards</i> by enabling a center-of-table console interface. It aligns <i>Touchboard</i> setups with standard Teams Rooms systems, improving usability and consistency. The feature is <b>on by default</b> for certified devices and does not require manual configuration.</p><p><b>What you can do to prepare</b></p><ul><li>If using <i>Teams Rooms on Windows </i>certified Touchboards, Admins should ensure that only certified <i>Universal Touch Consoles</i> are deployed and updated to the latest <i>Teams Rooms on Windows app</i> version once available. </li><li>Review device certification status and update policies to ensure compatibility. </li><li>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/rooms/\" target=\"_blank\">Microsoft Teams Rooms</a>\n</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows will support certified Universal Touch Consoles for Touchboards, providing a center-of-table console experience. The rollout starts late September 2025, enabling default, consistent controls on Touchboard setups. Admins should deploy certified devices and update the Teams Rooms app accordingly."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143994",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-29T00:29:39.073Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T00:29:33Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Rooms on Windows: Universal Touch Console Support for Touchboards",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
