{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re introducing a new way for users to stay engaged with conversations in Microsoft Teams. The <b>Follow thread</b> feature allows users to follow any post they see in the Discover feed or in Channels. Followed threads will be accessible in a new <b>Followed threads</b> view within the Chat app, making it easier to track important discussions across Teams.</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Targeted Release:</b> We will begin rolling out mid-November 2025 and expect to complete by late November 2025.</li>\n<li><b>General Availability (Worldwide):</b> We will begin rolling out late November 2025 and expect to complete by early December 2025.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> All Microsoft Teams users who access posts via the Discover feed or Channels.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will see a new <b>Follow thread</b> option on posts in the Discover feed and Channels.</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/0ece61cc-6dda-49c8-a193-2f0ee71b6bd7/28aac345e3e0c51d52c12df72871c4a972ee2cf4.png\" style=\"width: 400px;\" alt=\"user settings\"></p>\n    <li>Followed threads will appear in a dedicated <b>Followed threads</b> view in the Chat app.</li>\n    <li>There are no changes to tenant-level settings.</li>\n    <li>The feature is enabled by default; no admin action is required to turn it on.</li>\n  </ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required to prepare for this change. However, you may want to:</li>\n  <ul>\n    <li>Notify your users about the new <b>Follow thread</b> feature.</li>\n    <li>Update internal documentation to reflect the new <b>Followed threads</b> view in the Chat app.</li>\n    <li>Review Microsoft Teams help documentation for user guidance once available.</li>\n  </ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a \"Follow thread\" feature allowing users to follow posts from the Discover feed or Channels. Followed threads appear in a new \"Followed threads\" view in the Chat app. The feature rolls out from mid-November to early December 2025, enabled by default with no admin action needed."
    }
  ],
  "EndDateTime": "2026-01-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181659",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-30T15:45:41.88Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-30T15:45:35Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New: Follow Threads from Discover feed in Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
