{
  "ActionRequiredByDateTime": "2026-03-30T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 8, 2026: We have updated this post as a reminder. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>As part of ongoing service modernization, Microsoft has migrated the hosting of SharePoint Online static assets to the Microsoft Azure Front Door (AFD) content delivery network (CDN), using the new domain <b>public-cdn.sharepointonline.com</b>. This migration was previously announced in MC1066155 and completed in July 2025.<p></p>\n\n<p>This message is a follow-up notice to retire the legacy CDN domain <b>publiccdn.sharepointonline.com</b>. After this rollout completes, content referenced via the legacy domain will no longer be accessible, and users will receive 404 errors when trying to access resources hosted on the legacy domain.</p><p></p>\n\n<p><b><b>When this will happen:</b></b></p>\n<b>General Availability (Worldwide):</b> Rollout begins March 31, 2026, and completes by late April 2026.<br><p></p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<b>Who is affected:</b>\n<p></p><ul>\n<li>Organizations using SharePoint Online with applications, scripts, or configurations that hardcode the legacy CDN domain.</li>\n<li>Developers using SharePoint Framework (SPFx) with hardcoded <code>cdnBasePath</code> values.</li>\n<li>Admins who have configured domain-based allow lists in their network settings.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>The legacy domain <b>publiccdn.sharepointonline.com</b> will be retired.</li>\n<li>Any content referenced via the legacy domain will return <b>404 errors</b>.</li>\n<li>The same resources remain available through the new CDN domain <b>public-cdn.sharepointonline.com</b>.</li>\n<li>The legacy domain previously served as an automatic hosting endpoint for SharePoint resources.</li>\n<li>The 404 error does <b>not indicate data loss</b>—only the access path is affected.</li>\n<li>Hardcoded references to the legacy domain will fail once the domain is retired.</li>\n</ul>\n<p></p>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<p></p><ul>\n<li>Review your applications, scripts, and configurations for any hardcoded references to <b>publiccdn.sharepointonline.com</b>.</li>\n<li>Update affected components to use supported and dynamic endpoints to ensure continued functionality.</li>\n<li>For SPFx applications:\n  <ul>\n    <li>If using an external CDN, it’s fine to update the <code>cdnBasePath</code>.</li>\n    <li>If relying on automatic hosting through the Microsoft 365 Public CDN, <b>do not hardcode </b><code style=\"\">cdnBasePath</code>—leave it unchanged, shown in the code snippet box below. For more details, refer to <a href=\"https://learn.microsoft.com/sharepoint/dev/spfx/extensions/get-started/hosting-extension-from-office365-cdn#update-your-solution-project-for-the-cdn-urls\" target=\"_blank\">Update your solution project for the CDN URLs</a>.</li></ul></li><p></p>\n\n<pre><code>{\n  \"cdnBasePath\": \"&lt;!-- PATH TO CDN --&gt;\"\n}</code></pre><li>Ensure <b>public-cdn.sharepointonline.com</b> is included in your domain-based allow lists.</li>\n<li>Validate your updates before <b>March 31, 2026</b> to prevent potential service disruptions.</li>\n<li>Monitor network traffic and optionally block requests to the legacy domain to confirm that content hosted through the CDN continues to function properly.</li>\n<li>Learn more: <a href=\"https://learn.microsoft.com/sharepoint/dev/spfx/sharepoint-framework-overview\" target=\"_blank\">Overview of the SharePoint Framework</a></li></ul>\n\n<p></p>\n\n<p><b><b>Compliance considerations</b></b></p>No compliance considerations identified, review as appropriate for your organization.<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The legacy SharePoint Online CDN domain publiccdn.sharepointonline.com will be retired by late April 2026. Update all hardcoded references to the new domain public-cdn.sharepointonline.com to avoid 404 errors. Validate changes before March 31, 2026, to ensure uninterrupted access to SharePoint resources."
    }
  ],
  "EndDateTime": "2026-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1184996",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-08T19:03:19.657Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-12T00:10:11Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Legacy SharePoint Online Content Delivery Network (CDN) domain to be retired—review configurations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
