{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Microsoft Editor browser extensions for Microsoft Edge and Google Chrome—AI-powered writing assistants offering grammar, spelling, and style suggestions—will be retired and no longer supported after October 31, 2025. This change reflects our ongoing efforts to consolidate writing assistance into the built-in proofing experience in Microsoft Edge.</p><p><b>When this will happen</b></p><p>The Microsoft Editor browser extensions will be retired on October 31, 2025. After this date, they will no longer receive updates or support.</p><p><b>Why this change?</b></p><p>Microsoft Editor extensions have helped users write with clarity, correctness, and confidence. As we continue to evolve our AI capabilities, we are consolidating writing assistance into the built-in proofing tools in Microsoft Edge. This approach simplifies the experience and ensures users benefit from the latest AI-powered enhancements without needing separate installations.</p><p><b>What’s next?</b></p><p>The core capabilities of Microsoft Editor—such as grammar checks and spelling corrections—are now part of the standard Edge experience. This transition will offer:</p><ul><li><b>Smarter, enhanced suggestions</b> for grammar, spelling, and writing style.</li><li><b>Seamless built-in proofing experience directly in Edge</b>&nbsp;without requiring additional extensions.</li></ul><p><b>How this affects your organization</b></p><ul><li>Users who rely on the Microsoft Editor extensions will transition to the built-in capabilities in Microsoft Edge. </li><li>No action is required from administrators. </li><li>Users can continue using the extensions until the retirement date and will automatically benefit from the integrated writing assistance in Edge thereafter.</li></ul><p><b>What you can do to prepare</b></p><ul><li>We recommend informing users of the upcoming retirement and encouraging them to explore the built-in writing assistance in Microsoft Edge. </li><li>Learn more: <a href=\"https://www.microsoft.com/microsoft-365/microsoft-editor\" target=\"_blank\">Microsoft Editor</a></li></ul><p>We appreciate your continued use of Microsoft 365 and look forward to supporting your writing with even more powerful tools.\n</p><p><b>Compliance considerations</b></p><table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr>\n<th>Category</th>\n<th>Impact</th>\n</tr>\n<tr>\n<td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td>\n<td>AI-powered writing assistance is now integrated into Microsoft Edge, replacing the standalone Editor extensions.</td>\n</tr>\n<tr>\n<td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n<td>The retirement of the extension may affect how writing assistance is logged or monitored if previously tracked separately.</td>\n</tr>\n<tr>\n<td>Does the change allow a user to enable and disable the feature themselves?</td>\n<td>Users can enable or disable the built-in writing assistance in Edge via browser settings.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Editor browser extensions for Edge and Chrome will retire on October 31, 2025, consolidating writing assistance into Edge's built-in proofing tools. Users will get enhanced AI-powered grammar and style suggestions directly in Edge without needing extensions. No admin action is required."
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1144651",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-29T23:37:01.327Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T23:36:50Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retirement of Editor Browser Extensions for Microsoft Edge and Google Chrome",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
