{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We are introducing a new dashboard in Teams Admin Center (TAC) that gives admins new visibility into user voice and face enrollment data to help organizations better understand usage of AI-dependent capabilities such as speaker attribution, voice isolation, and face-based room experiences. Dashboard data includes enrollment status, counts, and aggregate metrics \n</p><p>This update also adds the ability for admins to view and delete end-user voice and face enrollment data  directly from TAC. These controls strengthen compliance posture and provide more direct management of sensitive data.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=506750\" target=\"_blank\">506750</a>.</p>\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide, GCC): We will begin rolling out mid-January 2026 and expect to complete by end of January 2026.</p>\n\n<p><b><b>How this will affect your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> Admins managing Microsoft Teams in Teams Admin Center.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>A new <b>voice and face enrollment dashboard</b> will appear in Teams Admin Center.</li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/08cb85d4-1ad0-4419-b988-4fc49ee85c0a\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li>Admins will gain <b>data deletion capabilities</b>, allowing removal of voice or face enrollment data for individual users or batches of users.</li>\n<li>Deleted data is <b>permanently removed</b>, and users will need to <b>re-enroll</b> to continue benefiting from features such as <b>speaker attribution</b> or personalized AI meeting experiences.</li>\n<li>There is <b>no change to default enrollment behavior</b>. Existing policies and user controls remain unchanged.</li>\n</ul>\n</li>\n</ul>\n\n<p><b><b>What you need to do to prepare:</b></b></p>\n<ul>\n<li>No action is required to enable this feature. It will appear automatically as part of the rollout.</li>\n</ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "506750"
    },
    {
      "Name": "Summary",
      "Value": "A new voice and face enrollment dashboard in Teams Admin Center will provide admins visibility into AI-related user data and allow deletion of enrollment data. Rolling out January 2026, it enhances data management without changing default enrollment or policies. No action is needed to enable it."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2026-03-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191921",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-03T21:41:20.09Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-03T21:40:58Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "New enrollment dashboard and data deletion controls in Teams Admin Center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
