{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>To help protect users from legacy protocol vulnerabilities, we’re introducing new Trust Center settings in Microsoft 365 apps that block file opens using insecure protocols by default. These changes enhance security by reducing exposure to outdated technologies like FrontPage Remote Procedure Call (FPRPC), FTP, and HTTP.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497299\" target=\"_blank\">497299</a>.</p><p>\n</p><p><b>When this will happen</b></p><ul><li><b>Public Preview (Worldwide):</b> We began rolling out in late July 2025 and expect to complete by late August 2025.\n</li><li><b>General Availability (Worldwide, GCC, GCC High, and DoD):</b> We will begin rolling out in late August 2025 and expect to complete by late September 2025.\n</li></ul><p><b>How this will affect your organization</b></p><p>Starting with version 2508 of Microsoft 365 apps:\n</p><ul><li>File opens using the legacy <b>FPRPC protocol</b> will be <b>blocked by default</b>. Files will instead open using a more secure fallback protocol.\n</li><li>A new <b>Trust Center setting</b> will allow users to re-enable FPRPC, unless the setting is centrally managed via <b>Group Policy</b> or the <b>Cloud Policy service (CPS)</b>.\n</li><li>New Trust Center settings will also allow users to <b>disable FTP and HTTP</b> file opens, which remain allowed by default. If these settings are managed by admins, the corresponding Trust Center options will be greyed out.</li></ul><p style=\"margin-left: 25px;\"><b>Note: </b>This change applies only to<b> Microsoft 365 apps for Windows</b>. There is <b>no impact on Microsoft Teams </b>across any platform (Windows, Mac, web, iOS, or Android).</p><p>\n</p><p><b>What you need to do to prepare</b></p><ul><li>Review current configurations to determine if FPRPC is already blocked via Group Policy or CPS.\n</li><li>If needed, configure policies to allow specific groups to continue using FPRPC (not recommended).\n</li><li>Inform users that:\n<ul><li>They may see changes in how files open.\n</li><li>Trust Center settings may be unavailable if managed centrally.\n</li></ul></li><li>Admins can manage these settings through <b>Cloud Policy service (CPS)</b>. If an admin disables a protocol via CPS, users will not be able to re-enable it through Trust Center.\n</li><li>While there is no explicit documentation for CPS policies related to these settings, admins can locate the relevant controls in CPS under Microsoft 365 Apps settings.</li></ul><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Admins can manage protocol settings via CPS or Group Policy, which can be scoped to Entra ID groups.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?&nbsp;</td><td>Users can re-enable FPRPC and disable FTP/HTTP unless the settings are managed centrally.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497299"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 apps will block insecure file open protocols like FPRPC by default starting version 2508, with new Trust Center settings to manage these protocols. Admins can control settings via Group Policy or Cloud Policy service. Changes apply only to Microsoft 365 apps for Windows, not Teams."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-11-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130392",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-06T23:35:55.693Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:35:03Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 apps | New Trust Center settings to block insecure file open protocols",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
