{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the public preview of Generative Pages. This new capability allows admins to simplify the app design process for model-drive apps using AI. This feature began rolling out to North America on July 22, 2025, and will become available in other regions at a later date.<br><br>  \n\n<b>How does this affect me?</b><br> \n\nGenerative Pages enable makers to describe their page needs in natural language and generate fully structured pages automatically. The system uses AI to produce React code that powers both the frontend experience and corresponding business logic, delivering modern, consumer-grade UI experiences within enterprise applications.<br><br> \n\nPlease note, pages must be published before they become available in apps. Additionally, while this feature is in public preview, it is not intended for use in your production environments.<br><br> \n\n<b>What action do I need to take?</b><br> \n\nThis message is for awareness and no action is required. However, admins can disable this capability at the environment level by turning off “Enable new AI-powered Copilot features for people who make apps” under Settings > Features in the Power Platform Admin Center (PPAC).<br><br> \n\nFor more information, please review <a href=\"https://aka.ms/ADO11546\"target=\"_blank\">Generate a page using natural language (preview)</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-08-25T20:19:01Z",
  "HasAttachments": false,
  "Id": "MC1121967",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-25T20:20:25.48Z",
  "Services": [
    "Power Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-25T20:19:01Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Apps – Generative Pages feature available for preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
