{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 13, 2025: We have updated the content. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re enhancing the Insider Risk Management (IRM) alert investigation experience to streamline workflows and improve usability. These updates are designed to maximize visual space, reduce clutter, and make it easier for analysts and investigators to focus on key insights during alert investigations.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=493754\" target=\"_blank\">493754</a>&nbsp;for Worldwide.</p><p><b>When this will happen</b></p><ul><li><b>Public Preview (Worldwide): </b>We will begin rolling out early September 2025 and expected to complete by late September 2025</li></ul><p><b>How this will affect your organization</b></p><p style=\"margin-left: 25px;\"><b>Prerequisite: </b>To receive the updated IRM alert workflow experience, tenants must have an<b> Insider Risk Management (IRM) license</b>.</p><p style=\"margin-left: 25px;\">This feature is <b>on by default</b> for eligible tenants once rollout begins.</p><p>These updates will improve the alert investigation experience for Insider Risk Management analysts and investigators. While all existing functionality remains available, some features will appear in new locations. Key changes include:\n</p><ul><li>The <b>Activity Explorer</b> tab will now open by default when an alert is selected.\n</li><li>The <b>All Risk Factors</b> tab has been enhanced to support more efficient investigations.\n</li><li>The <b>alert details banner</b> previously shown at the top of each tab is now accessible via the <b>Details</b> button.\n</li><li>Actions such as assigning users or taking action on an alert are now located under the <b>Details</b> button.\n</li><li>The <b>User Timeline</b>, previously displayed to the left of the Activity Explorer, is now accessible via the <b>Timeline button above Activity Explorer where the columns are managed.</b></li><li>Users can now <b>maximize or minimize</b> the Activity Explorer panel for improved visibility.\n</li></ul><p>These changes are designed to reduce visual clutter and improve focus during investigations.</p><p><i>Alert workflow enhancements before and after:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/090112a9-6c3c-428c-aa6e-539fe14654c2/1eb5bcbf26fa6b304c3b3cc86fc071276cc76608.png\" style=\"width: 50%;\"><br></p><p><b>What you need to do to prepare</b></p><ul><li>Share this information with your Insider Risk Management analysts and investigators.\n</li><li>Review the updated layout and functionality to ensure teams are familiar with the new locations of existing features.\n</li><li>No admin action is required to enable these changes.</li></ul>\n<p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493754"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management alert workflow is enhanced to improve usability by reducing clutter and maximizing visual space. Updates include default opening of Activity Explorer, relocated alert details and actions, and adjustable panels. Rollout begins September 2025, enabled by default for licensed tenants, with no admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1124562",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T19:26:11.35Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T00:00:12Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Experience enhancements to IRM alert workflow",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
