{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new feature in Viva Connections that helps users stay informed with SharePoint news. Starting with this rollout, users will receive a weekly notification in Microsoft Teams reminding them to catch up on SharePoint news articles they haven’t read from the previous week. These articles will be accessible under the <i>Unread</i> pill in the News tab within Viva Connections.&nbsp;&nbsp;</p><p>This feature is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498323\" target=\"_blank\">498323</a>.</p><p><b>When this will happen</b></p><p>We will begin rolling out in late August 2025 and expect to complete by mid-September 2025.</p><p><b>How this affects your organization</b></p><p>Once rolled out, users will receive a weekly notification in Microsoft Teams linking them to their unread SharePoint news in Viva Connections. This notification is enabled by default, but users can manage its visibility through their Teams notification settings.</p><p><b>What you can do to prepare</b></p><ul><li>No admin action is required. The rollout is automatic.</li><li>Admins may wish to inform users about the new notification and how to manage it in Teams settings.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498323"
    },
    {
      "Name": "Summary",
      "Value": "Viva Connections will send weekly Microsoft Teams notifications starting late August 2025, reminding users of unread SharePoint news from the past week. Notifications link to the Unread tab in Viva Connections and are enabled by default but can be managed in Teams settings. No admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS"
    }
  ],
  "EndDateTime": "2025-10-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1138793",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-20T23:37:33.753Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-20T23:37:14Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Unread News Notifications in Viva Connections",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
