{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 11, 2025: We have updated the content. Thank you for your patience.</p><p>To support a more consistent and secure email experience across Microsoft 365, we are transitioning to a unified domain for all product-generated emails. As part of this change, missed activity emails for Microsoft Teams will now be sent from ‘no-reply@teams.mail.microsoft’ instead of the previous ‘noreply@*email.teams.microsoft.com’ domain.</p><p><b>When this will happen:</b></p><ul><li>Public Preview: Rolling out early July 2025, expected to complete by early July 2025.\n</li><li>Targeted Release: Rolling out early July 2025, expected to complete by early July 2025.\n</li><li>General Availability: Rolling out mid-July 2025, expected to complete by late July 2025.\n</li></ul><p><b>How this will affect your organization:</b></p><p>There is no impact to tenant configuration or admin settings. End users will simply see a new sender address for missed activity emails from Teams. No action is required from users or admins.\n</p><p><b>What you can do to prepare:</b></p><p>No preparation is needed. However, you may wish to inform your helpdesk or communications teams of the sender address change to avoid confusion or misidentification of legitimate messages.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Missed activity emails for Microsoft Teams will now come from ‘no-reply@teams.mail.microsoft’ instead of ‘noreply@*email.teams.microsoft.com’. This change aims for a consistent and secure email experience and will roll out in July 2025. No action is required from users or admins."
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1112449",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-11T12:49:59.583Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-10T00:15:05Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Missed Activity Emails for Teams Will Now Come from a Unified Domain",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
