{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 17, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction \n</b></p><p>Viva Engage is introducing a successor to legacy Private Content Mode (PCM) in Yammer: When explicitly enabled, <i>Verified admins</i> and <i>Engage admins</i> will be able to open, view, and take moderation actions on conversations in private communities they are not members of. This capability is intended to support timely moderation and safety response without requiring admins to join each private community. Network admins and corporate communicators are not included in scope. This is a feature available to all Microsoft 365 tenants but requires an explicit, per‑admin opt‑in via a toggle in the Engage Admin Center.  \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498493\" target=\"_blank\">498493</a>.</p><p><b>When this will happen \n</b></p><p>General Availability (Worldwide): We will begin rolling out mid-September 2025 and expect to complete by late September 2025.</p><p><b>How this affects your organization \n</b></p><p>When a <i>Verified admin</i> or <i>Engage admin</i> (<i>Yammer administrator</i> in Entra) turns on the new <i>Private Content Mode toggle</i> in the <i>Engage Admin Center</i>:  \n</p><ul><li>They can view community feed, conversations, post conversations and moderate them for any private community that they are not a member of.  \n</li><li>Moderation actions supported in private communities (without membership) include delete, mute, close, plus other standard conversation actions. Admins may also start new conversations or reply in those communities; such activity appears in their <i>All-activity</i>&nbsp;feed on their storyline.  \n</li><li>Manage certain community settings like managing community experts, the files tab being shown. You can learn more on what they can and cannot do in the <a href=\"https://learn.microsoft.com/vi-vn/viva/engage/manage-security-and-compliance/monitor-private-content\" target=\"_blank\">Monitor private content in Viva Engage</a> documentation - which will be updated at the time of general availability. \n</li><li>Private content mode will persist for that particular admin user until it is explicitly disabled in the Engage admin center.&nbsp;&nbsp;</li></ul><p><b>To enable/disable this mode:  \n</b></p><p>Go to <i>Engage Admin Center </i>&gt; <i>Governance &amp; Compliance &gt; Data Management</i>&nbsp;&gt; and toggle&nbsp;<i>Private Content Mode On </i>or <i>Off.</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/7476af5a-d9da-44e7-80ee-1f8669dc8f6f\" style=\"width: 400px;\" alt=\"user settings\"></p><p>While enabled, a persistent, non‑dismissible banner appears across the Engage web UX.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9b2697d3-023d-437a-a691-b62dec144d6f\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b>Important limits: \n</b></p><ul><li>Private messages can only be viewed via data export or the ediscovery tool going forward.  \n</li><li>Community specific files and events will not be visible in private communities unless the admin is a member; admins also cannot attach media/files when posting in such communities while operating under PCM. Access to SharePoint‑scoped content remains governed by SharePoint/Entra permissions. \n</li><li>No accidental discovery: Private communities the admin isn’t a member of will not appear in Home feed and digests: content is only reachable via community navigation, or direct links.  \n</li><li>Network Analytics: no change to aggregation. Admins may continue to see aggregate counts, but drill‑down views only include posts from public communities or communities they are a member of.  \n</li></ul><p><b>What you can do to prepare \n</b></p><ul><li><b>Decide who should have access: </b>Limit enablement to Verified admins and/or Engage admins with moderation responsibilities. \n</li><li><b>Update policies and training: </b>Clarify appropriate use of this mode (purpose‑bound moderation, least‑privilege, no browsing). \n</li><li><b>Plan for audit and oversight: </b>The enablement/disablement of this mode is audit‑logged (who and when). Review your audit pipelines and retention to ensure these events are captured and monitored.&nbsp;</li></ul><p></p><p><b>Compliance considerations</b></p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n\n<tr><td>Does the change modify, interrupt, or disable audit logging capabilities?</td><td>Enablement and disablement of Private Content Mode are now audit-logged, requiring updates to audit pipelines.</td></tr>\n<tr><td>Does the change modify, interrupt, or disable eDiscovery or Content Search?</td><td>Private messages are only accessible via eDiscovery or data export through Engage admin center, changing how admins retrieve message data.</td></tr>\n\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Admins can enable or disable the mode, but it is limited to Verified admin &amp; Engage admin roles.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498493"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage updates Private Content Mode, allowing Verified and Engage admins to view and moderate conversations in private communities without membership by toggling this feature in the Engage Admin Center. It supports moderation actions, persists until disabled, and includes audit logging and compliance considerations. Rollout begins mid-September 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143993",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-17T20:14:22.343Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T00:29:09Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Modernized Private Content Mode",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
