{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing segmentation support in Microsoft Viva Engage to help organizations deliver more relevant and personalized experiences. This feature allows customers to isolate the Engage experience by department, geography, or other organizational compartments.\n</p><p><b>When this will happen:</b>\n</p><p>Private Preview (Worldwide): Starting end of June 2025 we will make the experience available to interested customers.</p><p>General Availability (Worldwide): We will begin rolling out late September 2025 and expect to complete by late September 2036.</p><p><b>How this will affect your organization:</b></p><p>This change is opt-in and will not impact organizations that choose not to enable segmentation.</p><p>An example of segmentation enabled for the Contoso organization (left) and Contoso Americas (right), showing how content can differ for each group:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/76db5257-a370-41e1-bac5-49a12ab6efe8\" style=\"width: 25%;\" alt=\"user controls\">\n</p><p>Organizations that adopt segmentation will define user segments using Microsoft Entra Dynamic Groups and enable segmentation in the Viva Engage admin center</p><p>As a user with Engage Network Admin role assignment go to the Engage Admin Center. Under Setup and Governance, find the tile labeled “Engage Segmentation”.&nbsp;</p><p><span style=\"background-color: rgb(255, 255, 0);\"> \n</span></p><p><b>STEP 1:</b></p><p>&nbsp;In a network that has not yet been enabled for segmentation, confirm that the segmentation toggle switch is “off”</p><p><b>STEP 2:</b></p><p>•\tSelect “Create New” to add segments. Segmentation can only be enabled when there is at least one segment defined\n</p><p>•\tTo create a new segment, give it a name and select the appropriate M365 group meant for the segment\n</p><p>•\tOnce segments are created, the entries may look like follows:</p><p><br></p><p><b>STEP 3:\n</b></p><p>Once the segments are defined and the user counts match up to the M365 Group membership meant for the segment, we are ready to ‘Enable segmentation’.\n</p><p>After segmentation is enabled, users will experience:</p><ul><li>Content and interactions tailored to their segment in feeds, communities, and search</li><li>Storylines and community content limited to users within the same segment</li><li>Mentioning (@mention) restricted to users within the same segment</li></ul><p>To join the Private Preview, contact your Microsoft account representative.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is introducing segmentation to deliver personalized experiences by department, geography, or other organizational compartments. The private preview starts in June 2025, with general availability in September 2025. This opt-in feature allows tailored content and interactions within user segments defined via Microsoft Entra Dynamic Groups."
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108827",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-03T23:28:54.39Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:28:33Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Introducing segmentation for personalized experiences (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
