{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're introducing two new ways for users to engage with Microsoft 365 Copilot directly within Microsoft Edge for Business. These entry points are designed to enhance productivity by enabling quick, contextual access to Copilot from within the browser.</p><p>This change is associated with Microsoft 365 Roadmap IDs: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=491473\" target=\"_blank\">491473</a> &amp; <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=489222\" target=\"_blank\">489222</a></p><p>\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Rollout has begun and is expected to complete by late July 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Once available, Entra ID users will automatically have access to these new Copilot entry points in Microsoft Edge for Business:\n</p><ul><li>Context Menu: Users can right-click on a webpage and select the Copilot option to generate a summary of the open page. Copilot will open in the side pane with the response.\n<ul><li>Microsoft 365 Roadmap ID 491473\n</li></ul></li><li>Find on Page Integration: When users type into the \"Find on Page\" input box, they can trigger Copilot to generate a response based on the entered text. The result will appear in the side pane.\n<ul><li>Microsoft 365 Roadmap ID 489222\n</li></ul></li></ul><p>These features are on by default. However, if your organization restricts Copilot from accessing page content via Data Loss Prevention (DLP), Copilot will not process the page content. If Copilot is disabled in your tenant, these features will not function as intended.\n</p><p><b>What you can do to prepare:</b>\n</p><p>No admin action is required before the rollout. We recommend:\n</p><ul><li>Reviewing your current DLP and Copilot configurations to understand the impact.\n</li><li>Notifying users about the new capabilities.\n</li><li>Updating internal documentation as needed.\n</li></ul><p>For more information, refer to <a href=\"https://learn.microsoft.com/DeployEdge/edge-learnmore-copilot-page-summary-results\" target=\"_blank\">Microsoft 365 Copilot Chat in Edge and Access to Page Content</a>.</p><p><b>Compliance considerations:</b></p><ul><li>Changes to data processing/storage/access?\tMaybe - If Copilot is allowed to access page content, it processes that content to generate responses. While the data isn't stored long-term, it is accessed and processed in new ways, especially if DLP policies are not in place.\n</li><li>New or modified AI/ML capabilities?\tYes - This update introduces new generative AI interactions via Copilot in the browser, including summarization and contextual responses based on user input or page content.\n</li><li>New generative AI interaction for end users?\tYes - Users can now interact with Copilot directly from the browser via context menu and Find on Page, representing a new surface for generative AI engagement.</li><li>Modifies Purview capabilities (DLP, labels, etc.)?\tMaybe - If DLP policies are configured to block Copilot from accessing page content, this feature will be restricted. However, the feature itself does not modify DLP—it respects existing configurations.\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489222,491473"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing two new ways to access Microsoft 365 Copilot in Microsoft Edge for Business: via the context menu and Find on Page integration. These features will be available by late July 2025 and will enhance productivity. No admin action is required, but reviewing DLP and notifying users is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108131",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-02T22:38:14.753Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-02T22:38:05Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge:  Microsoft 365 Copilot Chat entry point in Microsoft Edge for Business",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
