{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As of October 14, 2025, Microsoft is officially ending support for Windows 10. This means that Windows 10 devices will no longer receive security or feature updates, nor technical support from Microsoft. While these devices will continue to operate, the lack of regular security updates increases their vulnerability to cyber threats.&nbsp;</p><p><b>Microsoft Defender will continue to provide detection and protection capabilities to the extent possible on Windows 10 and other legacy systems. </b>Keep in mind that security solutions on legacy systems are inherently less secure and may not be able to receive all new features, so please review the important actions you can take.</p><p><b>Actions you can take:</b></p><ul><li><b>Upgrade to Windows 11: </b>This is the best way to ensure your endpoints remain protected and compliant. Devices running Windows 10 will be more vulnerable, even with ongoing security intelligence updates (SIUs).</li><li><b>Extended security update (ESU) program:</b> If upgrading isn’t immediately possible, Microsoft offers ESU for Windows 10. ESU provides critical and important security updates but does not include new features or technical support.</li></ul><p>For further guidance, connect with your Microsoft account team or check out these resources:</p><p></p><ul></ul><p></p><ul><li><a href=\"https://www.microsoft.com/windows/end-of-support?icid=SSM_Search_Windows10Endofsupport_Surface_CTA2&amp;r=1\" target=\"_blank\">End of support for Windows 10, Windows 8.1, and Windows 7 | Microsoft Windows</a></li><li><a href=\"https://blogs.windows.com/windowsexperience/2024/10/31/how-to-prepare-for-windows-10-end-of-support-by-moving-to-windows-11-today/\" target=\"_blank\">How to prepare for Windows 10 end of support by moving to Windows 11 today | Windows Experience Blog</a></li></ul><p><b><b>Compliance considerations:</b></b></p><p>Review compliance considerations as appropriate for your organization.</p><p></p><ul>\n    </ul>\n  <p></p><ul>\n</ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft ends Windows 10 support on October 14, 2025, stopping security updates and technical support. Microsoft Defender will still offer limited protection. To stay secure, upgrade to Windows 11 or use the Extended Security Update (ESU) program if upgrading isn’t immediately possible. Review compliance needs accordingly."
    }
  ],
  "EndDateTime": "2025-11-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1172531",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-14T22:41:04.157Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-14T22:40:44Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Protect your Windows 10 devices after Microsoft support ends",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
