{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of the <a href=\"https://www.microsoft.com/trust-center/security/secure-future-initiative\">Microsoft Secure Future Initiative (SFI)</a> and in alignment with the “Secure by Default\" principle, we are updating the Microsoft-managed default consent policy in Microsoft 365 Graph to align with Microsoft’s ongoing security improvements, help you to meet industry best practices, and harden your tenant’s security posture. These changes enable admins to better control third-party app access for Exchange and Teams content.  \n</p><p>This is the next step in a broader effort to evaluate and evolve Microsoft 365 defaults through the lens of SFI. This update follows our recent SharePoint and OneDrive changes that blocked legacy protocols and required admin consent for third-party apps accessing files and sites. The Exchange and Teams updates are a continuation of this same approach. admin consent for third-party apps accessing files and sites. The Exchange and Teams updates are a continuation of this same approach.\n</p><p><b>When this will happen:</b></p>\n  <p>\n    These changes will begin rolling out by end of October 2025 and are expected to be completed by late-November 2025.\n  </p>\n\n  <p><b>How this affects your organization:</b></p>\n<p>The following settings will be updated:</p>\n  <table border=\"1\" cellpadding=\"6\" cellspacing=\"0\" style=\"border-collapse:collapse;\">\n    <tbody><tr>\n      <th>Change</th>\n      <th>Impact</th>\n    </tr>\n    <tr>\n      <td><b>Require admin consent for apps accessing <u>Exchange </u>and <u>Teams </u>content&nbsp;</b></td>\n      <td>For customers using the Microsoft-managed default consent policy, admin approval will be required for third-party apps accessing Exchange and Teams content via Microsoft Graph, Exchange Web Services (EWS), Exchange ActiveSync (EAS), POP3, and IMAP4.</td>\n    </tr>\n  </tbody></table>\n  <p>\n    </p><p>To preserve end-user experience, some Exchange email clients are exempted from this change. Administrators can review and modify as noted below.</p><p>These changes will be reflected as an update to the Microsoft-managed default consent policy. With this change, any organization using the Microsoft-managed user consent policy will require admin consent for Mail, Teams Chat and Meetings functionality across various protocols.&nbsp;<a href=\"https://learn.microsoft.com/en-us/graph/permissions-reference?view=graph-rest-1.0\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Learn more about Graph permissions</a>.</p>\n  <ul><li>Organizations using other user consent policies will not be affected. \n</li><li>These changes will not require additional licensing.\n</li></ul><p>\n <b>What you can do to prepare:</b></p>\n<p>We recommend the following actions:\n  </p><ul>\n    <li>Assess current configurations: <a href=\"https://learn.microsoft.com/entra/identity/enterprise-apps/manage-application-permissions?pivots=portal\" target=\"_blank\">Review existing third-party applications</a> that access Exchange mail, calendar, contacts, and Teams chat/meetings data. \n<ul><li>If you already intend to allow user consent for certain third-party apps, we recommend that you create granular app access policies in advance, so those apps remain usable without interruption (<a href=\"https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/manage-app-consent-policies?pivots=ms-graph\" target=\"_blank\">Manage app consent policies</a>, <a href=\"https://learn.microsoft.com/en-us/entra/identity/enterprise-apps/configure-user-consent?pivots=portal\" target=\"_blank\">Configure how users consent to applications</a>)\n</li><li>If you are already using another consent policy that covers applications that will be impacted by this change and are satisfied with the policy, no changes are required from your end.  \n</li></ul></li><li>Configure Admin Consent workflow: If your organization relies on third-party apps for Exchange or Teams, set up the workflow (<a href=\"https://learn.microsoft.com/entra/identity/enterprise-apps/configure-admin-consent-workflow\" target=\"_blank\">Configuring admin consent workflow</a>); it will enable users to send a request to your global or app admin(s) to approve use of an application for users. Otherwise, potential users will not have an option to request admin approval. \n</li><li>Notify stakeholders: Inform IT admins, app owners, and security teams about the upcoming changes.\n</li><li>Update documentation: Ensure internal processes and app onboarding guidance reflect the new defaults and the admin consent process.</li></ul><p><b>Additional considerations:</b></p>\n  <p>Does the change alter how existing customer data is processed and stored?</p>\n  <ul><li>No, it doesn’t change how data is processed or stored.</li></ul>\n\n  <p>Does the change alter how existing customer data is accessed?</p>\n  <ul><li>\n    Yes, moving forward only admins may approve access for the set of permissions outlined above. Users cannot grant consent to third-party applications that access Exchange and Teams data via delegated permissions.\n  </li></ul>\n\n  <p>What is the impact on existing applications?</p>\n  <ul><li>\n    Users who have already granted consent to an app can continue to use it without interruption. New users, or apps requesting new or broader permissions, will require admin approval before they can be used. This ensures that only applications explicitly validated by the admin(s) can gain new access moving forward.\n  </li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting late October to November 2025, Microsoft will require admin consent for third-party apps accessing Exchange and Teams content via Microsoft-managed default consent policy. This enhances security by restricting user consent, affecting new app permissions but not existing approved apps. Admins should review app access and configure consent workflows accordingly."
    }
  ],
  "EndDateTime": "2026-01-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1163922",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-02T02:05:11.27Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-02T02:02:35Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Upcoming Secure by Default Settings Changes for Exchange and Teams APIs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
