{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\n</p><p>The new <b>Designer editor</b> integration in PowerPoint introduces a modern, intuitive image editing experience directly within your slides—eliminating the need to switch apps or interrupt your workflow. Whether you're refining visuals for a pitch deck, enhancing marketing assets, or simply making your slides more engaging, the <b>Designer editor</b> enables fast, seamless image enhancements powered by AI.</p><p>Screenshot 1: <i><b>Designer editor </b>is now built into PowerPoint, so you can edit pictures without leaving the app. To get started, select a picture and then select <b>Picture Format</b> &gt; <b>Edit Picture</b>, or right-click it and select <b>Edit Picture</b>.</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/7a8f02a8-999b-49fe-adda-4a5decc5daa5/b943695abfa4819eb5252d669400b01161ffe077.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Screenshot 2: <i>Transform your visuals using AI-powered tools like <b>Remove background</b>, <b>Auto enhance</b>, and more—right from the canvas.</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ea47aec0-8532-4ffc-aeaf-cb43dd8e3713\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=508530\" target=\"_blank\">508530</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p><p>\n</p><ul>\n<li><b>General Availability (Worldwide):</b> Rollout will begin in early December 2025 and is expected to complete by mid-December 2025.</li>\n</ul><p><b><b>How this affects your organization:</b></b></p><p>\n</p><ul>\n<li><b>Who is affected:</b> All users of PowerPoint in Microsoft 365 across commercial and education tenants.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will gain access to a new AI-powered image editing experience within PowerPoint.</li>\n    <li>The <b>Designer editor</b> will be available directly in the PowerPoint interface.</li>\n    <li>The following capabilities will be included:\n      <ul>\n        <li><b>Generative Erase:&nbsp;&nbsp;</b>Remove unwanted elements from images.</li>\n        <li><b>Generative Move:</b> Reposition objects within an image.</li>\n        <li><b>Add Text:</b> Insert text directly onto images.</li><li><b>Edit Text:</b>&nbsp;Recognize existing text in an image and edit it.</li>\n        <li><b>Upscale:</b> Improve image resolution for sharper visuals.</li>\n        <li><b>Background Removal:</b> Remove backgrounds for clean designs.</li>\n        <li><b>Auto Enhance (Color Adjustment):</b> Automatically improve color balance and vibrancy.</li>\n        <li><b>Effects:</b> Apply creative filters and styles.</li>\n      </ul>\n    </li>\n    <li>The feature will be enabled by default for all users.</li>\n    <li>No changes to existing admin policies are required unless your organization chooses to manage availability.</li><li><b>AI usage limits for this feature:</b>\n<ul>\n<li>Commercial users:\n<ul>\n<li>Copilot licensed users have fair use access to all generative AI features.</li>\n<li>Entra users have capacity-limited access; in-product messaging will notify users when limits are reached.</li>\n</ul>\n</li>\n<li>Consumer users:\n<ul>\n<li>Free and Basic MSA accounts: 15 credits/month for generative AI features.</li>\n<li>Personal and Family subscribers: 60 credits/month.</li>\n<li>Microsoft 365 Premium and Copilot Pro (while supported): fair use access.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul></li>\n  </ul>\n\n\n\n<p><b><b>What you can do to prepare:</b></b></p><p>\n</p><ul>\n<li>No action is required to enable the feature—it will be <b>on by default</b>.</li>\n<li>Review internal documentation if you provide guidance on PowerPoint features.</li>\n<li>Communicate this change to helpdesk and support teams to prepare for potential user questions.</li>\n<li>If your organization wishes to manage availability:\n  <ul>\n    <li>Configure access through policy or permissions as needed.</li>\n  </ul>\n</li>\n<li>Be aware:\n  <ul>\n    <li>This feature uses AI capabilities to edit and enhance images in PowerPoint.</li>\n    <li>AI usage disclaimers are included within the editor interface for end users.</li></ul></li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\n</p><table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>AI/ML capabilities interacting with customer data</td><td>The Designer editor introduces AI-powered image editing features (e.g., generative erase/move) that interact with user-uploaded image content.</td></tr>\n<tr><td>New way of interacting with generative AI</td><td>Users can directly engage with generative AI tools within PowerPoint to modify and enhance images.</td></tr>\n<tr><td>Admin control available</td><td>Organizations can manage availability through policy or permissions.</td></tr>\n<tr><td>User control</td><td>Users can access and use the Designer editor directly within PowerPoint.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "508530"
    },
    {
      "Name": "Summary",
      "Value": "PowerPoint will add the AI-powered Designer editor by December 2025, enabling in-app image editing with features like generative erase, move, text editing, background removal, and auto-enhance. It will be enabled by default for all Microsoft 365 users, with usage limits based on subscription type."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-01-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187787",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-18T20:42:12.883Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T20:39:22Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "PowerPoint adds AI-powered image editing with \"Designer editor\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
