{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 8, 2025: We have updated the timeline. Thank you for your patience.</p><p>In response to customer feedback, we are introducing enhanced flexibility, greater scalability, and streamlined compliance management for private channels in Microsoft Teams.\n</p><p>Note: It is important for compliance managers to review and take appropriate action before migration starts for these changes to private channels. \n</p><p><b>What's changing?</b></p><p>Private channels will transition use a channel mailbox instead of individual user mailboxes. \n</p><p>Organizations with compliance policies (retention, legal hold, data loss prevention, or eDiscovery) for private channels must review these policies and must apply policies to the Microsoft 365 group for the channel’s team before migration begins to ensure continuity of the policy for a private channel.  Existing policies will continue to apply to user mailboxes; post-migration, new data will be governed by policies on the group. Note that policies applied to the team’s group can apply to all channels in the team.\n</p><p>After the transition to updated private channels in your organization, private channels will be updated as follows.\n</p><ol><li>Private channels are no longer limited to 30 per team. Instead, private channels can be added up to the limit of 1000 total channels per team.\n</li><li>Private channels can now have up to 5000 members, instead of 250.\n</li><li>Meetings can now be scheduled in private channels.\n</li><li>Compliance policies for private channels are part of the team’s group policies instead of the individual user level.\n</li></ol><p>The migration of private channels to the updated capabilities will begin in early October 2025 and continue through January 2026 (previously December 2025). During this period, private channels will continue to operate normally. Admins and compliance managers should complete any required policy changes by October 2025 (previosly September), before the migration begins. Changes to private channel limits and meeting scheduling will follow in February 2026. Migration can start or end at different times for each tenant during the rollout period. To track progress, a new PowerShell command will be available for tenants to check whether their migration has started or is completed. This post will be updated soon with details on the PowerShell command.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out private channel migration early October 2025 (previously late September) and expect to complete by late January 2026 (previously mid-December 2025). Updated channel limits and meeting scheduling will begin rollout in early February 2026 and we expect to complete by end of February 2026.</p><p>\n</p><p><b>Message exceeds character limit for the request portal. Adding html below for reference: </b><a href=\"https://microsoft-my.sharepoint-df.com/:t:/p/brimcg/ERmYzK2UOKBBi9726qR52nEBGw-0sPPCEc1PfogoBOxb-A?e=mfTqqs\" target=\"_blank\">https://microsoft-my.sharepoint-df.com/:t:/p/brimcg/ERmYzK2UOKBBi9726qR52nEBGw-0sPPCEc1PfogoBOxb-A?e=mfTqqs</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams private channels will transition to use a channel mailbox, increasing limits to 1000 channels per team and 5000 members per channel, with meetings allowed. Compliance policies will shift to team group level. Migration starts October 2025, completing by January 2026; new features roll out February 2026."
    }
  ],
  "EndDateTime": "2026-03-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134737",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-08T17:35:49.717Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-13T23:09:57Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Private channels increased limits and transition to group compliance",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
