{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 30, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction\n</b></p><p>We’re retiring the <i>Deploy Shifts to your frontline teams at scale</i> feature in Microsoft Teams Admin Center. Starting September 5, 2025, this functionality will no longer be available. We recommend using the Teams web or desktop app to manage <i>Shifts</i>, where ongoing investments will continue to enhance scheduling capabilities.\n</p><p><b>When this will happen\n</b></p><p>The retirement will begin September 25, 2025.\n</p><p><b>How this affects your organization\n</b></p><p>You’re receiving this message because your organization uses Microsoft Teams. If you do not currently use the <i>Deploy Shifts to your frontline teams at scale</i> feature in Teams Admin Center, no action is required.\n</p><p>After September 5, 2025:\n</p><ul><li>Admins will no longer be able to deploy <i>Shifts </i>at scale via Teams Admin Center.\n</li><li><i>Shifts </i>management will continue to be supported in the Teams web and desktop apps.\n</li></ul><p><b>What you can do to prepare\n</b></p><p>No admin action is required. This change will occur automatically on the specified date.\n</p><p>To continue managing <i>Shifts</i>, use the Teams web or desktop app:\n</p><ul><li>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/frontline/deploy-shifts-at-scale?view=o365-worldwide\" target=\"_blank\">Deploy Shifts to your frontline teams at scale</a></li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Deploy Shifts to your frontline teams at scale\" feature in Teams Admin Center will retire starting September 5, 2025. After this date, admins must manage Shifts via the Teams web or desktop apps. No admin action is required; the change happens automatically."
    }
  ],
  "EndDateTime": "2025-11-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1127233",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-30T15:47:34.023Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-01T23:23:04Z",
  "Tags": [
    "Updated message",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Feature retirement: deploy Shifts to your frontline teams at scale in Teams Admin Center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
