{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re improving the PowerPoint export experience for the Team Summary report in Viva Glint. Managers will soon be able to export default report sections directly into fully editable PowerPoint slides. This enhancement enables faster, more flexible presentation creation compared to the previous screenshot-based export method.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=489811\" target=\"_blank\">489811</a></p>\n\n<b>When this will happen</b><p></p><p>\n</p><p>General Availability (Worldwide): Rollout will begin in mid-September 2025 and is expected to complete by end of September 2025.</p>\n\n<b>How this affects your organization</b><p></p><p>\n</p><ul>\n<li><b>Native PowerPoint output:</b> Reports can now be exported as editable PowerPoint slides, allowing users to leverage built-in formatting and editing tools without needing to manipulate static images.</li>\n<li><b>Cleaner, customizable presentations:</b> The new format improves layout and reduces whitespace, helping users create polished presentations more efficiently.</li>\n<li><b>Faster, more reliable export experience:</b> The export process has been optimized for performance, reducing time-outs and improving reliability—especially for large reports with filters and visuals.</li>\n</ul>\n<p>Note: The previous screenshot-based export option remains available for users who require custom PowerPoint templates, which are not yet supported in the new format.</p>\n<p>This feature is on by default and does not require admin configuration.</p>\n\n<b>What you can do to prepare</b><p></p><p>\n</p><p>No action is required to enable this feature. We recommend informing report consumers and presentation creators about the new export option to streamline their workflows.</p>\n<p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489811"
    },
    {
      "Name": "Summary",
      "Value": "Viva Glint's Team Summary report will soon export directly to editable PowerPoint slides, enabling faster, customizable presentations with improved layout and reliability. Rollout starts mid-September 2025. The screenshot export remains for custom templates. No admin action needed; inform users about the new feature."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1137607",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-18T23:09:14.31Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-18T23:09:09Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva - Viva Glint: Export Team Summary report in Viva Glint to editable PowerPoint slides",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
