{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 10, 2025: We have updated the timeline. Thank you for your patience.\n</p><p><b>Introduction</b></p><p>We’re introducing new Viva Engage role management APIs in Microsoft Graph, now available in beta. These APIs allow IT admins to programmatically manage Viva Engage-specific roles—such as Corporate Communicator, Network Administrator, and Verified Administrator, enabling automation, scalability, and integration with existing identity systems.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497131\" target=\"_blank\">497131</a>.</p><p><b>When this will happen:</b>\n</p><p><b>General Availability (Worldwide):</b> We will begin rolling out in late September 2025 (previously early September) and expect to complete by early October 2025 (previously late September).</p><p><b>How this will affect your organization:</b></p><p>These new APIs provide greater flexibility and control for IT admins by enabling:\n</p><ul><li>Automated role assignments\n</li><li>Programmatic retrieval of role data\n</li><li>Streamlined admin workflows across large organizations\n</li></ul><p>This expands on existing Microsoft Graph support for roles like Global Administrator and Yammer Administrator, now including all Viva Engage-specific roles. The update does not change the current UI-based role management experience—it simply adds a new programmatic option for admins and corporate communicators to provision Viva Engage roles.</p><p><b>What you need to do to prepare:</b></p><p>No immediate action is required. If your organization is interested in using these APIs, you can:\n</p><ul><li>Begin testing the <b>beta APIs </b>using either delegated (user-authenticated) or app-only access models</li><li>Ensure the appropriate roles are assigned—<b>Entra admin</b> or <b>Corporate Communicator</b>—as these are required to use the APIs</li><li>Share feedback to help improve the experience ahead of general availability</li></ul><p>Learn more:</p><ul><li><a href=\"http://Review the https://learn.microsoft.com/graph/api/resources/viva-engage-role-management?view=graph-rest-beta\" target=\"_blank\">Introducing Viva Engage Role Management APIs on Microsoft Graph API | Viva Engage | Viva Engage Blog</a></li><li><a href=\"https://learn.microsoft.com/graph/api/resources/engagement-api-overview?view=graph-rest-beta\" target=\"_blank\">Use the Microsoft Graph API to work with Viva Engage | Microsoft Learn</a></li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497131"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is releasing new Viva Engage role management APIs in Microsoft Graph (beta) for IT admins to automate and manage roles like Corporate Communicator and Network Administrator. Rollout begins late September 2025, enhancing programmatic control without changing the current UI. No immediate action required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1115983",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-10T14:24:01.037Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-15T22:53:20Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva | New Microsoft Graph APIs for Viva Engage role management",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
