{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 25, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>The <b>Interpreter agent</b> is now available in <b>Microsoft Teams Rooms on Windows</b> for devices with a <b>Teams Rooms Pro license</b>. This feature enables real-time interpretation in up to nine languages, allowing participants to speak and listen in their preferred language. It also offers an option to simulate a participant’s personal voice for a more inclusive experience. No additional Copilot license is required.</p><p>Screenshot 1: <i>Console</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6db07e31-9041-4f92-aad9-476cdda507ca\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Screenshot 2: <i>Front of room display</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f41f7224-7e2c-4751-8f6d-25c4927c9106\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=516571\" target=\"_blank\">516571</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>General Availability (Worldwide):</b> Rolling out early January 2026 (previously mid-December 2025), expected completion by late January 2026 (previously mid-January).</li>\n</ul>\n\n<p><b><b>How this will affect your organization:</b></b></p>\n<p><b>Who is affected:</b> Organizations using <b>Teams Rooms on Windows</b> with <b>Teams Rooms Pro licensing</b>.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Users can turn on <b>Interpreter</b> during a meeting:\n<ul>\n<li>Go to <b>More</b> &gt; <b>Turn on Interpreter</b>, then select the language and voice option.</li>\n</ul>\n</li>\n<li>Supported languages: Chinese (Mandarin), English, French, German, Italian, Japanese, Korean, Portuguese, Spanish.</li>\n<li>Voice representation options: <b>Simulated my voice</b> (default) or <b>Automated voice</b>.</li>\n<li>Privacy: Voice samples or biometric data are never stored; original audio is analyzed in real time and not retained.</li>\n<li>Interpretation is simultaneous and may introduce a short delay; accuracy and latency improvements are ongoing.</li>\n<li>Tenant settings:\n<ul>\n<li><b>Interpreter</b> is enabled by default. Admins can control whether the organization can use Interpreter and set the default voice option.</li>\n<li>No device-level setting in the <b>Pro Management Portal (PMP)</b>.</li>\n</ul>\n</li>\n<li>Licensing: 20 hours of interpretation included per room account per month with a <b>Teams Rooms Pro license</b>. Access beyond included hours is subject to available capacity.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/interpreter-agent-teams\" target=\"_blank\">Manage Interpreter agent for your organization - Microsoft Teams | Microsoft Learn&nbsp;</a></p><ul>\n</ul>\n\n<p><b><b>What you need to do to prepare:</b></b></p>\n<ul>\n<li>Ensure room accounts have a <b>Teams Rooms Pro license</b>.</li>\n<li>Review tenant settings:\n<ul>\n<li>Confirm <b>Interpreter</b> is enabled (default).</li>\n<li>Set the preferred default voice option in your tenant.</li>\n</ul>\n</li>\n<li>Communicate this change to helpdesk and support teams.</li>\n<li>Update internal documentation to reflect the new functionality.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "516571"
    },
    {
      "Name": "Summary",
      "Value": "The Interpreter agent in Microsoft Teams Rooms on Windows with a Teams Rooms Pro license enables real-time interpretation in nine languages, offering simulated or automated voice options. Rolling out worldwide from January 2026, it includes 20 hours of interpretation monthly per room, with tenant controls for enabling and voice settings."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188221",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-25T17:17:25.59Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-19T23:24:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Interpreter agent support in Teams rooms on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
