{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>Starting January 2026, <b>Microsoft Whiteboard will begin retiring the</b> <b>Insert Document</b> feature. This change removes the ability to insert PDFs and PowerPoint files from OneDrive for Business &amp; SharePoint into Whiteboard. The feature is being retired because of low usage and ongoing maintenance requirements.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li>General Availability (Worldwide): We will begin retiring this feature starting in early January 2026 and expect to complete retirement in early February 2026.</li>\n</ul>\n\n<p><b><b>How this will affect your organization:</b></b></p>\n<p><b>Who is affected:</b> All users of Whiteboard on Windows and Mac desktops</p>\n<p><b>What’s changing?</b></p>\n<ul>\n<li>The option to insert PDFs and PowerPoint files from OneDrive for Business &amp; SharePoint into Whiteboard will no longer be available.</li>\n<li>No admin controls are available to retain or re-enable the feature.</li>\n</ul>\n<p><b>What remains?</b></p>\n<ul>\n<li>Users can continue to insert PDFs from their local PC using the Whiteboard Windows Native app.</li>\n<li>The Insert Picture feature will remain unaffected.</li>\n<li>Already inserted PDFs and PPTs will remain unaffected and can be seen on existing boards.</li>\n</ul>\n\n<p><b>Details</b></p>\n<p>Previously, the Insert Document feature allowed users to:</p><ul>\n<li>Add PDFs and PowerPoint files via OneDrive for Business &amp; SharePoint or Local PC on both Whiteboard Windows Native and Web.</li>\n<li>Select specific pages/slides, which were then converted to images and inserted into the Whiteboard canvas.</li>\n</ul>\n<p>With this retirement:</p>\n<ul>\n<li>The ability to insert PDFs and PowerPoint files from OneDrive for Business &amp; SharePoint will be removed.</li>\n<li>Local PDF insertion on Windows Native will continue to be supported.</li>\n</ul>\n\n<p><b>Recommended Alternatives</b></p>\n<ul>\n<li><b>Convert files to images before upload: </b>Use PowerPoint or PDF export options to save slides/pages as images and then insert them using the<b> Insert Picture</b> feature.</li>\n<li><b style=\"\">Use local PDF insertion: </b>Users can insert PDFs from their local PC via the Whiteboard Windows Native app.</li>\n<li><b>Leverage OneDrive sharing links: </b>Share the document link in Whiteboard notes or sticky notes for quick access.</li>\n<li><b>Consider Microsoft Teams integration: </b>Attach documents directly in Teams chats or meetings for collaborative review alongside Whiteboard.</li>\n</ul><p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Inform users about this change and share recommended alternatives to minimize workflow disruption.</li>\n<li>Update internal documentation and training materials to reflect the removal of OneDrive-based document insertion.</li>\n<li>Prepare helpdesk teams to guide users on alternative methods and address questions related to this feature change.</li><li>No immediate action is required. However, if your workflows depend on inserting documents from OneDrive &amp; SharePoint, plan to use the alternatives above before February 2026.</li></ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations are identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting January 2026, Microsoft Whiteboard will retire the Insert Document feature that allows inserting PDFs and PowerPoint files from OneDrive for Business and SharePoint. Local PDF insertion on Windows Native app remains. Users should use alternatives like converting files to images or sharing links."
    }
  ],
  "EndDateTime": "2026-03-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1189912",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-25T22:30:35.36Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-25T22:29:53Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retirement of Insert Document and Insert PPT feature in Microsoft Whiteboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
