{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We’re updating the <b>data retention policy </b>for Microsoft Viva Pulse to improve consistency and transparency in how customer content is stored. This change aligns with our commitment to data governance and ensures that Pulse data remains available for reporting and analysis as long as the subscription is active.</p><p><b><b>When this will happen:</b></b></p><ul><li><b>General Availability: </b>Begins early October 2025</li><li><b>Expected Completion:</b> Mid-October 2025</li></ul><p><b><b>How this affects your organization:</b></b></p><p>Who is affected: All Microsoft 365 tenants using Viva Pulse</p><p>What will happen:</p><ul><li>Viva Pulse templates (research-backed and custom) are stored in Azure Cosmos DB based on tenant location (West US or EU).</li><li>These templates will be retained indefinitely while the tenant maintains an active Pulse subscription or until the tenant deletes the data.</li><li>Prior to September 1, 2025, Pulse instances were stored in Microsoft Forms. Forms data will continue to be retained indefinitely if the Pulse request met the minimum response threshold for report generation. If the Pulse request closed without meeting the threshold, Forms data was deleted immediately.</li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>No action is required from your organization at this time.</li><li>This change does not alter user workflows or admin experiences.</li><li>Learn more: <a href=\"https://learn.microsoft.com/viva/pulse/get-started/data-residency-for-viva-pulse\" target=\"_blank\">Data residency for Viva Pulse | Viva Pulse | Microsoft Viva | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed (such as documents, emails, chats, etc.), if so how and to what extent?</td><td>Yes. Viva Pulse data will now be stored indefinitely in Azure Cosmos DB while the tenant maintains an active Pulse subscription or until the tenant chooses to delete their data. Previously, Pulse data was stored in Microsoft Forms and subject to deletion based on reporting thresholds.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse updates its data retention policy starting October 2025, storing templates indefinitely in Azure Cosmos DB while subscriptions are active. Previously stored in Microsoft Forms, data retention depended on response thresholds. No action is needed, and workflows remain unchanged."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1158895",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-24T22:42:37.377Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-24T22:42:20Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: Updates to data retention policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
