{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 22, 2025: We have updated the timeline. Thank you for your patience.</p><p>We’re adding a new capability to Microsoft Defender that allows SOC teams and admins to dispute submission results directly within the portal.</p><p>This enhancement enables organizations to provide feedback on false positives and false negatives without opening support tickets, streamlining the feedback loop and improving detection accuracy over time.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=488096\" target=\"_blank\">488096</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Rollout will begin in early August 2025 (previously mid-July) and is expected to complete by late August 2025 (previously late July).\n</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization uses Microsoft Defender for Office 365 admin submission features, you’ll now see an option to dispute submission results directly in the Microsoft Defender portal. This allows admins to flag incorrect verdicts (false positives or false negatives) and provide context or evidence, helping Microsoft improve detection accuracy.\n</p><p>This feature is on by default and does not require any configuration.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins can access the new dispute functionality by navigating to:\n</p><p>Microsoft Defender portal: https://security.microsoft.com\n</p><p>Go to Actions &amp; Submissions &gt; Submissions or directly to https://security.microsoft.com/reportsubmission\n</p><p>To dispute a submission:\n</p><ol><li>Select a tab (Emails, URLs, or Email attachments).\n</li><li>Click on a completed submission row.\n</li><li>Select Dispute submission result.\n</li><li>Choose one or more of the following:\n</li><ul><li>Result\n</li><li>Reason behind result\n</li><li>Recommended steps\n</li></ul><li>Optionally, provide additional information or upload a screenshot.\n</li><li>Click Submit dispute.</li></ol><p>A new submission ID will be generated, and a confirmation message will appear in the flyout. You can view dispute details by clicking the submission panel.</p><p>\n</p><p>Note: Bulk submissions disputes are allowed. However, if a submission contains mixed results, the dispute option will be unavailable.\n</p><p>For more information, refer to:\n</p><ul><li><a href=\"https://learn.microsoft.com/en-us/defender-office-365/submissions-admin\" target=\"_blank\">Manage submissions - Microsoft Defender for Office 365 | Microsoft Learn </a>\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488096"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 will allow SOC teams and admins to dispute submission results directly in the portal, improving detection accuracy by providing feedback on false positives and negatives. This feature, available from early August 2025, is on by default and requires no configuration. Admins can access it via the Microsoft Defender portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108843",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-22T21:02:52.863Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:37:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Ability to Disagree with admin submissions analysis",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
