{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new data export capability in Viva Learning to help organizations gain deeper insights into learning engagement. This update enables you to export detailed activity data across both Viva Learning and Academy via six CSV files, providing greater visibility into learning trends and usage. This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468889\" target=\"_blank\">468889</a>.\n</p><p><b>When this will happen\n</b></p><p>We will begin rolling out to Targeted Release in mid-July 2025 and expect to complete by late July 2025. General Availability rollout will begin in late July 2025 and is expected to complete by the end of July 2025.\n</p><p><b>How this affects your organization\n</b></p><p>A new <i>Data export</i> tab will appear in the Viva Learning admin center under Reports. Admins will be able to export six CSV files containing detailed learning activity data across Viva Learning and Academy. This feature is on by default and does not change existing report access permissions.\n</p><p><b>What you can do to prepare\n</b></p><p>Access to the new reports can be managed using Microsoft 365 groups under Manage permissions, consistent with the existing Reports tab. No additional configuration is required. Review your current group permissions to ensure appropriate access.&nbsp;</p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468889"
    },
    {
      "Name": "Summary",
      "Value": "Viva Learning now offers data export reporting with six CSV files for detailed activity insights. Rolling out from mid-July to late July 2025, a new Data export tab will appear in the admin center. Access is managed via Microsoft 365 groups with no compliance issues identified."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-09-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1127223",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-01T23:16:42.003Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-01T23:16:22Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Viva Learning: data export reporting now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
