{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 26, 2026: We have updated the content Thank you for your patience.</p><p><b><b>Introduction</b></b>\n</p><p>Agent in Viva Engage communities are now available in Public Preview. Community admins can add agents to communities to help draft answers to questions without best or verified answers based on community content and add context to posts by answering follow up questions using the community's conversations and SharePoint site and library.<br><br>We’re now adding&nbsp;the&nbsp;option&nbsp;for community admins to&nbsp;specify&nbsp;additional&nbsp;SharePoint sites outside the&nbsp;community as grounding sources.&nbsp;The agent will only use sites that community admins select, and it drafts answers from items that community members can view (Read).</p><p>We are also adding a new capability: tagging by community members. Tagging by community members enables Microsoft 365 copilot-licensed users to @-mention the community agent in the comments and replies of threads with follow up questions and requests to add context to posts. When tagged, the community agent will reply in the post. Tagging by community members will be enabled by default, but can be disabled by community admins in the agent settings.</p><p><b><b>When this will happen:</b></b></p><ul>\n<li><b>Agents in communities Public Preview: </b>available now</li><li><b>SharePoint Grounding on Community site and library Public Preview (Worldwide): </b>available now</li><li><b>Grounding on SharePoint sites and libraries outside the community and tagging by community members Public Preview (worldwide): </b>Starting Feb. 16th, expected to complete by mid-March.</li>\n<li><b>General Availability (Worldwide): </b>Begins late March 2026, expected to complete by late April 2026</li>\n</ul>\n\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> Viva Engage community admins and members with Microsoft 365 Copilot licenses; Global and Engage admins managing Viva Engage networks</li>\n<li><b>What will happen:</b></li>\n<ul>\n<li><b>During Public Preview:</b></li>\n<ul>\n<li>Admins can opt their network into the preview via the <i>Engage admin center: Engage</i>&nbsp;admin center &gt; Tenant Settings &gt; Enable Community Agent Public Preview.</li></ul></ul></ul><p></p><ul></ul>Once enabled, admins can add agents to any community they manage.<p><i>Figure i. Add agent to community​</i></p><p></p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c90ccffc-5ca8-456f-bcdd-4b47e6a330f2\" style=\"width: 400px;\" alt=\"user settings\"><p></p><p></p><p>The agent will proactively draft answers to unanswered questions using past conversations.</p><p>By default, the agent posts answers <i>automatically</i>.</p><p>Admins can configure whether the agent posts answers automatically or only after approval and if tagging by community members is enabled.</p><p><i>Figure ii. Configure the agent's capabilities and knowledge sources</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/20b8887e-52f2-490e-820d-0a445570f685/3b91f26ec384430db23f225b99f3bf25f0a27ce1.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p><b><b>Grounding on SharePoint sites outside the community</b><b></b></b></p><ul><li>Community admins can add SharePoint sites and libraries outside the community as additional grounding sources (for sites/libraries they administer).</li><li>When an admin adds a site or library, they’ll be prompted to grant the community’s Microsoft 365 group Read access if it doesn’t already have permission.</li><li>The agent only drafts answers using content that all community members can view (Read).</li><li>By default, the agent uses the community’s SharePoint site and library. Any sites outside the community are optional and add to (not replace) the default grounding.</li></ul><p>If Require review is enabled, admins and designated experts will be notified when the agent drafts an answer. They can approve, edit, or dismiss the response.</p><p><i>Figure iii. Community admins and experts can review agent suggestions​</i></p><p>\n<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/63c1e5bf-334c-4d4a-878f-ac20b558e5e1/e974e32b0f05133c6b86305b27caccb1bd03748c.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p>If tagging by community members is enabled, then community members can @-mention the agent in messages.</p><p><b>Coming soon (General Availability):</b></p><ul></ul><p></p><p>The agent will only use content that all community members can access.</p><p>Admins must be owners of the SharePoint sites they wish to configure.</p><p>Admins can add additional SharePoint sites to expand the agent’s grounding knowledge.</p><p>The agent will be grounded by default on the community’s SharePoint site.</p><p>Community members can tag the community agent in community posts.</p><p>All Microsoft 365 Copilot licensed users will have access to the <i>Community Agent</i> by default.</p><p>The <i>Community Agent Public Preview</i> toggle will be retired.</p>\n\n<p></p><b><b>What you can do to prepare:</b></b><p></p>\n<ul>\n<li>If participating in preview:</li>\n<li>Opt your network into the preview via the <i>Engage admin center</i> \n</li><li>Communicate this change to helpdesk staff.&nbsp;</li>\n<li>Update internal documentation that references <i>Viva Engage Community Agent</i> behavior or setup.</li>\n<li>No action is required at GA; the feature will be <b style=\"\">on by default</b>.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/viva/engage/ai-technology-with-viva-engage/agents-community-network-deployment-config\" target=\"_blank\">Set up and manage agents in Viva Engage communities | Microsoft Learn</a></p>\n\n<p><b><b>Compliance considerations:</b></b></p><table border=\"1\">\n<tbody><tr><th>Consideration</th><th>Explanation</th></tr>\n<tr><td>Uses customer data</td><td>The agent accesses SharePoint content to generate answers. Only content accessible to all community members is used.</td></tr>\n<tr><td>Introduces AI/ML agent capabilities</td><td>The agent uses generative AI to draft responses based on SharePoint content.</td></tr>\n<tr><td>Admin control available</td><td>(Optional) Community admins can configure which SharePoint sites are used for grounding. Admin must be site owner.</td></tr>\n<tr><td>User interaction with generative AI</td><td>End users receive AI-generated answers grounded in community conversations and SharePoint content</td></tr>\n<tr><td>Can be controlled through Entra ID group membership</td><td>Admin access and site ownership can be managed via Entra ID group membership.</td></tr>\n</tbody></table><br><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Viva Engage community agents are in Public Preview, allowing admins to add AI agents that draft answers using community and SharePoint content. Tagging by members enables follow-up questions. Admins can specify additional SharePoint sites for grounding. General Availability starts late March 2026, with default enablement."
    }
  ],
  "EndDateTime": "2026-05-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1155311",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-26T20:39:00.75Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-18T17:07:29Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Viva Engage: Agents in Viva Engage communities Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
