{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing a new contextual entry point under the <i>References </i>tab in Word that helps users discover third-party citation tools alongside the default Word citation functionality. This update is designed to support users who are familiar with citation principles but need help navigating specific formatting styles like APA, MLA, and Chicago.</p><p>By surfacing both first-party and third-party options, users can quickly onboard to built-in tools or explore additional solutions that best fit their needs.\n</p><p><b>When this will happen:</b></p><p>Targeted Release: Rollout is expected to complete by early July 2025.\n</p><p>General Availability (Worldwide, GCC, GCC-High, DoD): Rollout will begin early July 2025 and is expected to complete by late July 2025.\n</p><p><b>How this will affect your organization:</b></p><p>This update enhances the discoverability of third-party citation tools directly within the Word app. Users will see a new contextual entry point under the References tab, making it easier to access and compare citation solutions.\n</p><ul><li>The default Word citation tool will remain visible and accessible.\n</li><li>Third-party tools will appear in parallel, offering users more flexibility and choice.\n</li></ul><p>This feature is on by default and requires no admin configuration to enable.\n</p><p><b>What you can do to prepare:</b></p><p>If your organization uses custom citation tools or has specific compliance requirements, consider reviewing the available third-party options to ensure alignment with your policies.</p>\n<p></p>\n<p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "A new contextual entry point under the References tab in Word will help users discover third-party citation tools alongside the default Word citation functionality. The rollout will complete by late July 2025, enhancing tool discoverability and flexibility. No admin configuration is required."
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108849",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-03T23:39:56.587Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:39:42Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "3rd party citation add-in in Word reference tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
