{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>To improve transparency and streamline post-export workflows, Microsoft Purview eDiscovery is enhancing metadata reporting in the <code>item.csv</code> files generated during Add to Review Set and Export processes. These updates are designed to provide deeper insights into item-level attributes and improve error traceability.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=506220\" target=\"_blank\">506220</a>.</p><p><b><b>When this will happen:</b></b></p><ul><li><b>General Availability (Worldwide, GCC, GCCH, DoD):</b> Rollout will begin in early October 2025 and is expected to complete by mid-November 2025.</li></ul><p><b><b>How this affects your organization:</b></b></p><p>Who is affected: Admins and users working with Microsoft Purview eDiscovery (Standard and Premium) workflows, particularly those who rely on metadata exports for review and automation.</p><p>What will happen:</p><ul><li>The <code>item.csv</code> report will have the follow updates:<ul><li>Status: Indicates if the item is processed successfully or has errors.</li><li>Error Detail: Detailed error messages for the item.</li><li>Custodian: SMTP address of the custodian the item was associated with.</li><li>Sensitivity label: GUID of the sensitivity label applied to the item.</li><li>IsEncrypted: True or false value to indicate if the item is encrypted.</li><li>SharePoint Item Content Type ID: Hexadecimal value representing the SharePoint content type.</li></ul></li><li>Admins will continue to have access to reports generated prior to this update. Newly generated reports will include the updated metadata fields and structure.</li><li>These changes will enhance visibility into item-level processing and support downstream automation and auditing.</li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>Review and update internal documentation to reflect the new field names and structure in the <code>item.csv</code> report.</li><li>Adjust automation or post-export workflows to rely on field names rather than fixed column positions.</li><li>Communicate these changes to relevant compliance and legal teams.</li><li>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/purview/edisc?view=o365-worldwide\" target=\"_blank\">Learn about eDiscovery | Microsoft Purview | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "506220"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview eDiscovery will enhance metadata in item.csv reports starting October 2025, adding fields like status, error details, custodian, sensitivity label, encryption, and SharePoint content type ID. These updates improve item-level insights, error traceability, and support automation. Admins should update workflows and documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162273",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-29T23:04:02.527Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T23:03:53Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery - Metadata field enhancements in process reporting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
