{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>To improve detection accuracy across EU identifiers, we’re updating the definitions of five Microsoft built-in out-of-box bundled (OOB) Sensitive Information Types (SITs). These bundled SITs include EU passport number, EU national identification number, EU social security number or equivalent identification, EU tax identification number, and EU driver’s license number. Bundled SITs contain definitions for multiple EU nations within a single SIT. With this update, we’ve aligned the accuracy of bundled SITs with their standalone counterparts by enhancing supporting keywords and function processors.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout began in mid-September 2025 and is expected to complete by mid-October 2025.</p><p><b>How this affects your organization:</b></p><p>Who is affected: Admins managing Microsoft Purview policies that use the specified bundled EU identifier SITs.</p><p>What will happen:</p><ul><li>Definitions for the five bundled EU OOB SITs will be updated.</li><li>Enhanced keyword and function processor logic improves detection accuracy.</li><li>No changes to standalone SITs.</li><li>Existing policies using these SITs will automatically benefit from improved detection.</li></ul><p>No admin action is required to enable the update.</p><p><b>What you can do to prepare:</b></p><p>No action is required. However, you may choose to:</p><ul><li>Review existing DLP or Information Protection policies that use these SITs.</li><li>Communicate the update to your compliance or security teams.</li><li>Update internal documentation if you reference these SITs.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/purview/sit-sensitive-information-type-learn-about\" target=\"_blank\">Learn about sensitive information types | Microsoft Purview | Microsoft Learn</a></p><p><b>Compliance considerations:</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>No</td></tr><tr><td>Does the change modify, interrupt, or disable any of the following capabilities (Purview):- Data Loss Prevention (DLP) policies or enforcement- Information Protection labels or sensitive information types</td><td>Yes. Updated Bundled SIT definitions will lead to improved detection for Purview policies using these SITs.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is updating five bundled EU Sensitive Information Types in Purview to improve detection accuracy by enhancing keywords and processors. The rollout began mid-September 2025, completing by mid-October 2025. No admin action is needed; existing policies will automatically benefit from improved detection."
    }
  ],
  "EndDateTime": "2026-01-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162966",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-30T23:22:13.55Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-30T23:22:09Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Updates to Microsoft built-in Sensitive Information Types (SITs)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
