{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 1, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction:</b></b>\n</p><p>We’re introducing a simplified external collaboration (EC) admin experience in <i>Microsoft Teams</i> to help administrators manage external collaboration settings more efficiently. This update introduces two predefined collaboration modes—Open and Controlled—as well as a Custom mode for organizations with unique requirements. The new experience provides a streamlined interface in the <i>Teams admin center (TAC)</i> for configuring external collaboration policies across chats, calls, meetings, Teams, and channels (including shared channels).</p>\n\n<p><b><b>When this will happen:</b></b>\n</p><p><b>Public Preview:</b> Rolling out mid-November 2025; expected completion by mid-November 2025.\n</p><p><b>General Availability (Worldwide):</b> Rolling out mid-February 2026 (previously late January); expected completion by late February 2026 (previously early February).</p>\n\n<p><b><b>How this affects your organization:</b></b>\n</p><p><b>Who is affected:</b> Admins managing Microsoft Teams external collaboration settings.\n</p><p><b>What will happen:</b>\n</p><ul>\n<li>A new admin experience will be available in <i>Teams admin center (TAC)</i>.</li>\n<li>Admins can choose from three collaboration modes:</li>\n<ul>\n<li><b>Open (Mode 1):</b>\n<ul>\n<li>Enables chats, calls, and meetings with all external domains and Teams personal accounts using federation or external access.</li>\n<li>Allows Teams and channels collaboration with Microsoft and non-Microsoft partners using B2B collaboration and B2B direct connect.</li>\n</ul>\n</li>\n<li><b>Controlled (Mode 2):</b>\n<ul>\n<li>Aligns with current defaults for enterprise and EDU tenants.</li>\n<li>Enables chats, calls, and meetings with all external domains using federation or external access.</li>\n<li>Blocks collaboration in shared channels.</li>\n</ul>\n</li>\n<li><b>Custom:</b>\n<ul>\n<li>Provides full control over each external collaboration setting.</li>\n<li>Allows manual configuration of org-wide external collaboration policies across chats, calls, meetings, Teams, and channels (including shared channels).</li>\n<li>Changes in Custom mode apply only to Global org-wide policies and settings; they do not affect custom policies.</li>\n</ul>\n</li>\n</ul>\n<li>Existing settings will remain unchanged unless modified by the admin.</li></ul><p><i>Screenshot 1 - A new external collab section and overview page that shows external collab settings at a glance:</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/41fcff49-a0bd-43e1-b77a-7e07185fbbfb/3832511b91a7cbb2ce2f56a6061c69e7df62a90a.png\" style=\"width: 400px;\" alt=\"user settings\"></p><ul>\n</ul>\n<p></p>\n\n<p><i>Screenshot 2: Manage external collab settings using a guided simple UX:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/fa8a9a5e-2300-4261-9290-dcbe745358d5/cd0133512c1c578e2201406d5e22460b7f1f10a7.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b><b>What you can do to prepare:</b></b>\n</p><p>No action is required at this time.\nAdmins may choose to explore the new interface once available to review and adjust external collaboration settings.\nFor more information, refer to the Teams admin center documentation once the update is live.</p>\n\n<p><b><b>Compliance considerations:</b></b>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a simplified external collaboration admin experience with three modes—Open, Controlled, and Custom—available in the Teams admin center. Public preview starts mid-November 2025; general availability begins mid-February 2026. Existing settings remain unless changed by admins. No immediate action required."
    }
  ],
  "EndDateTime": "2026-03-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1183006",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-01T17:47:12.743Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-05T00:18:25Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Introducing simplified admin controls to manage external collaboration in Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
