{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>A <b>new Power BI report</b> in <i>Microsoft Viva Insights</i> enables organizations to explore how Microsoft 365 Copilot usage influences employee experience sentiment, as measured by Viva Glint survey data. This report helps organizations analyze and segment data by Copilot usage patterns, sentiment outcomes, and organizational attributes to uncover deeper insights. </p><p>To access the report, users must have both a Viva Glint license and a Microsoft 365 Copilot license assigned.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=496654\" target=\"_blank\">496654</a>.\n</p>\n\n<p><b><b>When this will happen:</b></b>\n</p><p><b>General Availability (Worldwide): </b>Rollout will begin in late November 2025 and is expected to complete by mid-December 2025.\n</p>\n\n<p><b><b>How this affects your organization:</b></b>\n</p><p><b>Who is affected:</b>&nbsp;</p><ul><li>Viva Insights users with access to Advanced Insights </li><li>Admins managing Copilot Analytics and Viva Glint integration\n</li></ul><p>\n<b>What will happen:</b>\n</p><ul><li>A new preconfigured Power BI report, <b>Copilot employee experience outcomes (Glint)</b>, will be available in Viva Insights. </li><li>The report provides a data-driven view of how Microsoft 365 Copilot usage correlates with employee sentiment. </li><li>Insights include patterns of engagement, areas of success, and opportunities for improvement. </li><li>The report supports strategies to enhance Copilot adoption and employee experience. </li><li>The feature is available to licensed users and requires integration setup between Viva Glint and Viva Insights. </li><li>The feature is <b>not enabled by default</b> and requires admin configuration.\n</li></ul>\n\n<p><b><b>What you can do to prepare:</b></b>\n</p><p>Ensure the following prerequisites and setup steps are completed:\n</p><ul>\n<li>Assign both <b>Viva Glint</b> and <b>Microsoft 365 Copilot</b> licenses to employees in the measured population.</li>\n<li>Match employee records between Viva Glint and Viva Insights.</li>\n<li>Add Glint user email addresses to <b>Entra ID</b> and ensure all Glint domains are in your tenant’s <b>MAC domain list</b>. Learn more about this step:&nbsp;<a href=\"https://learn.microsoft.com/viva/glint/setup/access-with-azure-ad\" target=\"_blank\">Set up access to Viva Glint with Microsoft Entra ID</a></li>\n<li>(Optional but recommended) Enable <b>Require Entra ID for links in survey emails</b> in Glint admin settings.</li>\n<li>Assign the <b>Insights Analyst</b> role in Viva Insights Advanced Insights to users who will run the analysis.</li>\n<li>Ensure access to the correct <b>advanced insights data partition</b> and verify that Copilot usage data is available.</li>\n<li>Set up the Viva Glint to Viva Insights integration:\n  <ul>\n    <li>Viva Insights admin initiates the import in the web app. Learn more about how to start the process:&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/import-survey-glint\" target=\"_blank\">Import survey results from Viva Glint into Viva Insights</a></li>\n    <li>Viva Glint admin selects and shares survey programs.</li>\n    <li>Viva Insights processes and validates the data. Learn more about this step:&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/import-survey-glint#3-data-validation-and-processing\" target=\"_blank\">Data validation and processing - Import survey results from Viva Glint into Viva Insights</a></li>\n  </ul>\n</li>\n<li>Run the predefined <b>Copilot employee experience outcomes (Glint)</b> query in Viva Insights to populate the Power BI report. Learn more about this step:&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/advanced/analysis-intro\" target=\"_blank\">Advanced analysis introduction</a></li></ul><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/analysis-intro\" target=\"_blank\">Advanced analysis introduction | Viva Glint | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/import-survey-glint\" target=\"_blank\">Import survey results from Viva Glint into Viva Insights | Viva Glint | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/glint/setup/insights-integration\" target=\"_blank\">Send Viva Glint survey results to Viva Insights | Viva Glint | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/glint/setup/access-with-azure-ad\" target=\"_blank\">Set up access to Viva Glint with Microsoft Entra ID | Viva Glint | Microsoft Viva | Microsoft Learn</a></li>\n</ul>\n\n<p>\n</p><p><b><b>Compliance considerations:</b></b>\n</p><table class=\"table table-bordered\"><tbody><tr><td><b>Consideration</b></td><td><b>Explanation\t\n</b></td></tr><tr><td>New customer data storage</td><td>Viva Glint data is sent to Viva Insights for analysis. Data is stored securely and subject to confidentiality thresholds.</td></tr><tr><td>Changes to data processing</td><td>Combines workplace behavior data with sentiment survey responses for integrated analysis.</td></tr><tr><td>Admin control</td><td>Admins can enable and restrict access to the analyst role and the data partition that users with analyst role have access to.</td></tr><tr><td>Integration with 3rd parties</td><td>Viva Insights and Viva Glint integration involves data exchange between Microsoft services.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "496654"
    },
    {
      "Name": "Summary",
      "Value": "A new Power BI report in Microsoft Viva Insights links Microsoft 365 Copilot usage with employee sentiment from Viva Glint surveys. Available late 2025, it requires licenses, admin setup, and integration between Viva Glint and Viva Insights to analyze engagement, sentiment, and improve Copilot adoption."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2026-01-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181210",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-29T00:23:31.887Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-29T00:22:53Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Copilot employee experience outcomes report with Viva Glint in the Copilot Analytics dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
