{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 8, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re introducing Multi-Geo In-Region Routing (IRR) for Exchange Online, a new capability that helps organizations meet regional data residency requirements by allowing inbound email routing to be aligned with user locations. With IRR, admins can configure accepted domains to route messages directly to a designated geo-region, ensuring that email data is processed and stored entirely within the recipient’s region—even if it differs from the tenant’s primary location. This helps organizations meet compliance requirements without compromising email delivery performance.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=410245\" target=\"_blank\">410245</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out in early October 2025 and expect to complete by end of October 2025.\n</p><p>General Availability (Worldwide): We expect to begin rolling out in early December 2025 and expect to complete by late December 2025.</p><p><b>How this will affect your organization:</b></p><p>In-Region Routing (IRR) is disabled by default. If you do not plan to use this feature, no action is required.</p><p>For domains where you choose to enable IRR, the feature allows you to route inbound emails to accepted domains associated with specific geo-regions. When these domains are aligned with users located in the same geo-region, emails are fully processed and stored within the recipient’s region. This ensures that data remains within the user’s Preferred Data Location (PDL), supporting stronger data sovereignty and compliance with regional regulations.</p><p>If your organization uses Microsoft Purview capabilities such as Data Loss Prevention (DLP), retention policies, or eDiscovery, you may need to review and adjust those policies to ensure they align with the new regional routing behavior.</p><p></p><p><b>What you need to do to prepare:</b></p><ul><li>Ensure that admins have the necessary permissions to manage accepted domains and access to either Exchange Online PowerShell or to the Microsoft 365 admin center.</li><li>Review your domain configurations and identify users located in secondary geo-regions.\n</li><li>Prepare to configure accepted domains with the new geo-region property.</li><li>Review the licensing terms, as Multi-Geo licenses will be indefinitely required to use In-Region Routing:<ul><li><a href=\"https://learn.microsoft.com/en-us/microsoft-365/enterprise/microsoft-365-multi-geo?view=o365-worldwide#licensing\" target=\"_blank\">https://learn.microsoft.com/en-us/microsoft-365/enterprise/microsoft-365-multi-geo?view=o365-worldwide#licensing</a></li><li><a href=\"https://learn.microsoft.com/en-us/microsoft-365/enterprise/microsoft-365-multi-geo?view=o365-worldwide#getting-started\" target=\"_blank\">https://learn.microsoft.com/en-us/microsoft-365/enterprise/microsoft-365-multi-geo?view=o365-worldwide#getting-started</a>&nbsp;</li></ul></li><li>Review the documentation for configuring the feature: <a href=\"https://learn.microsoft.com/en-us/microsoft-365/enterprise/multi-geo-region-routing?view=o365-worldwide\" target=\"_blank\">Configure Multi-Geo In-Region Routing (In Preview) - Microsoft 365 Enterprise | Microsoft Learn\"</a></li></ul><p>We value your feedback and want to hear from you if you have any questions or concerns. Please comment or contact us through the M365 Admin Center if you need any assistance.</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing user data is processed, stored, or accessed? - Yes. Emails are stored in-region based on domain configuration.</li><li>Does the change modify, interrupt, or disable any Purview capabilities? - Maybe. Depends on how DLP or retention policies are scoped by region.</li><li>Does the change alter how admins can monitor, report on, or demonstrate compliance activities? - Maybe. Regional routing may affect reporting granularity.</li></ul><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410245"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is releasing Multi-Geo In-Region Routing for Exchange Online to route inbound emails based on user location, ensuring data residency compliance. Rolling out from October to December 2025, it requires Multi-Geo licenses and may impact Purview policies. Admins must prepare domain configurations and permissions accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1113112",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-08T21:50:25.577Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-10T23:34:01Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online | Releasing Multi-Geo In-Region Routing",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
