{
  "ActionRequiredByDateTime": "2026-01-04T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>To maintain app performance, security, and compatibility across devices, Outlook for Android will no longer support Android 9.x or earlier versions starting January 2026. This change aligns with Microsoft’s regular operating system (OS) support evaluations and reflects architectural differences in older Android versions.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>This change will take effect on January 5, 2026.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Users in your organization who access Outlook for Android on devices running Android 9.x or below.</li>\n</ul>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Users on Android 9.x or earlier will no longer be able to install updates for Outlook for Android.</li>\n<li>Existing installations may continue to work temporarily but will not receive new features, bug fixes, or security updates.</li>\n<li>Outlook for Android will require Android 10.0 or higher to install or update the app.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul><p>\n</p><li>Review mobile device usage across your organization to identify users on Android 9.x or below.</li>\n<li>Communicate this change to affected users to ensure they upgrade their device OS before January 2026.</li>\n<li>Update internal documentation and helpdesk guidance to reflect the new minimum OS requirement.</li></ul><p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting January 5, 2026, Outlook for Android will require Android 10.0 or higher. Devices running Android 9.x or below will no longer receive updates or new features, though existing installations may work temporarily. Organizations should identify affected users and encourage OS upgrades."
    }
  ],
  "EndDateTime": "2026-02-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1163756",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-01T22:33:55.997Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-01T22:33:49Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Outlook for Android will require Android 10.0 or higher starting January 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
