{
  "ActionRequiredByDateTime": "2025-11-28T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To streamline integration options and align with partner offerings, Microsoft is retiring the <b>managed connectors for UKG and Blue Yonder</b> in <i>Microsoft Teams Shifts</i>. This change supports a transition to more flexible and scalable integration methods, including partner apps and custom APIs.</p><p><b>When this will happen:</b></p><ul><li>The retirement will take effect on November 14, 2025.</li></ul><p><b>How this affects your organization:</b></p><p>Who is affected:</p><ul><li>Organizations currently using the UKG or Blue Yonder managed connectors in Teams Shifts.</li><li>Admins planning to deploy these managed connectors.</li></ul><p>What will happen:</p><ul><li>The UKG and Blue Yonder managed connectors will no longer be available in<i> Teams Shifts</i> after November 2025.</li><li>Existing users will need to transition to alternate solutions before the retirement date.</li><li>New customers will not be able to deploy these managed connectors going forward.</li></ul><p><b>What you can do to prepare:</b></p><ul><li>Work with your Microsoft account team to complete your transition plan.</li><li>UKG customers can adopt the UKG Flow app available in <i>Teams</i>. Learn about&nbsp;<a href=\"https://marketplace.ukg.com/apps/440612/ukg-flow-for-microsoft-teams\" target=\"_blank\">UKG Flow for Microsoft Teams</a>.</li><li>Other customers can build custom integrations using&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/frontline/shifts-custom-wfm-integration?view=o365-worldwide\" target=\"_blank\">Create a custom integration to sync your workforce management system with Shifts | Microsoft Learn</a>.</li><li>Communicate this change to helpdesk and operations teams managing workforce scheduling.</li><li>Update internal documentation to reflect the retirement and new integration paths.</li><li>For questions, contact your Microsoft account representative.</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring the UKG and Blue Yonder managed connectors in Teams Shifts on November 14, 2025. Organizations must transition to partner apps like UKG Flow or custom integrations before then. Admins should plan with their Microsoft account team and update documentation accordingly."
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1166868",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-06T23:15:27.827Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-06T23:15:22Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Retirement of UKG and Blue Yonder managed connectors for Shifts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
