{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:</b></p><p>\nMicrosoft Purview Insider Risk Management is enhancing policy configuration by enabling the selection of multiple Data Loss Prevention (DLP) policies as triggering events. Previously, only one DLP policy could be selected per Insider Risk Management policy. This update provides greater flexibility and alignment with complex organizational risk scenarios.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=493756\" target=\"_blank\">493756</a></p>\n\n<p><b>When this will happen:</b></p><ul><li>\n<b>Public Preview:</b> Rollout will begin in late August 2025 and is expected to complete by mid-September 2025.</li><li><b>General Availability (Commercial and Government Clouds):</b> Rollout will begin in early December 2025 and is expected to complete by late December 2025.</li></ul>\n\n<p><b>How this affects your organization:</b></p><p>\nThis update does not change existing configurations or require any action. It simply allows eligible admins to select multiple DLP policies as triggering events when creating or editing Insider Risk Management policies. This enhancement supports more comprehensive risk detection scenarios and improves policy customization.</p>\n\n<p><b>What you can do to prepare:</b></p><p>\nNo preparation is needed. However, you may wish to review your current Insider Risk Management policies and consider whether leveraging multiple DLP triggers could improve your risk detection strategy.&nbsp;</p>\n\n<p><b>Compliance considerations:</b></p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Does the change modify how admins can monitor, report on, or demonstrate compliance activities?</td><td>Yes – Admins can now configure policies with multiple DLP triggers, enhancing monitoring and reporting capabilities.</td></tr>\n<tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes – Policy configuration is managed by admins and can be scoped using role-based access controls.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493756"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will allow selecting multiple DLP policies as triggering events, enhancing flexibility and risk detection. Public preview starts late August 2025; general availability in December 2025. No action required, but admins can improve policy customization and compliance monitoring."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-02-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143302",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T22:06:01.047Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T22:05:43Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Insider Risk Management- Multi selectable DLP policies as an IRM triggering event",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
