{
  "ActionRequiredByDateTime": "2025-10-13T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<div style=\"\"><div><a href=\"https://techcommunity.microsoft.com/blog/officeeos/only-6-months-until-office-20162019-end-of-support-%E2%80%93-are-you-ready/4403556\" target=\"_blank\">As previously communicated here</a>&nbsp;and MC1056260 (April '25), support for <b>Office 2016</b> and <b>Office 2019</b> will end on October 14, 2025. After that date, no further updates, security fixes, or technical support will be available for these versions of Office. While the applications may continue to function, using unsupported software could lead to potential security risks, compliance risks, system incompatibilities, and other issues.</div><div><br></div></div><p>Support for <b>Visio 2016</b> and <b>2019</b>, <b>Microsoft Project 2016</b> and <b>2019</b>, and <a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/prepare-now-for-key-end-of-support-moments-in-2025/4267800\" target=\"_blank\">several other products</a> will also end on October 14, 2025. Organizations using these products should upgrade as soon as possible to maintain security, compliance, and performance.</p><p><b>When this will happen:</b></p><p>October 14, 2025</p><p> \n</p><p><b><b>Impact on your organization:</b></b></p><p>After end of support, Office 2016 and Office 2019 suites, standalones, and servers will no longer receive security updates or other fixes, and no technical assistance will be available for devices still running them. Continuing to run unsupported software may expose your organization to security vulnerabilities and compliance risks and may affect the reliability and performance of services. \n</p><p><b><b>What you can do to prepare:</b></b></p><p>To mitigate these risks while maintaining access to desktop Office apps, we recommend upgrading devices to a Microsoft 365 or Office 365 suite that includes Microsoft 365 Apps (for enterprise or for business). Microsoft 365 Apps provides always-up-to-date versions of familiar apps like Word, Excel, and PowerPoint for desktop, mobile, and web with continuous support under the <a href=\"https://learn.microsoft.com/en-us/lifecycle/faq/modern-policy\" target=\"_blank\">Modern Lifecycle Policy</a>, and is eligible for use with the Microsoft 365 Copilot add-on. \n</p><p>For scenarios that require a fully disconnected solution, we recommend upgrading to Office LTSC 2024. <a href=\"https://aka.ms/OfficeLTSC2024-EOSLearn\" target=\"_blank\">Office LTSC 2024</a> includes a subset of the value in Microsoft 365 Apps and will be supported until October 2029 under the <a href=\"https://learn.microsoft.com/en-us/lifecycle/faq/fixed-policy\" target=\"_blank\">Fixed Lifecycle Policy</a>. \n</p><p>Take steps to prepare for this transition with the following resources: \n</p><ul><li>Read the <a href=\"https://docs.microsoft.com/DeployOffice/endofsupport/plan-upgrade-older-versions-office\" target=\"_blank\">upgrade guidance</a> for an overview of how to move from Office 2016 or Office 2019 to Microsoft 365 Apps. \n</li><li>Consider engaging <a href=\"https://www.microsoft.com/fasttrack/microsoft-365\" target=\"_blank\">Microsoft FastTrack</a>, a Microsoft support service, for moving to Microsoft 365. \n</li></ul><p>Plan ahead to avoid potential disruptions and keep your organization’s software environment secure and up to date.&nbsp;</p><p><b>Compliance considerations:</b></p>\n<table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n<tbody>\n<tr>\n<td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n<td>Unsupported software may no longer comply with Data Loss Prevention (DLP), Information Protection labels, Conditional Access policies, and other Purview capabilities.</td>\n</tr>\n<tr>\n<td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td>\n<td>Unsupported versions may not integrate with modern compliance tools or reporting frameworks, impacting visibility and auditability.</td>\n</tr>\n<tr>\n<td>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights)?</td>\n<td>Unsupported software may not meet current GDPR compliance standards, potentially limiting users' ability to manage their personal data.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Support for Office 2016, Office 2019, Visio 2016/2019, Project 2016/2019, and related apps ends October 14, 2025. After this, no updates or support will be provided, risking security, compliance, and performance. Upgrading to Microsoft 365 Apps or Office LTSC 2024 is recommended."
    }
  ],
  "EndDateTime": "2026-01-23T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1154299",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-16T22:23:29.42Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-16T22:23:16Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Reminder - Support for Office 2016, Office 2019, and additional apps will end on October 14, 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
