{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>\nTo improve the accuracy of signature age alerts in <i>Microsoft Defender Antivirus</i>, we’re updating the minimum supported value for the <i>AVSignatureDue</i> policy. Previously, this setting could be configured to as low as one day, which led to misleading alerts due to timing misalignment between signature updates and checks. Starting in September 2025, the minimum value will be set to 2 days.\n</p>\n\n<p><b>When this will happen</b></p><p>\nGeneral Availability (Worldwide): Rollout will begin in late September 2025 and is expected to complete by mid-October 2025.\n</p>\n\n<p><b>How this affects your organization</b></p><p>\nThis change will only affect organizations that have configured the <i>AVSignatureDue</i> policy to a value less than 2 days. After this update, any value below 2 days will no longer be supported. This adjustment helps prevent false alerts indicating outdated signatures when updates have already been applied.\n</p>\n\n<p><b>What you can do to prepare</b></p><p>\nIf your organization has set the <i>AVSignatureDue</i> policy to less than 2 days, update the configuration to 2 days or higher to ensure continued policy compliance and accurate alerting. </p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/security/defender-endpoint/antivirus-policy-settings\">Microsoft Defender Antivirus policy documentation</a>.\n</p><p><b>Compliance considerations</b></p><p><b></b></p><p></p>\nNo compliance considerations identified, review as appropriate for your organization.\n<div><b><br></b></div>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting September 2025, Microsoft Defender Antivirus will require the AVSignatureDue policy minimum to be 2 days (up from 1 day) to prevent false alerts. Organizations with settings below 2 days should update their configuration before rollout completes in mid-October 2025."
    }
  ],
  "EndDateTime": "2025-11-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1151677",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-11T22:05:05.673Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-11T22:04:55Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Updated Microsoft Defender Antivirus AVSignatureDue policy limit",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
