{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b><b>Introduction</b></b></p>Windows Backup for Organizations is now available. This enterprise-grade feature helps IT teams streamline device transitions by securely preserving user settings and Microsoft Store app installations. Whether upgrading from Windows 10 to Windows 11 or refreshing Windows 11 PCs, this feature ensures a consistent user experience and supports business continuity through robust backup and rapid recovery capabilities.<p></p>\n\n<p><b><b>When this will happen:</b></b></p>This feature is available now with the September 2025 Windows Monthly Cumulative Update installed.<p></p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\nOrganizations running Windows 10 (for backup only) and Windows 11 (for backup and restore) with the September 2025 update.<p></p>\n<b>What will happen:</b>\n<p></p><ul>\n<li>Users will be able to back up their settings and Microsoft Store app installations on Windows 10.</li>\n<li>Users on Windows 11 will be able to restore these settings and apps during device setup.</li>\n<li>The feature is available once the cumulative update is installed but must be enabled by the admin.</li>\n<li>Admins can manage availability and configuration via policy settings.</li>\n</ul>\n<p></p>\n\n<p><b>What you can do to prepare:</b></p><ul>\n<li>Ensure devices are updated with the September 2025 Windows Monthly Cumulative Update.</li>\n<li>Review and configure backup policies in your organization.</li>\n<li>Communicate this feature to helpdesk and support teams.</li>\n<li>Update internal documentation to reflect new backup and restore capabilities.</li>\n<li>Learn more: <a href=\"https://learn.microsoft.com/windows/configuration/windows-backup/?tabs=intune\" target=\"_blank\">Windows Backup for Organizations</a>&nbsp;<a href=\"https://learn.microsoft.com/windows/configuration/windows-backup/?tabs=intune\" target=\"_blank\"></a></li>\n</ul>\n<p></p>\n\n<p><b>Compliance considerations:</b></p>Learn about data storage consideration:&nbsp;<a href=\"https://learn.microsoft.com/windows/configuration/windows-backup/faq#where-s-the-data-stored\" target=\"_blank\">Windows Backup for Organizations Frequently Asked Questions (FAQ)</a><div><p></p><p></p></div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Windows Backup for Organizations, available with the September 2025 Windows update, enables Windows 10 users to back up settings and apps, and Windows 11 users to restore them. Admins must enable and configure it via policies. Organizations should update devices, policies, and support documentation accordingly."
    }
  ],
  "EndDateTime": "2025-11-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1167603",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-07T22:29:39.97Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-07T22:29:27Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Windows Backup for Organizations is now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
