{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Microsoft Purview Insider Risk Management is enhancing the <i>Risky AI usage</i> policy template with support for priority content. This allows organizations to define what content is most sensitive—such as <i>Sensitive Info Types (SITs), Trainable Classifiers, </i>and <i>Sensitivity Labels</i>—and receive alerts only when risky AI activity involves that content.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484085\" target=\"_blank\">484085</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-July 2025 and expect to complete by late July 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2025 and expect to complete by late August 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This update enables more targeted risk detection by allowing admins to specify content to be considered high priority. Alerts will only trigger when risky AI activity involves this defined content, reducing noise and improving signal clarity.\n</p><p>The feature will be available by default and configurable by admins.\n</p><p>No changes will be made to existing policies unless updated by your organization.</p><p>Priority content matched in Insider Risk Management &gt; <i>Alerts:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3920ce53-42fa-484b-9355-ec0256f34091\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Define priority content in the policy at Insider Risk Management &gt; <i>Content to prioritize &gt; New insider risk policy &gt; Decide whether to prioritize content:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1b732827-704c-4bc5-9479-90859c9ec596\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current configuration to assess the impact on your organization. You may want to notify your admins and/or users about this change and update internal documentation.\n</p><p>Review your current Insider Risk Management policies and identify content that should be marked as priority.</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>Learn more: The <i>Prioritize content in policies</i> section of <a href=\"https://learn.microsoft.com/purview/insider-risk-management-policies#prioritize-content-in-policies\" target=\"_blank\">Create and manage insider risk management policies | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "484085"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is enhancing the Risky AI usage policy template to support priority content, enabling targeted risk detection. Public preview starts mid-July 2025, with general availability in mid-August 2025. Admins can define high-priority content, and alerts will trigger only for risky AI activities involving that content. No admin action is required before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102775",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-25T00:08:05.723Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-25T00:07:25Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Priority content support for risky AI usage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
