{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p><b>Introduction</b></p><p>We’re expanding access to the Data Access Governance report in SharePoint. Previously available only via <a href=\"https://learn.microsoft.com/sharepoint/powershell-for-data-access-governance#site-permissions-across-your-organization-report\" target=\"_blank\">SharePoint Online PowerShell</a>, the <i>Site permissions for your organization</i> report is now accessible directly from the <i>SharePoint Admin Center</i> portal under <i>Reports </i>&gt; <i>Data Access Governance</i>. This enhancement simplifies visibility into site-level permissions across your tenant and supports broader adoption of Microsoft Copilot.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f5f4767d-cf0e-4956-ac62-fa4708c2eaf2\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b>When this will happen</b></p><p>General Availability: We began rolling out in mid-August 2025 and expect to complete by late August 2025.</p><p><b>How this affects your organization</b></p><p>You can now generate the Site permissions report directly from the <a href=\"https://learn.microsoft.com/sharepoint/data-access-governance-reports#access-the-reports-in-the-sharepoint-admin-center\" target=\"_blank\" style=\"\">SharePoint Admin Center portal</a>, without needing PowerShell. This report provides insights into the exposure levels of SharePoint and OneDrive sites across your organization, helping you identify potential risks and take remedial actions. These insights are especially valuable for organizations adopting Microsoft Copilot, as they help ensure data is appropriately governed and accessible.</p><p>This feature is <b>on by default</b> and available to SharePoint administrators.</p><p><b>What you can do to prepare</b></p><ul><li>Review your current site permissions configuration to understand potential exposure.</li><li>Notify your SharePoint administrators about the new portal-based access.</li><li>Update internal documentation and workflows to reflect this change.</li></ul><p></p><p></p><b>Compliance considerations</b><br>\n</p><p>No compliance considerations have been identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Site permissions report for the entire organization is now accessible in the SharePoint Admin Center under Reports > Data Access Governance, eliminating the need for PowerShell. This feature, rolling out in August 2025, helps admins monitor site permission exposure and supports Microsoft Copilot adoption."
    }
  ],
  "EndDateTime": "2025-09-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143278",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T21:43:31.037Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T21:42:38Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Data Access Governance - Site permissions for entire organization report - Available from SharePoint Admin center Portal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
