{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're enhancing Microsoft Purview Data Loss Prevention (DLP) to improve data protection coverage. With this update, DLP will now scan and classify sensitive data embedded in image metadata when Optical Character Recognition (OCR) is not available. This ensures better detection of sensitive information in scenarios where text is not visible in the image itself.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=495459\" target=\"_blank\">495459</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout will begin in mid-July 2025 and is expected to complete by early August 2025.\n</p><p><b>How this affects your organization:</b></p><p>Once this feature is rolled out, DLP policies will automatically begin scanning image metadata for sensitive data, even when OCR is turned off. This helps ensure that sensitive information embedded in image files is not overlooked. No configuration changes are required—this feature is on by default.\n</p><p><b>What you can do to prepare:</b></p><p>No admin action is needed. However, we recommend reviewing your existing DLP policies to ensure they are aligned with your organization’s data protection goals.&nbsp;</p><p><b>Compliance considerations:</b></p><ul><li>Alters how existing customer data is processed, stored, or accessed\tYes – image metadata is now included in DLP scans</li><li>Modifies DLP, labels, or other Purview capabilities\tYes – expands DLP scanning scope</li><li>Alters compliance monitoring/reporting\tMaybe – may affect reporting visibility for image metadata\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "495459"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview DLP will now scan and classify sensitive data in image metadata when OCR is unavailable, improving data protection. This feature, rolling out from mid-July to early August 2025, requires no admin action and is enabled by default. Review DLP policies to ensure alignment with data protection goals."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108129",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-02T22:36:53.973Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-02T22:36:18Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Enhanced Metadata Scanning for Images in Exchange DLP",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
