{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 18, 2025: New capabilities are now available for Frontier program customers. We have updated the content below to provide additional details on how to use Agent Mode in Copilot in Excel.&nbsp;</p><p><b>Introduction:</b>\n</p><p>Agent Mode in Microsoft 365 Copilot for Excel, available now on the web and Windows desktop, is a new way for users to work with Copilot in Excel. It uses natural language to build and edit workbooks and allows users&nbsp;to&nbsp;keep their content editable and stay up to date with the latest changes. Agent mode can search the web to pull in trusted, up-to-date information from the internet to complement your Excel data. It helps answer questions, provide context, and enrich your analysis without leaving your workbook. Agent Mode in Excel also supports working with Claude AI models from Anthropic to build workbooks directly in Excel.</p><p>Users&nbsp;stay&nbsp;in control over all modifications at any time.&nbsp;To learn more, read <a href=\"https://aka.ms/Agent_Mode\">https://aka.ms/Agent_Mode</a>.&nbsp;</p><p><b>How to access Agent Mode in Copilot in Excel:</b>&nbsp;\n</p><ul><li>Available&nbsp;to Microsoft Frontier program customers&nbsp;starting October 21, 2025.&nbsp;\n</li><li>For Enterprise Microsoft 365 Copilot license customers, admins need to enable Frontier access for their organization in the Microsoft 365 Admin Center.&nbsp;\n</li><li>For Microsoft 365 Personal, Family or Premium licenses, customers&nbsp;can&nbsp;turn on Frontier Features with a new toggle under the Copilot ribbon button.&nbsp;\n</li><li>Once&nbsp;Frontier features are turned on, customers will see a new Agent Mode option under the Tools menu in Copilot chat.&nbsp;\n</li><li>This version will soon include more features and support for&nbsp;additional&nbsp;languages.&nbsp;\n</li></ul><p><b>What you can do to prepare:</b>\n</p><ul><li>Ensure Frontier Features are enabled in your tenant.</li><li>Admins must&nbsp;allow access to Anthropic AI models by allowing ‘AI providers for other large language models’ in the&nbsp;Microsoft 365 Admin Center before users can access Claude with Agent Mode in Excel.&nbsp;&nbsp;</li><li>Alternatively, ensure Office add-ins are enabled in your tenant and enable use of the Excel Labs add-in. To learn more, see <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-addins-in-the-admin-center?view=o365-worldwide\" target=\"_blank\">Review and manage add-ins in the admin center</a>.&nbsp;</li><li>Review documentation here: <a href=\"https://support.microsoft.com/topic/use-claude-with-agent-mode-in-excel-b2c3b3ec-154b-484b-84d0-914a80df395a\">Use Claude with Agent Mode in Excel</a></li></ul><p><b>Compliance considerations:</b>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot's Agent Mode in Excel Labs (Frontier preview) enables natural language workbook editing, available from October 21, 2025, for Frontier program customers. Admins must enable Frontier access; users can toggle features in Copilot. More features and languages are coming, with no identified compliance issues."
    }
  ],
  "EndDateTime": "2025-12-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162083",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-18T17:29:48.13Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T16:20:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Agent Mode available in Excel Labs add-in (Frontier preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
