{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Insider Risk Management (IRM) is introducing enhanced detection capabilities that allow organizations to identify sensitive files and text shared to any cloud application or website—including Generative AI platforms—via the network layer. This capability is powered by integration with third-party network partners, enabling data capture at the network level.\n</p><p>IRM correlates signals to detect potential insider risks such as IP theft, data leakage, and policy violations. Built with privacy by design, IRM pseudonymizes users by default and includes role-based access controls and audit logs to help ensure user-level privacy.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484084\" target=\"_blank\">484084</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-July 2025 and expect to complete by late July 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late September 2025 and expect to complete by early October 2025.</p><p><b>How this will affect your organization:</b></p><p>Organizations will gain visibility into sensitive data shared to any cloud application or website via the network layer. This helps strengthen insider risk detection and supports compliance and data protection efforts across cloud environments.\n</p><p>This capability will be available by default but requires admin configuration to take effect at Insider Risk Management <i>&gt; Insider Risk Management settings &gt; Policy indicators &gt; Network indicators (preview):</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/6cbb765f-1669-4461-b9c8-1c80f03ac338\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current Insider Risk Management configuration to assess the impact on your organization. You may want to notify your admins and/or users about this change and update internal documentation.</p><ul><li>Complete network onboarding as outlined in <a href=\"https://learn.microsoft.com/purview/dlp-network-data-security-learn\" target=\"_blank\">Learn about Microsoft Purview Network Data Security (preview) | Microsoft Learn</a></li><li>Enable network indicators in IRM and incorporate them into your Insider Risk Management policies to begin leveraging this new detection capability.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "484084"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing network-based detection for sensitive data sharing to cloud apps and Generative AI platforms. This feature, available from July 2025 (preview) and October 2025 (general), enhances insider risk detection and requires admin configuration. Organizations should review and update their Insider Risk Management settings."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102773",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-25T00:06:23.557Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-25T00:06:04Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Network-based detection of sensitive data sharing to cloud apps and Gen AI",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
