{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new way to stay informed about document changes in Word. The Activity tab in the Copilot summary now provides a dynamic snapshot of recent comments and edits, helping users quickly catch up on what’s changed.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide): We began rolling out in late July 2025 and expect to complete by late August 2025.</p><p><b>How this will affect your organization</b></p><p>When users open a Word document, they’ll see a new Activity tab in the Copilot summary at the top of the document. This tab displays a summary of recent changes and comments. Users can filter activity by time window:\n</p><ul><li>Since last visit\n</li><li>Past 3 days\n</li><li>Past week\n</li><li>Past 2 weeks\n</li></ul><p></p><p><i>A view of recent edits and comments in Word, available through the new <b>Activity </b>tab in the Copilot <b>summary</b> for quick document insights:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/bbf9756c-1899-4710-a355-cf3c2ded4be1/eeecec107f1b6afc5d0210f6a3ebfb8cc605a0bc.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>This feature enhances collaboration and document awareness, especially in shared or frequently updated files.</p><p><b>What you need to do to prepare</b></p><p>No action is required. This feature will be on by default. You may wish to inform users about this new capability to help them take full advantage of it.</p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does this change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>This change introduces new AI-powered capabilities in Copilot that interact with customer data to summarize recent document activity.</td></tr><tr><td>Does this change provide end users any new way of interacting with generative AI?</td><td>This change enables users to interact with generative AI through the Copilot summary, which now includes a dynamic activity snapshot.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot in Word introduces an Activity tab showing recent comments and edits, with filters by time. Rolling out globally from late July to August 2025, it enhances collaboration by summarizing document changes. The feature is on by default, requiring no user action."
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130391",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-06T23:34:46.517Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:34:16Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot | View recent activity in Word with Dynamic Document Snapshot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
