{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b><b>Introduction</b></b></p>\nTo support faster, more seamless investigations, Microsoft is introducing <b>Always-on diagnostics for Windows endpoints (Phase 2)</b>. This enhancement allows admins to retrieve diagnostic traces directly from Windows devices and selectively upload them to Microsoft via the Purview portal—without disrupting end users. This update is based on customer feedback to reduce friction during support escalations and improve troubleshooting efficiency.<p></p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499431\" target=\"_blank\">499431</a>.</p><p></p><p></p>\n\n<p><b><b>When this will happen:</b></b></p>\n<b>Public Preview (Worldwide):</b>&nbsp;Rollout begins in late October 2025 and completes by late October 2025.<br>\n<b>General Availability (Worldwide):</b>&nbsp;Rollout begins in mid-February 2026 and completes by late February 2026.<p></p>\n\n<p><b>[How this affects your organization:</b></p>\n<ul>\n<li><b>Who is affected:</b> Admins managing Endpoint <b>Data Loss Prevention (DLP)</b> on Windows endpoints via Microsoft Purview.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Admins can retrieve Always-on diagnostic traces from Windows endpoints.</li>\n    <li>Traces can be selectively uploaded to Microsoft through the Purview portal during investigations (e.g., support ticket submission).</li>\n    <li>No user interaction or disruption is required, and admins can reference the upload request number to Microsoft Support for investigations.</li>\n    <li>The feature enhances eDLP troubleshooting capabilities without impacting Information worker productivity.</li>\n    <li>This capability is integrated into the existing Endpoint DLP experience.</li>\n  </ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n  <li>No immediate action is required to enable this feature.</li>\n  <li>Communicate this capability to your security and helpdesk teams to streamline future investigations.</li>\n  <li>Update internal documentation if you maintain support workflows involving Endpoint DLP.</li><li>Learn more: <a href=\"https://learn.microsoft.com/purview/dlp-always-on-diagnostics\" target=\"_blank\">Always-on diagnostics for endpoint DLP | Microsoft Learn</a></li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Question</th><th>Explanation</th></tr>\n<tr><td>Does the change store new customer data, if so, where, and is the data cached or permanently stored?</td><td>Diagnostic traces will be uploaded to Microsoft during investigations. These are selectively uploaded by admins and stored in Microsoft systems for support purposes.</td></tr>\n\n<tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes, there is an admin control. Access is role-based (Global, Compliance, Security Admin) and managed via Entra ID roles</td></tr>\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499431"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing Always-on diagnostics for Windows endpoints (Phase 2) in Endpoint Data Loss Prevention, enabling admins to retrieve and selectively upload diagnostic traces via the Purview portal without user disruption. Rollout starts October 2025 (preview) and February 2026 (general availability). No immediate action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2026-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181277",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-29T06:55:09.68Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-29T06:54:58Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Endpoint Data Loss Prevention: Always-on diagnostics for Windows Endpoints (Phase 2)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
