{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 19, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p>We're making some changes to the Microsoft eCDN configuration.</p><p>Starting with Chrome 146, browsers will enforce Local Network Access restrictions that may impact Microsoft eCDN peer-to-peer functionality.\n</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because our reporting indicates one or more users in your organization may be using Microsoft eCDN. To maintain optimal performance for Teams Live Events and Town Halls, admins must configure the <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-browser-policies/localnetworkaccessallowedforurls\">LocalNetworkAccessAllowedForUrls</a> policy for Chrome-based browsers.\n</p><p><b>What you need to do to prepare:</b></p><p>For complete, up-to-date details (including required URLs, deployment methods, and tenant-specific considerations), see the official Microsoft eCDN documentation: <a href=\"https://learn.microsoft.com/ecdn/how-to/configure-local-network-access-policy\">Configure Local Network Access Policy for Microsoft eCDN</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting with Chrome 146, Local Network Access restrictions may affect Microsoft eCDN peer-to-peer functionality. To ensure optimal Teams Live Events performance, admins must configure the LocalNetworkAccessAllowedForUrls policy for Chrome-based browsers as detailed in the updated Microsoft eCDN documentation."
    }
  ],
  "EndDateTime": "2026-02-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1189910",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-19T17:14:38.727Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-25T22:28:49Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Configure Local Network Access Policy for Microsoft eCDN",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
