{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We're retiring support for inline SVG images in Outlook for Web and the new Outlook for Windows starting early September 2025. This change enhances security and aligns with current email client behavior, which already restricts inline SVG rendering.\n</p><p><b>When this will happen</b></p><p><b></b></p><ul><li>Worldwide rollout: Begins early September 2025, expected to complete by mid-September 2025.\n</li><li>GCC, GCC-H, DoD rollout: Begins mid-September 2025, expected to complete by late September 2025.\n</li></ul><p><b>How this affects your organization\n</b></p><ul><li>Inline SVG images will no longer be displayed in Outlook for Web or the new Outlook for Windows. Instead, users will see blank spaces where these images would have appeared.\n</li><li>This change affects less than 0.1% of all images used in Outlook, so impact is expected to be minimal.\n</li><li>SVG images sent as classic attachments will continue to be supported and viewable from the attachment well.\n</li><li>This update helps mitigate potential security risks, such as cross-site scripting (XSS) attacks.\n</li></ul><p><b>What you can do to prepare\n</b></p><p>No action is required from users or administrators.\n</p><p>We recommend:\n</p><ul><li>Updating internal documentation to reflect this change.\n</li><li>Informing users who may rely on inline SVGs in email communications.\n</li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook will retire support for inline SVG images in Outlook for Web and new Outlook for Windows starting September 2025, showing blank spaces instead. This affects under 0.1% of images, enhances security, and requires no user action, though updating documentation and informing users is recommended."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130385",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-06T23:29:13.843Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:26:48Z",
  "Tags": [
    "Retirement"
  ],
  "Title": "Retirement of inline SVG images in Microsoft Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
