{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b><br>\nStarting in early October, the Microsoft 365 Copilot app for Windows will introduce a new <i>Update available</i>&nbsp;button. This button will not block the app UI; users will be able to continue interacting with the app when the button appears. This update encourages users to use the latest version of the app—ensuring access to new features, performance improvements, and security updates—without disrupting their workflow.</p>\n\n<p><b><b>When this will happen:</b></b><br>\nGeneral Availability: Rollout begins in early October 2025 and completes by end of October 2025.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> All users of the Microsoft 365 Copilot app on Windows.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>A new <i>Update available</i>&nbsp;button will appear in the bottom-left corner of the app’s navigation pane when a newer version is available.</li></ul></li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2879645c-df59-4b68-ad3b-9e692a0696e9\" style=\"width: 400px;\" alt=\"user settings\"></p><ul><li>The button is non-blocking; users can continue using the app without interruption.</li><li>Clicking the button opens a prompt with two options:<ul><li><i>Update now:</i> The app will close, install the update in the background, and relaunch with the latest version.</li><li><i>Update later: </i>The app remains open in its current version, and the update button stays visible for future use.</li></ul></li></ul><p><img src=\" https://cxcs.microsoft.net/file/ccp/en-us/4250a336-cb66-4cab-867d-bbbfde041698\" style=\"width: 400px;\" alt=\"user settings\"></p><ul><li>Once updated, the button disappears until a new version becomes available.</li><li>No changes to app functionality or user settings are introduced with this update mechanism.</li></ul><p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n</ul><li>Communicate this change to your users to avoid confusion.</li><li>No admin action is required.</li><li>For internal documentation, you may wish to note the new update behavior.</li><ul>\n\n</ul><ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\nNo compliance considerations identified, review as appropriate for your organization.</p></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 2025, the Microsoft 365 Copilot app for Windows will show a non-blocking \"Update available\" button, allowing users to update immediately or later without interrupting use. No admin action is needed, and the update ensures access to new features and improvements."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1154790",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-17T23:05:59.01Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-17T23:04:48Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot App for Windows: \"Update available\" button",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
