{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 23, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b>Introduction</b></p><p>We’re enhancing offline functionality in the new Microsoft Outlook for Windows. This update (Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=496371\" target=\"_blank\">496371</a>) enables users to add file attachments while composing emails offline, improving productivity for those working without an internet connection.\n</p><p><b>When this will happen\n</b></p><ul><li>Targeted Release (Worldwide): Rollout begins in late October 2025 and is expected to complete by late November 2025.\n</li><li>General Availability (Worldwide): Rollout begins in mid-December 2025 and is expected to complete by early January 2026.\n</li><li>General Availability (GCC): Rollout begins in mid-January 2026 and is expected to complete by late January 2026.</li></ul><p><b>How this affects your organization\n</b></p><p>Users with offline mode enabled in the new Outlook for Windows will be able to attach files to draft emails while offline. These emails, including attachments, will be sent automatically once the device reconnects to the internet.\n</p><p>This feature will be on or off by default based on your current configuration of the <code>OWAMailboxPolicy-OfflineEnabledWin</code> policy. No changes will be made to existing configurations.\n</p><p><b>What you can do to prepare\n</b></p><p>To enable this functionality, ensure the following settings are configured in the new Outlook under <i>Settings </i>&gt; <i>General </i>&gt; <i>Offline</i>:\n</p><ul><li>Enable offline email, calendar, and people\n</li><li>Include file attachments</li></ul><p>Admins can manage this feature using the <code>OWAMailboxPolicy-OfflineEnabledWin</code> mailbox policy. Learn more at&nbsp;<a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy\" target=\"_blank\">Set-OwaMailboxPolicy</a>.</p><p><i>Caption i. Offline editing can be enabled or disabled in Settings &gt; General &gt; Offline</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/5512c4e3-99b6-44f5-b266-6f994f939ded/5c49e703b9acbba35362a284dab2a3567e666d9a.png\" style=\"width: 400px;\" alt=\"Screenshot highlighting toggle to Enable offline email, calendar, and people.\"></p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "496371"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook for Windows will allow adding file attachments to emails while offline, with rollout from late October 2025 to January 2026. Emails with attachments will send automatically upon reconnection. The feature follows current offline policy settings and can be managed via the OWAMailboxPolicy-OfflineEnabledWin policy."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1125491",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-23T16:35:27.28Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T23:48:11Z",
  "Tags": [
    "Updated message",
    "New feature"
  ],
  "Title": "Microsoft Outlook for Windows: Add attachments while offline",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
