{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to use modern architecture for existing legal entities in Dynamics 365 Project Operations. This feature will reach general availability on September 30, 2025.<br><br>\n<b>How does this affect me? </b><br>\nWith this feature, you can enable the resource and nonstocked deployment type for customers who previously used the Project Management and Accounting module without reimplementing your existing legal entity. If you want to continue using the capabilities in the stocked deployment type, you will not be impacted by this feature. <br><br>\nChanges include: <ul>\n<li>The existing validation in the <b>Global project management and accounting parameters</b> form is relaxed to allow legal entities with existing project data to enable resource and nonstock deployment types. </li>\n<li>The <b>Global project management and accounting parameters</b> validation checks that all projects are closed for the 10.0.43 release and allows for a new start. For the 10.0.45 release, we allow for projects to remain open with a subset of transaction types and processes supported for existing PMA projects. </li>\n<li>Evaluate business processes to make sure they restrict the appropriate deployment types. For example, you can create invoices for Dataverse-based projects only from Dataverse. </li>\n<li>We remove access or make read-only the legacy functions that exist in both deployment types. For example, when you enable this feature, you can't edit resource management and project work breakdown structures in the finance and operations user interface for the resource/non-stocked deployment mode. For projects you create in resource/non-stocked deployment mode, use <b>Unified Resource Scheduling</b> experiences for resource scheduling, and <b>Project for the Web</b> experiences for project planning. </li></ul>\n<b>What action do I need to take? </b><br>\nThis message is for awareness, and no action is required. <br><br>\nIf you would like more information on this feature, please visit <a href=\"https://aka.ms/ADO11707\" target=\"_blank\">Use the modern architecture for existing legal entities</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-09-28T13:43:56Z",
  "HasAttachments": false,
  "Id": "MC1143706",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-28T13:45:07.61Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-28T13:43:56Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Project Operations - Use the modern architecture for existing legal entities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
