{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re introducing a new way to collect files and metadata in SharePoint document libraries using modern file upload forms. This update enables library owners and editors to create custom forms—similar to Microsoft Lists forms—that can be shared internally to gather files and related information without exposing the full library. This simplifies scenarios like onboarding, campaign submissions, or invoice collection.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b185056f-2135-4e62-b72f-9c252c2ebb4e\" style=\"width: 400px;\" alt=\"user settings\"></p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489834\" target=\"_blank\">489834</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p><b>General Availability (Worldwide, GCC, GCCH, DoD):</b> We will begin rolling out late November 2025 and expect to complete by early January 2026.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>SharePoint document library owners and editors with edit permissions.</li>\n<li>Internal users submitting files via shared forms.</li>\n</ul>\n<p><b>What will happen:</b></p>\n\n\n<p><b>For file upload form creators:</b></p>\n<ul>\n<li>A new <b>Forms</b> button will appear in the command bar of document libraries and folders.</li>\n<li>Clicking <b>Forms</b> allows users to create and design a custom intake form using the library’s columns as fields.</li>\n<li>Form creators can show/hide fields, mark required info, and apply a theme using the library’s metadata schema.</li>\n<li>Files are stored in a folder associated with the form; storing files at the library root is not supported.</li>\n<li>Once ready, forms can be shared via link with anyone in the organization.</li>\n<li>Creators can stop accepting responses at any time and view/edit forms they’ve created from the <b>Forms</b> menu.</li>\n<li>External or guest sharing of forms is not supported.</li>\n<li><b>Document library forms respect existing sharing settings.</b> If a site or library is configured to disallow shareable links to the organization, the <b>Forms</b> feature will not be available on that library (similar to Microsoft Lists forms).</li>\n</ul>\n\n<p><b>For form respondents (contributors):</b></p>\n<ul>\n<li>Anyone in your organization with the form link can access and submit it.</li>\n<li>Respondents sign in with their organization credentials and see a web form to upload files and fill out metadata.</li>\n<li>Submissions can be made from any desktop or mobile browser.</li>\n<li>Submitters only see the form and do not see the library’s contents or other submissions.</li>\n<li>Once submitted, files and metadata are saved to the target folder in the library.</li>\n<li>Submitters cannot edit or view their submission unless they already have access to the library.</li>\n<li><b>Standard file upload methods</b> (e.g., <b>New</b>, <b>Upload</b>, or drag-and-drop) remain unaffected. Users with direct access to the library can continue using these methods; forms provide an additional optional method for gathering files from others.</li></ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>No admin action is required to enable this feature—it will be on by default.</li>\n<li>Inform document library owners and editors about the new <b>Forms</b> capability.</li>\n<li>Update internal documentation to reflect this new file collection method.</li>\n<li>Review site and library sharing settings to ensure org-wide sharing is enabled if you plan to use this feature.</li>\n<li>If you want to hide the <b>Forms</b> button in specific libraries, use command bar customization via JSON formatting. Refer to: <a href=\"https://learn.microsoft.com/en-us/sharepoint/dev/declarative-customization/view-commandbar-formatting#key\" target=\"_blank\">Command bar customization syntax reference</a>.</li>\n<li>A Microsoft blog post with additional details will be published closer to rollout. We recommend checking the SharePoint Blog for updates.</li></ul><p>Learn more: <a href=\"https://techcommunity.microsoft.com/blog/spblog/ux-updates-ai-actions--forms-in-document-libraries/4466700\" target=\"_blank\">UX Updates, AI Actions &amp; Forms in Document Libraries | Microsoft Community Hub</a></p><ul>\n</ul><p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint is introducing custom file upload forms in document libraries for internal file and metadata collection without exposing the full library. Available late Nov 2025, this feature lets owners create and share forms internally, with submissions saved in designated folders. No admin action required; external sharing is unsupported."
    }
  ],
  "EndDateTime": "2026-02-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188226",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-19T23:31:30.16Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-19T23:31:09Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "SharePoint: Document Libraries - A new forms experience for streamlined document collection",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
