{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 12, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We're introducing the Content Management Assessment (CMA) in SharePoint Advanced Management to help tenant admins evaluate site health, permissions, and lifecycle readiness—all in a single, actionable dashboard. CMA consolidates multiple reports, including Site Lifecycle Management (SLM) and Data Access Governance (DAG), and provides tailored recommendations to strengthen governance and accelerate Copilot onboarding.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501427\" target=\"_blank\">501427</a>.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide): Rollout begins early October 2025 (previously early September) and is expected to complete by early November 2025 (previously early October).</p><p><b>How this affects your organization</b></p><p>CMA is off by default and must be initiated by an admin. Once launched from the Advanced Management tab in the SharePoint Admin Center, CMA automatically generates reports such as SLM and DAG and presents results in a clean, actionable dashboard.</p><p>This update helps you:</p><ul><li>Save time by automating previously manual governance tasks.</li><li>Strengthen site governance with insights into oversharing, inactive content, and permission risks.</li><li>Prepare sites for Copilot by surfacing key lifecycle and access issues.</li><li>Align admin teams with a standardized view of governance priorities.</li></ul><p>Improvements include a more accessible UI, refined issue categories and tooltips, and easier navigation across reports.</p><p><b>What you can do to prepare</b></p><p>To use the Content Management Assessment (CMA), you must have either a <i>SharePoint Advanced Management license</i> or a <i>Microsoft 365 Copilot license</i> assigned to your admin account.</p><p>To get started:</p><ul><li>Go to the SharePoint Admin Center.</li><li>Select the <i>Advanced Management tab</i>.</li><li>Choose <i>Start a free content assessment</i>.</li><li>Review the dashboard and explore tailored recommendations.</li><li>Share feedback to help shape future improvements.</li></ul><p></p><p></p><b>Compliance considerations</b><table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr>\n<th>Compliance Area</th>\n<th>Explanation</th>\n</tr>\n<tr>\n<td>Stores new customer data</td>\n<td><i>CMA </i>generates and stores assessment data based on site health, permissions, and lifecycle status. Data is stored within the tenant and follows existing SharePoint data residency rules.</td>\n</tr>\n<tr>\n<td>Alters existing customer data processing</td>\n<td><i>CMA </i>processes existing site metadata and permissions to generate insights but does not modify content.</td>\n</tr>\n\n<tr>\n<td>Admin control available</td>\n<td>Admins initiate <i>CMA </i>manually and must have appropriate licensing.</td>\n</tr>\n<tr>\n<td>Controlled via Entra ID group membership</td>\n<td>Access to <i>SharePoint Advanced Management</i> features can be scoped via <i>Entra ID</i> groups.</td>\n</tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501427"
    },
    {
      "Name": "Summary",
      "Value": "The updated SharePoint Content Management Assessment (CMA) launches October 2025, offering admins a unified dashboard to evaluate site health, permissions, and lifecycle readiness. It automates governance tasks, enhances Copilot preparation, requires specific licenses, and stores data per SharePoint residency rules."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1148538",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-12T19:20:01.033Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-05T22:02:18Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "New SharePoint assessment and dashboard to streamline site governance and Copilot readiness",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
