{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>To help organizations better manage testing efforts and reduce the risk of prolonged exposure to test configurations, Microsoft Defender for Identity (MDI) now requires an expiration period (up to 60 days) when enabling Recommended test mode. This update ensures test settings are time-bound, improving operational clarity and reducing potential security gaps.</p><p><b>When this will happen\n</b></p><p><b>General Availability (Worldwide):</b> Rollout will begin in<b> late July 2025</b> and is expected to complete by <b>mid-August 2025</b>.\n</p><p><b>How this affects your organization\n</b></p><p>This feature is <b>not enabled by default</b>. Admins must manually enable Recommended test mode, and starting with this update, they will also be required to define an expiration period of up to 60 days. The selected expiration date will be clearly displayed next to the toggle in the Microsoft Defender for Identity portal.\n</p><p><i>Expiration date displayed next to the Recommended test mode toggle in the Microsoft Defender for Identity portal:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/22e4df22-73e6-4128-af3d-16fe2c7bdd35/bbdb103259eb966113aff6b8cbd4501c655befe6.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>For tenants that had Recommended test mode enabled prior to this change, a default 60-day expiration period will be automatically applied starting from the rollout date. Once the expiration period ends, test mode will be turned off and original alert thresholds will be restored.</p><p>This change:\n</p><ul><li>Applies to <b>all tenants with Microsoft Defender for Identity (MDI) installed</b>, regardless of licensing (e.g., E5, Defender for Identity).\n</li><li>Requires <b>Security administrator </b>permissions (or higher) to make changes on the <b>Adjust alerts thresholds </b>page.\n</li><li><b>Does not impact users directly but</b>&nbsp;may affect <b>alerting behavior and integrations with other Microsoft security products</b> once test mode expires.</li></ul><p><b>What you can do to prepare\n</b></p><p>No admin action is required for this change to take effect. However, we recommend:\n</p><ul><li>Reviewing your current use of Recommended test mode.\n</li><li>Planning for the expiration behavior and any downstream effects on alerting or integrations.\n</li><li>Ensuring appropriate admin roles (e.g., Security administrator) are assigned to those managing alert thresholds.</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/defender-for-identity/advanced-settings\" target=\"_blank\">Adjust alert thresholds | Microsoft Defender for Identity | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/defender-for-identity/\" target=\"_blank\">Microsoft Defender for Identity documentation | Microsoft Learn</a></li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity will require a 60-day expiration period when enabling Recommended test mode starting late July 2025. Admins must manually set this expiration, which limits test duration and restores original alert thresholds after expiry, affecting alerting and integrations but not users directly."
    }
  ],
  "EndDateTime": "2025-08-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1124559",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-29T23:59:50.477Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-29T23:59:35Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity: Expiration required for Recommended test mode",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
