{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p></p><p><b><b>Introduction</b></b></p>\nWe’re introducing a new post-deployment configuration option for unified sensors (V3.x) in Microsoft Defender for Identity (preview). This update enhances security and enables advanced identity detections by allowing admins to apply the new <i>Unified Sensor RPC Audit</i> tag to domain controllers onboarded with the unified sensor (v3.x). This tag activates Remote Procedure Call (RPC) monitoring using the Windows Filtering Platform (WFP), which is required for advanced identity detections.<p></p>\n\n<p><b><b>When this will happen:</b></b></p>Preview (Worldwide): Rollout will begin in <b>late September 2025</b> and is expected to complete by <b>mid-October 2025</b>.<p></p><p></p><p>Preview (GCC, GCCH, and DoD): Rollout will begin in <b>late September 2025</b> and is expected to complete in <b>late October 2025</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n  <li><b>Who is affected:&nbsp;</b>This configuration option applies only to devices running the unified sensor (v3.x).</li>\n  <li><b>What will happen:</b>\n    <ul>\n      <li>A new configuration option will be available in <i>Asset rule management</i>.</li>\n      <li>Admins can apply the Unified Sensor RPC Audit tag to onboarded domain controllers running the unified sensor (v3.x).</li><li>Devices with this tag will have WFP-based RPC monitoring enabled.</li>\n      <li>Once applied, the configuration is enforced on existing and future devices that match the rule criteria.</li><li>Tagged devices will appear in <i>Device inventory</i> for visibility and auditing.</li>\n      <li>This feature is <b>opt-in</b> and not enabled by default.</li>\n    </ul>\n  </li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n  <li>No action is required unless you want to enable the feature.</li>\n  <li>If needed, enable the new configuration option by creating an asset management rule to apply the tag.</li><li>Communicate this change to your security and compliance teams.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/defender-for-identity/deploy/prerequisites-sensor-version-3\" target=\"_blank\">Microsoft Defender for Identity sensor v3.x prerequisites (Preview)</a></p><ul><a href=\"https://learn.microsoft.com/en-us/defender-for-identity/unified-sensor-overview\">\n</a></ul><b><b>Compliance considerations:</b></b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity introduces a new opt-in post-deployment configuration for unified sensors (v3.x) enabling RPC monitoring via the Unified Sensor RPC Audit tag. Rollout starts late September 2025, enhancing advanced identity detections with visibility in device inventory. No action needed unless enabling the feature."
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162274",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-29T23:04:25.347Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T23:04:19Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "New post-deployment configuration for unified sensors (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
