{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>We’re introducing a new content explorer experience for cases in Insider Risk Management, now available in public preview. This update enhances the classic content explorer with advanced filtering, grouping options, document preview, column customization, and time zone selection—making it easier for investigators to review case content efficiently. This new experience will apply to all newly created cases in Insider Risk Management.</p>\n\n<b><b>When this will happen:</b></b>\n\n<ul><li>Public Preview (Worldwide): Rollout will begin in <b>early&nbsp;October 2025</b> and is expected to complete by <b>early November 2025</b>.</li></ul>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n</ul><p><b>Who is affected:</b> All Insider Risk Management customers using Microsoft Purview. Admins and investigators managing Insider Risk cases.</p><ul>\n</ul><p><b>What will happen:</b>\n  </p><ul>\n    <li>All new cases created after rollout will use the new content explorer experience.</li>\n    <li>Existing cases will continue to use the classic content explorer.</li>\n    <li>The new experience includes:\n      <ul>\n        <li>Advanced filtering and grouping options.</li>\n        <li>Document preview within the explorer.</li>\n        <li>Customizable columns.</li>\n        <li>Time zone selection for better context.</li>\n      </ul>\n    </li>\n    <li>No changes to existing policies or configurations.</li>\n    <li>The feature is enabled by default for new cases.</li>\n  </ul>\n<p></p><ul>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>No action is required. This feature will be rolled out automatically.</li>\n<li>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/compliance/insider-risk-management-content-explorer\">Review data with the Insider Risk Management content explorer</a></li></ul><p>\n<b><b>Compliance considerations:</b></b>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "A new content explorer for Insider Risk Management cases, featuring advanced filtering, grouping, document preview, customizable columns, and time zone selection, will roll out worldwide in public preview from early October to early November 2025. It applies to new cases only, with no changes to existing policies."
    }
  ],
  "EndDateTime": "2025-12-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162957",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-30T23:16:51.333Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-30T23:16:44Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Public preview: New content explorer experience for cases in Insider Risk Management",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
