{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n</p><p>We're introducing a <b>new preview experience </b>in the <i>Microsoft 365 Copilot app for Android</i> that allows users to open Word, Excel, and PowerPoint files and interact with them using Copilot Chat. For editing actions, the Microsoft 365 Copilot app will transition to the fully featured standalone Word, Excel, or PowerPoint apps. This change positions Microsoft 365 Copilot as your AI-first productivity assistant, bringing together activity across Word, Excel, PowerPoint, Outlook, and other Microsoft 365 apps.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=518290\" target=\"_blank\">518290</a>.</p>\n\n<p><b><b>When this will happen</b></b>&nbsp;</p><ul><li><b>Mid-November 2025: </b>Users may begin seeing prompts to install the standalone Word, Excel, or PowerPoint apps when attempting to edit those file types in Copilot.</li><li><b>Mid-December 2025 – Mid-January 2026: </b>Previewer experience rollout begins and is expected to complete by mid-January 2026.</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected:</i>&nbsp;</p><ul><li>All users of the Microsoft 365 Copilot app on <i>Android</i>. </li><li>Tenant admins responsible for app deployment and mobile productivity.\n</li></ul><p><i>What will happen:</i>&nbsp;</p><ul><li><b>Copilot Preview Experience</b>: Users can open Word, Excel, and PowerPoint files in the <i>Copilot app on Android </i>and use Copilot Chat for summaries and insights.</li><li><b>Editing Files</b>: Editing will require switching to the standalone Word, Excel, or PowerPoint apps. Users will be prompted to install or open these apps.</li><li><b>Teams, OneDrive, Outlook app integration</b>: These apps on <i>Android</i> will continue to show users previews of Office files. Editing will redirect users to the respective standalone apps. The Microsoft 365 Copilot app will no longer handle file open and edit operations from Teams, OneDrive or Outlook.\n</li><li><b>File Management</b>: File search remains available in <i>Copilot</i>. Advanced management will require the standalone OneDrive app.</li><li><b>Document creation</b>: Users can create documents via chat in <i>Copilot</i>. Viewing remains in-app; editing transitions to standalone apps.</li><li><b>Offline access</b>: Offline viewing will only be available in the standalone Word, Excel, PowerPoint, and OneDrive apps. “<i>Make Available Offline</i>” is being removed from Copilot.</li><li><b>PDF workflows</b>: No changes; PDF handling continues as before.</li><li><b>Folder browsing</b>: Folder browsing from OneDrive, SharePoint, or third-party hosts will no longer be supported in <i>Copilot</i>.</li><li><b>Protocol URLs</b>: Opening documents via protocol URLs will require the standalone apps.</li><li><b>Third-Party hosts</b>: Adding third-party host accounts to Copilot will no longer be supported.</li></ul>\n\n<p><b><b>What you can do to prepare</b></b>\n</p><p>Tenant admins should: </p><ul><li>Plan deployment of the standalone Word, Excel, and PowerPoint apps to support file editing. </li><li>Deploy the standalone OneDrive app to enable file and library management. </li><li>Communicate to users that editing and template creation will require switching to standalone apps. </li><li>Update internal documentation to reflect this workflow change.</li></ul>\n\n<p><b><b>Compliance considerations</b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Compliance Area</td><td>Impact</td></tr><tr><td><p>Does the change provide end users any new way of interacting with generative AI?&nbsp;</p></td><td><p>Users can interact with Word, Excel, and PowerPoint files via M365 Copilot Chat for summaries and insights. Preview and Copilot chat functionality for documents is accessible to users on Android.</p></td></tr><tr><td><p>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</p></td><td><p>Editing Word, Excel, and PowerPoint files will no longer be available in the M365 Copilot app; users must use standalone apps for editing. Make available offline capability has been removed from M365 Copilot. OneDrive file management capabilities have been removed from M365 Copilot.  Changing support for third party hosts as listed above.</p></td></tr><tr><td><p>Does the change include an admin control and, can it be controlled through Entra ID group membership?</p></td><td><p>Admins can manage app deployment and access via Entra ID and MDM policies. The M365 Copilot app should remain in managed app stores for enterprise environments.</p></td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "518290"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot for Android preview lets users open Word, Excel, and PowerPoint files with Copilot Chat for summaries. Editing requires switching to standalone apps. Offline access and advanced file management move to standalone apps. Rollout starts mid-November 2025, completing by mid-January 2026. Admins should plan app deployment accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Android"
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1184413",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-10T16:07:36.687Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-10T16:06:57Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot for Android: Preview and chat with Word, Excel, and PowerPoint files in the Copilot app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
