{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>To enhance visibility of in-room participants during Microsoft Teams meetings, we’re updating the <i>Gallery view</i> experience when Teams Rooms on Android joins a meeting. Teams Rooms on Android video tiles will now dynamically resize based on the number of people detected in the room, aligning with the experience already available in Teams Rooms on Windows.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=500635\" target=\"_blank\">500635</a>.</p>\n\n<b>When this will happen</b><p>General Availability (Worldwide): Rollout begins early October 2025 and is expected to complete by late October 2025.</p>\n\n<b>How this affects your organization</b><ul>\n<li>If only one person is present in the room, the room video tile will be the same size as other remote participant tiles.</li>\n<li>If multiple people are present, the room video tile will remain optimized at approximately 4x the size of a remote participant tile.</li></ul><p><i>Figure i. Conference Room Ruby has more than 1 person in the room, therefore, the room video tile is optimized. While, Conference Room Emerald has 1 person in the room, and the room video tile is the same size as other remote participants.</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3c848384-a368-4e6a-ae83-cc03119751de\" style=\"width: 400px;\" alt=\"user settings\"></p><ul>\n<li>This feature is enabled by default and requires a room camera capable of sending people count data.</li><li>If <i>people count</i> is turned off in Teams Rooms on Android admin settings, the room video tile will not dynamically resize, and will not provide people count information.</li>\n</ul>\n\n<b>What you can do to prepare</b><ul>\n<li>Inform users about the updated <i>Gallery view</i> experience.</li>\n<li>Update training materials and documentation as needed.</li>\n<li>Review and adjust Teams Rooms on Android admin settings if you wish to disable people count detection.</li>\n</ul>\n<table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>AI/ML capabilities interacting with customer data</td><td>People count detection uses camera-based AI to determine occupancy, which influences UI behavior.</td></tr>\n<tr><td>Admin control available</td><td>Admins can disable people count detection in Teams Rooms on Android settings.</td></tr>\n<tr><td>Feature enabled by default</td><td>The dynamic resizing feature is turned on by default.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "500635"
    },
    {
      "Name": "Summary",
      "Value": "Teams Rooms on Android will dynamically resize video tiles in Gallery view based on room occupancy, matching the Windows experience. One person results in equal tile size to remote participants; multiple people enlarge the tile. The feature, using AI-based people count, is enabled by default from October 2025, with admin controls to disable it."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1148542",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-05T22:04:43.223Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-05T22:04:38Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Dynamic video tile resizing based on occupancy count from Teams Rooms on Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
