{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>What and Who</b></p><p></p><p>To enhance the security and integrity of Microsoft Teams meetings, we are introducing a new feature that validates Teams meeting join URLs. This update helps ensure that meeting links are not altered or rewritten by security products in ways that could render them unusable or flagged as malicious.<b><br></b>\n\n</p><p><b>Rollout Schedule</b></p><p></p><ul><li><b>Worldwide:</b> September 30, 2025</li>\n<li><b>GCC, GCC High, DoD:</b> November 30, 2025</li>\n</ul>\n\n<p></p><p><b>Impact on Your Organization</b><b><br></b></p><ul><li><b>Who is affected:</b> <ul><li>Organizations using security products that inspect or rewrite URLs, and users who join Microsoft Teams meetings via meeting links.</li></ul></li></ul><p></p><ul>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Microsoft Teams will validate join URLs to ensure they have not been modified.</li>\n    <li>If a join URL is rewritten or altered by a security product, it may be marked as malicious.</li>\n    <li>Users may be prevented from joining meetings if URLs are not in their original format.</li>\n    <li>This feature is enabled by default and does not require admin configuration.</li></ul></li></ul><p><b>Action Required/Recommendations</b></p><ul><li>Ensure that your security products do <b>not</b> rewrite Microsoft Teams meeting join URLs.</li>\n<li>Whitelist Microsoft Teams join URLs in your security software.</li>\n<li>Review your organization’s URL rewriting or inspection policies before the rollout date.</li>\n<li>Communicate this change to your helpdesk and security teams.</li>\n</ul>\n\n<p></p><p><b>Compliance Considerations</b></p><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will validate meeting join URLs starting September 30, 2025 (November 30 for GCC/DoD) to prevent altered or rewritten links from being used. Security products must avoid rewriting these URLs to prevent users from being blocked. No admin action is needed, but organizations should update security policies accordingly."
    }
  ],
  "EndDateTime": "2026-01-12T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1120871",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-24T00:28:38.093Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-24T00:28:12Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Important Update: Teams Meeting Join URL Validation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
