{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><i>Agentic Users</i> are a new class of AI-powered digital entities designed to function as autonomous, enterprise-grade virtual colleagues. Unlike traditional bots, <i>Agentic Users</i> are provisioned as full-fledged user objects with their own identity in the organization’s directory (via Entra ID or Azure AD), email addresses, Teams accounts, and presence in the org chart. They can participate in meetings, send and receive emails and chats, access enterprise data, and learn from interactions to improve over time.</p>\n<p><i>Agent templates</i>—preconfigured digital worker profiles—are available in <i>Microsoft Teams</i> and the <i>Microsoft 365 Copilot Store</i>. These templates define the agent’s capabilities, identity, and compliance settings, enabling hiring managers to acquire agents that automate tasks and enhance team productivity.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=518220\" target=\"_blank\">518220</a>.</p>\n\n<b>When this will happen:</b>\n<p>Targeted Release rollout starts in mid-November 2025.</p><p>We will share additional timelines later when available.</p>\n\n<b>How this affects your organization:</b>\n<ul>\n</ul><p><b>Who is affected: </b>This change affects Microsoft 365 tenants with access to Microsoft Teams and the Microsoft 365 Copilot Store.</p><ul></ul><p></p><ul><li>All users in the tenant can discover and view agent templates.</li><li>Only users approved by the tenant admin can create agents from templates.</li>\n</ul><p><b>What will happen:</b></p><p></p><ul></ul><p></p><ul><li>Agent templates will be available in the <i>Apps area</i> in <i>Microsoft Teams</i> and in the <i>Microsoft 365 Copilot Store</i> under <b><i>Agents for your team:</i></b></li></ul><ul><p><i>Screenshot 1</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/bfa26787-f892-4615-b0fb-e3728630c7fc/de75b76035c2d75fbb8e0190241a9ea206d53c41.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i></i></p><p><i>Screenshot 2</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/7878b16c-90a7-403b-9f89-75f20e90122b/9b1e953ce9c0f9bebcacdb6507d1e3539ff36f6a.png\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li>Available on the desktop platform for Microsoft Teams and Microsoft 365 Copilot.</li>\n<li>Agent templates are <b>available by default</b> to all users in the tenant.</li><li>Users must request their tenant admin to publish the agent template.</li><li>Once approved and published, users can create<i> Agentic Users</i> from the template.</li><li><b>Admins assign the required A365 license at the time of approval</b>. <b>No additional Microsoft 365 or Teams license is required</b>.</li>\n<li>Users will be able to:\n<ul>\n<li>Request agent creation from a template.</li>\n<li>Receive notifications when agents are ready.</li>\n<li>Create and name agents via configuration pane.</li>\n<li>Interact with agents via Teams chat, channels, and meetings.</li>\n</ul></li>\n<li>Agents will appear in the <i>org chart</i> under sponsor supervision.</li>\n<li>Agents can be paused or deleted; resources remain available for 30 days post-deletion.</li>\n</ul>\n\n\n<b>What you can do to prepare:</b>\n<ul>\n<li>Ensure your tenant admin is aware of the publishing and licensing process for agent templates.</li>\n<li>Communicate the availability of agent templates to relevant teams.</li>\n<li>Review internal documentation to include guidance on agent creation and management.</li>\n<li>Additional configuration is available through the agent card in<i> Teams </i>or <i>Copilot chat</i>.</li>\n</ul>\n\n<p></p><p><b>Learn more:&nbsp;</b><a href=\"https://review.learn.microsoft.com/microsoft-agent-365/onboard?branch=main\" target=\"_blank\">Discover, create, and onboard an agent (preview) | Microsoft Agent 365 | Microsoft Learn</a></p><p><b>Compliance considerations:</b>\n</p><table border=\"1\">\n<tbody><tr><th>Question</th><th>Answer</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. Agentic Users are autonomous AI entities that access and act on enterprise data, learn from interactions, and improve over time.</td></tr>\n<tr><td>Does the change provide a new way of communicating between users, tenants, or subscriptions?</td><td>Yes. Agentic Users can send and receive emails and chats, and participate in meetings.</td></tr>\n<tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes. Agentic Users proactively reason and act without explicit instructions, offering a new generative AI interaction model.</td></tr>\n<tr><td>Does the change include an admin control and can it be controlled through Entra ID group membership?</td><td>Yes. Admins control agent creation and licensing through Entra ID group membership.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users can pause or delete agents after creation.</td></tr>\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "518220"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams and Microsoft 365 Copilot will introduce AI-powered Agentic Users—autonomous virtual colleagues with full organizational identities. Available from mid-November 2025, users can discover and request agent templates, with admins controlling creation and licensing. Agents interact via Teams, email, and meetings, enhancing productivity and learning over time."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-01-14T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1183300",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-06T00:21:33.613Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-06T00:20:44Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams and Microsoft 365 Copilot: Discover and create agentic users from Teams and M365 Agent Store",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
