{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 12, 2025: We have updated the timeline. Thank you for your patience.</p><p>Prior to this rollout, if a user plugged into a different desk than their existing desk reservation, they would be automatically reserved at the desk, provided there was capacity. This could lead to them having multiple desk reservations. With this roll out, when using bookable desks, users will be notified that they have multiple reservations and be asked to release the previous ones. In addition, we will also be releasing a first run experience to provide the user with more information on why they are receiving notifications to provide further clarity and information.&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC) for first run experience: We will begin rolling out mid-August 2025 (previously early August) and expect to complete early September 2025 (previously late August).</p><p>General Availability (Worldwide, GCC) for the notification when user has multiple reservations: We will begin rolling out late August 2025 and expect to complete mid-September 2025.&nbsp;</p><p>\n</p><p><b>How this will affect your organization:</b></p><p>As a reminder, Bookable desks refer to unassigned seats in the office that are equipped with devices such as monitors or other peripherals. Admins can associate these devices to an individual desk or desk pool account through the Teams Rooms Pro Management portal. <a href=\"https://learn.microsoft.com/en-us/microsoftteams/rooms/bookable-desks\" target=\"_blank\">aka.ms/desksetup</a></p><p>When a user books a desk in advance and plugs into a peripheral that is associated to a different desk, they will receive the following notification.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f572c80c-d43c-4587-aee2-f85ef668b814\" width=\"400\" height=\"\"></p>If they would like to, they can click ‘Cancel previous reservation’, and the previous reservation will be canceled on their behalf. This feature is available for Teams premium users and will be supported for both desks and desk pools.<p></p><p>In addition, we will also be adding a new in-depth notification for the first time a user receives any notification about a bookable desk. This will give users more insight into why they are receiving such notifications with links to learn more. This will only appear once and is available for all users and both desks and desk pools.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/45a9a281-ef87-499d-b312-1a3aac5ef3f4\" width=\"400\" height=\"\"></p><p>&nbsp;<b>What you need to do to prepare:</b>\n</p><p>There is no admin action required before roll out and will be available to all automatically once it is released. We recommend communicating this new feature to your users and admin team and share instructions if needed.&nbsp;</p><p><b>Compliance considerations:</b></p><ul><li>Does the change provide a new way of communicating between users, tenants, or subscriptions? No</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting mid-August 2025, Microsoft Teams will notify users with multiple desk reservations to release previous ones and introduce a first run experience explaining these notifications. This applies to bookable desks and desk pools, requires no admin action, and is available to all users, with cancellation features for Teams Premium users."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1106876",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T20:47:33.127Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-30T23:05:07Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: First run experience and prompting users to release previous reservations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
