{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re improving the email preview experience in Microsoft Defender for Office 365 to provide a clearer, more consistent, and secure workflow. These updates are designed to reduce ambiguity, simplify interactions, and reinforce security protections—helping organizations confidently use this feature as part of their protection strategy.</p><p><b>When this will happen:</b></p><p><b>General Availability (Worldwide): </b>Rollout will begin in mid-October 2025 and is expected to complete by early November 2025.</p><p><b>General Availability (GCC, GCCH, and DoD): </b>Rollout will begin in late October 2025 and is expected to complete by mid-November 2025.</p><p><b>How this affects your organization:</b></p><p>Who is affected: Quarantine administrators Microsoft Defender for Office 365 as well as users with access to review and preview messages within quarantine.</p><p>The update is specifically for the preview capability within the quarantine experience. What will happen:</p><ul><li>The update consists of three main parts:<ul><li><b>Streamlined view options: </b>The plain text view option will be retired to unify preview behaviors across Defender experiences.</li><li><b>Clearer handling of URLs: </b>The hover-over preview for URLs will be limited to reinforce that links in quarantine preview are not clickable.</li><li><b>Simplified content loading:</b> The “<i>Load external content</i>” button will be removed for some scenarios. Content will render in a secure, isolated environment.</li></ul></li></ul><p>Quarantine administrators and users will experience a simplified preview interface with clearer rendering and reduced visual cues for URL interactivity:</p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/c323345b-e44d-4e4b-b9a6-931e54f0447c/3b170c24424c66be67513eb830e99ce9533e18ad.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p></p><p><b>What you can do to prepare:</b></p><ul><li>Update any internal documentation that references the quarantine preview experience.</li><li>Communicate these changes to helpdesk and support teams to reduce confusion.</li><li>No configuration changes are required; the update will apply automatically.</li></ul><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 will enhance the quarantine email preview by retiring plain text view, limiting URL hover previews, and removing some \"Load external content\" buttons. Rollout starts mid-October 2025 globally, simplifying the interface without requiring configuration changes. Update documentation and inform support teams accordingly."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1166867",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-06T23:15:02.487Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-06T23:14:57Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Enhancing the quarantine email preview experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
