{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b><b>Introduction</b></b></p><p>We’re introducing <b>shared call history</b> in the <b>Microsoft Teams Queues app</b>. This feature provides queue members with a unified view of all call events—missed, incoming, and outgoing—within a call queue. By enabling shared history, teams can access consistent, up-to-date information, follow up efficiently, and improve operational responsiveness.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2d761294-90a6-40bf-a5fa-48ffdb656c1b\" style=\"width: 400px;\" alt=\"user settings\"></p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=530579\" target=\"_blank\">530579</a>&nbsp;and applies to Teams for Windows desktop and Teams for Mac desktop.</p><p>\n</p>\n\n<b><div><b><b>When this will happen:</b></b></div></b><ul><li><b style=\"\">Targeted Release:</b> Rolling out early&nbsp;January 2026, expected completion by mid-January 2026.</li>\n<li><b>General Availability (Worldwide):</b> Rolling out mid-January 2026, expected completion by early February 2026.</li>\n</ul>\n\n<b><b>How this affects your organization:</b></b><p></p><p></p><p><b>Who is affected:</b></p>\n<ul>\n<li>Organizations using <b>Microsoft Teams Queues app</b> on desktop, web, and Mac.</li>\n<li>Users with appropriate permissions and a <b>Teams Premium license</b>.</li>\n</ul>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Queue members will be able to view <b>shared call history</b> for all missed, incoming, and outgoing calls.</li>\n<li>Feature is <b>disabled by default</b>; admins must enable it in <b>Teams Admin Center (TAC)</b>.</li>\n<li>Admins can grant <b>shared call history</b> access to all queue members or restrict access to authorized users only.</li>\n<li>Known limitation: Tenant migration is not supported for <b>Queues call history</b>. If your organization moves to a new region, existing history will not transfer; a new history will begin. Support for migration will be added in a future update.</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b><p></p><p></p><ul><li>Enable <b>shared call history</b> in <b>Teams Admin Center</b>.</li>\n<li>Configure permissions for queue members or authorized users.</li>\n<li>Communicate this change to your helpdesk and affected users.</li>\n<li>Update internal documentation to reflect this feature.</li></ul><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/MicrosoftTeams/plan-auto-attendant-call-queue?branch=pr-en-us-18379\" target=\"_blank\">Plan for Teams Auto attendants and Call queues</a> (will be updated before rollout)</li><li><a href=\"https://learn.microsoft.com/microsoftteams/create-a-phone-system-call-queue?tabs=general-info\" target=\"_blank\">Create a Call queue in Microsoft Teams</a> (will be updated before rollout)</li></ul><ul>\n</ul><p><b><b>Compliance considerations:</b></b></p><p></p><p></p><p>No compliance considerations identified; review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "530579"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Queues app will introduce shared call history for queue members to view all call events. Rolling out January–February 2026, the feature is disabled by default and requires Teams Premium license and admin enablement. Tenant migration of call history is not supported initially."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-03-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188999",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-22T00:32:46.417Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-22T00:32:02Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Shared call history in Queues app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
