{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p><b>Introduction</b>\n</p><p>Organizations undergoing rebranding, mergers, acquisitions, divestitures, or tenant consolidations often need their SharePoint domain name in URLs to reflect their new identity. The <i>SharePoint Online (SPO) Tenant Rename</i> feature enables this change. We are announcing <b>General Availability (GA) of Advanced Tenant Rename</b> for tenants with up to 500K SharePoint sites, expanding support beyond the previous 100K site limit.</p>\n\n<p><b>When this will happen</b></p><p><b>General Availability (Worldwide):</b> We began rolling out in mid-August 2025 and expect to complete by early September 2025.</p><p>This feature will be generally available worldwide starting <b>September 1, 2025</b>.</p>\n\n<p><b>How this affects your organization</b>\n</p><p>This update allows rename support for tenants with up to 500K total SharePoint sites. It maintains high reliability across rename operations and ensures business-as-usual continuity during and after the rename. It is compatible with top Microsoft 365 partner scenarios such as Microsoft Teams and PowerApps.</p><p>Key capabilities include:</p><ul><li>Rename support for tenants with up to 500K total sites.</li><li>High reliability maintained across rename operations.</li><li>Business-as-usual (BAU) continuity ensured during and after rename.</li><li>Compatibility with top Microsoft 365 partner scenarios (Teams, PowerApps, etc.).</li><li>Enhanced telemetry to monitor rename operations and identify issues quickly.</li></ul><p>Please note the following limitations for this release:</p><ul><li>Tenant rename for vanity domains is not supported.</li><li>Tenant rename for Multi-Geo customers is not supported.</li><li>Tenant rename for customers with more than 500K sites is not supported.</li>\n</ul>\n\n<p><b>What you can do to prepare</b>\n</p><p>Admins should:\n</p><ul>\n<li>Confirm their tenant’s total site count using the SharePoint admin center (SPAC) or PowerShell before scheduling.</li>\n<li>Review unsupported features or limitations (such as Hub site limitations, vanity domains, or third-party integrations).</li>\n<li>Communicate any impact to site owners based on public documentation.</li>\n<li>Validate custom scripts, PowerShell automations, and integrations that rely on the old domain name.</li>\n</ul>\nLearn more:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/change-your-sharepoint-domain-name\">Change your SharePoint domains | SharePoint in Microsoft 365 | SharePoint | Microsoft Learn</a><p></p></p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online Tenant Rename is now generally available for tenants with up to 500K sites, allowing domain name changes during rebranding or mergers. It ensures high reliability, business continuity, and compatibility with Microsoft 365 apps, but excludes vanity domains, Multi-Geo, and tenants over 500K sites."
    }
  ],
  "EndDateTime": "2026-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1146820",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-02T23:21:41.753Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-02T23:21:30Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint Online: Tenant rename General Availability (GA) for tenants with up to 500K sites",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
