{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>Updated December 15, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p>Microsoft is introducing the ability to start, stop, and restart meeting recording and transcription directly from <b>Microsoft Teams Rooms on Android</b> devices. This enhancement supports a more seamless meeting experience by removing the need for a companion device to initiate these actions. Spoken language for the meeting can also be changed during the session. This functionality is <b><i>available with Teams Rooms Pro licensing</i></b>.</p>\n\n<b>When this will happen:</b><p></p><p><b>General Availability (Worldwide and GCC): </b>We will begin rolling out in mid-January 2026 (previously mid-December 2025) and expect to complete by late January 2026 (previously late December 2025).</p><p><b>General Availability (GCCH and DoD): </b>We will begin rolling out in early February 2026 (previously early January) and expect to complete by mid-February 2026 (previously&nbsp; end of January).</p>\n\n<b>How this affects your organization:</b>\n<ul>\n</ul><p><b>Who is affected:</b> </p><ul><li>Users joining Teams meetings from Microsoft Teams Rooms on Android devices. </li><li>Organizations with Teams Rooms Pro licensing.</li></ul><p><b>What will happen:</b>\n  </p><ul>\n    <li>Users can start, stop, and restart recording and transcription directly from a Teams Rooms device running Android. To do this, they can select <i><b>More </b></i>on the meeting interface, then choose <b><i>Record and transcrib</i></b><i><b>e</b></i> to initiate or stop the recording and transcription.</li>\n    <li>The spoken language for the meeting can be changed during the session.</li>\n    <li>Previously, users needed a companion device to initiate recording or transcription.</li>\n    <li>Recording and transcription are supported in meetings where a participant belongs to the same tenant as the organizer.</li>\n    <li>For <b>Meet now</b> or <b>Whiteboard</b> sessions initiated from a Teams Rooms on Windows device, users must invite themselves to the meeting to access the recording file via Teams desktop or mobile app.</li>\n    <li>To use the start and stop recording and transcription feature, both the meeting organizer and the room account must have permission to record and transcribe. If either party lacks the required permissions, the button to initiate or stop recording and transcription will not appear.</li>\n    <li>If the meeting organizer removes recording or transcription permissions from the room account using meeting options, the button will also be unavailable.</li>\n  </ul>\n<p></p><ul>\n</ul><ul>\n<li><b>Limitations -&nbsp;</b>Recording and transcription are <b>not supported</b> in the following scenarios:<ul>\n  <li>Peer-to-peer (P2P) calls: Direct one-on-one calls between two users.</li><li>Group calls: Ad-hoc calls involving multiple participants that are not scheduled meetings.</li><li>PSTN calls: Calls made through the Public Switched Telephone Network using Teams Calling Plans or Direct Routing.</li><li>External or cross-tenant meetings and calls: Meetings involving participants from outside the organizer’s tenant.</li><li>Third-party meetings and calls: Including Direct Guest Join and<b> </b>SIP-based meetings, which use the Session Initiation Protocol to connect external video conferencing systems (such as Cisco or Polycom) to Microsoft Teams. These integrations do not support native Teams recording and transcription features.</li></ul></li></ul><p><i>Screenshot - New recording and transcription controls in Teams Rooms on Android:</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/a97fb8e5-eca9-4d99-ae7a-52766f351e25/7a284388a96cce2b110be9787f0d13e57251c975.png\" style=\"width: 400px;\" alt=\"user settings\"></p><ul>\n\n</ul>\n\n<b>What you can do to prepare:</b>\n<ul>\n<li>Ensure room accounts and meeting organizers have permissions to record and transcribe meetings.</li>\n<li>Communicate this change to helpdesk and support teams.</li>\n<li>Update internal documentation to reflect the new functionality.</li>\n<li>Review meeting options to confirm room account permissions are correctly configured.</li></ul><p><b>Compliance considerations:</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change store new customer data, and if so, where is it stored?</td><td>Yes. Meeting recordings and transcriptions initiated from Teams Rooms on Android are stored in the meeting organizer’s OneDrive or SharePoint, depending on the meeting type. These files are accessible via Teams desktop or mobile apps.</td></tr><tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Yes. Users can initiate recording and transcription directly from the Teams Rooms on Android device, which changes the access point and method for capturing and storing meeting data.</td></tr><tr><td>Does the change require permissions to access or process customer data?</td><td>Yes. Both the meeting organizer and the room account must have permissions to record and transcribe the meeting. If permissions are not granted, the feature will not be available.</td></tr><tr><td>Does the change include an admin control, and can it be managed through Entra ID group membership?</td><td>Yes. Admins can manage recording and transcription permissions via meeting options and Teams Rooms settings. These permissions can be scoped using Entra ID group membership.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users can start and stop recording and transcription directly from the Teams Rooms on Android device, provided they have the necessary permissions.</td></tr></tbody></table><p></p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Android will allow users with Teams Rooms Pro licensing to start, stop, and restart meeting recording and transcription directly from the device, starting mid-January 2026. Permissions are required for organizer and room accounts, with some limitations on call types and tenant scenarios."
    }
  ],
  "EndDateTime": "2026-03-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1182688",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-15T23:14:24.417Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-04T00:36:03Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Rooms on Android: Recording and transcription controls (Teams Rooms Pro required)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
