{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re updating how the <b>featured conversations </b>capability works in <i>Microsoft Viva Engage</i> for <b>public communities</b>. Today, when you feature a conversation from a community, it is elevated for every user who has access to that community. <b>With this change, featured conversations will only be elevated for members of the community.</b> Users who are not members, even if they have access, will no longer see the conversation featured. This helps ensure that only the intended audience sees the featured conversation, improving relevance and reducing unnecessary noise.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out in <b>December 2025</b> and expect to complete in <b>December 2025</b>.</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>: </p><ul><li>All Microsoft Viva Engage users in <i>public communities</i>.</li><li>Engage admins, verified admins, and corporate communicators.</li></ul><p><i>What will happen</i>:</p><ul><li>Employees who have access to a public community but are not members will no longer see the featured post elevated in their feeds or email digests.</li><li>Engage admins, verified admins and corporate communicators who feature a conversation in a public community, will only see it elevated for members of that community, not for all users who have access:</li><p> &nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/fed86b85-3c6d-4f93-b350-71115ec0ad3f/255110ef65a11d791ed3d02bd103efc02a0fbb2b.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li><i>Behavior for All Company</i>, <i>private communities</i>, and <i>Storyline</i> remains unchanged.\n</li><li>No changes to how admins or communicators feature conversations.</li></ul><p><i><b>Note: </b>There are no changes to the user experience; the update applies solely to how the feature functions. See highlighted difference below:</i></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/41efbae7-2051-494e-82a1-1dd4971cf834/260a169e4c1297e04b5732dc9648e167ca0dd3e4.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b><b>What you can do to prepare</b></b></p><ul><li>Inform corporate communicators and administrators about this change.</li><li>No configuration changes or admin action required.</li><li>Update internal documentation if you describe featured conversation behavior.</li></ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/office/feature-a-conversation-in-viva-engage-92469ece-8a63-424f-9ad6-802ad90fc5c4\" target=\"_blank\">Feature a conversation in Viva Engage | Microsoft Support</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting December 2025, Microsoft Viva Engage will change featured conversations in public communities to be elevated only for community members, not all users with access. This improves relevance and reduces noise. No changes affect private communities, all-company, or admin actions. No admin configuration needed."
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187849",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-18T23:34:48.69Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T23:34:21Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Behavior change to Engage “featured conversations” in public communities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
