{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're introducing a new capability in Preview for the Project Manager agent in Planner. This enhancement enables the agent to utilize encrypted files from the SharePoint site associated with the Microsoft 365 group of the Plan for grounding. By leveraging these files, the agent can improve task creation from goals and execution of assigned tasks, ensuring more accurate and secure project management automation.</p>\n\n<b>When this will happen</b><p></p><p>\n</p><ul>\n<li>Public Preview rollout begins: Late July 2025</li>\n<li>Expected completion: Late August 2025</li>\n</ul>\n\n<b>How this affects your organization</b><p></p><p>\n</p><ul>\n<li>New Plans with Project Manager agent:\n  <ul>\n    <li>SharePoint Site grounding is enabled by default during Plan creation.</li>\n    <li>Admins and users can disable this feature during or after Plan creation.</li>\n  </ul>\n</li>\n<li>Existing Plans with Project Manager agent or Premium Plans:\n  <ul>\n    <li>SharePoint Site grounding is disabled by default.</li>\n    <li>Admins can enable it manually within the Plan settings.</li>\n  </ul>\n</li>\n<li>Task and file behavior:\n  <ul>\n    <li>When encrypted SharePoint files are used for grounding, the resulting tasks and files are unencrypted and can be exported, printed, and downloaded.</li>\n  </ul>\n</li>\n</ul>\n\n<b>What you can do to prepare</b><p></p><p>\n</p><ul>\n<li>Review Plan creation workflows and determine if SharePoint Site grounding should be enabled by default for your organization.</li>\n<li>Educate users and admins on how to toggle the grounding feature during and after Plan creation.</li>\n<li>If needed, disable the Project Manager agent for your tenant by following guidance here: <a href=\"https://learn.microsoft.com/Planner/turn-off-project-manager-agent\"><font color=\"#000000\" style=\"\">Microsoft Learn</font></a></li></ul>\n<b>Compliance considerations</b><p></p><p>\n</p><table>\n<tbody>\n<tr><td>Alters how existing customer data is processed, stored, or accessed</td><td>If SP Site grounding is enabled, the Project Manager agent can access encrypted files stored in the SharePoint site of the M365 group associated with the Plan.</td></tr>\n</tbody></table>\n<p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Project Manager agent in Planner will preview a feature using encrypted SharePoint files for improved task creation and execution. New Plans enable this by default; existing Plans require manual activation. Tasks from encrypted files become unencrypted for export. Rollout starts late July 2025, completing late August 2025."
    }
  ],
  "EndDateTime": "2025-12-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1122155",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-25T22:34:16.773Z",
  "Services": [
    "Planner"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-25T22:33:39Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Project Manager Agent – SP site grounding",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
