{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>As part of the final phase of the Viva Engage rebranding, we’re updating the email sender domains used for Viva Engage communications. This change ensures a consistent and secure brand experience across all surfaces and completes the transition from Yammer to Viva Engage.</p><p>This update was previously communicated in MC679739, “Yammer Rebranding to Viva Engage Domain Migration Update,” in October 2023.</p><p><b>When this will happen</b></p><ul><li>The email sender domain rollout will begin in mid to late August 2025 for U.S. tenants currently receiving messages from @yammer.com. </li><li>It will expand to EU tenants using @eu.yammer.com in early September. The entire rollout is expected to complete by the end of October 2025.</li><li>A fallback/coexistence period will be in place between August and the end of October, during which both the old and new domains will be supported. This will be managed via an internal experiment.</li></ul><p></p><p><b>How this will affect your organization</b></p><p>The sender domain for Viva Engage emails will change as follows:\n</p><ul><li>From @yammer.com to @engage.mail.microsoft for U.S. and global regions.\n</li><li>From @eu.yammer.com to @eu.engage.mail.microsoft for European regions.\n</li></ul><p>These new domains are secured with industry-standard authentication protocols (e.g., SPF) to help prevent spoofing and ensure reliable delivery.\n</p><p>To enhance security and reduce cross-tenant spam, sender addresses will now include a tenant-specific prefix. You may see emails from:\n</p><ul><li>noreply_tenant@engage.mail.microsoft (digests and delegate notifications)\n</li><li>notifications_tenant@engage.mail.microsoft (community, storyline, and activity notifications)\n</li><li>announcements_tenant@engage.mail.microsoft (leadership announcements)\n</li></ul><p>These changes apply to all Viva Engage tenants, regardless of license tier (e.g., Viva P1, P2), and affect all Viva Engage emails, including notifications, announcements, and digests.</p><p>Third-party integrations (e.g., journaling, archiving, or routing systems) that rely on the @yammer.com domain for classification or authentication may be impacted. Any such configurations should be reviewed and updated to recognize the new domains.</p><p><i>An example of a new Viva Engage email notification sent from the updated @engage.mail.microsoft domain:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/55498900-45c4-4375-be35-b989948d2946/c7973dd8d9bde265ced10161ed090ee81bad55cb.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b>What you need to do to prepare</b></p><p>Admins should review and update the following configurations:\n</p><ul><li>Transport rules and email gateways: Update any rules that reference @yammer.com to include the new domains.\n</li><li>Exchange filtering: Ensure filtering rules remain effective with the new sender domains.\n</li><li>Outlook rules: Inform users that any rules based on @yammer.com will no longer apply. Users can manually update or remove these rules.\n</li></ul><p>No admin action is required unless your organization has custom configurations based on the old domain.</p><p>Learn more:&nbsp;<a href=\"https://techcommunity.microsoft.com/blog/viva_engage_blog/yammer-is-evolving-to-viva-engage/3738825\" target=\"_blank\">Yammer is evolving to Viva Engage | Viva Engage Blog</a></p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is changing its email sender domains from @yammer.com to @engage.mail.microsoft, starting August 2025 for U.S. tenants and completing by October 2025 globally. This update includes tenant-specific prefixes for enhanced security and requires admins to update any custom email rules or integrations referencing the old domains."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1117814",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-18T23:38:58.163Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-18T23:38:18Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage | Email sender domain migration from @yammer.com to @engage.mail.microsoft",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
