{
  "ActionRequiredByDateTime": "2025-11-17T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p></p><p><b><b>Introduction</b></b></p><p></p><p>\n</p><p>To improve the security and reliability of event email notifications in Microsoft Teams, we're updating how custom HTML templates are supported. Starting November 17, 2025, organizations using premium custom HTML templates for Teams Events must ensure their sending domain is properly set up and authenticated. This change helps reduce the risk of event emails being flagged as spam or phishing by ensuring they originate from trusted, customer-owned domains.</p>\n\n<b><b>When this will happen:</b></b><p></p><p>\n</p><p>This change will take effect on <b>November 17, 2025</b>.</p>\n\n<b><b>How this affects your organization:</b></b><p></p><p></p><ul><li><b>Who is affected:</b> <ul><li>Organizations using <b>premium custom HTML templates</b> for <b>Teams Events email notifications</b>.</li></ul></li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will no longer be able to edit or use custom HTML templates for Teams Events unless the sending domain is properly set up and verified.</li>\n    <li>Event emails must be sent from a domain authenticated within your tenant.</li>\n    <li>Microsoft will no longer send these notifications from its default external email address for these templates.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Set up and verify your organization's domain in Microsoft 365 tenant settings.</li>\n<li>Configure the domain to allow Microsoft products to send notifications from your organization’s email address.</li>\n<li>This is a <b>one-time setup</b> and must be completed before November 17, 2025.</li>\n<li>Refer to the official guidance for step-by-step instructions: <a href=\"https://learn.microsoft.com/microsoft-365/admin/email/select-domain-to-use-for-email-from-microsoft-365-products?view=o365-worldwide\">Select domain to use for email from Microsoft 365 products</a></li></ul><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p>\n<p></p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting November 17, 2025, organizations using premium custom HTML templates for Teams Events email notifications must set up and verify their sending domain in Microsoft 365. Without this, custom templates cannot be used, and event emails must originate from an authenticated, customer-owned domain."
    }
  ],
  "EndDateTime": "2025-12-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1176301",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-20T18:37:45.583Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-20T18:37:33Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Action Required – Domain Setup for Custom HTML Templates in Teams Events Email Notifications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
