{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 27, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction\n</b></p><p>To simplify management and reduce configuration friction for voice and face recognition in Microsoft Teams Rooms (MTR), we’re introducing new admin-facing settings in the Teams Pro Management Portal and directly on Teams Rooms devices (Windows and Android). These settings replace PowerShell-based configuration with a more intuitive UI, offering clearer visibility into recognition status across rooms.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?featureid=499615\" target=\"_blank\">499615</a>.</p><p></p><p><b>When this will happen\n</b></p><p>General Availability (Worldwide, GCC):<b> </b>Rollout will begin in mid-October 2025 and is expected to complete by late October 2025.</p><p></p><p><b>How this will affect your organization</b></p><p>This update enhances the experience for tenant admins who manage Intelligent Rooms by:</p><ul><li>Introducing a simplified UI in the Teams Pro Management Portal and on-device settings for managing voice and face recognition.\n</li><li>Setting voice recognition to <b>Off by default</b>, allowing admins to enable it as needed.\n</li><li>Eliminating the need for PowerShell scripts to configure recognition settings, though PowerShell will remain a supported method.</li></ul><p><i>New UI for managing voice and face recognition settings in Teams Rooms devices:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/36ab065c-0ae4-4846-b093-3f19871525ed/b4e6c9cf66d25afe460d817fd3ea46fe0554c13f.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>This feature applies to Microsoft Teams Rooms on:\n</p><ul><li><b>Windows (version 4.19 or higher)\n</b></li><li><b>Android (version 3.6 or higher)</b></li></ul><p>Note: This feature is not supported on Surface Hub or Teams displays.</p><p>Access to the Teams Pro Management Portal requires at least one Teams Rooms Pro or Teams Shared Device license.</p><p>Users must enroll on-device and provide consent to participate in voice and face recognition. Recognition data is stored locally on the device and is not uploaded to the cloud.</p><p></p><p><b>What you can do to prepare\n</b></p><p>No action is required until rollout begins. Once available:\n</p><ul><li>Review and configure the new settings in the Teams Pro Management Portal or directly on Teams Rooms devices.\n</li><li>If your organization uses voice and face recognition in Intelligent Rooms, you can now manage these settings via the new UI instead of PowerShell.</li><li>PowerShell remains available for organizations that prefer or require script-based configuration.</li><li>Enrollment is <b>completed on-device</b> and <b>requires user consent</b>.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/rooms/voice-and-face-recognition\" target=\"_blank\">Overview of voice and face enrollment | Microsoft Teams | Microsoft Learn</a></p><p></p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499615"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms will introduce a simplified UI in the Teams Pro Management Portal and on devices to manage voice and face recognition, replacing PowerShell configuration. Rollout begins mid-October 2025. Voice recognition defaults to off, requires user consent, and data stays local. Supported on Windows (v4.19+) and Android (v3.6+)."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1135396",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T14:32:27.5Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-14T22:59:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams | Manage voice and face recognition for rooms (MTR-W/MTRA) via device settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
