{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 10, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>We’re introducing new features to the Copilot Notebooks module in the following apps:</p>\n<ul>\n<li>M365 Copilot App for Desktop (Windows and macOS)</li>\n<li>M365 Copilot App for Web</li>\n<li>OneNote Win32 (Insiders/Beta ring)</li>\n</ul>\n<p>These updates make it easier for users to onboard and find value within Copilot Notebooks by improving navigation, personalization, and AI capabilities.</p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=516042\" target=\"_blank\">516042</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul><li><b>Public Preview: </b>Rollout begins mid-November 2025 and is expected to complete by mid-December.</li><li><b>General Availability (Worldwide): </b>Rollout begins early January 2026 (previously early December 2025) and is expected to complete by late mid-February 2026.</li></ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b style=\"\">Who is affected:</b></p>\n<ul>\n<li>Frontier Public users with an <b>M365 Copilot license</b>.</li>\n</ul>\n<p><b style=\"\">What will happen:</b></p>\n<ul>\n<li>Users will experience a streamlined interface with a persistent navigation pane and chat on the right for optimized notebook workflows.</li><p>Screenshot: <i>A view of the new UX, Overview Page, and Suggestions.</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5e09b531-583a-4cf4-bff2-9aa8418f02b0\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p>\n<li>Suggested Notebooks and references will provide personalized recommendations based on projects, graph context, and recent files.</li>\n<li>An automatically generated overview page will summarize the Notebook and key insights, refreshable as new references are added.</li>\n<li>Advanced AI features will expand reference types to include SharePoint folders and OneNote notebooks.</li>\n<li>Features will be <b>ON by default for Frontier Public users</b> starting November 19, 2025.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No admin action is required for rollout.</li>\n<li>Communicate these changes to helpdesk staff to prepare for user questions.</li>\n<li>Update internal documentation if you detail Copilot Notebook functionality.</li></ul><p>Learn more: <a href=\"https://support.microsoft.com/topic/get-started-with-microsoft-365-copilot-notebooks-0775e693-11c6-4d80-8aba-fcc81a737a06\" target=\"_blank\">Get started with Microsoft 365 Copilot Notebooks</a>&nbsp;(will be updated soon)</p><ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "516042"
    },
    {
      "Name": "Summary",
      "Value": "New features for Copilot Notebooks in M365 apps will roll out starting mid-November 2025, with general availability in January 2026. Updates include improved navigation, personalized suggestions, an overview page, and expanded AI references. Features will be on by default for Frontier Public users with no admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187387",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-10T21:43:59.077Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-17T23:46:37Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "New features coming to Copilot Notebooks for Frontier users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
