{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b><br>\nSecurity Operations Center (SOC) teams rely on remediation actions like <i>Move to Junk</i>, <i>Delete</i>, <i>Soft Delete</i>, and <i>Hard Delete</i> to swiftly eliminate email threats from user inboxes. However, meeting invite emails have posed an additional challenge: even after the email is removed, <i>Outlook</i> automatically creates a calendar entry during delivery, which remains active and accessible to users.</p>\n\n<p>This residual calendar entry can still contain malicious links or phishing content, creating a security gap. We’re closing that gap.</p>\n\n<p>With this update, the <i>Hard Delete</i> action will now also remove the associated calendar entry for any meeting invite email. This ensures that threats are fully eradicated—not just from the inbox, but also from the calendar—reducing the risk of user interaction with potentially harmful content. Note that calendar entries manually created by users by adding <i>.ics</i> attachments to the calendar will not be deleted.</p>\n\n<p><b>When this will happen</b></p><ul><li>\nGeneral Availability (Worldwide): Rollout will begin early September 2025 and is expected to complete by late September 2025.</li><li>General Availability (GCC, GCC High, DoD): Rollout will begin early October 2025 and is expected to complete by late October 2025.</li></ul>\n\n<p><b>How this affects your organization</b><br>\n<i>Hard Delete</i> actions will now automatically remove calendar entries created by malicious meeting invite emails. This reduces the risk of user interaction with phishing links or harmful content that may persist in calendar entries. Deleted calendar entries can only be recreated by resending the invite or manually by the user.</p>\n\n<p>This change is <b>on by default</b> and requires no configuration.</p>\n\n<p><b>What you can do to prepare</b><br>\nNo action is required. We recommend informing SOC teams and security administrators of this enhancement to ensure awareness and alignment with incident response procedures.</p>\n\n<p><b>Compliance considerations</b></p>\n<ul>\n</ul><table border=\"1\">\n<tbody><tr>\n<th>Compliance area</th>\n<th>Explanation</th>\n</tr>\n<tr>\n<td>Alters how existing customer data is processed, stored, or accessed</td>\n<td>Calendar entries created by meeting invite emails will now be automatically deleted when <i>Hard Delete</i> is applied, changing how calendar data is retained.</td>\n</tr>\n<tr>\n<td>Modifies deletion workflows</td>\n<td><i>Hard Delete</i> now includes calendar entry removal, extending its scope beyond email content.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Hard Delete now removes calendar entries from malicious meeting invites, closing a security gap by fully eradicating threats from inboxes and calendars. This update rolls out worldwide in September 2025 and GCC regions in October 2025, is on by default, and requires no user action."
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1151684",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-11T22:18:14.607Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-11T22:18:09Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Hard delete action now removes calendar entries from malicious meeting invite emails",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
