{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p>Updated August 27, 2025: We have updated the content. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re introducing a new SharePoint Web Part: Agent Link Web Part. This feature allows site owners to embed a clickable link to an agent on a SharePoint page that launches the configured agent in the sidecar experience. It’s a lightweight, flexible way to surface contextual help using AI agents directly from within your site—improving discoverability and access to AI agents where users need it most.\n</p><p><b>Where to Find It: </b>The Agent Link Web Part will appear under a new category called <i>AI</i> in the web part toolbox. Search for the name <i>Agent Link WebPart</i>.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481512\" target=\"_blank\">481512</a>.\n</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide):</b> We will begin rolling out mid-August 2025 and expect to complete by late August 2025 - Completed</p><p><b>How this affects your organization</b></p><ul><li>Flexible Placement: Add a link to any custom SharePoint agent directly on your page.\n</li><li>Contextual Assistance: Clicking the link opens the agent in the sidecar, enabling users to get help without leaving the page.\n</li><li>Enhanced Discoverability: Promotes in-context discovery of AI-powered agents, helping users engage with intelligent assistance where and when they need it.\n</li><li>License Handling: Users without access see a message indicating they don’t have access within the sidecar. As a reminder, links to agents only work for users with a Microsoft 365 Copilot license, or for users in organizations that have set up the Microsoft 365 PAYG meter.\n</li></ul><p><b>Here's how an editor adds the web part to the page:\n</b></p><p>Find the webparts in the toolbox. Under the category <i style=\"\">AI, </i>find a web part called <i style=\"\">Agent Link and Add </i>it to your page.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/d130236a-087d-4771-8e0a-5b7b22270940\" style=\"width: 400px;\" alt=\"user settings\"><br></p><p>Next, configure and link it to an agent - either search for an agent or pick one from the recently used agents. Customize the size of the link from small, medium, or large, and choose to show a title or not. \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/3815b5bc-0743-4917-bfd2-71cf26066a05\" style=\"width: 400px;\" alt=\"user settings\"><br></p><p>Then, publish your page. That's it – your web part is ready to go! Now, as a site visitor, sees the webpart on the page. When a user selects the webpart, the agent link opens in the sidecar. \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/71d71e4c-a20a-442c-b97c-7b02b0bb761a\" style=\"width: 400px;\" alt=\"user settings\"><br></p><p><b>&nbsp;What you can do to prepare</b></p><p>Site admins and content authors may want to:\n</p><ul><li>Identify pages where contextual agent support can improve user experience.\n</li><li>Plan to add the Agent Link Web Part to relevant pages post-GA.\n</li><li>Ensure referenced agents are published and accessible to your users.\n</li><li>Agents published to SharePoint are also configurable using this web part.\n</li></ul><p><i>Note: </i>This web part is currently not supported in mobile or email scenarios.</p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><b>Compliance considerations</b>\n<table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Stores new customer data</td><td>The agent interaction may generate contextual data stored temporarily in the sidecar experience.</td></tr>\n<tr><td>Alters existing customer data processing</td><td>The agent may access and process existing SharePoint content to provide contextual assistance.</td></tr>\n<tr><td>Introduces or modifies AI/ML capabilities</td><td>Introduces AI agents that interact with user data in real-time via the sidecar.</td></tr>\n<tr><td>Provides new user interaction with generative AI</td><td>Users can engage with Copilot agents directly from SharePoint pages.</td></tr>\n<tr><td>Includes admin control</td><td>Admins can manage agent publishing and access via SharePoint and Entra ID group membership.</td></tr>\n<tr><td>Allows user to enable/disable feature</td><td>Site owners can choose to add or remove the web part from pages.</td></tr>\n</tbody></table>\n\n</p><p>Additional resources:\n</p><p><a href=\"https://support.microsoft.com/office/using-web-parts-on-sharepoint-pages-336e8e92-3e2d-4298-ae01-d404bbe751e0#bkmk_availableparts\" target=\"_blank\">Using web parts on SharePoint pages - Microsoft Support</a> </p><p><a href=\"https://support.microsoft.com/office/use-the-agent-link-web-part-719ce79c-64c9-4beb-bdea-e283b5e549df\" target=\"_blank\">Use the Agent link web part - Microsoft Support</a>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481512"
    },
    {
      "Name": "Summary",
      "Value": "The new SharePoint Agent Link Web Part, available under the AI category, lets site owners embed clickable links to AI agents that open in a sidecar for contextual help. It improves discoverability, requires appropriate licenses, and is configurable by editors. It is not supported on mobile or email."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1131063",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T19:06:26.81Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-07T23:38:13Z",
  "Tags": [
    "Updated message",
    "Feature update"
  ],
  "Title": "SharePoint Agent: New Agent Link WebPart",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
