{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Purview | Information Protection: To help improve label usability and configuration, the sensitivity labeling scheme will be simplified to only consist of labels and label groupings.</p><p>This move to a dynamic architecture will make it easier to move a child label into label groups, out of label groups, and between label groups without losing referential integrity, allowing customers to better scale and reorganize their labels across their entire data estate.\n</p><p>Tenants in scope for manual migration to the new label scheme will see a message on the <i>Sensitivity labels</i> page in the Purview portal, where the tenant admin can access a simple manual migration wizard to opt in to the migration, which should complete in less than a few minutes or even seconds, depending on the label configuration.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/490e4ae4-a990-460a-a6e2-35622780e3b1\" width=\"400\" height=\"\"></p><p>\n</p><p>If you do not see this message, your tenant does not meet the criteria for manual migration (your tenant lacks applicable parent labels). This new label scheme will be rolled out to your tenant in the coming months. (and we will send a separate MC post in advance).\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=386900\" target=\"_blank\">386900</a>.</p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide): We will begin rolling out early July 2025 and expect to complete by late August 2025.</p><p>General Availability (Worldwide):&nbsp;We will communicate the plan for General Availability in a future post.</p><p><b>How this will affect your organization:</b></p><p>During migration, to ensure label scoping integrity, any applicable parent label will be converted to a child label under a new label group, and then both parent and child label will have the same display name as the original parent label. Non-applicable parent labels will automatically be converted to label groups.\n</p><p>A parent label is deemed applicable if it has a different scope from any of its children, has label actions, or is published separately from its children.\n</p><p>The manual migration wizard provides a preview of the migrated scheme so admins can better understand how their sensitivity label scheme will change after the migration.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f27dc36f-6558-4427-9865-7e02ce1e2a4e\" width=\"400\" height=\"\"></p><p>\n</p><p>After migration, admins are free to make changes to their migrated label scheme, including unpublishing applicable parent labels that were converted to children during migration.</p><p>Users will not notice any change in how labels are viewed or applied. This change will be on by default.</p><p>Example of a migrated label scheme:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/89e23e5c-513d-4045-a508-d194e5e573c9\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your tenant’s label scheme to ensure it is up to date. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Optionally, before you migrate your production tenant, consider migrating a test tenant configured with a label scheme that is representative of your production tenant, to become familiar with the migration process and the modern label scheme.</p><p>Learn more: <a href=\"https://learn.microsoft.com/en-us/purview/sensitivity-labels\" target=\"_blank\" style=\"\">Learn about sensitivity labels | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "386900"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is simplifying its sensitivity labeling scheme to consist only of labels and label groupings. This dynamic architecture will improve label usability and configuration. Manual migration will be available for applicable tenants, with a preview wizard to assist admins. The rollout begins in July 2025 and completes by August 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1111778",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-08T23:26:54.703Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-08T23:26:31Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Sensitivity label grouping modernization",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
