{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p><b>Introduction</b></p>\n<p>We’re introducing new multitasking enhancements in <i>Microsoft Fabric</i> to help users work more efficiently across complex workflows. These updates improve navigation, context awareness, and workspace management—making the experience smoother, faster, and more intuitive.</p>\n\n<p><b>When this will happen</b></p>\n<ul>\n<li>Public Preview (Worldwide): Rollout begins early September 2025 and is expected to complete by mid-September 2025.</li>\n</ul>\n\n<p><b>How this affects your organization</b></p>\n<ul>\n<li><i>Horizontal tabs for open items</i>: Users can easily switch between <i>notebooks</i>, <i>pipelines</i>, <i>reports</i>, and more, with clear labels showing name, type, and workspace indicators.</li>\n<li><i>Support for multiple open workspaces</i>: Users can open and work across multiple workspaces side-by-side. Color coding and numeric labels help distinguish items by workspace, reducing confusion.</li>\n<li><i>Object Explorer</i>: A structured view that allows users to browse and open items across all currently open workspaces without switching pages.</li>\n<li><i>Raised open item limit</i>: The previous 10-item cap has been increased, allowing users to keep more tabs open and active for uninterrupted multitasking.</li>\n</ul>\n<p>These changes apply only to the <i>Fabric</i> experience and do not affect <i>Power BI</i>.</p>\n\n<p><b>What you can do to prepare</b></p>\n<p>No action is required at this time. This message is for awareness only.</p>\n\n<p><b>Compliance considerations</b></p>\n</p><p>No compliance considerations identified, review as appropriate for your organization.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Fabric will introduce multitasking improvements in early September 2025, including horizontal tabs, multiple open workspaces with color coding, an Object Explorer, and a raised open item limit. These changes enhance workflow efficiency and apply only to Fabric, not Power BI. No action is needed now."
    }
  ],
  "EndDateTime": "2026-02-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1150677",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-09T23:18:35.66Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-09T23:18:30Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Coming soon: Multitasking improvements in Microsoft Fabric",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
