{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of our ongoing investment in a unified and modern OneNote experience, OneNote for Windows 10 will reach end of support on October 14, 2025. After this date, the app will enter read-only mode. Users will still be able to view their notes, but editing, creating, or syncing content will no longer be supported.</p><p>\nWe recommend transitioning to OneNote on Windows (OneNote for Microsoft 365) to ensure continued productivity, security, and access to the latest features.</p>\n\n<p><b>When this will happen</b></p><p>\nSupport for OneNote for Windows 10 ends on <b>October 14, 2025</b>. After this date, the app will become read-only.</p>\n\n<p><b>How this affects your organization</b></p><ul>\n<li>Users will no longer be able to edit, create, or sync notes in OneNote for Windows 10.</li>\n<li>Existing notes will remain accessible in read-only mode.</li>\n<li>Transitioning to OneNote on Windows (Microsoft 365) provides a modern, secure, and feature-rich experience that enhances collaboration and productivity.</li>\n<li>Migrating reduces IT support overhead and aligns your organization with Microsoft 365 innovations.</li>\n</ul><p></p>\n\n<p><b>What you can do to prepare</b></p><p>\nTo ensure a smooth transition:\n</p><ul>\n<li>Begin migrating users to OneNote on Windows (Microsoft 365).</li>\n<li>Use the available migration guide and script to support deployment.</li>\n<li>For help, contact Microsoft Support or use in-app support via <b>Help &gt; Support</b> in OneNote on Windows.</li>\n</ul>\n<b>Resources:</b><br>\n<ul><li>Enterprise: <a href=\"https://learn.microsoft.com/en-us/microsoft-365-apps/deploy/onenote-for-windows-10-migration-guide\">OneNote for Windows 10 Migration Guidance for Enterprise</a>.</li><li>Education:&nbsp;<a href=\"https://learn.microsoft.com/en-us/microsoft-365-apps/deploy/edu-it-admins-migration-guide?source=recommendations\">OneNote Migration Guide for Microsoft 365 Education Admins</a></li><li>Learn More:&nbsp;<a href=\"https://techcommunity.microsoft.com/blog/Microsoft365InsiderBlog/onenote-for-windows-10-support-is-ending/4445230\" target=\"_blank\">OneNote for Windows 10 Support is ending</a></li></ul><p></p>\n\n<p><b>Compliance considerations</b><br>\n</p><table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Impact</th></tr>\n<tr><td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td><td>Retention policies and deletion workflows may be impacted if users rely on OneNote for Windows 10. Admins should validate retention settings in OneNote for Microsoft 365.</td></tr>\n<tr><td>Does the change describe the features/components that have been retired or altered?</td><td>OneNote for Windows 10 is being retired and will become read-only.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Users can choose to install and use OneNote on Windows (Microsoft 365).</td></tr>\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneNote for Windows 10 will end support on October 14, 2025, becoming read-only. Users can no longer edit, create, or sync notes. Transition to OneNote on Windows (Microsoft 365) is recommended for continued productivity, security, and features, with migration guides and support available."
    }
  ],
  "EndDateTime": "2025-12-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1139479",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-21T23:59:32.59Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-21T23:59:23Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "OneNote for Windows 10 End of Support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
