{
  "ActionRequiredByDateTime": "2026-01-12T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>We’re retiring the <i>When Sending a Message</i> Group Policy in Classic Outlook for Windows to improve administrative flexibility and respond to customer feedback. This legacy policy grouped several mail-sending behaviors under one setting. Moving forward, these behaviors will be managed through individual policies, allowing for more granular control and easier configuration.</p>\n<p><b><b>When this will happen:</b></b></p><ul>\n<li>New individual Group Policies will be introduced starting <b>October 14, 2025</b>.</li>\n<li>The legacy <i>When Sending a Message</i> policy will be <b>removed on January 13, 2026</b>.</li>\n</ul>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><i><b>Who is affected: </b></i>Admins managing <b>Classic Outlook for Windows</b> using Group Policy.</li>\n<li><b style=\"\">What will happen:</b>\n  <ul>\n    <li>New individual Group Policies will be added to the Office admin templates (ADMX/ADML).</li>\n    <li>These policies will coexist with the legacy policy until January 2026.</li>\n    <li>After January 13, 2026, the legacy <i>When Sending a Message</i> policy will be removed.</li>\n    <li>Admins will need to configure the new policies individually.</li>\n    <li>No changes will occur automatically; migration is required.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Review your current use of the <i>When Sending a Message</i> Group Policy.</li>\n<li>Plan to migrate to the new individual policies before January 13, 2026.</li>\n<li>Download the updated Administrative Template files (ADMX/ADML) from the Microsoft Download Center.</li><li><a href=\"https://www.microsoft.com/en-us/download/details.aspx?id=104003\"></a>Update internal documentation and helpdesk guidance to reflect the new policy structure.</li><li>Learn more: <a href=\"https://support.microsoft.com/office/outlook-gpo-update-for-when-sending-a-message-policy-b5757666-2f4a-4aa3-8a88-a7bd035f89b1\">Outlook for “When Sending a Message” Policy</a></li>\n</ul>\n\n<b><b>Compliance considerations:</b></b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"When Sending a Message\" Group Policy in Classic Outlook for Windows will be retired by January 13, 2026. New individual policies will be introduced starting October 14, 2025, requiring admins to migrate and configure settings separately for more granular control."
    }
  ],
  "EndDateTime": "2026-02-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1164375",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-02T22:10:42.417Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-02T22:10:12Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of \"When Sending a Message\" Group Policy in Classic Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
