{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Beginning in early August 2025, we will remove the Apps section from the hamburger menu in the Microsoft 365 Copilot mobile app to align with Copilot. This will happen across Android and iOS devices.</p><p><b>When this will happen  \n</b></p><p>This change will be deployed in phases, beginning roll out in early August 2025 to iOS devices first, and Android devices soon after.  \n</p><p><b>How this affects your organization  \n</b></p><ul><li>Users will no longer see the Apps section in the hamburger menu of the Microsoft 365 Copilot app on their mobile devices. With this change, users cannot access apps ‘from your organization’ and ‘recommended for you’ through the Microsoft 365 Copilot mobile app. Users can go to the Microsoft 365 Copilot app on their desktop or web browser where the Apps section is still available in the side menu to open these apps. Users can also download dedicated mobile apps for popular Microsoft 365 apps from the Apple App Store or Google Play Store. Note: Users will still be able to open files – ie. Word, Excel, and PowerPoint files – in the Microsoft 365 Copilot mobile app like before.</li><li>The update will be delivered automatically via app store updates. There are no admin controls to retain or disable this change. \n</li><li>This change is user-impacting but does not affect app permissions or integrations. \n</li><li>No admin action is required.  \n</li></ul><p><b>What you can do to prepare  \n</b></p><p>Notify users about the upcoming change and provide guidance on alternate ways to access the apps.  \n</p><p><b>Compliance considerations  \n</b></p><p>No compliance considerations identified, review as appropriate for your organization.&nbsp;&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early August 2025, the Apps section will be removed from the Microsoft 365 Copilot mobile app's hamburger menu on iOS and Android. Users can still access apps via desktop, web, or dedicated mobile apps. The update is automatic, requires no admin action, and does not affect permissions."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129127",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-04T22:52:13.323Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-04T22:52:01Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft 365 Copilot Mobile App: Removal of Apps section",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
