{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>&nbsp;<b>Introduction</b></b></p>\n<p>Microsoft is introducing a major evolution of <b>Purview Data Security Posture Management (DSPM) </b>to help organizations strengthen data security and confidently embrace AI. The new DSPM experience unifies visibility and control across traditional data and AI-driven environments, delivering outcome-based guided workflows that turn insights into actionable steps—so teams can prioritize risks and remediate faster. It brings AI observability, enhanced posture reporting, and intelligent Security Copilot agents to automate tasks like triage and policy management. </p><p>Purview now also extends coverage beyond Microsoft data with third-party signals from partners like BigID, Cyera, OneTrust, and Varonis, giving security teams a single, streamlined view of sensitive data across clouds and platforms. Additionally, Data Risk Assessments are extended to Fabric and item-level analysis with new remediation actions like bulk disabling of overshared SharePoint links.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=532728\" target=\"_blank\">532728</a>.</p>\n\n<p><b>When this will happen:</b></p>\n<ul>\n<li><b>Public Preview (Worldwide):</b> Rollout begins early December 2025 and completes by early April 2026.</li>\n<li><b style=\"\">General Availability (Worldwide):</b> Rollout begins early April 2026 and completes by early May 2026.</li>\n</ul>\n\n<p><b>How this affects your organization:</b></p>\n<ul>\n<li><b>Who is affected:</b> Admins managing Microsoft Purview DSPM.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Customers will continue to have access to the current DSPM (classic) and DSPM for AI (classic) experiences.</li>\n<li>Existing policies and configurations remain unchanged.</li>\n<li>The new DSPM experience and its features will be available in addition to existing experiences.</li>\n<li>No default policy changes; onboarding steps from classic experiences carry over.</li>\n</ul>\n</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>No action is required from admins.</li>\n<li>For customers already onboarded to DSPM (classic) and DSPM for AI (classic), onboarding steps will automatically carry over.</li></ul><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/purview/dspm-for-ai?tabs=m365\" target=\"_blank\">Learn how Microsoft Purview Data Security Posture Management for AI provides data security and compliance protections for Copilots and other generative AI apps | Microsoft Learn</a> (will be updated before rollout)</li><li><a href=\"https://learn.microsoft.com/purview/data-security-posture-management\" target=\"_blank\">Learn about Data Security Posture Management | Microsoft Learn</a> (will be updated before rollout)</li>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\n<table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n<tbody><tr>\n<th>Compliance Area</th>\n<th>Explanation</th>\n</tr>\n<tr>\n<td>AI/ML capabilities interacting with customer data</td>\n<td>Security Copilot agents automate triage and policy management.</td>\n</tr>\n<tr>\n<td>Integration with 3rd party software</td>\n<td>Adds signals from BigID, Cyera, OneTrust, and Varonis.</td>\n</tr>\n<tr>\n<td>Admin reporting and monitoring</td>\n<td>Enhanced posture reporting and remediation actions introduced.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "532728"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is launching a new Purview Data Security Posture Management (DSPM) experience by early 2026, enhancing AI observability, posture reporting, and automation with Security Copilot. It integrates third-party data signals, extends risk assessments, and maintains existing policies without requiring admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-06-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191257",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-01T18:15:39.063Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-01T18:14:50Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "New Microsoft Purview data security posture management experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
