{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're improving the search experience in Microsoft Teams Desktop to make it easier for users to find and take action on meetings—past, present, and future—directly from the search bar.\n</p><p><b>When this will happen:</b></p><p>Targeted Release: Rolling out early June 2025, expected to complete by mid-June 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Rolling out mid-June 2025, expected to complete by late June 2025.\n</p><p><b>How this affects your organization:</b></p><p>This update enhances the Teams Desktop search experience with the following capabilities:\n</p><ul><li>Users can search for meetings by typing the meeting name or participant names in the Teams search bar.\n</li><li>From the search results, users can:\n<ul><li>Join ongoing meetings\n</li><li>View recaps of past meetings\n</li><li>RSVP to upcoming meetings\n</li><li>Access meeting chats and shared artifacts\n</li></ul></li><li>A new Meeting pill in the Auto Suggestion canvas allows users to scope searches to meetings only.\n</li><li>A dedicated Meetings tab on the search results page provides a focused view of meeting-related results.\n</li></ul><p>These features are enabled by default and require no admin configuration.\n</p><p><b>What you can do to prepare:</b></p><p>No action is required. The new meeting search experience will be available automatically to all users on Teams Desktop. Consider informing your users about the enhanced capabilities to help them take full advantage of the update.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Meeting search in Microsoft Teams Desktop is being improved to allow users to find and take action on meetings directly from the search bar. The update rolls out in June 2025 and includes features like joining ongoing meetings, viewing past meeting recaps, RSVPing to upcoming meetings, and accessing meeting-related content. No admin action is required."
    }
  ],
  "EndDateTime": "2025-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1104317",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-26T23:19:52.257Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-26T23:19:37Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Meeting Search in MS Teams Desktop",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
