{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 5, 2025: Access to emails by typing '/' in the prompt box will only be available when using Copilot Chat in Outlook. This applies to both the full app and side pane experience.</p><p>We're enhancing Microsoft 365 Copilot Chat with new capabilities that make it easier for users to include work content—such as files and emails—in their prompts. By typing ‘<b>/</b>’ in the prompt box, users can quickly search and reference relevant files or emails, streamlining prompt creation and improving Copilot responses. Additionally, some suggested prompts beneath the input box will now include relevant files or emails to help users get started quickly.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e6d7449f-abbc-4ee6-b2b3-0b9f4c2a127a/2f8c1d1ae924ab9dd9b1edf74689e47553383208.png\" style=\"width: 25%;\"><br></p><p>Note: For users without a Microsoft 365 Copilot license, Copilot Chat is still grounded only in the web. Users can also choose to include additional content in the prompt for Copilot to reason over, such as with the methods described above. Chat is not automatically grounded in the organization’s graph or the user’s personal graph - this is only available for users with a Microsoft 365 Copilot license when using Chat in Work scope.</p>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?id=500377\" target=\"_blank\">500377</a>.</p><p><b>When this will happen:</b></p>\n<ul>\n<li><b>Files:</b> Currently available (Roadmap ID 497112)</li>\n<li><b>Emails:</b> Rollout begins mid-September 2025 and completes by late September 2025 (Roadmap ID 500377).</li>\n</ul>\n\n<p><b>How this affects your organization:</b></p>\n<p>This update improves usability and prompt relevance in Copilot Chat by allowing users to reference files and emails in their prompts (without uploading them manually) or as part of suggested prompts under the input box. Users will only see content they have access to, based on interaction signals (such as accessed, modified, or shared) and properties (such as creation or last update date).</p>\n<p>No changes to default settings or user permissions are required.</p>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n</ul><p>No admin action is required. You may want to inform your users about the new reference capabilities.</p><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/en-us/topic/using-context-iq-to-refer-to-specific-files-people-and-more-in-microsoft-365-copilot-and-copilot-chat-272ac2c1-c5f7-49c9-8a42-2a8a87846fa0\" target=\"_blank\">Using Context IQ to refer to specific files, people, and more in Microsoft 365 Copilot and Copilot Chat</a></p><p><b>Compliance considerations</b></p><p></p><table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n<tbody><tr><th>Consideration</th><th>Explanation</th></tr>\n<tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Yes, users can now access specific data types (files, emails) they have permission to view directly from Copilot Chat by typing '/' in the prompt box.</td></tr>\n<tr><td><a href=\"https://support.microsoft.com/en-us/topic/using-context-iq-to-refer-to-specific-files-people-and-more-in-microsoft-365-copilot-272ac2c1-c5f7-49c9-8a42-2a8a87846fa0\"></a>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes, users can now more easily include specific data types (files, emails) in their prompts, improving grounding and relevance of Copilot responses.</td></tr>\n</tbody></table>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "500377"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat now lets users include files and emails in prompts by typing '/' in Outlook, enhancing prompt relevance and usability. Email access rolls out mid to late September 2025. No admin action is needed; users see only content they have permission to access."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-11-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1139489",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-05T19:03:59.41Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-22T00:06:34Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Chat: New ways to include files and emails in prompts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
