{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting early August, the bottom tab navigation in the Microsoft 365 Copilot mobile app will be removed and Copilot Chat will become the default experience for those who have access and have Copilot Chat pinned. Users will be able to navigate to other app experiences such as Search and Create using the universal hamburger menu. This makes it easier to stay productive and get things done using Copilot Chat while also simplifying the experience by removing multiple ways to navigate the app.  For users who do not have access to Copilot Chat or do not have it pinned, their last used experience would be the default.</p><p><b>When this will happen</b></p><p>These changes will begin rolling out in the Microsoft 365 Copilot app for iOS devices starting early August. Updates to the Android app will follow soon.</p><p><b>How this affects your organization</b></p><p>With these updates, users will notice the following changes in the Microsoft 365 Copilot mobile app:</p><ul><li>The bottom tab navigation will be removed for all users. To access other app features such as Search, Chat, Create, and Notebooks, users can simply open the hamburger menu at the top left corner of the mobile app and select the desired tab. This update helps keep the mobile app home screen uncluttered and ensures that all key app experiences are easily discoverable through the hamburger menu.</li><li>Chat will become the default experience in the mobile app for users that have access to Copilot Chat and have it pinned. Other users will land on their last used experience or Search if new to the app.</li><li>For users with access to Copilot Chat and have it pinned, Chat history (‘Conversations’) in the hamburger menu will be expanded by default to make it more discoverable so users can find previous conversations faster. Users can collapse chat history manually if desired.</li></ul><p>Admins can <a href=\"https://learn.microsoft.com/copilot/microsoft-365/pin-copilot-chat-navbar\" target=\"_blank\">manage pinning settings</a> for Copilot Chat to optimize user experience.</p><p><b>What you can do to prepare</b></p><p>Prepare support teams for potential increase in helpdesk queries due to UI changes. No other action required.</p><p><b>Compliance Considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early August, Microsoft 365 Copilot mobile app will remove bottom tab navigation, making Copilot Chat the default for users with access and pinning. Other features move to the hamburger menu. Chat history will be expanded by default. iOS updates begin in August, Android follows. Admins can manage pinning settings."
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129128",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-04T22:52:37.437Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-04T22:52:31Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot Mobile App: Bottom tabs removal and default land to Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
