{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 6, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>We’re introducing a new <b>opt-in feature</b> for <b>automatic event-auditing configuration</b> in <b>Microsoft Defender for Identity unified sensors (v3.x)</b>. This enhancement simplifies deployment by automatically applying the required <b>Windows event-auditing settings</b> on sensors, reducing manual post-deployment steps and ensuring consistent policy enforcement across all onboarded sensors.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li>General Availability (Worldwide, GCC, GCCH, and DoD): The auditing opt-in feature will be available starting mid-January 2026 (previously early January), with rollout expected to complete by end of January 2026 (previously mid-January). Until then, it will remain disabled in the portal.</li>\n<li>Related <b>auditing health alerts</b> will also roll out gradually starting mid-January 2026 (previously early January), completing by end of January 2026 (previously mid-January).</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b> Admins managing <b>Defender for Identity unified sensors (v3.x)</b> in Microsoft 365 tenants.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>A new <b>opt-in setting</b> will be available in both the <b>UI</b> and via <b>Graph API</b>.</li>\n<li>In the UI, this option will appear under <b>Defender for Identity Settings → Advanced features</b>.</li>\n<li>Once enabled, the automatic configuration feature will:\n<ul>\n<li>For <b>new sensor activations</b>: Automatically apply all required <b>Windows event-auditing settings</b> during activation.</li>\n<li>For <b>existing onboarded sensors</b>: Automatically apply <b>Windows event-auditing settings</b> only if misconfigured and dismiss related health issues.</li>\n</ul></li>\n<li>After enabling the toggle, the automatic configuration process may take up to 24 hours to apply across all applicable <b>Identity Unified sensors (v3.x)</b>.</li>\n<li>This feature is not enabled by default and requires admin action. No changes will occur unless admins choose to enable the feature.</li>\n</ul>\n<p><b>Relevant auditing configurations health issues covered:</b></p>\n<ul>\n<li><b>NTLM auditing</b> is not enabled</li>\n<li><b>Directory Services Advanced Auditing</b> is not enabled as required</li>\n<li><b>Directory Services Object Auditing</b> is not enabled as required</li>\n<li><b>Auditing on the Configuration container</b> is not enabled as required</li>\n<li><b>Auditing on the ADFS container</b> is not enabled as required</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<p>No action is required unless you choose to enable the feature.</p>\n<p>If you plan to opt in:</p>\n<ul>\n<li>Review your unified sensor deployment strategy.</li>\n<li>Enable the opt-in setting via the <b>UI</b> or <b>Graph API</b>.</li>\n<li>Communicate the change to relevant IT and security teams.</li>\n<li>Update internal documentation if you track auditing configurations.</li>\n</ul><p>Learn more: </p><ul><li><a href=\"https://learn.microsoft.com/defender-for-identity/health-alerts\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Auditing health alerts documentation</a></li><li><a href=\"https://learn.microsoft.com/defender-for-identity/deploy/prerequisites-sensor-version-3#configure-windows-event-auditing\" target=\"_blank\">Configure Windows event auditing</a>\n</li><li><a href=\"https://learn.microsoft.com/defender-for-identity/deploy/configure-windows-event-collection\" target=\"_blank\">Configure audit policies for Windows event logs</a></li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity unified sensors (v3.x) will offer an opt-in feature from mid-January 2026 to automatically configure Windows event-auditing settings, simplifying deployment and ensuring consistent policy enforcement. Admins must enable it via UI or Graph API; rollout completes by end of January 2026."
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1193410",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-06T17:31:48.727Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-09T00:13:56Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Automatic Windows event auditing configuration availability for unified sensors (V3.x)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
