{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're updating how Microsoft Edge handles external links for enterprise users. Before this rollout, Edge opens external links using the last used profile. After this rollout, for users signed in with Microsoft Entra ID, Edge will default to the Primary work profile to open links. The Primary profile is typically the most secure and appropriate profile for work-related content. This change will be on by default.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=494835\" target=\"_blank\">494835</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late June 2025 and expect to complete by mid-July 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This change affects the user experience for how external links are opened in Microsoft Edge:\n</p><ul><li>Windows users: The Primary work profile is the one signed in with the Entra ID account used to join the device. If this profile exists, Edge will use it by default for external links.\n</li><li>macOS and Linux users: If only one work profile signed in with an Entra ID account is detected, it will be used as the Primary work profile. If multiple Entra ID profiles are present, the setting will not apply.</li></ul><p>Admins can manage this behavior using the <code>EdgeOpenExternalLinksWithPrimaryWorkProfileEnabled</code> policy:\n</p><ul><li>Enabled or Not Configured: Edge will use the Primary work profile by default.\n</li><li>Disabled: Edge reverts to using the last used profile.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-browser-policies/edgeopenexternallinkswithprimaryworkprofileenabled\" target=\"_blank\">Microsoft Edge Browser Policy Documentation EdgeOpenExternalLinksWithPrimaryWorkProfileEnabled | Microsoft Learn</a> </p><p><i>Before this rollout:</i></p><p>Users see <i>Last used (default)</i>&nbsp;selected by default in Edge <i>Settings </i>at <a href=\"edge://settings/profiles/multiProfileSettings\" target=\"_blank\">edge://settings/profiles/multiProfileSettings</a>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fc61eb35-247b-4662-9493-c602d1ae899b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>After this rollout:</i></p><p>Users will see <i>(default) Work</i>&nbsp;selected by default in Edge <i>Settings </i>at <a href=\"edge://settings/profiles/multiProfileSettings\" target=\"_blank\">edge://settings/profiles/multiProfileSettings</a></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5fc9a3ac-f986-4dc0-9d28-a0602fc6472f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494835"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Edge will default to opening external links with the Primary work profile for users signed in with Microsoft Entra ID, starting late June 2025. This change affects Windows, macOS, and Linux users differently and can be managed with the `EdgeOpenExternalLinksWithPrimaryWorkProfileEnabled` policy. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1104313",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-26T23:17:48.963Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-26T23:17:40Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge: Primary work profile will open external links by default",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
