{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>\nWe’re introducing support for manual uploads of historical HR data in Organizational Data in Microsoft 365. Admins can now specify whether uploaded data is current or historical using a new toggle in the CSV upload experience. For historical data, an effective date can be assigned to ensure accurate processing by downstream apps such as Viva Insights. This enhancement improves data consistency across Microsoft 365 and supports retroactive updates for organizational reporting.</p><p><i>Figure i. Historical upload in Organizational Data in Microsoft 365</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/31925bcb-3cb3-4b44-a75e-d409cbdef935\" style=\"width: 400px;\" alt=\"user settings\"><b><br></b></p><p><b>When this will happen</b></p><p>\nGeneral Availability (Worldwide): Rollout will begin in late September 2025 and is expected to complete by late October 2025.</p>\n\n<p><b>How this affects your organization</b></p><p>\nOrganizations using Organizational Data to manage HR information will gain greater flexibility and control over user record updates. Historical uploads allow you to:\n</p><ul>\n<li>Correct past data errors</li>\n<li>Build comprehensive user histories</li>\n<li>Align data ingestion with behavioral processing timelines in Viva Insights</li>\n</ul><i>\nNote</i>: Historical data uploads are supported only via manual CSV uploads. Automated connectors will continue to support current data only. This feature is off by default and requires admin action to use.<p></p>\n\n<p><b>What you can do to prepare</b></p><p>\nYou can begin preparing by:\n</p><ul>\n<li>Reviewing internal HR data sources for historical records</li>\n<li>Preparing CSV files with accurate effective dates for upload</li>\n<li>Understanding how MODIS and Viva Insights process backdated attributes</li>\n</ul><b>Compliance considerations</b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 now supports manual uploads of historical HR data in Organizational Data with an effective date toggle for accurate processing. This feature, rolling out late September to October 2025, enables correcting past errors and building user histories but requires admin activation and manual CSV uploads only."
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162297",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-29T23:16:49.953Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T23:16:38Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New support for historical data uploads in Organizational Data in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
