{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>To streamline the user experience and reduce redundancy, we are retiring the <i>Refresh all on page</i> button from the Meeting Details pane in OneNote for Windows. Users will still be able to insert updated meeting information by selecting the meeting again from the right pane. This change aligns with our efforts to simplify the interface and reduce confusion around meeting updates.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>We will begin retiring the <i>Refresh all on page</i> button starting <b>November 15, 2025</b>, and expect to complete the rollout by <b>December 15, 2025</b>.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/66f3343b-56a0-4f62-95e5-65e1a4807d0c\" style=\"width: 383.987px;\" alt=\"user settings\"></p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> Users of OneNote for Windows who utilize the Meeting Details pane.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>The <i>Refresh all on page</i> button in the Meeting Details pane will be removed.</li>\n    <li>Users will no longer be able to refresh meeting details using this button.</li>\n    <li>To insert updated meeting information, users can click the meeting again in the right pane.</li>\n    <li>This change will roll out gradually to Insiders and Production customers starting mid-November 2025.</li>\n    <li>The change will happen automatically; no admin action is required.</li>\n  </ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Notify your users about the upcoming change and the new method for updating meeting details.</li>\n<li>Update internal documentation or training materials that reference the <i>Refresh all on page</i> button.</li>\n<li>Share this workaround with users:<p></p>\n<i>To update meeting details, click the meeting again in the right pane to insert the latest information.</i></li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Refresh all on page\" button in OneNote's Meeting Details pane will be retired between November 15 and December 15, 2025. Users can update meeting info by selecting the meeting again from the right pane. No admin action is needed; notify users and update documentation accordingly."
    }
  ],
  "EndDateTime": "2026-01-14T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1171847",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-13T23:26:14.72Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-13T23:26:01Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retiring the “Refresh all on page” button in OneNote Meeting Details pane by end of 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
