{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Starting in October 2025, Microsoft will begin automatically installing the Microsoft 365 Copilot app on Windows devices that have Microsoft 365 desktop client apps. This app provides a centralized entry point for accessing Copilot experiences and AI-powered capabilities across Microsoft 365. This change simplifies access to Copilot and ensures users can easily discover and engage with productivity-enhancing features.</p><p><b>When this will happen</b></p><p>Rollout begins in early October 2025 and completes mid-November 2025</p><p><b>How this affects your organization</b></p><p><b>Who is affected:</b></p><ul><li>Organizations with Windows devices running Microsoft 365 desktop client apps</li><li>Customers outside the European Economic Area (EEA) (EEA customers are excluded)</li><li>Admins responsible for managing Microsoft 365 Apps deployments</li><li>Users on eligible devices who will see the Microsoft 365 Copilot app appear in their <i>Start menu</i></li></ul><p><b>What will happen:</b></p><ul><li>The Microsoft 365 Copilot app will be <b>automatically installed</b> on Windows devices that have Microsoft 365 desktop apps, unless administrators opt out.</li><li>The app will appear in the <i>Start menu</i> as a new entry point for accessing Copilot experiences across Microsoft 365.</li><li>On devices where the app is already installed, no visible change will occur.</li><li>The app installation is <b>enabled by default</b> and does not require user interaction.</li><li>This change does not apply to customers in the European Economic Area (EEA).</li></ul><p><b>What you can do to prepare</b></p><p><b>Admin Actions</b></p><ul><li>Review the <a href=\"https://go.microsoft.com/fwlink/?linkid=2327914\" target=\"_blank\">documentation</a>&nbsp;for more details and instructions on how to manage this.</li><li>You can opt out of the installation in the Microsoft 365 Apps Admin Center.&nbsp;</li><li>Consider notifying helpdesk and users to reduce confusion and support requests.</li><li>Update internal documentation if you reference installed apps or Copilot access points.</li></ul><p><b>User Impact</b></p><ul><li>Users may see a new app icon for Microsoft 365 Copilot in the <i>Start menu.</i></li><li>On many devices, the app may already be installed, resulting in no visible change</li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 2025, Microsoft will automatically install the Microsoft 365 Copilot app on Windows devices with Microsoft 365 desktop apps, except in the EEA. The app appears in the Start menu, enabled by default, with admins able to opt out and prepare users accordingly."
    }
  ],
  "EndDateTime": "2025-12-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1152323",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-12T23:11:52.947Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-12T23:10:52Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Apps installation on devices with Microsoft 365 Apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
