{
  "ActionRequiredByDateTime": "2025-08-14T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re updating the data retention policy for access reviews in Microsoft Entra ID Governance to improve performance and align with data minimization principles. Starting August 15, 2025, only access review data from the last 12 months will be available via the user interface and APIs.\n</p><p><b>How this affects your organization:</b></p><p>Access review data older than 12 months will no longer be accessible through the Microsoft Entra portal or APIs. The <i>Review history</i> report will also be limited to the past 12 months. This change is on by default and does not affect audit logs. There are no admin controls for this change.</p><p>You are receiving this message because our telemetry indicates your organization may be using access reviews and relying on historical data exports beyond the new retention window. \n</p><p><b>What you need to do to prepare:</b></p><p>To avoid data loss, we recommend the following actions before August 15, 2025:</p><ul><li>Export all historical review data using Microsoft Graph APIs before August 15, 2025. \n</li><li>To transfer historical data for compliance or audit purposes, use the script in the section called <i>Example: Various queries that use access reviews</i> in <a href=\"https://learn.microsoft.com/entra/id-governance/custom-entitlement-report-with-adx-and-entra-id#example-various-queries-that-use-access-reviews\" target=\"_blank\">Create Custom Reports Using Microsoft Entra and Application Data - Microsoft Entra ID Governance | Microsoft Learn</a>.</li><li>Establish a routine for generating and securely storing review reports annually to ensure uninterrupted access to necessary data.</li><li>Notify relevant admins and update internal documentation.</li></ul><p>We’re committed to supporting your transition and ensuring continuity in your governance processes.\n</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed (e.g. documents, emails, chats, etc.)? Yes, data will be stored for only 1 year and not more than that</li><li>Does the change alter how admins can monitor, report on, or demonstrate compliance activities e.g. Purview or admin reporting? Yes. Before this rollout, APIs provide data for longer than 12 months. After this rollout, customers can only pull the data for the last 12 months.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra ID is updating its data retention policy for access reviews. Starting August 15, 2025, only the last 12 months of access review data will be available via the user interface and APIs. Organizations should export historical data before this date and establish a routine for annual data storage."
    }
  ],
  "EndDateTime": "2025-07-23T23:53:07Z",
  "HasAttachments": false,
  "Id": "MC1101895",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-23T23:54:18.573Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-23T23:53:07Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Entra ID access reviews: Updated historical data retention policy for access reviews",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
