{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 17, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>To strengthen security when Microsoft Purview interacts with Microsoft 365 services (Exchange, SharePoint, OneDrive, and Teams), we’re updating how roles are managed in Microsoft Purview. Certain admin roles in Purview will now be mapped to three newly created roles in Microsoft Entra. Role assignments will be synchronized between Purview roles and Entra roles without any customer action. This ensures that user permissions and identity flow securely from Purview to Microsoft 365. M365 services will only allow high-privileged operations like search/export to Purview users with the correct level of permissions in Entra, further protecting customer data.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li>General Availability (Worldwide): Rollout begins mid-February 2026, finishes by late March 2026.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b> All customers with admins assigned to high-privileged roles in Purview that access Microsoft 365 data. These admins will have their assignments synced to Entra, meaning they will be assigned membership to mapped Entra roles.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>New roles will be created in Entra to map to Purview roles listed below.</li>\n<li>Existing role assignments will sync automatically.</li>\n<li>New assignments will sync from Purview to Entra within 15 minutes.</li>\n<li>If an admin has multiple Purview roles, they will receive the highest privilege Entra role: Administrator &gt; Writer &gt; Reader.</li>\n<li>Customers may see new Purview-specific Entra roles in audit logs.</li>\n<li>Do not assign to these roles directly in Entra; Purview manages them.</li>\n</ul>\n\n<p><b>Role Mapping Table:</b></p>\n<table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n<tbody><tr><th>Purview Role(s)</th><th>Mapped Entra Role</th></tr>\n<tr><td><p>Insider Risk Management Analysis<br>Insider Risk Management Investigation<br>Compliance Search<br>Export<br>Privacy Management Admin<br>Privacy Management Analysis<br>Privacy Management Investigation<br>Privacy Management Permanent Contribution<br>Privacy Management Temporary Contribution<br>Privacy Management Viewer<br>Data Security Investigation Reviewer</p></td><td>Purview Workload Content Reader</td></tr>\n<tr><td>Hold<br>Privacy Management Investigation<br>Data Security Investigation Investigator</td><td>Purview Workload Content Writer</td></tr>\n<tr><td>Search and Purge<br>Data Security Investigation Admin<br>Data Security Investigation Analyst (New Role)</td><td>Purview Workload Content Administrator</td></tr>\n</tbody></table>\n\n<p><b>Example:</b> If you have both Export and Search and Purge roles, you’ll get the Purview Workload Content Administrator role in Entra.</p>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required.</li>\n<li>Be aware that new Purview-specific Entra roles may appear in audit logs.</li>\n<li>Do not manually assign these roles in Entra; Purview will overwrite changes.</li>\n<li>For more details, review <a href=\"https://learn.microsoft.com/microsoft-365/compliance/\" target=\"_blank\">Microsoft Purview documentation</a>.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is updating role management by mapping certain Purview admin roles to new Microsoft Entra roles, synchronizing assignments automatically from mid-February to late March 2026. No customer action is needed, but new Entra roles will appear in audit logs and should not be assigned manually."
    }
  ],
  "EndDateTime": "2026-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1199765",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-18T19:21:52.207Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-18T23:40:22Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Role management update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
