{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Based on your feedback, we’re simplifying how users access Copilot Chat on the web by consolidating entry points.&nbsp;</p><p>Today, users without chat pinned in the Microsoft 365 Copilot app access Copilot Chat in a standalone experience on copilot.cloud.microsoft, while users with chat pinned access Copilot Chat on m365.cloud.microsoft.\n</p><p>To simplify and improve the Microsoft 365 Copilot Chat experience, we’re consolidating the chat functionality into the Microsoft 365 Copilot app. Having two separate entry points has created customer confusion and extra effort for our customers. By unifying the experience, we’re making it easier to access the full value of Copilot in one place.</p><p>Below is the new experience on m365.cloud.microsoft for users without chat pinned in the Microsoft 365 Copilot app who visit Microsoft 365 Copilot app via a direct chat link (m365.cloud.microsoft/chat). Users with pinning disabled will continue to see chat unpinned by default on m365.cloud.microsoft, on mobile, and on desktop. Users who continue to navigate to copilot.cloud.microsoft will automatically be redirected to the below chat experience on m365.cloud.microsoft/chat.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/629b644a-e18c-4971-aa90-e0ae9b7ca627\" width=\"400\" height=\"\"></p><p>If users come to chat via a direct link (m365.cloud.microsoft/chat) they will see chat in a transient state in their navigation. If a user navigates away from chat, it will disappear from the navigation unless the user chooses to pin it.&nbsp;</p><p>\n&nbsp;Below is the default experience on m365.cloud.microsoft for users with chat pinned in the Microsoft 365 Copilot app. No change to the end users’ experience.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/76f24c75-9eab-461a-9558-f8221ccef315/658f00666b83a6d5f1204b3dc9125ad653435af9.png\" width=\"400\" height=\"\"></p><p>There is no change for users with a Microsoft 365 Copilot license and no change for users whose access to Copilot has been blocked in Integrated Apps.\n</p><p>Users with bookmarks or favorites saved to copilot.cloud.microsoft will be redirected to m365.cloud.microsoft/chat automatically.\n</p><p><b>How this will affect your organization:\n</b></p><ul><li>Users who previously landed on copilot.cloud.microsoft for chat access will now be automatically directed to m365.cloud.microsoft/chat for chat access. \n</li><li>There is no change for users who do not have access to Copilot. \n</li><li>There is no change for users who already access Copilot Chat via the Microsoft 365 Copilot app.</li></ul><p><b>When this will happen: </b></p><p>The rollout begins with 301 traffic redirections in mid-September. The copilot.cloud.microsoft will be deprecated at the end of September. Users with bookmarks or favorites saved to copilot.cloud.microsoft or who navigate directly to copilot.cloud.microsoft will be redirected to m365.cloud.microsoft/chat automatically going forward.</p><p><b>What you need to do to prepare: </b></p><p>No admin action is required. If you would like to inform users of this update, you could consider the following message:</p><p>“Copilot Chat is now available in the <a href=\"https://m365.cloud.microsoft/chat/\" target=\"_blank\">Microsoft 365 Copilot app</a>. This change simplifies access and ensures a consistent experience across Microsoft 365 Copilot app web entry points.” \n</p><p>To learn more about your options for managing Microsoft 365 Copilot Chat, see <a href=\"https://learn.microsoft.com/en-us/copilot/manage\" target=\"_blank\">Manage Microsoft 365 Copilot Chat | Microsoft Learn.</a></p><p><b>Compliance considerations:\n</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? No.\n</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data? No.\n</li><li>Does the change provide a new way of communicating between users, tenants, or subscriptions? No.\n</li><li>Does the change provide end users any new way of interacting with generative AI? No – it improves access to existing capabilities\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat web access is being simplified by consolidating entry points from copilot.cloud.microsoft to m365.cloud.microsoft/chat, reducing user confusion. The change starts mid-September with automatic redirection, requires no admin action, and does not affect data processing or AI capabilities."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129706",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-06T19:53:44.487Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-05T22:44:05Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Simplifying Microsoft 365 Copilot app web experiences",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
