{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting in September 2025, Microsoft Authenticator on iOS will offer a more seamless and secure backup and restore experience using iCloud and iCloud Keychain. This update eliminates the need for a Microsoft personal account to back up account names and third-party TOTP (Time-based One-Time Password) credentials, simplifying setup on new devices.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out in September 2025 and expect to complete by early October 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><ul><li>Users with iCloud and iCloud Keychain enabled will automatically benefit from this enhanced backup experience.\n</li><li>Account names for all accounts in the Authenticator app—including work or school accounts, Microsoft personal accounts, and non-Microsoft accounts (such as Amazon, Google)—will be securely backed up using iCloud and iCloud Keychain.\n</li><li>The existing in-app backup feature that requires a Microsoft personal account will be removed.\n</li><li>Only account names and third-party TOTP credentials will be backed up. No other credentials are included.\n</li><li>Users can disable backup at any time via iCloud settings on their device.\n</li><li>When setting up a new iOS device, users will see their account names automatically appear in the Authenticator app and can sign in to complete setup—without needing a Microsoft account. This experience requires iOS version 16.0 or later.</li></ul><p>A new in-app banner notifies users about the upcoming changes to Microsoft Authenticator’s backup experience on iOS:</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/686c6c92-62d6-4f90-91ee-b5306c778164/971be16f4246f5fdf3247c7a225b0dba65d42e56.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Settings message alerting users to upcoming backup changes:</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/c626f7a1-2b36-4167-9601-b28e2e7dfb27/24a9438eb2ba1cfe92944e977d84abbdc2a95e89.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Updated settings screen with backup option no longer shown:</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/6e5e75a5-0bbf-441c-a80f-1093eac0cf0c/979764e1315f31d2c0799b395dec92010a7bbe71.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/account-billing/back-up-account-credentials-in-microsoft-authenticator-bb939936-7a8d-4e88-bc43-49bc1a700a40\" target=\"_blank\">Back up account credentials in Microsoft Authenticator</a></p><p><b>Compliance considerations:</b></p><ul><li>Does the change store new customer data? - No.&nbsp;</li><li>Does the change alter how existing customer data is processed, stored, or accessed? - Yes. Backup is now handled via Only iCloud and iCloud Keychain instead of iCloud and Microsoft account.</li><li>Does the change modify how users can access, export, delete, or correct their personal data? - Yes. Users now manage backup data through iCloud settings without needing a Microsoft account.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting September 2025, Microsoft Authenticator on iOS will use iCloud and iCloud Keychain for backup and restore, eliminating the need for a Microsoft personal account. This update simplifies setup on new devices, with automatic backup of account names and third-party TOTP credentials. No admin action is required."
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1111780",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-08T23:30:00.65Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-08T23:29:36Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Improved backup and restore experience for Microsoft Authenticator on iOS",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
