{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re introducing the <b>Restart Event feature</b> in <i>Microsoft Teams Events</i> to improve resiliency for live events. This feature lets organizers restart a live event that encounters an unrecoverable failure, minimizing disruption and ensuring continuity for Town Halls and other large meetings.&nbsp;&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=523214\" target=\"_blank\">523214</a>.&nbsp;&nbsp;</p><p><b><b>When this will happen</b></b></p><ul><li><b>General Availability (Worldwide): </b>We will begin rolling out in <b>early January 2026 </b>and expect to complete by<b> late January 2026</b>.</li><li><b>General Availability (GCC and GCCH):</b> We will begin rolling out in<b> late&nbsp;January 2026</b> and expect to complete by <b>early February 2026</b>.</li><li><b>General Availability (DoD): </b>We will begin rolling out in <b>early February 2026</b> and expect to complete by <b>early February 2026</b>.</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected: </i>Organizers and admins managing Microsoft Teams live events.&nbsp;&nbsp;</p><p><i>What will happen:</i>&nbsp;&nbsp;</p><ul><li>Organizers will see a new <i><b>Restart Event</b></i> button in the<i> Teams UI for live events</i>.&nbsp;&nbsp;</li><li>The feature is <b>enabled by defaul</b>t; no admin configuration is required.&nbsp;&nbsp;</li><li>Attendees may experience a brief interruption while the event restarts but can rejoin seamlessly.&nbsp;&nbsp;</li><li>No impact on existing policies or tenant-level settings.&nbsp;&nbsp;</li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>Communicate this new capability to event organizers and support teams.&nbsp;&nbsp;</li><li>Update internal training and documentation for large event management.&nbsp;&nbsp;</li><li>No policy or tenant-level changes are needed.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "523214"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce a Restart Event feature for live events with unrecoverable failures, rolling out worldwide from January to February 2026. Organizers can restart events to minimize disruption, with no admin setup needed. Attendees may face brief interruptions but can rejoin seamlessly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-03-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1194079",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-10T23:56:53.063Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-10T23:56:43Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Restart Event feature for Town Hall with unrecoverable failures",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
