{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 2, 2025: We have updated the content. Thank you for your patience.&nbsp;<br><br><b><b>Introduction</b></b></p>\n<p>We’re introducing a new flexible layout option in future Teams meetings to give users more control over how shared content and participant videos appear. A resizable divider will let users adjust the space between shared content and the video gallery. Want to focus more on the presentation? Expand the content area. Prefer to see more people? Shrink the content area to make room for more video tiles. Users can also swap the position of content and participants to suit their viewing preference. This works with spotlighted speakers, pinned videos, and Speaker View, providing a more personalized meeting experience—especially helpful on larger or ultra-wide screens.<br><br>Screenshot 1: <i>When someone is sharing content or when you are in Speaker view, grab the divider between the left and right views to resize them.</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/5ad8177d-b16a-4b53-a524-4b1d16a38e10/35dcf036667dbaf9af73409969cd593f5b7c799e.png\" style=\"width: 200px;\" alt=\"user settings\"></p><p>Screenshot 2. <i>When you drag the divider to the left, you will see more people in the right gallery view. When you drag the divider to the right, you will see less people in the gallery but the content or speaker will become larger.</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/24405469-1ed5-4393-86d8-a09dbd20d9b2/695bb6807c04f2e4f397331d2cff3a342cb65300.png\" style=\"width: 200px;\" alt=\"user settings\"></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=528930\" target=\"_blank\">528930</a>&nbsp;and applies to Teams for Windows desktop and Teams for Mac desktop.</p>\n\n<p><b>When this will happen:</b></p><ul>\n<li>Targeted Release: Rolling out early January 2026, expected completion by late January 2026.</li>\n<li>General Availability (Worldwide and GCC): Rolling out early February 2026, expected completion by late March 2026.</li>\n</ul>\n\n<p><b>How this will affect your organization:</b></p>\n<p><b style=\"\">Who is affected:</b> All Teams users in Worldwide and GCC environments.</p>\n<p><b style=\"\">What will happen:</b></p>\n<ul>\n<li>Users will see a new resizable divider in Teams meetings during content sharing.</li>\n<li>Users can adjust layouts to prioritize content or participant video tiles.</li>\n<li>Users can swap positions of shared content and video gallery.</li>\n<li>Works with spotlighted speakers, pinned videos, and Speaker View.</li>\n<li>Enabled by default; no admin configuration required.</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>No configuration is required; the feature is enabled by default.</li>\n<li>Update training materials and FAQs to explain:\n<ul>\n<li>How to find and use the resizable divider.</li>\n<li>How to adjust layouts during content sharing and Speaker View.</li>\n</ul>\n</li>\n<li>Communicate this change to helpdesk staff to prepare for user questions, especially from those with large or ultra-wide monitors.</li>\n</ul><p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "528930"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"528930\":[{\"RoadmapId\":528930,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-11-27T13:29:07.6642662Z\",\"LatestRing\":null},{\"RoadmapId\":528930,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-11-27T13:29:07.6642664Z\",\"LatestRing\":null},{\"RoadmapId\":528930,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-11-27T13:29:07.6642665Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Teams meetings will feature a new resizable divider allowing users to adjust the space between shared content and participant videos, swap their positions, and personalize layouts. This feature, enabled by default, rolls out from January to March 2026 for all Windows and Mac desktop users worldwide and GCC."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1190199",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-02T19:23:26.507Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-26T23:22:09Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Flexible layout for Teams meetings with resizable divider",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
