{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to view the performance of AI agents from the Agent Insights dashboard in Dynamics 365 Contact Center and Customer Service. The Agent Insights dashboard equips Supervisors with real-time visibility into key performance indicators and operational trends regarding their AI agents, enabling confident, data-driven decision-making throughout their autonomous transformation journey. This feature will reach general availability on November 14, 2025.<br><br><b>How does this affect me?</b><br>The Agent Insights dashboard will include the following key functionalities:<ul><li>A holistic view into program performance across case and conversations through a seamless pivot experience</li><li>Key performance indicators monitoring active conversations and cases and completed engagements with performance breakdowns across autonomous, AI-assisted, and representative led engagements</li><li>The ability to set goals across the top KPIs to provide targets for your operational teams to meet</li><li>Insights into AI agent performance with quick links to deeper dive analytics</li><li>Funnel view to help visually digest where customers are falling out of the autonomous journey</li><li>Volume breakdown by intent group showcasing top volume intents and areas of opportunity to drive automation</li></ul><b>What action do I need to take?</b><br>To take advantage of this new feature, admin will have to enable it by navigating to Copilot Service admin center and then the Insights page where you can enable Agent Insights. This is where you can also specify the goals you would like to achieve.<br><br>If you would like more information on this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/ADO12673\">View Agent insights dashboard</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-12-06T17:09:00Z",
  "HasAttachments": false,
  "Id": "MC1171742",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-13T17:11:04.293Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-13T17:09:55Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Agent Insights Empowering AI Supervisors on their Autonomous Transformation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
