{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 28, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>We’re introducing new<b> Word, Excel, and PowerPoint agents in Microsoft 365 Copilot</b> to help users create documents, workbooks, and presentations more efficiently in Copilot Chat within the <b>Frontier program</b>. These agents assist with creating documents, workbooks, and presentations by using web and enterprise grounding. Each agent supports multi-turn chat, enabling user to refine content through an interactive back-and-forth conversation.</p><p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>General Availability:</b>&nbsp;We will begin rolling out on February 5, 2026 (previously January 29).</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p><p>If your organization is part of the Frontier program and has enabled Anthropic usage in your tenant, users will be able to access Word, Excel, and PowerPoint agents via the <b>navigation pane</b> in the M365 Copilot app or within the <b>Tools menu</b> in Copilot chat across Word, Excel and PowerPoint. Additionally, users can <b>invoke these agents by typing “@” followed by the agent name</b> (for example, <b>@PowerPoint</b>).</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/5af01a28-f301-4a8c-86b6-41332b2913c5\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b style=\"\">Who is affected:</b></p>\n<ul>\n<li>Copilot Chat users in the Microsoft 365 Copilot app in the Frontier Program.</li></ul><p><b>What will happen:</b></p>\n<ul>\n<li>Users will have access to the following Copilot agents:</li>\n<ul>\n<li><b>Word agent:</b> Assists with research, formatting, layout, and content refinement for documents such as strategic plans, policy documents, and technical papers.</li>\n<li><b>Excel agent:</b> Supports data analysis, formula generation, trend identification, and summarization of insights.</li>\n<li><b>PowerPoint agent:</b> Helps generate presentations from outlines or documents, suggests layouts, and refines visual storytelling.</li>\n</ul>\n<li>Each agent supports multi-turn chat for iterative content development.</li>\n<li>Users can perform high-level iterations on the generated files via chat directly in the <b>Word, Excel, and PowerPoint agents</b>. For more extensive or granular editing, users can open their documents in the respective applications.</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/d3bbc383-4bd2-43e2-9bd8-fab18f3e5992/b32f23c4b5284242a36d4d309c42118670165389.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>The feature will be <b>ON by default</b> for tenants with Copilot access, Frontier enabled, and for tenants who have opted into Anthropic usage. If Anthropic usage is disabled by the admin, the agents will not appear in the user experience. Learn more: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/connect-to-ai-models\" target=\"_blank\">Connect to Anthropic's AI models | Microsoft Learn</a>.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required at this time.</li>\n<li>Communicate availability to helpdesk or content teams.</li>\n<li>If desired, review internal documentation or training materials to reflect the new capabilities.</li>\n</ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/topic/get-started-with-word-excel-and-powerpoint-agents-in-microsoft-365-copilot-frontier-76691f5e-bb19-4029-a34d-33a00e0a0c4f\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Get started with Word, Excel, and PowerPoint Agents in Microsoft 365 Copilot (Frontier)</a></p>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot introduces Word, Excel, and PowerPoint agents in the Frontier program starting February 5, 2026. These AI agents assist with content creation via multi-turn chat, accessible in the Copilot app for users with Anthropic enabled. No action is required to prepare."
    }
  ],
  "EndDateTime": "2026-03-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187799",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-28T21:11:09.253Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T20:53:27Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Word, Excel, and PowerPoint agents: A new Copilot experience for content creation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
