{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're introducing a new drag-and-drop capability in the new Microsoft Outlook for Windows. This feature will users to drag emails and files from one personal or enterprise account and drop them into another personal or enterprise account as attachments—streamlining cross-account workflows and improving productivity.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=493289\" target=\"_blank\">493289</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-July 2025 and expect to complete by mid-August 2025.\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-September 2025 and expect to complete by mid-October 2025.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, users are not able to drag emails and files from one account to another.\n</p><p>After this rollout, users from organizations with the <code>ItemsToOtherAccountsEnabled</code> parameter set to  <code>TRUE</code> in the <code>OWAMailboxPolicy</code> will be able to:</p><ul><li>Drag and drop emails and files from one mailbox into a draft in another mailbox as attachments.\n</li><li>Attach content from Shared Mailboxes or Shared Folders into another mailbox.\n</li></ul><p>To enhance security, users will see a confirmation prompt before completing the drag-and-drop action:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/0244f18c-a1b0-4e2e-bf08-5857c3d69b88\" style=\"width: 300px;\" alt=\"user message\">\n</p><p>This confirmation does not appear when attaching files from a Shared Mailbox.\n</p><p>This feature respects your existing <code>OWAMailboxPolicy</code> settings and does not change any defaults.\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates. Review your current  <code>OWAMailboxPolicy</code> settings, particularly the <code>ItemsToOtherAccountsEnabled</code> parameter, to determine if you would like to enable or disable this feature after roll out occurs. No change to your existing <code>ItemsToOtherAccountsEnabled</code> configuration will occur with this rollout.  You may want to notify your admins and/or users about this change and update internal documentation.</p><p>Learn more about the <code>ItemsToOtherAccountsEnabled</code> parameter in <a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy?view=exchange-ps#-itemstootheraccountsenabled\" target=\"_blank\">Set-OwaMailboxPolicy (ExchangePowerShell) | Microsoft Learn</a></p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "493289"
    },
    {
      "Name": "Summary",
      "Value": "New Microsoft Outlook for Windows will allow users to drag and drop emails and files between accounts as attachments starting mid-July 2025 for targeted release and mid-September 2025 for general availability. Users must review their OWAMailboxPolicy settings, specifically the ItemsToOtherAccountsEnabled parameter, to manage this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1104315",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-26T23:18:44.3Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-26T23:18:38Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Drag and drop files between accounts as attachments",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
