{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re updating the default behavior of <b>Microsoft Teams Copilot in meetings</b>. Copilot without transcription will become the default mode for newly scheduled Teams meetings where Copilot is allowed. Additionally, conversation history will now persist during meetings, improving multitasking and continuity of insights.\n</p><p>This update is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=478611\" target=\"_blank\">478611</a>.\n</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out in mid-September 2025 and expect to complete by late September 2025.\n</p><p><b>How this affects your organization</b></p><ul><li><b>Copilot without transcription becomes default:\n</b><ul style=\"\"><li style=\"\">Applies to new tenants and new users.\n</li><li style=\"\">Existing users without a set policy will inherit the host configuration and receive this new default.\n</li><li style=\"\">Custom policies will remain unchanged.</li><li style=\"\">In Teams meeting policy, the default property value for “Copilot” will change from <b>EnabledWithTranscript to Enabled</b>. This affects how Copilot behaves in newly scheduled meetings unless overridden by custom policy.</li><li style=\"\">Starting Copilot during a meeting will no longer automatically start transcription.\n</li><li style=\"\">Transcription must be manually enabled in Meeting Options or during the meeting if users want post-meeting insights or access to Copilot conversation history.\n</li></ul></li><li><b>Conversation history now persists during meetings:\n</b><ul style=\"\"><li style=\"\">Users can switch between meeting features (chat, participant list) without losing Copilot insights.\n</li><li style=\"\">This change applies to all users using Copilot without transcription.</li></ul></li></ul><p><b>What you can do to prepare</b></p><ul><li>Review your organization’s Teams meeting policies for dependencies on transcription defaults.\n</li><li>Update internal documentation and training to reflect the new default behavior and conversation history persistence.\n</li><li>Communicate to users how to manually enable transcription when needed, especially if they want to retain Copilot insights after the meeting.\n</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/copilot-teams-transcription\" target=\"_blank\">Manage Microsoft 365 Copilot in Teams meetings and events | Microsoft Teams | Microsoft Learn</a></li><li><a href=\"https://support.microsoft.com/office/use-copilot-without-recording-a-teams-meeting-a59cb88c-0f6b-4a20-a47a-3a1c9a818bd9\" target=\"_blank\">Use Copilot without recording a Teams meeting | Copilot in Teams | Copilot | Microsoft Support</a></li></ul><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td><b>Question</b></td><td><b>Answer</b></td></tr><tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Conversation history is now retained during the meeting instead of being cleared when switching panels.</td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Copilot behavior is updated to persist conversation history, enhancing AI-driven meeting insights.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Users can now maintain a continuous Copilot interaction during meetings without transcription.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>IT admins can enforce or override defaults via Teams meeting policy.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Users can manually enable transcription during meetings to retain Copilot insights post-meeting.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "478611"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Copilot will default to running without transcription for new meetings starting mid-September 2025, with conversation history now persisting during meetings. Transcription must be manually enabled for post-meeting insights. Custom policies remain unchanged, and admins can control settings via Teams meeting policies."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1139493",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-22T00:09:52.163Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-22T00:09:47Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Copilot without transcription becomes default for meetings - conversation history now persists",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
