{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>To improve consistency across Microsoft 365 services and reduce reliance on <i>Scope Search</i>, Microsoft Teams will now respect hidden user attributes—such as <code>ShowInAddressList</code> and <code>HiddenFromAddressListsEnabled</code>—without requiring <i>Scope Search</i>. This change aligns Teams behavior with Outlook and Exchange, simplifying user visibility management and resolving issues caused by <i>Scope Search</i>, such as difficulty locating <i>Call Queues</i> and <i>Auto Attendants</i>.</p>\n\n<b><b>When this will happen:</b></b>\n<p>Rollout begins early October 2025 and is expected to complete by late October 2025.</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> Admins managing Microsoft Teams user visibility, especially those who previously used <i>Scope Search</i> to hide users.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Teams will respect hidden user attributes (e.g., <code>ShowInAddressList</code>, <code>HiddenFromAddressListsEnabled</code>, <code>msExchangeHiddenFromAddressList</code>) without requiring <i>Scope Search</i>.</li>\n    <li>Guest users with <code>ShowInAddressList</code> set to <code>False </code>will no longer appear in <i>People Search</i>.</li>\n    <li><i>Scope Search</i> is no longer needed to hide users.</li>\n    <li>If <i>Scope Search</i> is used for <i>Information Barriers</i> (IB), it should remain enabled.</li>\n    <li>This change aligns Teams behavior with Outlook and Exchange.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Review your current use of <i>Scope Search</i>. If used solely to hide users, disable it.</li>\n<li>Ensure hidden user attributes are correctly configured:\n  <ul>\n    <li>Online: <code>HiddenFromAddressListsEnabled</code></li>\n    <li>On-premises: <code>msExchangeHiddenFromAddressList</code></li>\n    <li>Guest users: Set <code>ShowInAddressList</code> to <code>True </code>if they should appear in search results.</li>\n  </ul>\n</li>\n<li>Communicate this change to helpdesk and support teams.</li>\n<li>Update internal documentation to reflect the new behavior.</li>\n<li>For more details, refer to <a href=\"https://learn.microsoft.com/microsoftteams/teams-overview\">Microsoft Teams admin documentation</a>.</li></ul><p><b><b>Compliance considerations:</b></b></p>\n<table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Alters how existing customer data is processed</td><td>Teams will now use hidden user attributes to determine visibility, changing how user data is surfaced in search.</td></tr>\n<tr><td>Includes an admin control</td><td>Admins can manage visibility using hidden attributes (as mentioned above).</td></tr><tr><td>Allows user visibility to be controlled indirectly</td><td>Guest users and others can be hidden or shown based on attribute configuration.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 2025, Teams will respect hidden user attributes like ShowInAddressList without needing Scope Search, aligning with Outlook and Exchange. Admins should review and update attribute settings, disable Scope Search if only used for hiding users, and inform support teams accordingly."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1168293",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-08T22:03:44.447Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-08T22:03:38Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Teams Search now respects hidden user attributes without requiring \"Scope Search\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
