{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing new timeout rules logic for <b>Representative Non-Response Time</b> and open state conversations in Dynamics 365 Customer Service. This feature will reach general availability on November 3, 2025.<br><br>\n<b>How does this affect me?</b><br>\nWe are updating the logic for the <b>Representative Non-Response Time</b> event to encompass a more holistic approach. The following describes the new logic for the <b>Representative Non-Response Time</b> trigger event:<br><br>\nOn initial contact between the service representative and the customer, if the customer has sent a message and started the chat, the system will calculate the time that the customer has been waiting after the representative is actively on the conversation:<ol type=\"a\">\n    <li>Once Representative Notification accepted, auto-assign Notification timeout, or Force Assign via Supervisor occurs, then:<ol type=\"i\"><li><b>Representative Non-Response Time</b> = <i>Current Time - Representative assignment time</i></li></ol></li><br>\n    <li>Once there is rapport (back and forth messages), the Representative Mid-conversation Logic will be used:<ol type=\"i\"><li><b>Representative Non-Response Time</b> = <i>Current Time - Last customer message</i></li>\n        <li>The <i>Last customer message</i> is determined by the duration the service representative has not responded to the customer's most recent message.</li></ol></li>\n</ol>\n<b>What action do I need to take?</b><br>\nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-04T15:09:23Z",
  "HasAttachments": false,
  "Id": "MC1165529",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-04T15:12:01.69Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-04T15:09:23Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Service - New timeout rules logic for Representative Non-Response time and open state conversation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
