{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>Microsoft Teams is introducing a new feature in the Teams Admin Center that enables IT administrators to streamline app and agent evaluations using trust-based filters. This enhancement allows filtering by industry-standard security and compliance attributes such as SOC 2, ISO 27001, HIPAA, GDPR, and more—helping organizations make faster, more informed decisions about trusted apps.&nbsp;</p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=503100\" target=\"_blank\">503100</a>.</p><p><b><b>When this will happen:</b></b></p><p>General Availability (Worldwide): Rollout will begin mid-October 2025 and is expected to complete by the end of October 2025.</p>\n\n<b><b>How this affects your organization:</b></b>\n\n<p><b>Who is affected:</b> Admins managing apps and agents in Microsoft Teams Admin Center.</p><p><b>What will happen:</b>\n  </p>\n    <p>Today, IT administrators can view security and compliance information for apps and agents by navigating to <i>Teams apps &gt; Manage apps &gt; App details page &gt; Security and Compliance tab</i>. This includes data for Microsoft 365 certified and publisher-attested apps.</p><p>With this update:</p><ul><li>A new column titled <i>Security and compliance info</i> will be added to the Manage apps list view.</li><li>Admins can filter apps by specific compliance attributes (e.g., SOC 2, ISO 27001, HIPAA, GDPR) to quickly identify trusted apps aligned with organizational standards.</li><li>An enhanced tile on the <i>Manage apps</i> page will highlight Microsoft 365 certified apps that have submitted supporting evidence documents.</li><li>These improvements simplify the app review process and support broader and faster adoption of secure apps.</li><li>The feature will be available automatically and does not change app enablement/blocking behavior.</li>\n    \n    \n    \n    \n    </ul><ul>\n  </ul>\n<p></p><ul>\n</ul><ul>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n</ul><p>No action is required.</p><ul>\n</ul><p>You may choose to:\n  </p><ul>\n    <li>Familiarize yourself with the new filtering options in Teams Admin Center.</li>\n    <li>Communicate this enhancement to relevant IT staff.</li>\n    <li>Update internal documentation if app review workflows are documented.</li></ul><p>Before rollout, we will update this post with new documentation.</p><ul>\n</ul>\n\n<b><b>Compliance considerations:</b></b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "503100"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Admin Center will add trust-based filters for app reviews, allowing admins to filter apps by security and compliance standards like SOC 2, ISO 27001, HIPAA, and GDPR. This feature, rolling out October 2025, streamlines app evaluation without changing app enablement behavior."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162959",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-30T23:18:04.51Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-30T23:17:55Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: Speed up app reviews with trust-based filters",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
