{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting November 24, 2025, <b>Microsoft Viva Engage</b> will begin rolling out <b>support for manual multi-language post creation </b>on the web. Support for Teams will follow shortly after, beginning in early December 2025. This feature enables communicators to write and publish posts in multiple languages, ensuring manually authored versions override automatic translations. It is designed to improve inclusivity and engagement across multilingual organizations.</p>\n\n<b>When this will happen</b><p>General Availability (Worldwide) rollout <b>begins November 24, 2025</b>.</p>\n\n<b>How this affects your organization</b><ul>\n<li><b>Who is affected:</b> Premium licensed users of Viva Engage who author posts; all users who read posts.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Authors can manually create translated versions of a post in up to 41 supported languages.</li>\n<li>Readers will automatically see the translated version matching their locale or can switch using a dropdown.</li>\n<li>Creation is supported on web only; rendering is supported across all clients including Teams, Outlook, SharePoint, and mobile.</li>\n<li>Only premium licensed users can create multi-language posts; all users can read them.</li>\n<li>Manual translation is limited to thread starters and does not apply to replies.</li>\n<li>Notifications will display the default language version.</li>\n<li>Editing and adding new language versions is supported post-publication (web only).</li>\n<li>Attachments and cover photos must be reuploaded for each language translation.</li>\n</ul>\n</li>\n</ul>\n\n<b>What you can do to prepare</b><ul>\n<li>Ensure premium licenses are assigned to users who will author multi-language posts.</li>\n<li>Communicate to your teams that manual language translations will be visible based on user locale settings.</li>\n<li>Reupload attachments and cover photos for each language version.</li>\n<li>Update internal documentation to reflect this new capability.</li></ul><p><b>Learn more:</b>&nbsp;<a href=\"https://support.microsoft.com/topic/multi-language-posts-for-global-communication-1033ec42-6db4-4743-abba-58d01b8bbf91\" target=\"_blank\">Multi-language posts for global communication | Microsoft Support</a></p><ul>\n</ul>\n\n<b>Compliance considerations</b><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting November 24, 2025, Microsoft Viva Engage will support manual multi-language post creation on the web, allowing premium users to publish posts in up to 41 languages. Readers see posts in their locale, with support across Teams, Outlook, SharePoint, and mobile. Attachments must be reuploaded per language."
    }
  ],
  "EndDateTime": "2026-01-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187804",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-18T20:58:12.047Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T20:57:58Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Multi-language post creation support rolling out to general availability (GA)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
