{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We're introducing a new capability in <b>Microsoft Purview Data Lifecycle Management </b>that allows admins to override existing retention policies and delete content from OneDrive and SharePoint Online before the retention or legal hold duration expires. This feature supports organizations managing Copilot-related artifacts—such as Teams recordings and transcripts—independently of OneDrive retention policies, giving admins greater control over how long this content is retained.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489454\" target=\"_blank\">489454</a>.</p><p><b><b>When this will happen:</b>\n</b></p><ul><li><b>General Availability (GCC):</b> We will begin rolling out late November 2025 and expect to complete by early December 2025.\n</li><li><b>General Availability (GCC High, DOD): </b>We will begin rolling out late December 2025 and expect to complete by early January 2026.</li></ul><p><b><b>How this will affect your organization:</b>\n</b></p><p><b style=\"\">Who is affected:\n</b></p><ul><li>Admins managing OneDrive and SharePoint Online retention policies\n</li><li>Organizations using Microsoft Purview for data lifecycle management\n</li></ul><p><b style=\"\">What will happen:\n</b></p><ul><li>Admins can create<b> Priority Cleanup policies</b> to delete content before retention or hold periods expire.</li><li>Feature includes simulation mode, audit logging, and disposition reviews.</li><li>New admin policy authoring flows are introduced, governed by Microsoft Purview role groups.</li><li>Feature is not enabled by default; requires explicit policy creation and enforcement.</li><li>Requires at least two admins to author and enforce a <b>Priority Cleanup policy</b>.</li></ul><p><b><b>What you need to do to prepare:</b>\n</b></p><ul><li>Ensure at least two admins are assigned the <b>Priority Cleanup Admin</b> and <b>Retention Management roles</b>.</li><li>Review and configure role assignments in Microsoft Purview portal\n</li><li>Communicate this change to your compliance and records management teams\n</li><li>Update internal documentation to reflect new policy authoring and enforcement capabilities</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/purview/priority-cleanup-onedrive-sharepoint\" target=\"_blank\">Override holds to clean up files for Copilot and reclaim storage</a></p><p><b><b>Compliance considerations:</b></b></p><table border=\"1\">\n<tbody><tr>\n  <th>Question</th>\n  <th>Explanation</th>\n</tr>\n<tr>\n  <td>Does the change alter how existing customer data is processed, stored, or accessed?</td>\n  <td>It allows deletion of content before the expiration of retention or hold policies, changing how data is retained and disposed based on compliance admin decision.</td>\n</tr>\n<tr>\n  <td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n  <td>It introduces a new way to override retention policies and holds, impacting deletion workflows with the approval of an admin with special Purview roles.</td>\n</tr>\n<tr>\n  <td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td>\n  <td>Admin access is governed by Microsoft Purview role groups, which can be managed via Microsoft Purview portal settings.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "518223"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Lifecycle Management now lets admins create Priority Cleanup policies to delete OneDrive and SharePoint content before retention or legal hold expires, with simulation, audit, and review features. Requires two admins with specific roles and explicit policy enforcement. Rolling out late 2025 to early 2026."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-02-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1183292",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-02T18:48:30.173Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-06T00:10:42Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Lifecycle Management - Introducing secure priority cleanup workflows for OneDrive/SharePoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
