{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p></p><p><b><b>Introduction</b></b></p><p></p><p>\n</p><p>To improve alert clarity and reduce fatigue, Microsoft Defender XDR is introducing enhanced configuration options for identity-related alerts from Entra ID Protection. These updates are based on customer feedback requesting more granular control over risk-based alerting.</p>\n\n<b><b>When this will happen</b></b><p></p><p>\n</p><p>This change will begin rolling out as a <b>public preview starting December 11, 2025</b>.</p>\n\n<b><b>How this affects your organization</b></b><p></p><p>\n</p><ul>\n<li><b>Who is affected:</b> <ul><li>Admins using Microsoft Defender XDR with Entra ID Protection.</li></ul></li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>New alert configuration options will be available in the Defender XDR portal.</li>\n    <li>Alert ingestion logic will now be explicitly tied to Entra ID Protection risk levels.</li><li>Admins can choose which alerts to ingest into Defender XDR based on:<ul><li>High risk detections only</li><li>High + Medium risk detections</li><li>All detections</li></ul></li><li>Updated UI strings and visuals will improve clarity and usability.</li>\n    <li>The default setting is changing from ingesting alerts of all severities to ingesting only alerts with severity = High. As a result, you may notice a reduction in alert volume, and some alert types will no longer be ingested into Defender XDR. You can always change the default setting to any of the other options - High + Medium or All detections, according to your organization’s needs.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare</b></b><p></p><p>\n</p><ul>\n<li>No immediate action is required.</li>\n<li>If you wish to explore the new configuration options:\n  <ul>\n    <li>Visit the Microsoft Defender XDR portal after December 11, 2025.</li>\n    <li>Review and adjust alert settings based on your organization’s risk tolerance.</li>\n    <li>Share this update with your security operations team.</li>\n    <li>Learn more: <a href=\"https://learn.microsoft.com/defender-xdr/investigate-alerts?tabs=settings#configure-microsoft-entra-ip-alert-service\">Microsoft Defender XDR alert settings</a></li></ul></li></ul>\n\n<b><b>Compliance considerations</b></b><p></p><p>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting December 11, 2025, Microsoft Defender XDR will offer enhanced alert configuration for Entra ID Protection, allowing admins to filter alerts by risk level (High only, High + Medium, or All). The default will change to High risk only, reducing alert volume and improving clarity."
    }
  ],
  "EndDateTime": "2026-02-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1190195",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-26T23:14:27.63Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-26T23:12:28Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Upcoming Changes to Entra Identity Protection Alert Settings in Defender XDR",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
