{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to enable selective hold with music and exit prompts in Dynamics 365 Contact Center. This feature will reach general availability on November 24, 2025.<br><br>\n<b>How does this affect me?</b><br>\nThis feature enables voice agents to use selective hold periods when callers need time to retrieve information or respond. By playing music or promotional prompts during these pauses, the system prevents silences that might suggest disconnection or audio problems.<br><br>\nWith <b>Hold</b> and <b>Resume</b>, you can create more natural and considerate voice experiences. For example:<ul>\n    <li>When sending a one-time passcode (OTP), the agent can automatically enter a hold state, giving the caller time to retrieve and enter the code.</li>\n    <li>If a caller needs a moment to find an order number, personal information, or other documents, the agent can pause and wait without interrupting or misinterpreting background noise as input.</li>\n</ul><b>What action do I need to take?</b><br>\nThis message is for awareness and no action is required.<br><br>\nIf you would like more information on this feature, please visit the <a href=\"https://aka.ms/ADO11700\"target=\"_blank\">Enable selective hold with music and exit prompts</a> article.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-25T19:03:45Z",
  "HasAttachments": false,
  "Id": "MC1179700",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-25T19:07:14.783Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-25T19:03:45Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Enable selective hold with music and exit prompts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
