{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>We’re introducing smart tagging for electronically signed documents in <i>SharePoint Online</i>. When a document is uploaded and identified as electronically signed, it will automatically be tagged as “Signed.” This enhancement also applies retroactively— existing e-signed files will be updated with the appropriate tags.</p><p>To improve visibility and control, two optional metadata columns will be available in document libraries:</p><ul><li><b>Electronically Signed </b>– Indicates whether a document has been e-signed.</li><li><b>Signature Provider </b>– Displays the service used for the e-signature.</li></ul><p>This feature is <b>available exclusively to tenants with eSignature enabled</b>, helping streamline compliance tracking and document management.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=500873\" target=\"_blank\">500873</a>.</p>\n\n<p><b>When this will happen</b></p>\n<p><b>General Availability (Worldwide)</b>: Rollout will begin in <b>late September 2025</b> and is expected to complete by <b>late November 2025</b>.</p>\n\n<p><b>How this affects your organization</b></p>\n<p>Once eSignature is enabled, SharePoint will automatically tag e-signed documents across all sites. This improves visibility and simplifies compliance workflows. The feature is <b>on by default</b> for tenants with eSignature enabled.</p>\n<p>Users will see new metadata columns in document libraries, which can be optionally added to views. No manual tagging is required.</p>\n\n<p><b>What you can do to prepare</b></p>\n<ol>\n<li>Enable <b>eSignature </b>in the <i>Microsoft 365 admin center</i>.</li>\n<li>Configure your preferred eSignature provider.</li>\n<li>Specify the SharePoint location for usage.</li></ol><p>Regardless of the sites specified in item #3 above, tagging will be automatically applied to all SharePoint sites once eSignature is enabled.</p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does this change store new customer data?</td><td>Yes. The feature adds metadata tags to documents indicating eSignature status and the provider used.</td></tr><tr><td>Does this change alter how existing customer data is processed, stored, or accessed (e.g., documents, emails, chats, etc.)?</td><td>Yes. Existing e-signed documents will be retroactively updated with metadata tags, modifying how they are stored and accessed.</td></tr><tr><td>Does this change add any integration to third-party software products?</td><td>Yes. Documents signed by third party provides including Adobe, DocuSign and others will be tagged</td></tr><tr><td>Does this change include an admin control, and can it be controlled through Entra ID group membership?</td><td>Yes. Admins can enable (or disable) eSignature, which automatically enables (or disables) this feature</td></tr></tbody></table><p></p><ul>\n</ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "500873"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint Online will automatically tag electronically signed documents as “Signed” and add optional metadata columns for eSignature status and provider. This feature, available to tenants with eSignature enabled, rolls out from late September to November 2025, improving compliance and document management."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143282",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T21:45:20.083Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T21:44:53Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Enable smart tagging for eSigned documents in SharePoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
