{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>Organizers and co-organizers of Teams Town Hall events can now edit event details directly from their Outlook calendar. This update introduces a direct link to the Teams Town Hall edit page, streamlining the event management experience and aligning it with the existing webinar editing capabilities for consistency across event types.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=496986\" target=\"_blank\">496986</a>.\n</p><p><b>When this will happen\n</b></p><p><b>General Availability (Worldwide):</b> Rollout will begin in mid-August 2025 and is expected to complete by late August 2025.\n</p><p><b>How this affects your organization\n</b></p><p>This update does not introduce any changes to default settings or user permissions. It enhances usability for event organizers by providing a more intuitive way to manage Town Hall details. No end-user or admin action is required.\n</p><p><b>What you can do to prepare\n</b></p><p>No preparation is needed. However, you may wish to inform event organizers of this new capability to improve awareness and adoption. For more information about managing Teams Town Hall events, visit the <a href=\"https://learn.microsoft.com/microsoftteams/town-hall-overview\" target=\"_blank\">https://learn.microsoft.com/microsoftteams/town-hall-overview</a>.\n</p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "496986"
    },
    {
      "Name": "Summary",
      "Value": "Organizers and co-organizers can now edit Teams Town Hall event details directly from Outlook via a link to the edit page. This feature, rolling out worldwide in August 2025, improves event management without changing settings or permissions. No action is required, but informing organizers is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1124568",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-30T00:09:16.863Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T00:09:14Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Edit and manage Teams Town Hall instances in Microsoft Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
