{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b></b>\n\n<p>Updated January 30, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b>Copilot readiness</b> in the <i>Microsoft 365 admin center</i> provides a centralized experience for applying Microsoft’s recommended settings, policies, and actions for Copilot. It organizes these into predefined packages so admins can quickly deploy Copilot securely and confidently.</p><p>To support IT admins in navigating the fast-paced AI landscape, Microsoft is introducing <b>Copilot Readiness Packages</b> in the <i>Microsoft 365 Admin Center</i>. These packages offer a centralized experience to discover Microsoft’s recommended admin presets, grouped by key administrative outcomes. Each package includes a personalized readiness assessment, contextual insights, and step-by-step guidance—helping admins deploy Copilot securely, confidently, and efficiently.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=526793\" target=\"_blank\">526793</a>.</p>\n\n<p><b><b>When this will happen</b></b></p><ul>\n<li><b>Targeted Release:</b> Begins mid-February 2026 (previously&nbsp;mid-December 2025); completes mid-February 2026 (previously&nbsp;mid-January).</li>\n<li><b>General Availability (Worldwide):</b> Begins mid-March 2026 (previously&nbsp;mid-January); completes by end of March 2026 (previously&nbsp;late February).</li>\n</ul><p></p>\n\n<p><b><b>How this affects your organization</b></b>\n</p><p><b>Who is affected:&nbsp;</b>Admins managing Microsoft 365 tenants with Copilot capabilities.\n<b>What will happen:</b>\n</p><ul>\n<li>A new <b><i>Readiness</i></b> pivot will appear under <i><b>Copilot &gt; Settings</b></i> in the <i>Microsoft 365 admin center</i>.</li>\n<li>Admins will see grouped configuration sets aligned to key administrative outcomes.</li>\n<li>Each package includes Microsoft’s recommended presets, a personalized readiness assessment, and contextual insights.</li>\n<li><b>No changes will be made automatically;</b> admins can review and apply configurations as needed.</li>\n<li>The experience is designed to reduce setup complexity and improve governance and security alignment.</li><li><b>No Microsoft 365 Copilot license is required to use this feature. </b>Admins can configure both <b>Copilot Chat</b> and <b>Microsoft 365 Copilot </b>settings without needing a license.</li>\n</ul><p></p>\n\n<p><b><b>What you can do to prepare</b></b>\n</p><p>No special preparation is required. To get the most out of the experience, admins should:\n</p><ul>\n<li>Visit the Microsoft 365 admin center and navigate to <b>Copilot &gt; Settings &gt; Readiness</b></li>\n<li>Review the suggested presets and readiness assessments</li>\n<li>Follow the provided guidance to complete any missing actions or policy updates</li>\n<li>Share feedback directly in the <i>admin center</i> to help improve clarity and completeness</li>\n</ul><p></p>\n\n<p><b><b>Compliance considerations</b></b>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "526793"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 admin center will introduce Copilot Readiness Packages by mid-March 2026, offering admins centralized, recommended settings, assessments, and guidance for secure Copilot deployment. No automatic changes or licenses are required. Admins can review and apply configurations to simplify setup and enhance governance."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-05-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1192665",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-30T17:46:56.243Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-06T00:20:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Copilot settings – readiness",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
