{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 4, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>To streamline workspace scheduling, users can now <b>book a workspace directly from the location field </b>when creating a calendar event. This enhancement simplifies the booking experience and aligns with user feedback requesting more intuitive workspace reservation options.</p><p>Screenshot: <i>Open the location field to book a workspace through search or by selecting <b>Browse workspaces</b></i></p><p><img src=\" https://cxcs.microsoft.net/file/ccp/en-us/4b317b18-e4c8-40c0-8688-474de82eccaf\" style=\"width: 400px;\" alt=\"user settings\"></p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>General Availability (Worldwide, GCC, GCC High, DoD):</b> Rollout will begin in mid-December 2025 (previously early December) and is expected to complete by mid-January 2026 (previously early December 2025).</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> All users in tenants where workspace booking is enabled by IT admins and users have turned on workspace booking in their settings.</li>\n<li><b>What will happen:</b>\n  </li><ul>\n    <li>Users will see a new option to search or <b>Browse Workspaces</b> directly from the <b>location field</b> when creating an event.</li>\n    <li>On iOS, the existing long-press <b>calendar compose button</b> method for booking workspaces will be retired.</li><li>This feature is ON by default but only applies if <b>workspace booking</b> is enabled by both the admin and the user.</li><li>Admins must have already configured <b>workspace bookings</b> for this feature to be available in their organization.</li></ul></ul><ul><ul>\n  </ul>\n\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No admin action is required.</li>\n<li>If <b>workspace booking</b> is not yet enabled in your organization, consider reviewing the feature and enabling it to take advantage of this streamlined experience.</li>\n<li>Communicate the upcoming change to helpdesk staff, especially regarding the retirement of the iOS long-press method.</li>\n<li>Update internal documentation if it references the previous booking method.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/calendaring/configure-room-finder-rooms-workspaces\" target=\"_blank\">Configure rooms and workspaces for Room Finder in Outlook</a></p><ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Users can now book workspaces directly from the calendar event location field starting mid-December 2025. The iOS long-press booking method will be retired. This feature requires workspace booking enabled by admins and users, is on by default, and needs no admin action to prepare."
    }
  ],
  "EndDateTime": "2026-02-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1186361",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-04T21:54:33.22Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-14T23:51:15Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Book a workspace when creating an event",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
