{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're updating the output format of certain properties returned by Exchange Online PowerShell cmdlets to improve performance and align with backend service optimizations. This change reduces unnecessary data retrieval and enhances consistency across services.\n</p><p><b>When this will happen:</b></p><p>Rollout will begin in August 2025.\n</p><p><b>How this affects your organization:</b></p><p>This update changes the string format of specific properties returned by Exchange Online cmdlets. For example, the Database property in the output of Get-Mailbox will change from:\n</p><p><code>Database : APCP153DG038-db080</code>\n</p><p>to:\n</p><p><code>Database : APCP153.PROD.OUTLOOK.COM/7ad9dea1-26b7-4088-ad73-708c219faff6</code>\n</p><p>This change applies only to <i>Exchange Online</i>. On-premises Exchange environments are not affected.\n</p><p>We do not expect organizations to have dependencies on these output formats. These values are informational only and not intended for admin control or automation. No changes to user workflows, admin configurations, or help desk processes are expected.\n</p><p><b>What you can do to prepare:</b></p><p>No action is required. There are no settings or controls to manage this change. If you have scripts that parse these property values, we recommend reviewing them to ensure compatibility.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Changing output format for some database properties in Exchange Online cmdlets to improve performance and consistency. Rollout starts August 2025. The update affects string format of specific properties, but no action is required. Review scripts for compatibility if they parse these values. On-premises Exchange is not affected."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108848",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-03T23:39:19.53Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:39:14Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Changing output format for some database properties in Exchange Online cmdlets",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
