{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Microsoft 365 Copilot is expanding its grounding sources to include discussion posts from Viva Engage public communities and Storylines. This enhancement helps Copilot deliver more contextually relevant responses by drawing from a broader range of organizational conversations.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=408167\" target=\"_blank\">408167</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We began rolling out in late June 2025 and expect to complete by mid-August 2025.</p><p><b>How this will affect your organization:</b></p><p>This new feature builds on existing support for question posts by expanding Copilot’s grounding sources to include discussion posts from Viva Engage public communities and Storylines. As a result, Copilot can surface more relevant organizational knowledge from employee-driven conversations in response to user prompts.</p><p>Only content from public communities and Storylines is included—private or restricted content is not used.\n</p><p>This feature is on by default and is enabled automatically for tenants with both Viva Engage and Microsoft 365 Copilot. There are no new admin controls, and user interaction with Copilot remains unchanged.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current Viva Engage configuration to assess the impact on your organization. You may want to notify your admins and users about this change and update internal documentation.</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/engage/manage-engage-licenses-microsoft-365\" target=\"_blank\">Manage Viva Engage Core user licenses in Microsoft 365 | Microsoft Learn</a></p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed (such as documents, emails, chats)? - Yes. Copilot will now process and access additional types of existing data—specifically, discussion posts from public Viva Engage communities and Storylines—as grounding sources for responses. This expands the scope of data used by Copilot, though it does not change where or how the data is stored.</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data? - Yes. This change enhances Copilot’s AI capabilities by expanding the types of content it can use to generate responses. It introduces new grounding sources (discussion posts), which may affect the relevance and scope of AI-generated answers.</li><li>Does the change provide users any new way of interacting with generative AI? - Yes. Users may now receive Copilot responses grounded in a broader set of Viva Engage content, which may change the type and depth of information surfaced in their queries. However, the interaction model (such as chat with Copilot) remains the same.</li></ul><p><br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408167"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot now includes Viva Engage discussion posts from public communities and Storylines as grounding sources, enhancing contextually relevant responses. This feature, rolling out from June to August 2025, requires no admin action and does not include private content. Review Viva Engage configurations and notify relevant parties."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS, Web"
    }
  ],
  "EndDateTime": "2025-09-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1112450",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-10T00:15:42.237Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-10T00:15:30Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot | Viva Engage discussion posts added to grounding sources",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
