{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><a href=\"https://aka.ms/Windows11/25H2/UpdateHistory\" target=\"_blank\">Windows 11, version 25H2</a> is now being offered to eligible devices via feature updates. For customers enrolled in hotpatch quality update policies, when the upgrade is taken can affect whether devices continue to receive hotpatch updates during the current hotpatch cycle. Devices that upgrade during a designated <a href=\"https://learn.microsoft.com/windows/deployment/windows-autopatch/manage/windows-autopatch-hotpatch-updates#release-cycles\" target=\"_blank\">baseline release period</a> (such as October) will remain eligible for hotpatching. Devices that upgrade during a non-baseline month (such as November) will temporarily stop receiving hotpatch updates and, until the next baseline release in January 2026, will instead receive standard security updates that require a restart.</p><p><b>When will this happen:</b></p><p>The Windows 11, version 25H2 upgrade will be offered starting September 30, 2025, with October 2025 designated as the baseline month for hotpatch eligibility. Organizations should plan their upgrade timing accordingly to maintain hotpatch continuity.</p><p><b>How this will affect your organization:</b>\n</p><p>If you are using hotpatch-enabled quality updates in your tenant and a device upgrades to Windows 11, version 25H2 outside of a <a href=\"https://learn.microsoft.com/windows/deployment/windows-autopatch/manage/windows-autopatch-hotpatch-updates#release-cycles\" target=\"_blank\">baseline month</a>, it will temporarily receive standard (non-hotpatch) updates until the next baseline month.</p><p><b>What you need to do to prepare:</b>\n</p><p>To ensure devices continue to receive hotpatch updates, please review the following:</p><ul><li>Review your feature update release schedule to ensure devices are positioned to update during baseline months. Look for the release date for your devices in your feature update policy as well as your feature update deferral settings in your Update Rings policies in Windows Autopatch.  \n</li><li>Review the hotpatch servicing cadence and upgrade timing implications. Refer to the <a href=\"https://techcommunity.microsoft.com/blog/windows-itpro-blog/hotpatch-for-client-frequently-asked-questions/4413582\" target=\"_blank\">Hotpatch FAQ</a> for technical guidance.</li></ul><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Windows 11 version 25H2 is available from September 30, 2025. Upgrading during October (a baseline month) keeps devices eligible for hotpatch updates; upgrading outside baseline months pauses hotpatching until the next baseline. Organizations should schedule upgrades accordingly to maintain hotpatch continuity."
    }
  ],
  "EndDateTime": "2025-11-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162947",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-30T23:06:23.147Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-30T23:06:16Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Windows 11, version 25H2 is now available via feature updates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
