{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are introducing updates to the Power apps license consumption experience designed to improve <a href=\"https://aka.ms/13295/licenses/powerApps/overview\" target=\"_blank\">Power Apps licensing management</a>. These changes will begin rolling out on December 8, 2025, based on geographic region, and will be available in all regions by December 19, 2025.<br><br>\n<b>How does this affect me? </b><br>\nThis update will introduce the following improvements:<br><br>\n<b>New tiles in the license consumption report: </b><ul>\n<li><b>Per User Licenses:</b> Summary of licenses purchased, assigned, and consumed based on last 90 days usage. </li>\n<li><b>Per App Licenses: </b>Summary of licenses purchased and allocated. </li>\n<li><b>Pay-As-You-Go: </b>View the number of billing plans set up for Power Apps. </li>\n<li><b>Additional Insights: </b>Month-over-month trends for per-user license and app pass consumption. </li>\n</ul>\n<b>New admin options: </b><ul>\n<li>Download detailed license consumption data, including how licenses were consumed based on app launches. </li>\n<li>Identify users who have assigned licenses but have not launched an app recently. </li>\n<li>Manage allocation of app passes directly from this experience for better control and governance. </li>\n</ul>\nThis update also brings the following changes to the current experience: <ul>\n<li>Updated layout with the new license consumption report tiles. </li>\n<li>Removal of the “License Type” column from the summary. </li>\n<li>Removal of the Usage Details by License Type table. </li>\n</ul>\n<b>What action do I need to take? </b><br>\nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-12-25T02:38:27Z",
  "HasAttachments": false,
  "Id": "MC1189695",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-25T02:39:33.363Z",
  "Services": [
    "Power Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-25T02:38:27Z",
  "Tags": [
    "Feature update"
  ],
  "Title": "Power Apps – Upcoming changes to license consumption experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
