{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 22, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b>\n</p><p>To enhance wireless content sharing in meeting spaces, Microsoft Teams Rooms on Windows devices will soon support Miracast. This complements existing options like Teams Cast and HDMI ingest and is available for devices including touch boards. This feature is exclusive to Teams Rooms Pro.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=506748\" target=\"_blank\">506748</a>.</p>\n\n<b><b>When this will happen:</b></b>\n\n<ul><li><b>Targeted release: </b>We will begin rolling out in mid-March 2026 (previously mid-February) and expect to complete by end of March 2026 (previously end of February).\n</li><li><b>General Availability: </b>We will begin rolling out end of March 2026 (previously end of February) and expect to complete by mid-April 2026 (previously end of March).</li></ul>\n\n<b><b>How this affects your organization:</b></b>\n<p><b>Who is affected: </b>Admins managing Teams Rooms on Windows devices with Teams Rooms Pro licenses.</p>\n<p><b style=\"\">What will happen:</b></p>\n<ul>\n<li>Miracast will be available as a wireless sharing option in Teams Rooms on Windows.</li>\n<li>The feature will be <b>OFF by default</b> and can be enabled via a tenant-wide toggle in the IT admin portal.</li>\n<li>Laptop devices must support Miracast to use this feature.</li>\n<li>No impact to end-user workflow unless enabled by admin.</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Review your Teams Rooms device compatibility with Miracast.</li>\n<li>Enable the feature via the IT admin portal if desired.</li>\n<li>Communicate the availability of Miracast to helpdesk and meeting room support staff.</li>\n<li>Update internal documentation to reflect the new sharing option.</li>\n</ul>\n\n<b><b>Compliance considerations:</b></b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "506748"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows (Pro only) will support Miracast for wireless content sharing, rolling out from mid-March to mid-April 2026. The feature is off by default, enabled via admin portal, requires Miracast-compatible laptops, and has no impact unless activated. Prepare by reviewing compatibility and updating documentation."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2026-05-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1186374",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-22T17:47:04.137Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-15T00:01:30Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Miracast support for Teams Rooms on Windows (Teams Rooms Pro only)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
