{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re expanding the <i>Best practice configurations </i>dashboard in the Microsoft Teams admin center to include additional monitoring scenarios. This dashboard helps Teams administrators assess how well their tenant aligns with Microsoft’s recommended best practices for optimal collaboration—particularly for meeting experiences.</p><p>This message applies to Teams for Windows desktop, Teams for the web, and Teams for Mac.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=492982\" target=\"_blank\">492982</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide and GCC): We will begin rolling out mid-July 2025 and expect to complete by late July 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The <i>Best practice configurations</i> dashboard helps ensure a high-quality Teams experience by identifying areas where your network setup may not align with Microsoft’s recommendations. In this release, the dashboard will monitor three additional scenarios:\n</p><ul><li>Bypass local proxy\n</li><li>Bypass cloud proxy\n</li><li>DNS resolution failures\n</li></ul><p>Non-conformant locations will be highlighted on the dashboard and summarized in a widget on the main page. Admins will also see a breakdown by city and subnet/IP address, with export options for sharing insights with relevant teams. Only locations with significant non-conformance will be shown, to reduce noise.\n</p><p>As issues are resolved, the dashboard will track trends to help monitor progress over time.</p><p>After this rollout, visit the <i>Meetings </i>section of the Teams admin center to view the updated dashboard. Use the export and recommended remediations to collaborate with your networking teams and address any flagged issues.\n</p><p>This feature will be available by default for admins to configure.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your admins and/or users about this change and update internal documentation.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/best-practice-dashboard\" target=\"_blank\">Best practice configurations dashboard for Microsoft Teams meetings - Microsoft Teams | Microsoft Learn</a></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "492982"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Teams admin center is expanding the Best Practice Configurations dashboard to include additional monitoring scenarios for meeting experiences. This update, rolling out in July 2025, will monitor bypass local proxy, bypass cloud proxy, and DNS resolution failures. Admins can view and export insights to address flagged issues. No action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-09-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1103605",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-26T00:32:24.813Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-26T00:32:18Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: Additional monitoring scenarios in Best Practice Configurations dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
