{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to the Microsoft eCDN configuration.</p><p>Starting with Chrome 142, browsers will enforce Local Network Access restrictions that may impact Microsoft eCDN peer-to-peer functionality.</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because our reporting indicates one or more users in your organization may be using this Microsoft eCDN. To maintain optimal performance for Teams Live Events and Town Halls, admins must configure the LocalNetworkAccessAllowedForUrls policy for Chrome-based browsers</p><p><b>What you need to do to prepare:</b></p><p>Admins will need to:</p><p>Add the following URLs to the LocalNetworkAccessAllowedForUrls policy in your environment:</p><ul><li><b>*.</b>ecdn.teams.microsoft.com</li><li>https://teams.microsoft.com</li><li><b>*.</b>ecdn.teams.cloud.microsoft</li><li>https://teams.cloud.microsoft</li><li>https://engage.cloud.microsoft/</li></ul><p>Apply these settings via Group Policy or registry keys for:</p><ul><li>Microsoft Edge: HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Microsoft\\Edge\\</li><li>Google Chrome: HKEY_LOCAL_MACHINE\\SOFTWARE\\Policies\\Google\\Chrome\\</li></ul><p>For US Government tenants, use GCC/GCC High-specific hostnames as outlined in the documentation.</p><p>Additional Notes:</p><ul><li>This change aligns with Microsoft’s Unified Domains initiative. Ensure your network filters include both legacy and new domains.</li><li>Pair this configuration with WebRtcLocalIpsAllowedUrls for full peer-to-peer functionality.</li><li>Firefox restrictions are planned but not yet enforced.</li></ul><p>See documentation for full guidance: <a href=\"https://learn.microsoft.com/ecdn/how-to/configure-local-network-access-policy\" target=\"_blank\">Configure Local Network Access Policy for Microsoft eCDN</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins must configure the LocalNetworkAccessAllowedForUrls policy in Chrome-based browsers to allow specific Microsoft eCDN URLs, ensuring optimal Teams Live Events performance amid new Local Network Access restrictions starting with Chrome 142. Apply settings via Group Policy or registry keys; see documentation for details."
    }
  ],
  "EndDateTime": "2026-02-23T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1189910",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-26T18:38:20.067Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-25T22:28:49Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Configure Local Network Access Policy for Microsoft eCDN",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
