{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b><div>\n</div><div>We’re excited to announce the general availability of Microsoft 365 LTI, a unified LTI designed to make Learning Management System (LMS) integrations simple, with powerful capabilities to streamline and simplify deployment. Microsoft 365 LTI enhances your LMS platform whether you’re using Canvas, Schoology, Brightspace, Blackboard, or Moodle, making it easier than ever for educators and students to leverage the full suite of Microsoft 365 tools within their existing LMS workflows.</div><div><br></div><div>  \n</div><div><b><b>When this will happen:</b></b></div><ul><li>Microsoft 365 LTI is generally available (worldwide) on September 15, 2025. \n</li></ul><div><b><b>How this affects your organization:</b>&nbsp;</b></div><ul><li><b>Who is affected:&nbsp;</b>Admins and users of LMS platforms including Canvas, Schoology, Blackboard, D2L Brightspace, Moodle, and others who use Microsoft 365 Education tools.</li></ul><div><b><b>What will happen:</b></b></div><ul><li>Microsoft 365 LTI will be available for deployment in supported LMS platforms. \n</li><li>Users will gain unified access to OneDrive, Assignments, Teams, Class Notebook, Reflect, and more—directly within the LMS. \n</li><li>Educators can add content, create assignments, and schedule meetings from a single interface. \n</li><li>Replaces the <a href=\"https://support.microsoft.com/topic/teams-learning-tools-interoperability-lti-sunset-faq-7e071764-f5bf-420a-b4a1-6070cd6b9aa2\" target=\"_blank\">retired Teams Meetings and Teams Classes LTI tools</a>.</li><li>Restores the OneNote Class Notebook auto-provisioning feature from LMS rosters. \n</li><li>Reduces clutter by eliminating the need to enable multiple tools separately. \n</li></ul><div><b><br></b></div><div><b><b>What can you do to prepare:</b></b></div><ul><li>Admins must deploy the new Microsoft 365 LTI integration to enable access for users. \n</li><li>Review the <a href=\"https://aka.ms/LMSAdminDocs\" target=\"_blank\">overview and deployment guides to assist with setup</a>.</li><li>Communicate this change to helpdesk and instructional staff. \n</li><li>Update internal documentation to reflect the new LTI tool. \n</li><li>If you previously used the Teams Meetings or Teams Classes LTI tools, you'll need to transition to the new Microsoft 365 LTI to restore functionality those tools provided. \n</li></ul><div><b><b>Compliance considerations:</b></b></div><div>No compliance considerations identified, review as appropriate for your organization. \n</div>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 LTI, a unified integration for LMS platforms like Canvas and Moodle, will be generally available worldwide on September 15, 2025. It streamlines access to Microsoft 365 tools within LMS, replaces retired Teams LTI tools, and requires admin deployment and communication for a smooth transition."
    }
  ],
  "EndDateTime": "2025-10-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1154301",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-16T22:25:29.907Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-16T22:24:17Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Education Customers: Enhance your LMS with the power of Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
