{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n</p><p>To enhance detection capabilities in <i>Insider Risk Management (IRM)</i>, we’re adding two new email indicators as triggers for data <i>exfiltration activities</i>. These indicators help identify potential data leaks when users send business-sensitive attachments to personal or public email domains. This update supports stronger data protection and aligns with customer feedback requesting broader coverage of email-based risks.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=496149\" target=\"_blank\">496149</a>.</p>\n\n<b><b>When this will happen:</b></b>\n<p>General Availability (Worldwide, GCC, GCC High, GCC DoD): Rollout will begin in early September 2025 and is expected to complete by late September 2025.</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> Admins managing <i>Insider Risk Management</i> policies.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Two new email triggers will be available:\n      <ul>\n        <li><i>Sending email with attachments to free public domains.</i></li>\n        <li><i>Sending email with attachments to self</i> (personal email).</li>\n      </ul>\n    </li>\n    <li>These indicators can be enabled from the <i>IRM settings page</i>.</li>\n    <li>Sequence detections will now include these indicators as exfiltration activities.</li>\n    <li><i>IRM quick policy templates </i>will be updated:\n      <ul>\n        <li><b><i>Email exfiltration:</i></b> These two indicators will be set as default triggers and indicators. Sending email with&nbsp;attachments to external recipients will not be enabled by default.</li>\n        <li><b><i>Data leaks:</i></b> Both indicators will be added to triggers and indicators, with no changes to existing ones.</li>\n        <li><b><i>Data theft by users leaving your org:</i></b> Indicators will be added; existing triggers and indicators remain unchanged.</li>\n        <li><b><i>Critical asset protection:</i></b> Both indicators will be added to triggers and indicators, with no changes to existing ones.</li>\n      </ul>\n    </li>\n    <li>Existing policies created from quick templates will not be affected.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>No action is required. The new triggers will automatically become available for configuration in the <i>IRM policy wizard</i>.</li>\n</ul>\n\n<b><b>Compliance considerations:</b></b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "496149"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will add two new email triggers in September 2025 to detect data exfiltration via attachments sent to personal or public email domains. These triggers can be enabled in IRM settings and will update quick policy templates without affecting existing policies. No action required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1147381",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-03T23:22:04.423Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-03T23:21:18Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management - Personal email triggers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
