{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To streamline Microsoft Word and focus on core productivity features, we are retiring the Send to Kindle integration, which allows users to upload documents directly to Kindle from Word.\n</p><p><b>When this will happen:</b></p><p>The retirement will begin on February 9th, 2026, and the feature will be fully removed by March 9th, 2026.</p><p><b>How this will affect your organization:</b></p><p>The Send to Kindle feature will no longer be available in Word for Window desktop, Word for Mac desktop, and Word for the web after the retirement period. (This feature was never available for iOS/Android.) Users will still be able to upload .doc and .docx files to Kindle using <a href=\"https://www.amazon.com/sendtokindle\" target=\"_blank\">https://www.amazon.com/sendtokindle</a>. Documents already sent to Kindle will not be affected by this retirement.\n</p><p><b>What you need to do to prepare:</b></p><p>No admin action is required. We recommend informing users of this change and updating any internal documentation or workflows that reference the Send to Kindle feature.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Send to Kindle\" feature in Microsoft Word will retire starting February 9, 2026, and be fully removed by March 9, 2026. It will no longer be available on Word desktop or web, but users can still upload documents via Amazon's Send to Kindle website. No admin action is needed."
    }
  ],
  "EndDateTime": "2026-05-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1182709",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-04T03:46:03.49Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-04T00:53:13Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Word: The \"Send to Kindle\" feature will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
