{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>Microsoft Teams introduced a new SlimCore-based optimization for Citrix VDI environments and Windows endpoints in late 2024. This update delivered improved performance, reliability, and quality compared to the legacy WebRTC-based optimization. It also unlocks new features such as Gallery view (3x3 and 7x7), QoS, HID support, custom backgrounds, hardware acceleration, and 1080p video. Microsoft recommends enabling this optimization ahead of the upcoming WebRTC deprecation announcement.</p><p><b><b>When this will happen:</b></b></p><p>This update is available now. Microsoft recommends configuring your environment as soon as possible to ensure continued access to new Teams features.</p><p><b>Who is affected:&nbsp;</b>Admins managing Citrix DaaS/CVAD environments where Microsoft Teams is deployed</p><p><b>What will happen:</b></p><ul><li>You are receiving this message because we detected that your Citrix DaaS/CVAD environment is not configured to allow the custom virtual channels needed by Microsoft Teams so it can optimize users with the SlimCore architecture.</li><li>If the virtual channels are not whitelisted, Microsoft Teams will only be able to optimize using the legacy WebRTC-based offloading.</li><li>Since the new SlimCore-based optimization is where all new features will be introduced, Microsoft strongly recommends IT administrators reconfigure Citrix Studio policies.</li><li>SlimCore-based optimization will not be available until the Citrix Studio policy that allows virtual channels is updated.</li><li>Users will miss out on new Teams features and performance improvements.</li><li>Microsoft will deprecate WebRTC optimization in a future update.</li></ul><p><b><b>What you can do to prepare:</b></b></p><p>To enable SlimCore-based optimization:</p><ul><li>Review and update the <a href=\"https://learn.microsoft.com/microsoftteams/vdi-2#citrix-virtual-channel-allow-list\" target=\"_blank\">Virtual channel allow list policy in Citrix</a>&nbsp;studio.</li><li>Whitelist the following virtual channels: MSTEAMS, MSTEAM1, and MSTEAM2.</li><li><a href=\"https://learn.microsoft.com/microsoftteams/vdi-2#step-2-plugin-installation-on-the-endpoint\" target=\"_blank\">Deploy the Citrix Plugin alongside the Citrix Workspace app</a>. This plugin is a client-side component that terminates the custom virtual channel on the Workspace app.&nbsp;</li><li>Refer to the configuration article for detailed steps: <a href=\"https://learn.microsoft.com/microsoftteams/vdi-2\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">New VDI solution for Teams | Microsoft Teams | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td><td>Once SlimCore-based optimization is enabled, admins will see enhanced session details in Teams Admin Center and Call Quality Dashboard, improving visibility and troubleshooting workflows.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams now supports SlimCore-based optimization for Citrix VDI, offering better performance and new features. Admins must update Citrix Studio policies to whitelist virtual channels (MSTEAMS, MSTEAM1, MSTEAM2) and deploy the Citrix Plugin. WebRTC optimization will be deprecated in the future."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1154298",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-16T22:22:57.123Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-16T22:22:50Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Configure your Citrix VDI environments for SlimCore-based optimization",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
