{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 7, 2025: We have updated the timeline. Thank you for your patience.</p><p>We are changing how <a href=\"https://learn.microsoft.com/en-us/graph/metered-api-overview\" target=\"_blank\">metered APIs in Microsoft Graph</a> incur costs based on usage.</p><p>Effective from August 25, 2025, the Teams APIs listed on <a href=\"https://aka.ms/graph-metered-list\" target=\"_blank\">this</a> page will no longer incur the metered charges previously applied. Here are some key dates:</p><ul><li>August 25, 2025 -After this date no further billing events will be registered when calling the impacted APIs (listed on <a href=\"https://aka.ms/graph-metered-list\" target=\"_blank\">this</a> page).\n</li><li>Final Billing – Your final bill for metered API calls will be on your normal billing schedule.</li></ul><div>For existing customers who have been using the APIs:\n<ul><li>This does not require any change to client applications or other action on your part.\n</li><li>The final invoice will happen on your normal billing schedule.\n</li></ul>This change will impact all regions served by Microsoft 365 Graph APIs, and there is no additional action required from customers.</div><div>Note: This change does not impact the SharePoint and OneDrive for Business assignSensitivityLabel API or the SharePoint prioritization product.&nbsp;</div><div>\n<p></p></div>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting August 25, 2025, certain Teams APIs in Microsoft Graph will no longer incur metered charges. No client changes are needed, and final billing will follow the normal schedule. This update applies globally and does not affect SharePoint and OneDrive assignSensitivityLabel APIs or prioritization products."
    }
  ],
  "EndDateTime": "2025-09-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1122144",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-07T19:31:16.58Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-25T22:20:14Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Graph Metered API Update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
