{
  "ActionRequiredByDateTime": "2025-09-14T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 27, 2025: We have updated the content. Thank you for your patience.</p><p><b>When this will happen:&nbsp;</b>Updated Rollout Schedule for iPhone and iPad</p><p>The first phase of this change is in-product notifications in the M365 Copilot app to encourage users who are editing documents to install the Word, PowerPoint, Excel and OneDrive apps. This in-app notification will roll out to TestFlight users only the week of August 25, 2025 and become generally available on September 15, 2025 (09/15). This is a modification from the initial post to allow our enterprise customers more time to prepare.</p><p>The second phase of this change updates the Word, PowerPoint and Excel functionality in the Microsoft 365 Copilot app with previewers that will be made available to TestFlight users only in September and GA on October 13, 2025. All changes described below will be implemented across iPhone and iPad.\n</p><p>To get early builds and test out features before GA dates – you will need to join the iOS TestFlight program for the Microsoft 365 Copilot app.  There are a limited number of seats available in the iOS TestFlight program. We periodically remove inactive users (those who have not updated their build) to make space for others. If you are unable to join because the program is full, please check back later, or contact your Microsoft Support representative.  Learn More: Microsoft 365 Insider program on iOS, Become a Microsoft 365 Insider on iOS.</p><p><b>How this affects your organization:&nbsp;</b>Transition to Previewers in the M365 Copilot App for WXP file viewing &amp; File Access &amp; Management</p><p>As part of this update, the Microsoft 365 Copilot app for iPhone and iPad will transition to a Copilot powered preview experience for Word, Excel, and PowerPoint. Users will continue to be able to view files and use Copilot Chat to get deeper analysis and insights on their content. If a user needs to edit, the M365 Copilot app will transition to the standalone Word, Excel, or PowerPoint apps. Users of the M365 Copilot app will continue to be able to browse and search recent files in the app, but users seeking comprehensive file management features will be encouraged to utilize the OneDrive app. When users land in the M365 Copilot app Search experience and navigate to the My files, Libraries, or My device entry points a notification will appear promoting the use of the OneDrive app for these actions.\n</p><p>Detailed Change Log: Word, Excel, PowerPoint, M365 Copilot App \n</p><ul><li>Word, Excel, PowerPoint: The Microsoft 365 Copilot app for iPhone and iPad will a provide a Copilot powered preview experience for documents. Users can view content and use Copilot Chat for file queries. Users who wish to edit the file will be prompted to open or install the standalone apps.\n</li><li>M365 Copilot App: The M365 Copilot app has evolved to an AI-first productivity assistant that brings together productivity activity across Word, Excel, PowerPoint, Outlook and other Microsoft 365 apps. It gives your users the power of file previews and M365 Copilot chat in an experience that inherits all the security, identity and privacy policies you’ve set up in Microsoft 365.\n</li><li>iPad Inclusion: All changes described will now be rolled out simultaneously for iPad and iPhone.\n</li><li>Teams, OneDrive, Outlook iOS app integration: These apps on iPhone and iPad will continue to show users a preview of their Word, Excel and PowerPoint files. If users want to open and edit a Word, Excel, or PowerPoint file, they will now be directed to the respective standalone Word, Excel or PowerPoint app. The M365 Copilot app will no longer handle file open and edit operations from Teams, OneDrive or Outlook.</li><li> File Management: Searching for files within the M365 Copilot app will remain available. For advanced file management, users will be directed to the standalone OneDrive app. \n</li><li>Create Experience: Document creation in the M365 Copilot app will be available from chat. After file creation, users can view the file within M365 Copilot. Editing the document will transition to the standalone WXP apps. \n</li><li>Offline File Experience: For users who wish to make files available offline, please use the Word, Excel, PowerPoint, and OneDrive apps. \"Make Available Offline\" is being removed from the M365 Copilot app in favor of Copilot powered previewer experiences.\n</li><li>PDF Workflows: No changes. PDF handling continues as before in the M365 Copilot app.</li></ul><p><b>What you can do to prepare:&nbsp;</b>Updated Recommendations</p><p>•\tInform iOS and iPadOS users about the updated file experiences in the M365 Copilot app, and for users who have the need to edit WXP files on their mobile devices, encourage installation of the standalone Word, Excel, and PowerPoint apps.\n</p><p>•\tThe M365 Copilot app should continue to be available to end users as an AI-first productivity assistant. It brings together productivity apps and content with Copilot, Word, Excel, PowerPoint, and more.\n</p><p>•\tUpdate all internal documentation and training materials to reflect the revised file handling behavior for the M365 Copilot app across iPhone and iPad.\n</p><p>•\tFor organizations using mobile device management (MDM), push the standalone Word, Excel, PowerPoint, and OneDrive apps to manage iOS/iPadOS devices.\n</p><p>•\tJoin the iOS TestFlight program for the M365 Copilot app to get early access to changes\n</p><p>Learn more: Deployment guide: <a href=\"https://learn.microsoft.com/intune/intune-service/fundamentals/deployment-guide-platform-ios-ipados\" target=\"_blank\">Manage iOS/iPadOS devices in Microsoft Intune</a></p><p><b>Compliance considerations: </b>Impact on Workflows, Admin Controls, and Metrics</p><table border=\"1\">\n  <tbody><tr>\n    <th>Compliance Area</th>\n    <th>Impact</th>\n  </tr>\n  <tr>\n    <td>Does the change provide end users any new way of interacting with generative AI?</td>\n    <td>Users can interact with Word, Excel, and PowerPoint files via M365 Copilot Chat for summaries and insights. Preview and Copilot chat functionality is streamlined for documents and accessible on both iPhone and iPad.</td>\n  </tr>\n  <tr>\n    <td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n    <td>Editing Word, Excel, and PowerPoint files will no longer be available in the M365 Copilot app; users must use standalone apps for editing. WXP file preview and chat capabilities remain available in Copilot.</td>\n  </tr>\n  <tr>\n    <td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td>\n    <td>Admins can manage app deployment and access via Entra ID and MDM policies. The M365 Copilot app should remain in managed app stores for enterprise environments.</td>\n  </tr>\n</tbody></table>\n<p></p><p>The M365 Copilot app remains a necessary and supported solution for enterprise environments, providing preview and AI-powered chat experiences for Word, Excel, and PowerPoint files. Organizations should continue to manage and deploy the Copilot app to maintain access to Enterprise AI workflows.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot app for iOS will transition to AI-powered previewers for Word, Excel, and PowerPoint files, requiring standalone apps for editing. Rollout begins with TestFlight users in August-September 2025 and general availability by October 13, 2025. OneDrive app is recommended for advanced file management."
    }
  ],
  "EndDateTime": "2026-01-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1136042",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-27T13:21:38.557Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-15T22:49:34Z",
  "Tags": [
    "Updated message",
    "New feature"
  ],
  "Title": "Streamlined file preview experience in Microsoft 365 Copilot app for iOS",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
