{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b>Introduction</b>\n<p>We’re improving the admin experience for Microsoft Teams Calling Plans SMS by introducing new self-service capabilities, a proactive validation layer, and clearer campaign status flows. These updates reduce delays, improve transparency, and help organizations meet industry requirements more efficiently.</p>\n\n<b>When this will happen</b>\n<p>This feature update is available now.</p><p><b>How this affects your organization</b></p><p>If your organization uses Microsoft Teams Calling Plans SMS in the United States (including Puerto Rico) or Canada, excluding GCCH and sovereign clouds, this update enhances the campaign management experience in the Teams Admin Center:</p>\n\n<ul>\n  <li><b>New self-service rejection handling</b>\n    <ul>\n      <li>Rejected campaigns are no longer routed to Microsoft support by default.</li>\n      <li>You can now view rejection reasons and resubmit campaigns—up to <b>four times</b>—directly in the Teams Admin Center.</li>\n      <li>A new campaign status, <b>Customer Update Pending</b>, indicates that admin action is required. Admins can open the campaign side panel, review rejection reasons, update the form, and resubmit.</li>\n      <li>The <b>brand main contact</b> will continue to receive email notifications for all campaign status changes, including the new Customer Update Pending status.</li>\n    </ul>\n    <p><b style=\"\">Note:</b><i> </i>Existing campaigns currently being handled by Microsoft support will continue to be processed. In the coming days, remaining campaigns will be handed over to customers for self-service management.</p>\n  </li>\n\n  <li><b>Submission attempt logic clarified</b>\n    <ul>\n      <li>A submission attempt is only counted after Microsoft validates the campaign and forwards it to the SMS aggregator.</li>\n      <li>After four valid submission attempts, the campaign enters a <b>Denied</b> state and cannot be resubmitted.</li>\n      <li>We strongly recommend reviewing the Microsoft Learn article&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/sms-setup-campaign\" target=\"_blank\">Create a Campaign for SMS in Microsoft Teams&nbsp;elements</a> before resubmitting.</li>\n    </ul>\n  </li>\n\n  <li><b>New Microsoft Validation layer</b>\n    <ul>\n      <li>Campaigns now pass through a Microsoft Validation layer before being submitted to its downstream partners.</li>\n      <li>This proactive screening helps catch issues earlier and accelerate time to approval.</li>\n    </ul>\n    <p><b style=\"\">Note<i>:</i></b><i> </i>A few rejection scenarios will continue to be processed by Microsoft support.</p>\n  </li>\n</ul>\n\n<p><i>Figure i. Submission Updated campaign flow</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/291f1cfb-50a7-416b-8126-7e1a881f2ae4\" style=\"width: 400px;\" alt=\"user settings\"></p><p>These changes apply only to the <b>campaign management</b> step. Brand registration and phone number activation remain unchanged.</p>\n\n<b>What you can do to prepare</b>\n<ul>\n  <li>Review the updated documentation: <a href=\"https://learn.microsoft.com/microsoftteams/sms-setup-campaign\" target=\"_blank\">Create a Campaign for SMS in Microsoft Teams.</a>.</li>\n  <li>If you are the brand contact, you will receive an email with the new <b>Customer Update Pending</b> status and the rejection reasons.</li>\n  <li>Careful review rejection reasons and campaign requirements before resubmitting.</li>\n</ul>\n\n<b>Compliance considerations</b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Calling Plans SMS now offers self-service campaign rejection handling, a proactive Microsoft validation layer, and clearer status updates like \"Customer Update Pending.\" Admins can view rejection reasons, resubmit campaigns up to four times, and manage approvals directly in the Teams Admin Center, improving transparency and efficiency."
    }
  ],
  "EndDateTime": "2025-09-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134740",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T23:13:23.157Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-13T23:12:31Z",
  "Tags": [
    "Feature update"
  ],
  "Title": "Streamlining SMS campaign approvals in Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
