{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\nWe're introducing <i>User-Based Alert Aggregation</i> in <i>Microsoft Purview Data Loss Prevention (DLP)</i> to help security teams triage alerts more efficiently. This feature consolidates DLP rule match events by user identity within a defined time window, enabling faster investigation and remediation of potential insider threats.</p>\n<p> This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501786\">501786</a>.</p>\n<p><b><b>When this will happen:</b></b></p><p>Public Preview: We will begin rolling out late September 2025 and expect to complete by early October 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late October 2025 and expect to complete by early November 2025.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n</ul><p><b>Who is affected:</b> Admins managing DLP policies in <i>Microsoft Purview compliance portal</i>.</p><ul>\n</ul><p style=\"\"><b>What will happen:</b>\n  </p><ul>\n    \n    \n    </ul><p></p><ul><li>This feature is <b>opt-in</b> and can be enabled via the <i>Microsoft Purview compliance portal</i>.</li><li>Navigate to <i>Settings &gt; Data Loss Prevention &gt; User-Based Alert Aggregation</i>.</li><li>Toggle on <i>User-Based Aggregation</i> and select an aggregation time window (minimum 15 minutes).</li></ul><p><img src=\" https://cxcs.microsoft.net/file/ccp/en-us/6494ee6e-d5b3-4d79-8fe7-62b2f280e5b9\" style=\"width: 400px;\" alt=\"user settings\"></p><ul><li>DLP rule match events for the same user and rule within the selected window will be grouped into a single alert.</li><li>Alerts will be created per user and per rule. For example, if <i>User A</i> and <i>User B</i> violate the same rule within 15 minutes, two separate alerts will be generated.</li><li>Alert volume may increase due to per-user aggregation.</li><li>Events will continue to be added to an alert even if it is marked resolved or closed, as long as the aggregation window is active.</li></ul>\n\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No preparation is required unless you choose to enable the feature.</li>\n<li>To opt in:\n  <ul>\n    <li>Go to <i>Microsoft Purview compliance portal</i>.</li>\n    <li>Navigate to <i>Settings &gt; Data Loss Prevention &gt; User-Based Alert Aggregation</i>.</li>\n    <li>Toggle on the feature and select your preferred aggregation time window.</li>\n    <li>Review internal documentation and communicate the change to your security operations team.</li></ul></li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501786"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview DLP introduces opt-in User-Based Alert Aggregation, consolidating alerts by user within a set time window to improve security triage. Rolling out from September to November 2025, admins can enable it in the compliance portal to group rule match events per user, enhancing investigation efficiency."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-12T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1148528",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-05T21:54:06.467Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-05T21:53:42Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Data Loss Prevention: User based alert aggregation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
