{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing support for sharing files protected with Microsoft Purview Information Protection sensitivity labels across Microsoft 365 cloud boundaries. This includes Worldwide, GCC High, and Microsoft 365 operated by 21Vianet. This enhancement enables secure collaboration across previously siloed environments, allowing recipients to view, edit, print, and more, based on the rights assigned by the document owner.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=495000\" target=\"_blank\">495000</a>.</p><p><b>When this will happen</b></p><p>Public Preview (Worldwide): Begins mid-August 2025, completes by late September 2025</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Begins late September 2025, completes by late October 2025</p><p><b>How this affects your organization</b></p><p>Organizations that need to collaborate across Microsoft 365 cloud boundaries will now be able to share Purview-encrypted documents securely. Once configured, recipients in other clouds will be able to access content based on the assigned rights. This feature is <b>off by default</b> and requires configuration to enable cross-cloud sharing.</p><p><b>What you can do to prepare</b></p><ul><li>Review the <a href=\"https://aka.ms/Purview/CrossCloudDocs\" target=\"_blank\">configuration and deployment guidance</a>.</li><li>Ensure your organization’s compliance and security teams are aware of the new sharing capabilities.</li><li>Plan for any necessary training or documentation updates for users who collaborate across cloud boundaries.</li></ul><p><b>Compliance considerations</b></p><p></p><p></p><table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Impact</th></tr>\n<tr>\n\n</tr>\n<tr>\n\n</tr>\n<tr>\n<td>Does the change include an admin control and, can it be controlled through Entra ID group membership? Admin and group based on cross-tenant access settings.</td>\n<td>&nbsp;Admins must configure the feature; Entra ID group membership can be used to manage access</td>\n</tr>\n<tr>\n\n</tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "495000"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Information Protection will support sharing sensitivity-labeled files across Microsoft 365 clouds (Worldwide, GCC, GCC High, 21Vianet). Public preview starts mid-August 2025; general availability by late October 2025. The feature is off by default and requires admin configuration with Entra ID group controls."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1147390",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-03T23:26:02.853Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-03T23:25:54Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Purview Information Protection - Support for Cross Cloud Protected Files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
