{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 30, 2025: We have updated the content. Thank you for your patience.</p><p><b><b>Introduction</b></b></p>\n<p>Starting in late October 2025, Microsoft will begin automatically installing the Microsoft 365 companion apps—<i>People</i>, <i>Files</i>, and <i>Calendar</i>—on Windows 11 devices that already have Microsoft 365 desktop client apps. These taskbar-integrated apps are designed to streamline everyday workflows, helping users stay focused, reduce context switching, and complete tasks faster.</p><p></p><p>With Copilot integration, users can ground their prompts in the right context—whether it’s a shared file, a meeting, or a collaborator. This integration allows users to catch up, summarize, and take action more efficiently.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486856\" target=\"_blank\">486856</a>.</p>\n\n<p><b><b>When this will happen:</b></b><b><br></b></p><p><b>General availability</b>: Rollout begins late October 2025 and is expected to complete late December 2025.</p><p><b><b>How this affects your organization:</b></b><b><br></b></p><p><b>Who is affected:</b> </p><p>All users on Windows 11 devices with Microsoft 365 desktop client apps.</p><p><b>What will happen:</b>\n  \n</p><ul><li>Microsoft 365 companion apps (<i>People</i>, <i>Files</i>, <i>Calendar</i>) will be automatically installed.</li><li>Admins can opt out of automatic installation via <i>Device Configuration</i> settings.<ul>\n  </ul></li><li>If <i>Copilot pinning</i> is not yet enabled, admins will be able to pin both <i>Copilot </i>and companion apps starting mid-October.</li><li>If you’ve already enabled <i>Microsoft 365 Copilot pinning</i> in the Microsoft 365 Admin Center, note that companion apps are not included in the pinning configuration at this time but you will be able to enable companions pinning starting mid-October.<ul>\n    </ul></li><li>On devices where the apps are already installed, no visible change will occur.<ul>\n    </ul></li><li>Installation is <b>enabled by default</b> and does not require user interaction.<ul>\n    </ul></li><li>Apps will appear in the <i>Start menu</i> and provide quick access to people, files, and calendar data from the Microsoft Graph.</li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>Notify users about this change via an internal announcement to set expectations.\n</li><li>Update any relevant internal documentation to reflect the availability of these apps.\n</li><li>If you want to opt out of automatic installation:\n<ol><li><a href=\"https://config.office.com/officeSettings\" target=\"_blank\">Go to <i>Microsoft 365 App Admin Center.</i></a></li><li>Navigate to <i>Customization -&gt; Device Configuration.</i></li><li>Select <i>Modern App settings\n</i></li><li>Choose <i>Microsoft 365 companion apps</i></li><li>Uncheck <i>Enable automatic installation of Microsoft 365 companion apps and Microsoft 365 Apps</i></li></ol></li><li>Learn more: <a href=\"https://go.microsoft.com/fwlink/?linkid=2302123\" target=\"_blank\">Overview of Microsoft 365 companion apps - Microsoft 365 Apps | Microsoft Learn</a></li><li>Check out the latest features here: <a href=\"https://go.microsoft.com/fwlink/?linkid=2310491\" target=\"_blank\">Get Started with Microsoft 365 companion apps | Microsoft Support</a></li></ul><p><b>App highlights:</b></p><p><i>People </i>app features:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1ab1216e-e6b3-456b-b381-4e13b74a9326\" alt=\"user settings\" style=\"width: 400px;\"></p><ul><li>Look up colleagues by name, skills, role, location and more.</li><li>View profile cards, availability, and organizational charts. \n</li><li>Send messages and start chats.  \n</li><li>Use Copilot to ask people-related questions like, <i>What does this person work on?</i>&nbsp;or <i>Draft a message to catch up</i>. \n</li><li>Type freeform prompts for any colleague directly in the app. \n</li></ul><p><i>File </i>app features: \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/9b2249a8-a8d7-4d30-a0fa-57dc641621ab\" alt=\"user settings\" style=\"width: 400px;\"></p>\n<ul></ul><p></p><ul><li>Find Microsoft 365 and locally downloaded files.</li><li>Preview file content and share with colleagues. \n</li><li>Filter by person, file type, or activity (<i>Created</i>,<i> Shared</i>,<i> Edited</i>, or <i>@Mentioned</i>). \n</li><li>Use Copilot to summarize, catch up, and act on files.</li></ul><p style=\"\"><i>Calendar </i>app features:&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/231dc5b0-4b22-4bd0-b648-a4207ad7a90d\" alt=\"user settings\" style=\"width: 400px;\"></p><ul><li>Find events by organizer, attendees, or title.&nbsp;</li><li>View agenda or day at a glance.&nbsp;</li><li>Open meeting details and join directly from the calendar.&nbsp;</li><li>Edit meetings, chat with participants, or copy the meeting link.&nbsp;</li><li>Use Copilot to prepare for upcoming meetings or catch up on missed ones.</li></ul><p><br></p><p></p><p><b><b>Compliance considerations:</b></b></p><table border=\"1\">\n<tbody><tr><th>Question</th><th>Explanation</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td><i>Copilot</i> integration enables contextual AI-driven assistance based on user data such as files, meetings, and contacts.</td></tr>\n<tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Users can interact with <i>Copilot Companions</i> directly from the taskbar using contextual prompts grounded in <i>Microsoft Graph</i> data</td></tr>\n\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Users can pin or unpin the apps from the taskbar once available.</td></tr>\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486856"
    },
    {
      "Name": "Summary",
      "Value": "Starting late October 2025, Microsoft 365 companion apps—People, Files, and Calendar—will auto-install on Windows 11 devices with Microsoft 365 apps, integrating Copilot for contextual AI assistance. Admins can opt out via Device Configuration. Apps enhance productivity by streamlining access to contacts, files, and meetings."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1160180",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-30T21:37:36.483Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-26T18:06:13Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "NEW Microsoft 365 companion apps: a suite designed to enhance productivity",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
