{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new map-based desk booking experience in Microsoft Places that replaces the existing reservation flows in the Places app and calendar across desktop and mobile. This update enhances usability, supports both individually configured and pooled desks, and introduces new capabilities to improve workplace flexibility and collaboration.</p><p>This message is associated with Microsoft 365 Roadmap IDs&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488802\" target=\"_blank\">488802</a>, <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488803\" target=\"_blank\">488803</a>, <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488804\" target=\"_blank\">488804</a>, <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488805\" target=\"_blank\">488805</a> and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=488809\" target=\"_blank\">488809</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out in mid-August 2025 and expect to complete by end of September 2025.</p><p><b>How this will affect your organization</b></p><p>This update introduces a refreshed user experience for desk booking in Microsoft Places for users with users with a <b>Teams Premium license</b>. It replaces the existing desk reservation flows in the Places app and calendar across desktop and mobile platforms.\n</p><p>The new experience is available to <b>Microsoft 365 tenants</b> that have <b>enabled desk reservation through Microsoft Places</b>. It enhances usability and flexibility for hybrid work scenarios by offering:\n</p><ul><li>A unified desk booking interface across the calendar (New Outlook, Teams, OWA) and the Places app (web and connected app in Teams/Outlook)\n</li><li>Interactive floor maps with fixture support, including fallback functionality for floors without uploaded maps\n</li><li>The ability to view colleagues’ seating locations and reserve nearby desks (visibility is user-controlled)\n</li><li>Support for partial-day and multi-day desk reservations\n</li><li>Delegation capabilities for executive assistants or delegates to reserve desks on behalf of others</li><li>Admin-configurable check-in requirements, with automatic release of unclaimed desks\n</li><li>Support for both assigned desks (for specific users) and drop-in desks (non-reservable, real-time availability shown)\n</li></ul><p><b>Licensing: </b>This is a user experience update to an existing feature and requires a Teams Premium license. Users without a license will not see the feature in the UI. A trial or preview option is not currently available.</p><p><b>Access control:</b>&nbsp;No changes. Admins can continue to manage access using existing policy settings or Entra ID group membership.</p><p><b>Dependencies: </b>Uploading floor maps is optional but recommended to enable the full visual experience. A fallback experience is available for floors without uploaded maps.</p><p><b>Note:</b>&nbsp;Legacy desk booking via the calendar’s event form (supporting only workspaces/desk pools) remains available and does not require Microsoft Places or Teams Premium.</p><p><b>What you need to do to prepare</b></p><p>No admin action is required before rollout. However, to maximize the benefits of the new experience, we recommend:\n</p><ul><li>Communicating the update to users who reserve desks via the Places app or calendar (New Outlook or Teams)</li><li>Uploading floor maps with fixtures to enable the full visual experience</li></ul><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change store new customer data?&nbsp;</td><td>The new desk booking experience stores desk reservation data, including user location preferences and shared visibility settings. This data is stored within Microsoft 365 services and may be cached for performance optimization.</td></tr><tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Desk reservation data is now processed to support map-based visualization and colleague proximity features. This includes accessing user reservation details to display desk occupancy on maps.</td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>The system uses intelligent logic to surface desk availability and colleague proximity, which may involve AI-based recommendations or filtering based on user preferences and historical data.</td></tr><tr><td>Does the change provide a new way of communicating between users, tenants, or subscriptions?</td><td>Users can now optionally share their desk reservation information with colleagues, enabling a new form of workplace visibility and coordination.</td></tr><tr><td>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights)?</td><td>Users have control over whether their desk reservation data is visible to others, and can modify or delete their reservations, aligning with GDPR data subject rights.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?&nbsp;</td><td>Admins can configure desk reservation policies, including check-in requirements and desk assignment rules. These controls can be scoped using Entra ID group membership.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?&nbsp;</td><td>Users can choose whether to share their desk reservation details and can opt in or out of visibility features within the Places app or calendar interface.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488802,488803,488804,488805,488809"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Places introduces a new map-based desk booking experience for Teams Premium users, unifying desk reservations across apps with interactive floor maps, colleague seating visibility, partial/multi-day bookings, delegation, and admin check-in controls. Rollout begins mid-August 2025, enhancing hybrid work flexibility without requiring admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1124563",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-30T00:01:13.947Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T00:01:10Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365: New map-based desk booking experience in Microsoft Places",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
