{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 11, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>We’re updating the product licensing experience in the Microsoft Admin Center to make it easier for admins to distinguish between direct and group-based license assignments. This update improves clarity and performance on the product licensing pages (Billing &gt; Licenses), helping you quickly understand how licenses are assigned and to whom.</p><p><b>When this will happen:</b>\n</p><p>Rollout will begin in late June 2025 and is expected to complete by late September 2025 (previously late July).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Admins will see a new layout on the product licensing pages:\n</p><ul><li>Users with directly assigned licenses will appear in the User tab.\n</li><li>Users assigned via Group-Based Licensing (GBL) will appear in the Groups tab.\n</li></ul><p>To view users assigned via GBL, select the group name from the list of group assignments for that product, then navigate to the Successfully assigned tab.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/ee8b2edf-39de-43c0-a98c-3821b3dce9a6/e41d44e562a72a16ade566381b6e9fb2fa341718.png\" width=\"400\" height=\"\"></p><p>\n</p><p>This change is designed to improve page load performance and make license assignment paths more intuitive.\n</p><p><b>What you can do to prepare:</b>\n</p><p>Review and update any internal documentation, training materials, or processes that assume all license assignments appear in the User tab. After this update, license assignments will be split between the User and Groups tabs based on how the license was assigned.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Admin Center will update product licensing pages by late September 2025, separating direct license assignments (User tab) from group-based assignments (Groups tab) to improve clarity and performance. Admins should update documentation and training to reflect this new layout."
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102762",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-11T21:14:28.347Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-24T23:46:35Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Updates to user and group assignment views on the Microsoft Admin Center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
