{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce the general availability of Microsoft Security Copilot in Intune, a powerful AI-driven experience that transforms how you manage and protect endpoints. With this release, we have embedded generative AI directly into the Intune admin center, allowing you to streamline daily tasks, uncover insights, and take action faster, all through natural language.</p><p>Learn more about this new capability in the blog: <a href=\"https://aka.ms/Intune/CopilotJuly2025\" target=\"_blank\">Copilot in Intune deep dive – Part 3: Explore and Act on your Intune data with AI</a></p><p><b>How this will affect your organization:</b>\n</p><p>Powered by Security Copilot, IT admins gain access to a new Explorer page in the Intune admin center. This AI-first experience allows admins to ask natural language questions across Intune resources to quickly troubleshoot, create custom reports, take direct action from query results, and more. This new capability enhances operational agility by simplifying endpoint management and accelerating day-to-day tasks with AI-powered assistance.</p><p><b>What you need to do to prepare:</b>\n</p><p>To start using the new Explorer page, you will need to enable Security Copilot. Note that to enable Security Copilot you must be an Azure owner or contributor and an Intune administrator. For more information on enabling Security Copilot and using the new Explorer review:\n</p><ul><li><a href=\"https://learn.microsoft.com/copilot/security/get-started-security-copilot\" target=\"_blank\">Get started with Microsoft Security Copilot</a> \n</li><li><a href=\"https://learn.microsoft.com/intune/intune-service/copilot/copilot-intune-overview\" target=\"_blank\">Microsoft Copilot in Intune</a> \n</li><li><a href=\"https://learn.microsoft.com/intune/intune-service/copilot/copilot-intune-explorer\" target=\"_blank\">Explore Intune data and get Microsoft Copilot recommendations</a> \n</li><li><a href=\"https://aka.ms/Intune/CopilotJuly2025\" target=\"_blank\">Copilot in Intune deep dive – Part 3: Explore and Act on your Intune data with AI</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Security Copilot in Intune is now generally available, providing AI-driven capabilities to manage and protect endpoints. IT admins can use natural language to troubleshoot, create reports, and take actions. To use the new Explorer page, enable Security Copilot as an Azure owner or contributor and Intune administrator."
    }
  ],
  "EndDateTime": "2025-08-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1115296",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-14T23:49:59.127Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-14T23:49:50Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Security Copilot in Intune is now generally available with new ways to explore and act on your Intune data",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
