{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>\n</p>\n<p><b>Introduction\n</b></p><p>We’re introducing a new Workflows experience in Microsoft Teams that is rebuilt from the ground up based on feedback.&nbsp;</p><p>The Workflows app helps you automate repetitive tasks and streamline everyday processes across Teams and Microsoft 365. Whether you're scheduling messages, managing approvals, syncing updates across apps, or triggering actions from chat messages, Workflows makes it easy to build automations in just a few clicks. It’s powered by Power Automate and designed to help you stay focused on what matters most.</p><p>This new version addresses previous concerns around complexity and performance, delivering a faster, more intuitive, and streamlined interface. With the updated experience, users can now create powerful automations in three steps or fewer.</p><p>This release is part of our broader effort to make automation more accessible and impactful for every information worker. Whether you're new to automation or a seasoned pro, the new Workflows app is designed to meet you where you work—and help you get more done with less effort. This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=491632\" target=\"_blank\">491632</a>.</p><p>\n<b>When this will happen</b></p><ul><li><b>Public Preview &amp; Targeted Release: </b>We will begin rolling out August 2025.\n</li><li><b>General Availability (Worldwide): </b>We will begin rolling out in September 2025.</li></ul><p></p><p><b>How this affects your organization\n</b></p><p>The new Workflows experience is designed to reduce complexity and improve usability. It introduces:\n</p><ul><li>A streamlined, performant user interface that works across Teams chats, channels, and SharePoint lists and libraries.</li><li>A redesigned template library for faster discovery of common workflows.</li><li>Natural language-to-flow capabilities that allow users to describe what they want to automate.</li><li>A Madlib-style editor that simplifies customization using plain language and dynamic placeholders.</li></ul><p>Under the hood, the new Workflows experience is still powered by Power Automate—so you get the same enterprise-grade reliability, security, and extensibility you trust. This update does not impact existing workflows or internal compliance processes. The feature will be on by default and requires no admin configuration.\n</p><p><i>i. Workflows v2 Home Page Experience:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e2b83b9f-093b-4197-9a25-847331c4f2ae/737b8d4fec61bcda636eb30cf6fdb1d3870af523.png\" style=\"width: 400px;\" alt=\"Screenshot of Workflows v2 Home Page Experience.\">&nbsp;</p><p><i>ii. Workflows v2 Template Catalog Experience:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e7a4cf05-3f32-4740-8cab-261c911ae8fe/7f9dec884f355780d28f86a835971cbb860eae23.png\" style=\"width: 400px;\" alt=\"Screenshot of Workflows v2 Template Catalog Experience.\">&nbsp;</p><p><b>What you can do to prepare\n</b></p><p>No admin action is required at this time, but you can:</p><ul><li>Inform users about the upcoming changes to the Workflows experience in Teams and SharePoint.</li><li>Reassure users that existing workflows and policies will remain unaffected.</li></ul><p>Learn more:</p><ul><li><a href=\"https://support.microsoft.com/en-us/office/browse-and-add-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a\" target=\"_blank\">Browse and add workflows in Microsoft Teams - Microsoft Support</a> - will be updated before WW rollout</li><li><a href=\"https://support.microsoft.com/en-us/office/add-or-run-a-workflow-from-a-message-in-microsoft-teams-921ce26d-265e-401e-b062-06dd3ae2f0c5\" target=\"_blank\">Add or run a workflow from a message in Microsoft Teams</a> - Microsoft Support - will be updated before WW rollout</li><li><a href=\"https://support.microsoft.com/en-us/office/add-or-run-a-workflow-from-the-messaging-area-in-microsoft-teams-09bd60e1-8cae-4a11-9322-5fe7a15c5c24\" target=\"_blank\">Add or run a workflow from the messaging area in Microsoft Teams - Microsoft Support</a> - will be updated before WW rollout</li><li><a href=\"https://support.microsoft.com/en-us/office/add-or-run-a-workflow-in-chats-chat-messages-channels-and-channel-posts-in-microsoft-teams-242eb8f2-f328-45be-b81f-9817b51a5f0e\" target=\"_blank\">Add or run a workflow in chats, chat messages, channels, and channel posts in Microsoft Teams - Microsoft Support</a> - will be updated before WW rollout</li><li><a href=\"https://support.microsoft.com/en-us/office/creating-a-workflow-from-a-chat-in-teams-e3b51c4f-49de-40aa-a6e7-bcff96b99edc\" target=\"_blank\">Creating a workflow from a chat in Teams - Microsoft Support</a> - will be updated before WW rollout</li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "491632"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is launching a redesigned Workflows app in August 2025, improving automation with a faster, simpler interface powered by Power Automate. It features natural language flow creation, a new template library, and works across chats, channels, and SharePoint, requiring no admin setup and preserving existing workflows."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1121517",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-25T00:44:19.287Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-25T00:44:11Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Introducing the New Workflows Experience in Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
