{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>\nWith the rollout of <i>Preview</i> in <i>Manage what attendees see</i>, Teams town hall has now reached full feature parity with Teams live events. We’re encouraging all Teams live events users to make the switch and take advantage of the richer, more flexible capabilities available in town hall—like enhanced presenter controls, streaming attendee chat, reactions, and improved attendee experiences. Now is the time to transition and prepare your organization for the future of large-scale virtual events.</p>\n\n<p>This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web and is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=487431\" target=\"_blank\">487431</a>.</p>\n\n<p><b>When this will happen</b></p><p>This transition is now supported. The <i>Manage what attendees see</i> feature is available, and Teams Town Hall is ready for full adoption across your organization.</p><p><b>How this affects your organization</b></p><p>\nThere is no immediate impact to you or current Teams live events users. However, Teams town hall offers a more modern and engaging experience for large-scale virtual events. Organizations are encouraged to begin transitioning to Teams town hall to prepare for future deprecation of Teams live events.</p>\n\n<p><b>What you can do to prepare</b></p><p>Ensure that your <a href=\"https://learn.microsoft.com/microsoftteams/set-up-town-halls\" target=\"_blank\">IT policy is enabled</a> for Teams town halls.</p><p><!--<p--><b>Compliance considerations</b></p><p></p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Impact</th></tr>\n<tr><td>Admin control available</td><td>IT admins can enable Teams town hall via policy settings.</td></tr>\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "487431"
    },
    {
      "Name": "Summary",
      "Value": "Teams Town Hall now matches Teams Live Events in features, offering enhanced controls and attendee experiences. Users are encouraged to transition to Town Hall, as it supports large-scale virtual events and will replace Live Events in the future. Enable IT policies to prepare for this change."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1154302",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-16T22:25:59.68Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-16T22:25:50Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Transition to Teams Town Hall from Teams Live Events",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
