{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 13, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b>\n</p><p>We're introducing new capabilities in Copilot Pages and Copilot Chat that enable improved connection and interactions between these two experiences. There are four main elements included in this update: </p><ol><li>Page creation via Chat, where an intent to create a Copilot Page in a Chat prompt will automatically create that page. </li><li>Page updates via Chat, where a prompt to modify or add to the currently-open Page will make those changes directly on the Page. </li><li>Chat can now answer questions based on the content of the open Page. </li><li>Improved on-Page Copilot interactions, including Ask Copilot for selecting content and the use of Page-level improvements via the Copilot Shortcuts experience.</li></ol>\n\n<b><b>When this will happen:</b></b>\n<p>General Availability (Worldwide): We will begin rolling out in early October 2025 and expect to complete by early February 2026 (previously early November 2025).</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> Users with access to Copilot in Microsoft 365 who use Copilot Pages and Copilot Chat in side-by-side mode.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will be able to create new pages in Chat when they use language that implies that a new Page is desired (e.g., \"Create a Page to help me...\")</li><li>If a Page is already open, they can use Chat to request updates to the page (e.g., \"Update the introduction to be more formal\")</li><li>Users will be able to ask questions in Copilot Chat about the currently open page in Copilot Pages and Copilot will respond using the content of the open page to provide contextual answers.</li><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/d61b1bd2-71b9-484d-a207-e3362a235b41/95c4bbb201db9ba153d0acd20845f78b0b8d6299.png\" style=\"width: 400px;\" alt=\"user settings\">\n    <li>Copilot will respond using the content of the open page to provide contextual answers.</li><li>Users can use on-Page experiences like Ask Copilot (available by selecting content and either right-clicking or using the floating menu experience) and Copilot Shortcuts (available in the bottom corner of the Page)</li>\n    <li>The feature will be ON by default for eligible tenants to configure.</li>\n    <li>Existing admin policies are respected; no policy changes are required.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Communicate this change to helpdesk and support staff.</li>\n<li>Update internal documentation or training materials that reference Copilot Pages or Chat functionality.</li>\n<li>Review user guidance to ensure users understand how to use Copilot effectively in side-by-side mode.</li></ul><p>Learn more:&nbsp; <a href=\"https://learn.microsoft.com/microsoft-365/loop/cpcn-admin-configuration?view=o365-worldwide\" target=\"_blank\">Manage Copilot Pages and Copilot Notebooks in your organization | Microsoft Learn</a></p><ul>\n</ul>\n\n<b><b>Compliance considerations</b></b>\n<p>No compliance considerations identified, all <a href=\"https://learn.microsoft.com/microsoft-365/loop/cpcn-compliance-summary?view=o365-worldwide\" target=\"_blank\">compliance capabilities</a> will be the same as the <a href=\"https://support.microsoft.com/topic/get-started-with-microsoft-365-copilot-pages-6674bd51-9ff5-42c4-9256-44d9428a726f\" target=\"_blank\">Microsoft 365 Copilot Pages experience</a>.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "487848"
    },
    {
      "Name": "Summary",
      "Value": "M365 Copilot Chat now creates and updates Copilot Pages via chat prompts, answers questions based on the open page content, and offers improved on-page interactions. The feature rolls out worldwide from October 2025 to February 2026, is on by default, respects existing policies, and requires user communication and training updates."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1173931",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-13T22:28:40.01Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-16T22:56:58Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Copilot Pages: New feature—M365 Copilot Chat can now answer questions about the currently open page",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
