{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 14, 2025: We have updated the timeline. Thank you for your patience.\n</p><p><b>Introduction</b></p><p>We're introducing a new self-service capability in the Teams Admin Center (TAC) that allows Teams Phone administrators to resolve and resubmit certain porting order rejections without needing to contact Microsoft support. This enhancement improves efficiency and reduces turnaround time for common porting issues, while preserving the existing support experience for more complex cases.</p><p><b>When this will happen</b></p><p><b>General Availability:</b> We will begin rolling out in<b>&nbsp;mid-August 2025</b> (previously early August)<b> </b>and expect to complete by<b> late August&nbsp;2025 </b>(previously early August).</p><p><b>How this will affect your organization</b></p><p>This update streamlines the current porting experience in TAC without removing any existing features. Administrators will now be able to use the existing porting wizard not only to submit new porting orders but also to fix and resubmit certain rejected orders.\n</p><p>When a porting order is rejected for a fixable reason—such as an incorrect ZIP code or missing PIN—administrators will:\n</p><ul><li>Receive an email notification.\n</li><li>See a prompt on the order's detail page in TAC.\n</li><li>Be guided through the porting wizard to correct and resubmit the order.\n</li></ul><p>This self-serve experience is designed to feel familiar and intuitive, minimizing disruption. Rejections that require partner coordination or are otherwise ineligible for self-service will continue to be handled by Microsoft support.\n</p><p>This feature is:\n</p><ul><li>On by default\n</li><li>Available to all tenants\n</li><li>Accessible to Teams Phone administrators with appropriate permissions\n</li></ul><p>Admins can still contact Microsoft support if needed.&nbsp;</p><p><b>Steps to resolve a rejected porting order in Teams Admin Center</b></p><p>To fix and resubmit a rejected porting order:</p><p style=\"\">a. Navigate to Teams Admin Center.&nbsp;\n</p><p style=\"\">b. In the left navigation, expand the <b>Voice&nbsp;</b>drawer and select&nbsp;<b>Phone numbers:</b></p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/15454878-a601-400c-ae8c-477acc64a91b/a42ee9b0cc705d20021ac0bdcab3b0e1f6990f88.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p>c. On the <b>Phone numbers&nbsp;</b>page, select the<b>&nbsp;Order history</b>&nbsp;tab. If an order requires customer attention, its status will show <b>Customer action required</b>.</p><p>d. Click the name of the order to open its details:</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/2485d7ab-1574-4ad8-acb9-e3788ad8167a/2e18c80fb08e7921fbe0f7ce34619697ae22eb88.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p>e. In the order details page, select <b>Update</b> to correct the issue and resubmit the order:</p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/b137f731-8315-44d8-8331-7075c37540e9/ee2f882cc841b5724bbc295f0b2e98162c6f7f1b.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b>Steps to contact Microsoft support</b></p><p>a. If your order status is <b>Microsoft Support Engaged</b>, it means that your order already has an associated support ticket. On the order details page, select the <b>Contact service desk</b>&nbsp;hyperlink and navigate to the associated ticket.&nbsp;</p><p>b. If your order status is&nbsp;<b>Customer action required</b>, you will need to create a new support ticket. Here are the steps:</p><ol><li>On the <b>Order Details </b>page, select the <b>Action </b>dropdown and select <b>Get support</b>.</li><li>On the support home page, select <b>Create ticket</b></li><li>On the Create ticket page, fill in your Title, Description, Country.</li><li>Ensure your <b>Case Type</b> is \"Port in\"<b> </b>and your <b>Case Creation Reason</b> is \"Question about existing request\"</li></ol><p><b>What you need to do to prepare</b></p><ul><li>Review the updated guidance on porting numbers to Teams:&nbsp;<a href=\"https://learn.microsoft.com/MicrosoftTeams/phone-number-calling-plans/transfer-phone-numbers-to-teams?tabs=new-porting-wizard\" target=\"_blank\">Submitting a port request | Microsoft Learn</a>.&nbsp;</li><li>No additional configuration is required to enable this feature.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Admin Center will roll out a self-service feature by late August 2025 allowing Teams Phone admins to fix and resubmit certain rejected porting orders without contacting support. Notifications and prompts guide admins through corrections using the existing porting wizard. Complex cases still require Microsoft support."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1119404",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-15T14:19:31.607Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-21T23:29:59Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams | New in Admin Center: Self-Serve Fixes for Porting Rejections",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
