{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re introducing a new <b>Permissions report</b> in the SharePoint admin center under <b>Data access governance</b>. This report helps SharePoint admins quickly identify which sites a specific user can access, including whether access is granted directly or through group membership. This feature supports investigations and permission reviews, especially before assigning Copilot licenses.</p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=492621\" target=\"_blank\" style=\"\">492621</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide, GCC, GCCH, DoD): Rollout begins mid-December 2025 and completes by mid-January 2026.</p>\n<p><b><b>How this affects your organization:</b></b></p><ul>\n<li><b>Who is affected:</b> SharePoint administrators managing site permissions and access.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>A new <b>Permissions report</b> will be available in the SharePoint admin center under <b>Data access governance</b>.</li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/7ddac865-7a97-4138-872a-aac88b098601\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li>The report lists all SharePoint sites a user can access, including whether access is full-site or limited to sections.</li>\n<li>Access details include whether permissions were granted directly or via group membership.</li>\n<li>This feature is enabled by default; no additional configuration is required.</li>\n</ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Review your current site permissions configuration to understand potential exposure.</li>\n<li>Notify your SharePoint administrators about the new portal-based access report.</li>\n<li>Update internal documentation and workflows to reflect this change.</li>\n</ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/data-access-governance-site-permissions-users-report\" target=\"_blank\">Discover sites accessible by a given user with the snapshot report</a></p><ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "492621"
    },
    {
      "Name": "Summary",
      "Value": "A new Permissions report in the SharePoint admin center (under Data access governance) will show which sites a user can access, including direct or group-based permissions. Rolling out worldwide from mid-December 2025 to mid-January 2026, it requires no configuration and aids permission reviews."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-02-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1197128",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-15T20:09:34.053Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-15T20:09:30Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "New permissions report available in SharePoint admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
