{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated&nbsp;February 4, 2026: We have updated the timeline.&nbsp;Thank you for your patience.</p><p><b><b>Introduction</b></b></p>\n<p>Teams users in tenants with open collaboration policies have long been able to start a chat with anyone who has an email address. However, recipients without a Teams account were previously asked to sign up for one before being able to collaborate. We're introducing a new capability in Microsoft Teams for certain tenants (see ‘Who is affected’ below) that allows these recipients to <b>join the chat as a guest— no account needed</b>, and as long as it is <b>allowed by the tenant’s existing policy configuration</b>.</p><p>This feature will be available across Windows, Mac, Web, iOS, and Android platforms.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=513271\" target=\"_blank\">513271</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Targeted Release:</b>&nbsp;Rollout for users with the aforementioned licenses begun in early November 2025 and was completed in mid-November 2025</li>\n<li><b>General Availability (Worldwide):</b>&nbsp;May 2026 (previously February)</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p><p>This capability is currently available only to small and medium business customers enrolled in public preview with a Teams Essentials, Business Basic, Business Standard, or Business Premium license. It also only affects organizations with guest chat enabled and that do not limit guest collaboration to specific domains. Organizations without users enrolled in public preview or without users with these licenses may still see this post even if they are not affected.</p>\n<p><b>What will happen for those who are affected:</b></p>\n<ul>\n<li>After Teams users start a chat with someone who is not on Teams, the recipient will receive an email inviting them to join the chat as a guest. Only Teams users in your organization can start the chat, as users without Teams accounts cannot initiate chats.</li>\n<li>Chats will remain within your organization’s boundary.</li>\n<li>This feature is <b>enabled by default</b> but will be governed by your organization’s Entra B2B Guest policies and Teams Admin Center Guest Access policies. It will not override any existing policy configurations.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Update internal documentation to reflect this new capability.</li>\n<li>Inform helpdesk and support teams about the change.</li><li>Review the documentation here: <a href=\"https://learn.microsoft.com/microsoftteams/chat-with-people-not-using-teams\">Chat with anyone not using Teams - Microsoft Teams | Microsoft Learn</a></li><li>To disable the feature, set the <b>UseB2BInvitesToAddExternalUsers </b>attribute of TeamsMessagingPolicy to<b> false</b>. <a href=\"https://learn.microsoft.com/powershell/module/microsoftteams/set-csteamsmessagingpolicy?view=teams-ps#-useb2binvitestoaddexternalusers\" target=\"_blank\">Set-CsTeamsMessagingPolicy documentation here</a>.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "513271"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams now allows users in certain small and medium business tenants to chat with anyone via email without requiring the recipient to have a Teams account, joining as a guest instead. This feature, enabled by default and governed by existing policies, rolled out in late 2025 with general availability in May 2026."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2026-06-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1182004",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-04T17:12:00.763Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-31T23:20:44Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Chat with anyone with an email address",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
