{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Microsoft Edge for Business will soon support <i>Rewrite</i>, a new feature powered by Microsoft 365 Copilot Chat. This capability helps users draft and rephrase editable text directly within <i>Edge</i>, enhancing productivity and writing quality. Users can access <i>Rewrite</i> by highlighting editable text and right-clicking to open the context menu.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420335\" target=\"_blank\">420335</a>.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>Rollout will begin in late September 2025 and is expected to complete by late September 2025.</p><p><b>How this affects your organization</b></p><ul><li><i>Rewrite</i> will be <b>enabled by default</b> for Edge for Business users.&nbsp;</li><li>Users can access <i>Rewrite</i> by highlighting editable text and right-clicking to open the context menu.</li><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e0d954c7-eff4-4a2c-92b2-c6a479f1a8c0/9c483f3360fb2698d456b9325d6aeaf5d56bb61f.png\" style=\"width: 623.982px;\"><p></p><li>If Microsoft 365 Copilot is restricted from accessing page content due to Data Loss Prevention (DLP) policies, <i>Rewrite</i> will not function on that content.</li><li>Admins can manage this feature using the <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-browser-policies/composeinlineenabled\" target=\"_blank\">InlineComposeEnabled</a> policy setting.</li></ul><p><b>What you can do to prepare</b></p><p>No admin action is required before rollout. </p><p>We recommend:</p><ul><li>Reviewing your current DLP configurations to understand how they may impact <i>Rewrite </i>functionality.</li><li>Notifying users about this new capability.</li><li>Updating internal documentation to reflect this change.</li></ul><p>Learn more about how DLP affects Copilot access to page content:&nbsp;<a href=\"https://learn.microsoft.com/DeployEdge/edge-learnmore-copilot-page-summary-results\" target=\"_blank\">Microsoft 365 Copilot Chat in Edge and Access to Page Content | Microsoft Edge | Microsoft Learn</a></p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. This change introduces a new generative AI capability through Microsoft 365 Copilot Chat, allowing users to rewrite or draft text directly in Edge for Business.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes. Users can interact with Copilot Chat by highlighting editable text and using the right-click context menu to access Rewrite, enabling AI-assisted drafting and rephrasing.</td></tr><tr><td>Does the change modify Data Loss Prevention (DLP) policies or enforcement?</td><td>Yes. If DLP policies restrict Copilot from accessing page content, the Rewrite feature will not function on that content.</td></tr><tr><td>Does the change include an admin control and can it be controlled through Entra ID group membership?</td><td>Yes. Admins can manage the availability of this feature using the InlineComposeEnabled policy setting.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users can choose to use the Rewrite feature by manually invoking it through the right-click context menu in Edge.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420335"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat's Rewrite feature will launch in Edge for Business by late September 2025, enabling users to draft and rephrase text via right-click. It’s enabled by default, subject to DLP restrictions, and manageable by admins through the InlineComposeEnabled policy. No prior admin action is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1146821",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-02T23:22:20.687Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-02T23:22:03Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Rewrite with Microsoft 365 Copilot Chat coming soon to Edge for Business users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
