{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 19, 2025: We have updated the content Thank you for your patience.</p><p><b><b>Introduction</b></b>\n</p><p>Agent in Viva Engage communities are now available in Public Preview. Community admins can add agents to communities to enhance knowledge sharing by drafting answers to questions without best or verified answers based on community content.<br><br>Shortly after public preview begins, we'll be enhancing agents in communities with SharePoint grounding to improve the accuracy and relevance of AI-generated answers. This update allows the agent to use content from SharePoint sites that community members can access, helping ensure responses are contextually grounded and backed by trusted sources. Agents in communities will only draft answers with content that all community members have access to. You can set up your agent with before SharePoint grounding is available and add it later.</p><p><b><b>When this will happen:</b></b></p><ul>\n<li><b>Agents in communities Public Preview:</b> Begins September 18th, expected to be complete by late September 2025</li><li><b>SharePoint Grounding Public Preview (Worldwide):</b> Begins late September 2025, expected to complete by early October 2025</li>\n<li><b>General Availability (Worldwide):</b> Begins late January 2026, expected to complete by late February 2026</li>\n</ul>\n\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> Viva Engage community admins with Microsoft 365 Copilot licenses; Global and Engage admins managing Viva Engage networks</li>\n<li><b>What will happen:</b></li>\n<ul>\n<li><b>During Public Preview:</b></li>\n<ul>\n<li>Admins can opt their network into the preview via the <i>Engage admin center: Engage</i>&nbsp;admin center &gt; Tenant Settings &gt; Enable Community Agent Public Preview.</li></ul></ul></ul><p></p><ul></ul>Once enabled, admins can add agents to any community they manage.<p><i>Figure i. Add agent to community​</i></p><p></p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c90ccffc-5ca8-456f-bcdd-4b47e6a330f2\" style=\"width: 400px;\" alt=\"user settings\"><p></p><p></p><p>The agent will proactively draft answers to unanswered questions using past conversations.</p><p>By default, the agent posts answers <i>automatically</i>.</p><p>Admins can configure whether the agent posts answers automatically or only after approval.</p><p><i>Figure ii. Configure the agent to require answer review before posting​</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ce207aa0-35f2-4c9d-8d75-5df42ee13b8b\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p>If Require review is enabled, admins and designated experts will be notified when the agent drafts an answer. They can approve, edit, or dismiss the response.</p><p><i>Figure iii. Community admins and experts can review agent suggestions​</i></p><p>\n<img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e641e3d6-9fff-4a4e-ac28-07adc0509e00\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p><b>Coming soon (General Availability):</b></p><ul></ul><p></p><p>The agent will only use content that all community members can access.</p><p>Admins must be owners of the SharePoint sites they wish to configure.</p><p>Admins can add additional SharePoint sites to expand the agent’s grounding knowledge.</p><p>The agent will be grounded by default on the community’s SharePoint site.</p><p>All Microsoft 365 Copilot licensed users will have access to the <i>Community Agent</i> by default.</p><p>The <i>Community Agent Public Preview</i> toggle will be retired.</p>\n\n<p></p><b><b>What you can do to prepare:</b></b><p></p>\n<ul>\n<li>If participating in preview:</li>\n<li>Opt your network into the preview via the <i>Engage admin center</i> \n</li><li>Communicate this change to helpdesk staff.&nbsp;</li>\n<li>Update internal documentation that references <i>Viva Engage Community Agent</i> behavior or setup.</li>\n<li>No action is required at GA; the feature will be <b style=\"\">on by default</b>.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/viva/engage/ai-technology-with-viva-engage/agents-community-network-deployment-config\" target=\"_blank\">Set up and manage agents in Viva Engage communities | Microsoft Learn</a></p>\n\n<p><b><b>Compliance considerations:</b></b></p><table border=\"1\">\n<tbody><tr><th>Consideration</th><th>Explanation</th></tr>\n<tr><td>Uses customer data</td><td>The agent accesses SharePoint content to generate answers. Only content accessible to all community members is used.</td></tr>\n<tr><td>Introduces AI/ML agent capabilities</td><td>The agent uses generative AI to draft responses based on SharePoint content.</td></tr>\n<tr><td>Admin control available</td><td>(Optional) Community admins can configure which SharePoint sites are used for grounding. Admin must be site owner.</td></tr>\n<tr><td>User interaction with generative AI</td><td>End users receive AI-generated answers grounded in community conversations and SharePoint content</td></tr>\n<tr><td>Can be controlled through Entra ID group membership</td><td>Admin access and site ownership can be managed via Entra ID group membership.</td></tr>\n</tbody></table>https://cxcs.microsoft.net/file/ccp/en-us/e641e3d6-9fff-4a4e-ac28-07adc0509e00https://cxcs.microsoft.net/file/ccp/en-us/e641e3d6-9fff-4a4e-ac28-07adc0509e00<p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Viva Engage agents are in Public Preview starting September 18, 2025, allowing community admins to add AI agents that draft answers using community and SharePoint content. SharePoint grounding will enhance answer accuracy by late September. General Availability is planned for early 2026, with admin controls for posting and content access."
    }
  ],
  "EndDateTime": "2026-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1155311",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-19T16:21:47.43Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-18T17:07:29Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Viva Engage: Agents in Viva Engage communities Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
