{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re enhancing <b>Microsoft Purview | Information Protection</b> by adding the ability to preview email attachments directly in <b>Activity explorer</b> for Exchange Online. Previously, only the message body was viewable, limiting visibility into flagged sensitive content. This update helps admins quickly investigate incidents without downloading emails, improving efficiency and security.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=527834\" target=\"_blank\">527834</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n\n<ul><li>Public Preview: Rollout begins early December 2025 and completes by mid-December 2025.</li><li>General Availability (Worldwide): Rollout begins mid-January 2026 and completes by late January 2026.</li></ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b style=\"\">Who is affected:</b> Admins managing Exchange Online and using <b>Activity explorer</b> in Microsoft Purview.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Admins can preview email attachments flagged for sensitive data directly in <b>Activity explorer</b>.</li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/45313afb-86dd-4c9c-bf5c-15fdb97da1a0\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li>No need to download emails for investigation.</li>\n<li>Feature is enabled by default; no configuration changes required.</li>\n<li>Existing DLP (data loss prevention) and Information Protection policies remain unchanged.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required; the feature will be available automatically after rollout.</li>\n<li>Optional: Communicate this update to your security and compliance teams.</li>\n</ul><p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "527834"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Information Protection will enable admins to preview email attachments flagged for sensitive data directly in Activity explorer for Exchange Online, improving incident investigation without downloading emails. The feature rolls out from December 2025 to January 2026, is enabled by default, and requires no action."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191918",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-03T21:40:18.357Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-03T21:39:45Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection – Email attachment preview in Activity explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
