{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 5, 2025: Gallatin customers are advised to still implement multifactor authentication for user accounts to improve security, but there will not be Microsoft enforcement at this time.</p><p><b>Introduction</b></p><p>To strengthen security across Azure environments, Microsoft is introducing enforcement of multifactor authentication (MFA) for all Azure resource management actions. This change helps protect your organization from unauthorized access and aligns with industry best practices for identity protection.\n</p><p>This effort is part of Microsoft’s commitment to enhance security for all customers and follows <a href=\"https://learn.microsoft.com/entra/identity/authentication/concept-mandatory-multifactor-authentication?tabs=dotnet#phase-1-applications\" target=\"_blank\">Azure’s Phase 1 rollout</a> completed last year. Phase 2 enforcement ensures that all Azure clients - including CLI, PowerShell, SDKs, and REST APIs - are protected against unauthorized access.\n</p><p><b>When this will happen</b></p><p>Phase 2 enforcement will begin rolling out on  October 1, 2025, and will be applied gradually across tenants. Customers may postpone enforcement until July 2026 if additional time is needed to become compliant.</p><p><b>How this will affect your organization</b></p><p>Users will be required to set up MFA before performing Azure resource management actions (via Azure CLI, PowerShell, Mobile App, Identity SDK, IaC tools, or REST APIs).\n</p><p>Enforcement applies to all Azure tenants in the public cloud and all users. This includes automation and scripts using user identities (instead of application IDs). The <a href=\"https://aka.ms/postponePhase2MFA\" target=\"_blank\">Phase 2 Azure Portal experience </a>will show when enforcement is active on a tenant.</p><p>If your organization cannot meet the enforcement deadline, you can <a href=\"https://learn.microsoft.com/en-us/entra/identity/authentication/concept-mandatory-multifactor-authentication?tabs=dotnet%22%20%5Cl%20%22request-more-time-to-prepare-for-enforcement#request-more-time-to-prepare-for-phase-2-mfa-enforcement\" target=\"_blank\">postpone your tenant’s enforcement date</a>.</p><p><b>What you need to do to prepare</b></p><ul><li><b>Verify MFA Readiness: </b>Ensure all users performing Azure resource management actions are enrolled in MFA.\n</li><li><b>Apply Azure Policy:</b>&nbsp;To understand the potential impact, apply a <a href=\"https://aka.ms/mfaforazureselfenforce\" target=\"_blank\">built-in Azure Policy definition</a> in audit or enforcement mode to assess impact.</li><li><b>Upgrade Azure CLI or PowerShell Versions:</b>&nbsp;For the best compatibility experience, users in your tenant should use Azure CLI version 2.76 or later and Azure PowerShell version 14.3 or later.&nbsp;</li><li><b>Postpone If Needed: </b>Global administrators can self-serve postponement in the<b> </b><a href=\"https://aka.ms/postponephase2MFA\" target=\"_blank\">Azure Portal</a>&nbsp;before enforcement begins.</li></ul><p>This change will happen automatically. No admin action is required unless you need to delay enforcement.</p><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/entra/identity/authentication/concept-mfa-howitworks\" target=\"_blank\">How it works: Microsoft Entra multifactor authentication | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/entra/identity/authentication/how-to-mandatory-multifactor-authentication\" target=\"_blank\">How to verify that users are set up for mandatory MFA | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/entra/identity/authentication/concept-mandatory-multifactor-authentication?tabs=dotnet#request-more-time-to-prepare-for-enforcement\" target=\"_blank\">Planning for mandatory multifactor authentication for Azure and other admin portals | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/en-us/azure/governance/policy/tutorials/mfa-enforcement\" target=\"_blank\">Tutorial: Self-enforce MFA through Azure Policy - Azure Policy | Microsoft Learn</a></li></ul><p><b>Compliance Considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will enforce multifactor authentication (MFA) for all Azure resource management actions starting October 1, 2025, with a postponement option until July 2026. Users must enable MFA, update Azure CLI/PowerShell, and can apply Azure Policy to assess impact. Gallatin customers are advised to implement MFA without enforcement."
    }
  ],
  "EndDateTime": "2026-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143999",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-05T18:55:17.193Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T00:35:43Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Azure Information Protection: Enable multifactor authentication for your Azure tenant by October 1, 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
