{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing that the Sales Qualification Agent for Dynamics 365 Sales is now fully autonomous. This updated feature is currently being rolled out to all regions and is anticipated to be available globally by August 31, 2025.<br><br>\n<b>How does this affect me? </b><br>\nThis feature is designed to assist your sales team qualify leads faster and with more confidence.<ul>\n\n<li><b>AI-Powered Lead Research: </b>The agent will autonomously research leads by combining your CRM data with public web sources as well as custom knowledge sources through Copilot Studio, creating rich lead and company profiles. It assesses a lead's importance based on target profile criteria you define, as well as signals from emails with the lead and recent marketing interactions. </li>\n<li><b>Instant Insights: </b>Get actionable recommendations, 360-degree lead and account summaries, recent company news, competitor insights and clear prioritization—letting sellers focus on the leads most likely to convert. </li>\n<li><b>Personalized Outreach: </b>The updated agent not only automatically drafts but also sends customized emails with key talking points. It also reminds leads that don't engage, increasing the response rates of your prospecting efforts. </li>\n<li><b>Smart Engagement with Q&A and intent detection: </b>With new automation, the agent can send personalized follow-up emails and analyze responses to detect purchase intent, ensuring high-touch engagement and boosting your pipeline’s quality. It can answer the lead's questions using your configured knowledge sources, moving the lead further down the consideration journey. </li>\n<li><b>Easy Customization with configurable automation level: </b>Admins can tailor qualification rules, add industry-specific research sources, and fine-tune the agent’s handover criteria to your unique sales strategy. You can control the level of automation you want - from research and pre-qualification all the way to full engagement.</li></ul>\n\n<b>What do I need to do to prepare? </b><br>\nIf you’re currently using the Sales Qualification Agent (including the April 2025 preview), please note your agent may now appear in Draft mode. To benefit from the new features, you must upgrade by following the information available here: <a target=\"_blank\" href=\"https://aka.ms/11780/upgrade-sales-qualification-agent\">Upgrade your Sales Qualification Agent (preview) </a>.<br><br>\n\nFor additional information regarding this feature, please refer to this documentation: <a target=\"_blank\" href=\"https://aka.ms/11780/sales-qualification-agent\">Sales Qualification Agent overview (preview)</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-09-19T03:42:01Z",
  "HasAttachments": false,
  "Id": "MC1137668",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-19T03:43:28.123Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-19T03:42:01Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Sales - Sales Qualification Agent is now fully autonomous",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
