{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p>As part of the integration between Microsoft Purview Insider Risk Management and Microsoft Defender XDR, we’re enabling Streaming API support for two Advanced Hunting tables: <b>DataSecurityEvents</b> and <b>DataSecurityBehaviors</b>. These tables contain insider risk alert data, and this enhancement allows organizations to receive data in real time via event hubs. We invite your organization to explore this feature and share feedback.</p>\n\n<p><b>When this will happen:</b></p></p><p>\n\n<ul>\n<li><b>Public Preview:</b> Rollout will begin in <b>late August 2025</b> and is expected to complete by <b>mid-September 2025</b>.</li>\n</ul>\n\n<b>How this affects your organization:</b></p><p>\n\n<p>With Streaming API support, your organization can receive insider risk alert data as soon as it’s available in the <b>DataSecurityEvents</b> and <b>DataSecurityBehaviors</b> tables. This push-based model eliminates the need for repeated polling, unlike the Graph API, which requires pull-based requests. This enhancement improves data timeliness and reduces overhead for security operations teams.</p>\n\n<p>This feature is <b>off by default</b> and requires configuration to begin streaming data.</p>\n\n<b>What you can do to prepare:</b></p><p><ul><li>Set up an <b>event hub or storage location</b> to stream data.</li>\n<li>Follow the setup guidance here: <a href=\"https://learn.microsoft.com/en-us/defender-endpoint/api/raw-data-export\">https://learn.microsoft.com/en-us/defender-endpoint/api/raw-data-export</a></li></ul>\n<p><b>Compliance considerations:</b></p>\n\n<table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n<tbody>\n<tr><td>Alters how existing customer data is processed, stored, or accessed</td><td>Yes – Insider risk alert data is now streamed in real time to customer-defined event hubs, changing how data is accessed.</td></tr>\n<tr><td>Adds integration to 3rd party software products</td><td>Yes – Streaming API enables integration with external SIEM and data platforms via event hubs.</td></tr>\n<tr><td>Includes an admin control and can be controlled through Entra ID group membership</td><td>Yes – Admins can configure access and streaming endpoints, and control permissions via Entra ID.</td></tr>\n</tbody></table></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender XDR will support Streaming API for DataSecurityEvents and DataSecurityBehaviors tables starting late August 2025, enabling real-time insider risk alert data delivery via event hubs. This push-based feature is off by default, requires setup, and allows integration with external platforms while offering admin control through Entra ID."
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1137606",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-18T23:08:48.773Z",
  "Services": [
    "Microsoft Defender XDR",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-18T23:08:43Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Streaming API support for Data Security tables in Microsoft Defender XDR Advanced Hunting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
