{
  "ActionRequiredByDateTime": "2025-09-04T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 4, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>Microsoft Entra is updating how Conditional Access (CA) policies apply to Azure DevOps sign-ins. Azure DevOps will no longer rely on the Azure Resource Manager (ARM) resource during sign-in or token refresh flows. This change ensures that access controls are applied directly to Azure DevOps. Organizations must update their Conditional Access policies to explicitly include Azure DevOps to maintain secure access.</p><p><b>When this will happen\n</b></p><p>This change will take effect starting <b>September 2, 2025</b>, and will be <b>fully enforced by September 18, 2025 </b>(previously September 4), across all environments.</p><p><b>How does this affect your organization?</b></p><p>If your organization has Conditional Access policies targeting the Windows Azure Service Management API (App ID: 797f4846-ba00-4fd7-ba43-dac1f8f63013), those policies will no longer apply to Azure DevOps sign-ins. This may result in <b>unprotected access</b> unless these policies are updated to include Azure DevOps (App ID: 499b84ac-1321-427f-aa17-267ca6975798).\n</p><ul><li>Access controls such as MFA or compliant device requirements may not be enforced unless policies are updated.\n</li><li>If you already have a policy that targets all users and all cloud apps and does not explicitly exclude Azure DevOps, no action is required—Azure DevOps sign-ins will continue to be protected.\n</li><li>This change does not introduce any new user-facing experience or UI changes.\n</li><li>Sign-in activity can be monitored using Microsoft Entra ID sign-in logs.</li><li>Licensing requirement: Microsoft Entra ID P1 or P2 is required. There are no functional differences by license type. This is a feature change, not a new feature, so trial or preview options are not applicable.</li><li>Unlicensed users may also be impacted.\n</li><li>Existing Conditional Access policies will be affected, specifically those targeting the Windows Azure Service Management API.\n</li><li>A small subset of tenants may see the app name as \"Microsoft Visual Studio Team Services\" instead of \"Azure DevOps\"—the App ID remains the same.</li></ul><p>&nbsp;<b>What do you need to do to prepare?</b></p><p>To ensure continued protection of Azure DevOps sign-ins, administrators should:\n</p><ul><li><b>Review existing Conditional Access policies</b> - Identify any policies that target the Windows Azure Service Management API.\n</li><li><b>Update policies to include Azure DevOps:</b><ul><li>Go to the Entra admin center.\n</li><li>Navigate to <b>Entra ID &gt; Conditional Access &gt; Policies</b>.\n</li><li>Select the relevant policy.\n</li><li>Under <b>Target resources</b>, choose<b> Select resources</b> and add Azure DevOps (App ID: 499b84ac-1321-427f-aa17-267ca6975798).\n</li><li>Save the policy.</li></ul></li><li><b>Use Entra ID group membership</b> to scope policies to specific users or groups.</li><li><b>Monitor sign-in activity</b> using Entra ID sign-in logs.</li><li><b>Review licensing requirements</b> - Conditional Access requires Microsoft Entra ID P1 or higher. Organizations without the required license may explore trial options.</li></ul><p>Learn more: </p><ul><li><a href=\"https://devblogs.microsoft.com/devops/removing-azure-resource-manager-reliance-on-azure-devops-sign-ins/\" target=\"_blank\">Removing Azure Resource Manager reliance on Azure DevOps sign-ins | Azure DevOps Blog</a></li><li><a href=\"https://learn.microsoft.com/entra/identity/conditional-access/overview\" target=\"_blank\">What is Conditional Access? | Conditional Access | Microsoft Entra ID | Microsoft Learn</a></li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra will stop applying Conditional Access policies via Azure Resource Manager for Azure DevOps sign-ins starting September 2, 2025, fully enforced by September 18. Organizations must update policies to explicitly include Azure DevOps (App ID: 499b84ac-1321-427f-aa17-267ca6975798) to maintain secure access."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1123830",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-04T19:48:11.603Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-28T23:49:43Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Entra: Action Required – Update Conditional Access Policies for Azure DevOps Sign-ins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
