{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>To enhance workbook security, a new group policy is being introduced to expand File Block Settings to external workbook links. This policy allows administrators to control whether links to blocked file types can be refreshed.\n</p><p>If not configured, no changes will take effect immediately. However, starting October 2025, the default behavior will block external links to file types currently blocked by the Trust Center. When this policy is enabled, new references to blocked file types will return a <code>#BLOCKED</code> error. Existing links will display the last successfully refreshed values but will no longer refresh.\n</p><p><b>When this will happen\n</b></p><p><b>General Availability:</b> We will begin rolling out the default change in early October 2025 and end in late July 2026.\n</p><p><b>How this affects your organization\n</b></p><ul><li><b>Policy not configured:</b> No immediate change will occur.\n</li><li><b>Build 2509 warning bar: </b>Users will see a business bar when opening workbooks containing external links to blocked file types, alerting them to the upcoming change.\n</li><li><b>Build 2510 enforcement: </b>If the policy remains unconfigured, users will no longer be able to refresh or create new references to blocked file types.\n</li><li><b>Existing links behavior:</b> External links will retain the last successfully loaded value but will not refresh.\n</li><li><b>New links behavior: </b>Creating a new external link to a blocked file type will return a <code>#BLOCKED</code> error.\n</li><li><b>Workbook Links pane: </b>Will indicate which workbooks failed to refresh due to being blocked.</li></ul><p><b>What you can do to prepare\n</b></p><p>Administrators who need to allow workbook links to blocked file types can revert to the previous behavior using the following methods:\n</p><ul><li>Registry setting: Set <code>HKCU\\Software\\Microsoft\\Office\\16.0\\Excel\\Security\\FileBlock\\FileBlockExternalLinks</code> to 0.\n</li><li>Group Policy setting: <code>Set File Block Includes External Link</code> Files to <code>Disabled</code>:\n</li><li><code>Excel Group Policy Template &gt; Excel Options &gt; Security &gt; Trust Center &gt; File Block Settings &gt; File Block includes external link files</code>\n</li></ul><p>We recommend reviewing existing workbooks and communicating this change to users who rely on external links to ensure continuity of workflows.\n</p><p><b>Learn more:</b>&nbsp;<a href=\"https://learn.microsoft.com/en-us/deployoffice/security/internet-macros-blocked\" target=\"_blank\">Macros from the internet are blocked by default in Office</a><a href=\"https://learn.microsoft.com/en-us/deployoffice/security/internet-macros-blocked\" target=\"_blank\"></a></p><p><b>Learn more:</b> <a href=\"https://support.microsoft.com/en-us/topic/external-workbook-links-to-blocked-file-types-will-be-disabled-by-default-6dd12903-0592-463d-9e68-0741cf62ee58\" target=\"_blank\">External Workbook Links to Blocked File Types Will Be Disabled by Default</a></p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 2025, external workbook links to blocked file types will be disabled by default, showing a #BLOCKED error for new links and preventing refresh of existing ones. Administrators can revert this via registry or group policy settings. A rollout and user warnings will occur from October 2025 to July 2026."
    }
  ],
  "EndDateTime": "2026-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1125497",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-30T23:51:29.75Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T23:50:24Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "External workbook links to blocked file types will be disabled by default",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
