{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>To improve visibility of communications related to our expanding Copilot offerings, we’re introducing a new service listing: Microsoft 365 Copilot Chat. This listing will appear in both the Service health and Message center experiences and is designed to help administrators stay informed about incidents and changes that may affect Copilot Chat usage.\n</p><p>Microsoft 365 Copilot Chat pertains to our web-grounded AI chat with enterprise data protection for Business and Enterprise users without a Microsoft 365 Copilot license. The service listing: Microsoft Copilot (Microsoft 365), will continue to be used for communication regarding the Microsoft 365 Copilot licensed offerings.</p><p><b>When this will happen</b></p><p><b>General availability (Worldwide and GCC): </b>We will begin rolling out in the end of August 2025 and expect to complete by the end of September 2025.</p><p><b>How this will affect your organization</b></p><p>You will begin to see incident and change communications related to Copilot Chat under the new <b>Microsoft 365 Copilot Chat</b> service listing in both Service health and Message center:</p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/641ba5bf-e62a-40dd-9044-945e1cebe66f/619002245581c252feca6aa7362fe59a8b30bc63.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>If your organization subscribes to <b>Microsoft Copilot for Microsoft 365</b>, you will continue to receive communications under the existing <b>Microsoft Copilot (Microsoft 365)</b> listing.</p><p>This change does not affect service functionality or user experience. It improves how Copilot-related communications are categorized and surfaced to administrators.</p><p>The listing will appear <b>automatically</b>—no action is required to enable or disable it.</p><p><b>What you can do to prepare\n</b></p><ul><li>Update administrator training and documentation to reflect the new service listing.\n</li><li>Consider configuring <b>Service health and Message center email notifications</b> for <b>Microsoft 365 Copilot Chat</b> to ensure timely updates.\n</li><li>No configuration is required to activate the listing—it will be visible by default.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/copilot/overview\" target=\"_blank\">Overview of Microsoft 365 Copilot Chat | Copilot | Microsoft Learn</a></p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is introducing a new service listing, Microsoft 365 Copilot Chat, in Service health and Message center to improve communication visibility for Copilot Chat users. It will roll out worldwide by September 2025, requires no action, and does not affect service functionality."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1138795",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-20T23:38:39.923Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-20T23:38:32Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Chat: new service listing in Service health and Message center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
