{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We are introducing a new capability in Microsoft Teams external collaboration that allows Teams administrators to specify which users or groups within the organization can interact with specific external domains. This enhancement provides more granular control over external collaboration, enabling scenarios such as piloting with select departments, restricting high-risk roles, or enabling broader federation where appropriate.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501275\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">501275</a>.</p><p><b>When this will happen</b></p><p>Targeted Release: Begins early September 2025 and completes by mid-September 2025.</p><p>General Availability (Worldwide): Begins late October 2025 and completes by mid-December 2025.</p><p><b>How this affects your organization</b></p><p>Previously, external access settings could only be configured at the tenant level, with policy-level settings limited to either inheriting tenant settings or blocking all external domains. With this update, you can assign custom external access policies to users or groups with five configuration options:</p><ul><li><i>Use organization settings</i>: Inherits the tenant’s default external access configuration</li><li><i>Allow all external domains</i>: All external organizations are trusted</li><li><i>Allow only specific external domains</i>: Only domains in the allow list are trusted</li><li><i>Block only specific external domains</i>: Domains in the block list are restricted; all others are trusted</li><li><i>Block all</i>: All external domains are blocked for users assigned to this policy</li></ul><p>Users assigned a custom policy may interact with different external domains than those defined in the organization-wide settings.</p><p><b>What you can do to prepare</b></p><p>Administrators should begin identifying users and groups that require differentiated external access and plan pilot scenarios accordingly.</p><p>During the public preview, configuration must be done via PowerShell using the following cmdlets:</p><ul><li><code>Set-CsExternalAccessPolicy</code></li><li><code>Set-CsTenantFederationConfiguration</code></li></ul><p><i>Note: </i>Changes made through these cmdlets will not be reflected in the Teams admin center UI during the Targeted Release.</p><p>Once the feature reaches general availability, the Teams admin center UI will support these configurations, allowing policy management via both PowerShell and the UI.</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/manage-external-access\" target=\"_blank\">Manage external meetings and chat with people and organizations using Microsoft identities</a>.</p><p><b>Compliance considerations</b></p><table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n\n<tr>\n  <td>Admin control via Entra ID group membership</td>\n  <td>Policies can be assigned to Entra ID groups for targeted external access control.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501275"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will enable admins to assign custom external access policies by user or group, allowing specific control over which external domains they can interact with. This feature, available from September 2025, supports five policy options and will be manageable via PowerShell initially, then through the Teams admin center UI."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2026-01-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1150123",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-08T23:31:37.08Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-08T23:31:18Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Teams Admin Center: Control External Access by Domain for Specific Users and Groups",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
