{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re improving the alert experience in Microsoft Defender for Office 365 (MDO) to help security teams triage alerts more efficiently. These updates reduce alert fatigue by consolidating related signals into single, richer alerts—without compromising detection fidelity or coverage.</p>\n\n<b>When this will happen</b>\n<p>General Availability (Worldwide, GCC, GCC High, DoD): Rollout begins mid-September 2025 and will complete by late November 2025. Updates will be delivered incrementally during this period.</p>\n\n<b>How this affects your organization</b>\n<ul>\n<li><b>Fewer near-duplicate alerts:</b> Closely related signals will be grouped, reducing clutter in the alert list.</li>\n<li><b>Richer alert detail: </b>Alerts will include impacted entities (e.g., users, recipients), key identifiers (e.g., message/network IDs), and timelines. Evidence such as URLs, attachments, and IPs remains accessible.</li>\n<li><b>Preserved triage workflows: </b>Existing pivots like <i>Open message in Explorer</i>, <i>View timeline</i>, and <i>List impacted entities</i>&nbsp;remain unchanged. Severity and categorization are unaffected.</li>\n<li><b>Incident correlation: </b>Incidents may contain fewer child alerts but with denser evidence per alert.</li>\n<li><b>APIs and reporting:</b> No schema changes. You may observe lower raw alert counts with higher per-alert density. Dashboards and automation referencing alert IDs will continue to function.</li>\n</ul>\n<p>This feature is on by default and requires no configuration changes.</p>\n\n<b>What you can do to prepare</b>\n<ul>\n<li><b>Review automation logic:</b> Ensure playbooks and scripts can handle alerts with multiple entities and richer context.</li>\n<li><b>Review alert metrics: </b>If you track alert counts, consider also measuring how many users or messages are included in each alert, what actions are taken, and how long it takes to respond and resolve (mean time to acknowledge and mean time to resolve).</li><li><b>Communicate with SecOps teams: </b>Set expectations around reduced alert volume with maintained evidence depth.</li>\n</ul>\n<p>No policy or configuration changes are required before rollout.</p>\n\n<b>Compliance considerations</b>\n<p>No compliance considerations identified, review as appropriate for your organization.\n</p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 will enhance alert experience by consolidating related signals into richer alerts, reducing alert fatigue while preserving detection and workflows. Rollout starts mid-September 2025, requires no configuration changes, and may affect automation and alert metrics tracking. No compliance issues identified."
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1147387",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-03T23:25:12.03Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-03T23:24:58Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Alert experience enhancements for faster triage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
