{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 5, 2025: We have updated the timeline. Thank you for your patience.</p><p>When users report an email as junk, they’ll now see an option to unsubscribe—if the sender supports it. This helps reduce unwanted messages at the source and keeps users’ blocked sender lists from growing unnecessarily. If unsubscribing isn’t available, users can still block the sender as usual. This update simplifies inbox management and gives users more control over their email experience.\n</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=495469\" target=\"_blank\">495469</a>\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Rollout will begin&nbsp;mid-July 2025 and is expected to complete by late August 2025 (previously late July).\n</p><p><b>How this will affect your organization:</b>\n</p><p>This update enhances the junk email reporting experience by allowing users to unsubscribe from senders directly when reporting a message as junk (if supported by the sender). This reduces the need to manually manage blocked senders and helps keep inboxes cleaner.\n</p><p>There are no changes to existing junk, phishing, blocking, or unsubscribing rules—this feature simply adds a more efficient action path for users.\n</p><p>The feature will be on by default.\n</p><p><b>What you can do to prepare:</b>\n</p><p>No admin action is required. You may wish to inform your users about this new option to help them take full advantage of the improved junk email handling experience.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "495469"
    },
    {
      "Name": "Summary",
      "Value": "Starting mid-July to late August 2025, Outlook will let users unsubscribe from senders when reporting junk emails, if supported. This simplifies inbox management by reducing blocked senders. The feature is on by default, requires no admin action, and enhances junk email reporting without changing existing rules."
    },
    {
      "Name": "Platforms",
      "Value": "Android"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1112455",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-05T20:19:00.823Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-10T00:18:35Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Outlook: Report junk + block or unsubscribe in one same action",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
