{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 6, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>What and Why:</b></p>\n<p>We're introducing a new capability in Microsoft Purview Data Lifecycle Management that allows admins to bypass existing retention policies and delete content from OneDrive and SharePoint Online before the retention or hold duration expires. This feature supports organizations managing Copilot-related artifacts—such as Teams recordings and transcripts—independently of OneDrive retention policies, giving admins greater control over how long this content is retained.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=496151\" target=\"_blank\">496151</a></p>\n\n<p><b>Rollout Schedule:</b></p>\n<ul>\n  <li><b>Public Preview (Worldwide):</b>&nbsp;Mid-September 2025 (previously mid-August) – late September 2025 (previously late August)</li>\n  <li><b>General Availability (Worldwide):</b>&nbsp;mid-November 2025 (previously mid-September) - late November 2025 (previously late September).</li>\n</ul>\n\n<p><b>Impact on Your Organization:</b></p>\n<p><i>Who is affected:</i></p>\n<ul>\n  <li>Admins managing OneDrive and SharePoint Online retention policies</li>\n  <li>Organizations using Microsoft Purview for data lifecycle management</li>\n</ul>\n<p><i>What will happen:</i></p>\n<ul>\n  <li>Admins can create Priority Cleanup policies to delete content before retention or hold periods expire</li>\n  <li>Feature includes simulation mode, audit logging, and disposition reviews</li>\n  <li>New admin policy authoring flows are introduced, governed by Microsoft Purview role groups</li>\n  <li>Feature is not enabled by default; requires explicit policy creation and enforcement</li>\n  <li>Requires at least two admins to author and enforce a Priority Cleanup policy</li>\n</ul>\n\n<p><b>Action Required/Recommendations:</b></p>\n<ul>\n  <li>Ensure at least two admins are assigned the <b>Priority Cleanup Admin</b> and <b>Retention Management</b> roles</li>\n  <li>Review and configure role assignments in Microsoft Purview portal</li>\n  <li>Communicate this change to your compliance and records management teams</li>\n  <li>Update internal documentation to reflect new policy authoring and enforcement capabilities</li></ul><p><b>Compliance considerations</b></p>\n<table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n  <tbody><tr>\n    <th>Question</th>\n    <th>Explanation</th>\n  </tr>\n  <tr>\n    <td>Does the change alter how existing customer data is processed, stored, or accessed?</td>\n    <td>Yes – It allows deletion of content before the expiration of retention or hold policies, changing how data is retained and disposed.</td>\n  </tr>\n  <tr>\n    <td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n    <td>Yes – It introduces a new way to override retention policies and holds, impacting deletion workflows.</td>\n  </tr>\n  <tr>\n    <td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td>\n    <td>Yes – Admin access is governed by Microsoft Purview role groups, which can be managed via Entra ID.</td>\n  </tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "496151"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Lifecycle Management will introduce a secure workflow allowing admins to bypass retention/legal holds to delete OneDrive and SharePoint content early. This requires specific admin roles, includes audit features, and is planned for public preview in September 2025 and general availability in November 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1115304",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-06T16:02:45.393Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-14T23:54:59Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Introduction of secure workflow to bypass retention/legal holds on OneDrive and SharePoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
