{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b>\n</p><p>To improve team governance and reduce the risk of unintended access, Microsoft Teams is updating the<b> join by code experience</b> for private teams. Going forward, team owners will need to approve join requests when users attempt to join a private team using a code. This change aligns the join by code experience with existing join by link behavior for private teams.</p>\n\n<p><b><b>When this will happen:</b></b>\n</p><ul><li><b>Targeted Release:</b> Rolling out in mid-November 2025 and expected to complete by late November 2025.\n</li><li><b>General Availability (Worldwide):</b> Rolling out in early December 2025 and expected to complete by mid-December 2025.</li></ul>\n\n<p><b><b>How this affects your organization:</b></b>\n</p><p><b>Who is affected:</b>\n- All Microsoft Teams users in private teams using the join by code feature.\n</p><p><b>What will happen:</b>\n</p><ul>\n  <li>Team owners can continue to generate join codes under<b> <i>Team settings &gt; Team code</i></b>.</li>\n  <li>Users can enter a join code via the <i>New items</i> menu in the <i>Chat</i> or <i>Channels app</i>.</li>\n  <li>For <b>private teams</b>, users will no longer be added immediately upon entering a join code.</li>\n  <li>Instead, team owners will receive a join request they can approve or reject.</li>\n  <li>This change <b>does not affect public teams</b>—users can still join public teams automatically using a code.</li>\n</ul>\n<p></p>\n\n<p><b><b>What you can do to prepare:</b></b>\n</p><ul>\n  <li>Inform team owners, especially in environments where join by code is commonly used (such as schools or universities).</li>\n  <li>Encourage team owners to monitor and manage join requests for private teams.</li>\n  <li>Update internal documentation or training materials to reflect this change.</li>\n  <li>No admin action is required to enable this feature.</li>\n</ul>\n<p></p>\n\n<p><b><b>Compliance considerations:</b></b>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting late 2025, Microsoft Teams will require owner approval for users joining private teams via join codes, aligning with join-by-link behavior. Public teams remain unaffected. Team owners should monitor requests and update documentation; no admin action is needed. This enhances governance and reduces unintended access."
    }
  ],
  "EndDateTime": "2026-01-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1183610",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-07T00:50:22.773Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-07T00:50:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Join by code requires owner approval for private teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
