{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 4, 2025: We have updated the timeline. Thank you for your patience.\n</p><p><b>Introduction</b></p><p>We’re streamlining the Know Your Customer (KYC) requirements for acquiring Microsoft telephone numbers in all markets. Teams administrators will need to submit general business information and supporting documents via Teams Admin Center before provisioning new telephone numbers. This is a one-time process that will allow Microsoft to validate businesses and fulfill regulatory requirements, helping protect our phone services from misuse, such as spam calls and voice phishing (vishing).</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out in early August 2025 and expect to complete by early September 2025 (previously late August).</p><p><b>How this will affect your organization</b></p><p>This change updates the existing telephone number provisioning workflow. Teams administrators must now complete a KYC onboarding process in the Teams Admin Center before provisioning new telephone numbers.</p><ul><li>Admins will be required to submit business information and supporting documentation.\n</li><li>The vetting process typically takes a few hours but may take up to two business days.\n</li><li>No new telephone numbers can be acquired until the submitted information is validated.\n</li><li>Existing telephone numbers are not affected.</li></ul><p>These requirements apply globally and are consistent across all markets.</p><p><b>What you need to do to prepare</b></p><p>Ensure your Teams administrators are ready to provide the following information via the Teams Admin Center:\n</p><ul><li>Company name\n</li><li>Tax ID, DUNS number, or Business Registration Number\n</li><li>Business address\n</li><li>A copy of the Business Registration, Registry Extract, or Articles of Incorporation</li></ul><p>This process applies to all tenants, including those on free trials. No specific license tier is required to complete the KYC onboarding.</p><p>Learn more: <a href=\"https://learn.microsoft.com/MicrosoftTeams/teams-phone-know-your-customer\" target=\"_blank\">Teams Phone Know Your Customer overview - Microsoft Teams | Microsoft Learn</a>&nbsp;&nbsp;</p><p><b>Compliance considerations</b></p><ul><li>Does the change store new customer data, if so, where, and is the data cached or permanently stored? - Yes. The KYC onboarding process requires submission of business information and supporting documentation, which will be stored by Microsoft to fulfill regulatory requirements.</li><li>Does the change alter how existing customer data is processed, stored, or accessed? - Maybe. While existing telephone numbers are not affected, the process introduces new data collection and validation workflows that may interact with existing tenant metadata.</li><li>Does the change include an admin control and, can it be controlled through Entra ID group membership? - Yes. The KYC onboarding process is managed through the Teams Admin Center, which supports role-based access control via Entra ID group membership.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early August 2025, Teams admins must complete a one-time KYC onboarding in Teams Admin Center with business info and documents before provisioning new phone numbers. The process, taking hours to two days, applies globally, does not affect existing numbers, and requires no specific license tier."
    }
  ],
  "EndDateTime": "2025-10-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1117815",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-04T17:47:05.787Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-18T23:39:28Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams | Know Your Customer (KYC) onboarding required for new phone number requests",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
