{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re introducing the <i>Workplace Patterns Report</i> in Viva Glint—an integrated analytics report that combines Viva Insights workplace behavior data with employee sentiment from Viva Glint surveys. This feature enables HR analysts and administrators to uncover actionable relationships between how people work and how they feel, without needing custom analysis. It accelerates decision-making and supports meaningful actions across the organization.</p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=489229\" target=\"_blank\">489229</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide): Rollout will begin in late November 2025 and is expected to complete by mid-December 2025.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> Company-level Viva Glint administrators and HR analysts. Other roles may be granted access if permissions are extended.</li>\n<li><b>What will happen:</b><ul><li>The report provides:<br>\n  <ul>\n    <li><b>Integrated Analytics: </b>Combines Viva Insights workplace habits data with Viva Glint survey sentiment to uncover actionable relationships between how people work and how they feel.</li>\n    <li><b>Automated Insights:</b> Streamlines discovery of key patterns and sentiment drivers for HR analysts and admins, eliminating manual data sifting.</li>\n    <li><b>Role-Based Access: </b>Available to company-level Glint admins; can be extended to other roles as needed, but designed for large population analysis.</li>\n    <li><b>Confidentiality &amp; Data Requirements:</b> Enforces strict confidentiality thresholds (minimum respondent counts) and requires sufficient data volume for reliable analysis.</li>\n    <li><b>Relationship Mapping:</b> Highlights strongest associations between workplace metrics (e.g., after-hours work, collaboration hours) and survey items (e.g., work-life balance, burnout).</li>\n    <li><b>Interactive Drill-Downs:</b> Allows users to click into relationships for detailed breakdowns by metric buckets, supporting deeper analysis.</li>\n    <li><b>Heatmap Visualization: </b>Provides color-coded tables to show how sentiment scores vary across workplace metric groups.</li>\n    <li><b>Filtering &amp; Customization: </b>Enables filtering by survey items, categories, and Viva Insights metrics; supports benchmarking and comparison settings.</li>\n    <li><b>Actionable Guidance:</b> Offers best practices for interpreting results, validating hypotheses, combining quantitative and qualitative feedback, and sharing insights with stakeholders.</li>\n  </ul>\n</li></ul></li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li><b>Review prerequisites and setup instructions:</b> <a href=\"https://learn.microsoft.com/viva/glint/setup/insights-to-glint\" target=\"_blank\">Send Viva Insights data to Viva Glint | Microsoft Learn</a>. This article contains:<ul><li>Prerequisites for the integration that powers the report\n</li><li>Workflow to send Viva Insights data to Viva Glint\n</li><li>Understand Confidentiality Thresholds</li></ul></li>\n<li><b>Role-based enablement and access: </b><a href=\"https://learn.microsoft.com/viva/glint/setup/reporting-setup\" target=\"_blank\">Viva Glint Reporting setup | Microsoft Learn.&nbsp;</a>The <i>Workplace Patterns Report</i> is targeted at HR analysts and admins at the company level. Company-level Glint admins will have access to this report by default. Users from other roles do not automatically see this report unless permissions are specifically extended. As an admin, you can choose whether to enable this report for additional roles, but it’s recommended to enable for roles handling large populations to get meaningful insights.&nbsp;</li>\n<li><b>Review the strategic playbook: </b><a href=\"https://adoption.microsoft.com/files/viva/glint/Microsoft-Viva-Glint_Insights-playbook.pdf\" target=\"_blank\">Microsoft Viva Glint + Insights Playbook (PDF)</a>. Outlines strategic guidance for combining sentiment and work patterns data and illustrative examples of how this information provides insight value. Use this playbook to understand how to interpret combined Viva Insights and Viva Glint data to unlock deeper insights into your people's experiences.</li>\n<li>Communicate availability to HR teams and update internal documentation if needed.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<table border=\"1\">\n<tbody><tr><th>Consideration</th><th>Explanation</th></tr>\n<tr><td>New customer data storage</td><td>Viva Insights data is sent to Viva Glint for analysis. Data is stored securely and subject to confidentiality thresholds.</td></tr>\n<tr><td>Changes to data processing</td><td>Combines workplace behavior data with sentiment survey responses for integrated analysis.</td></tr>\n\n<tr><td>Admin control</td><td>Admins can enable or restrict access based on role and population size.</td></tr>\n<tr><td>Integration with 3rd party</td><td>Viva Insights and Viva Glint integration involves data exchange between Microsoft services.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489229"
    },
    {
      "Name": "Summary",
      "Value": "The Workplace Patterns Report in Viva Glint integrates Viva Insights workplace data with employee sentiment surveys, enabling HR analysts to uncover actionable insights through automated analytics, interactive visualizations, and role-based access. It will roll out globally from late November to mid-December 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1180891",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-27T22:49:46.573Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-27T22:49:10Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Workplace Patterns Report in Viva Glint with Viva Insights integration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
