{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This message only applies to tenants that use B2B (business-to-business) collaboration.\n</p><p>We will start rolling out an update to the authentication experience for guest users signing in to your tenant for collaboration via Microsoft Entra ID B2B collaboration.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early July 2025 and expect to complete by late December 2025.\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, guest users will begin signing in on your branded sign-in screen. After entering their email and clicking Next, they will be redirected to their home organization’s sign-in page to enter their credentials. This ensures they see the branding and URL endpoint of their home tenant, making clearer whose credentials to use. After successful authentication, they will be redirected back to your organization to complete the sign-in process.\n</p><p>This change enhances usability and reduces user confusion during cross-tenant sign-in. \n</p><p><b>What you need to do to prepare:</b>\n</p><p> No administrative action is required prior to this rollout. We recommend you review your current B2B collaboration configuration to understand the potential impact and update any relevant documentation to guide users.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra ID will update the guest authentication experience for B2B collaboration starting July 2025, completing by December 2025. Guest users will sign in via their home organization’s sign-in page, enhancing usability and reducing confusion. No administrative action is required, but review your B2B configuration."
    }
  ],
  "EndDateTime": "2026-02-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1103608",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-26T00:35:27.643Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-26T00:34:18Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Entra ID: Change in guest authentication experience for B2B collaboration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
