{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re introducing a new capability in Microsoft Purview eDiscovery (Premium) that allows users to upload and review non-Microsoft 365 content within review sets. This enhancement supports a more comprehensive investigation experience by enabling side-by-side analysis of external and Microsoft 365 data in the modern eDiscovery interface.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497638\" target=\"_blank\">497638</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p><b>General Availability (Worldwide, GCC, GCC High, DoD):</b> We will begin rolling out early December 2025 and expect to complete by mid-December 2025.</p><p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b style=\"\">Who is affected:</b> Admins and compliance teams using Microsoft Purview eDiscovery (Premium) in GCC, GCC High, and DoD environments.</li>\n<li><b>What will happen:\n  </b><ul>\n    <li>A new option will be available to upload non-Microsoft 365 data into review sets.</li><li>The feature is available by default, and no configuration is needed.</li>\n    <li>Uploaded data will be viewable and searchable alongside Microsoft 365 content.</li><li>This change may affect how your organization manages eDiscovery workflows, requiring updates to internal processes and additional training for the eDiscovery team to ensure awareness and proper adoption of this feature.</li>\n    </ul></li></ul><p><b><b>What you can do to prepare:</b></b></p><ul>\n  <ul>\n    </ul><li>Review internal eDiscovery workflows and documentation.</li><li>Communicate the change to your eDiscovery and compliance teams.</li><li>Consider training for investigators on handling external data within review sets.</li><li>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/compliance/ediscovery\" target=\"_blank\">Learn about eDiscovery solutions | Microsoft Learn</a></li><ul>\n    \n    \n    </ul><ul>\n  </ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497638"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview eDiscovery (Premium) will allow uploading and reviewing non-Microsoft 365 data alongside Microsoft 365 content in review sets starting December 2025. This feature requires no configuration but may need workflow updates and training for compliance teams in GCC, GCC High, and DoD environments."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1176369",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-20T23:48:20.137Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-20T23:48:01Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery: Import Non-O365 data into review set for modern eDiscovery (Premium)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
