{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing <b>cross-cloud synchronization</b> in Microsoft Entra to help organizations streamline user lifecycle management across Microsoft’s commercial, US Government, and China cloud environments. This feature automates creating, updating, and deleting users across supported cloud pairs and is currently in public preview. It is <b>off by default</b> and must be explicitly enabled by administrators.</p><p><b>When this will happen</b></p><p><b>General availability (Worldwide, GCC, GCCH, DoD):</b> The capability is currently in public preview and will be rolled out to general availability <b>between early September and mid-September 2025</b>.&nbsp;</p><p><b>How this will affect your organization</b></p><p>There is <b>no impact to your tenant unless you choose to enable this feature</b>. Cross-cloud synchronization is opt-in and can be configured based on your organization’s needs. It provides a more efficient way to manage users across multiple Microsoft cloud environments.\n</p><p>Supported cloud pairs:\n</p><ul><li>Commercial (Commercial, GCC) → US Government (GCCH, DoD)</li><li>US Government (GCCH, DoD) → Commercial (Commercial, GCC)</li><li>Commercial → China\n</li></ul><p>This feature is <b>not visible to users</b>. Administrators attempting to configure it in the Entra portal will receive a <b>licensing warning</b> if prerequisites are not met.</p><p><b>What you need to do to prepare</b></p><p>Organizations planning to use cross-cloud synchronization should be aware of the following:</p><ul><li>A <b>Microsoft Entra ID Governance / Microsoft Entra Suite license</b> is required for each user in the source tenant that is being synchronized across clouds. This license is an add-on to Entra ID P1 or P2.</li><li>The feature must be enabled by an administrator in the <b>Microsoft Entra admin center</b>.\n</li><li>Access to the feature can be managed through <b>Entra ID group membership</b>.\n</li><li><b>New blades</b> are introduced in the Entra portal to support configuration and management.\n</li><li>The feature is accessible via <b>PowerShell</b> and the <b>Microsoft Graph API</b>.\n</li><li><b>Provisioning logs </b>and <b>Audit logs</b> in Microsoft Entra provide visibility into provisioning activity.\n</li><li>The feature supports <b>synchronization between two Microsoft Entra tenants</b>.</li><li>Setup guidance and prerequisites are available at:&nbsp;<a href=\"https://learn.microsoft.com/entra/identity/multi-tenant-organizations/cross-tenant-synchronization-configure?pivots=cross-cloud-synchronization\" target=\"_blank\">Configure cross-tenant synchronization - Microsoft Entra ID | Microsoft Learn</a></li><li>Ensure your environment meets the requirements for the cloud pairs you plan to synchronize.</li><li>Known limitations and troubleshooting guidance:&nbsp;<a href=\"https://learn.microsoft.com/entra/identity/app-provisioning/known-issues?pivots=cross-tenant-synchronization\" target=\"_blank\">Known issues for provisioning in Microsoft Entra ID | Microsoft Learn</a></li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra introduces cross-cloud synchronization in public preview, enabling automated user lifecycle management across Microsoft commercial, US Government, and China clouds. It is off by default, requires explicit admin enablement, a Microsoft Entra ID Governance license, and supports configuration via portal, PowerShell, and Graph API."
    }
  ],
  "EndDateTime": "2025-10-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1124558",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-29T23:59:11.217Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-29T23:58:36Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Entra: Cross-cloud synchronization now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
