{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We're introducing a new lifecycle management feature that helps admins identify and take action on ownerless agents—those created by users who have left the organization. This update improves visibility and control over agent inventory, helping maintain security and governance across your tenant.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481519\" target=\"_blank\">481519</a>.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide): Rollout begins in late August 2025 and is expected to complete by mid-September 2025.</p><p><b>How this affects your organization</b></p><p>Admins will be able to:</p><ul><li>Use the Missing an Owner dashboard card to filter and view agents without valid owners.</li><li>Select individual agents to review details and choose to delete or block them.</li><li>Ability for admin to assign an owner for a ownerless agent is coming soon in October.<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/dfa2d5ed-27ab-4755-bf2a-ed0fb32c2089\" style=\"width: 400px;\" alt=\"Screenshot of Ownerless agents count view.\"></p></li></ul><p><i>Note: </i>Only agents created using <i>Agent Builder</i> or <i>Agents Toolkit</i> can be deleted or blocked from within the MAC portal.</p><p>This feature enhances security and ensures proper lifecycle management of Copilot agents when creators exit the organization.</p><p></p><p></p><p><b>What you can do to prepare</b></p><p>Inform your admin team about this upcoming capability so they’re ready to manage ownerless agents once the feature becomes available. No configuration is required prior to rollout.</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481519"
    },
    {
      "Name": "Summary",
      "Value": "Admins will gain lifecycle controls to identify, review, delete, or block ownerless Copilot agents created by departed users, improving security and governance. The feature rolls out globally from late August to mid-September 2025, with owner assignment for agents coming in October. No prior configuration is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-10-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134170",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T23:02:00.41Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-12T23:00:50Z",
  "Tags": [
    "New feature"
  ],
  "Title": "[Copilot Extensibility] Admins can manage ownerless Copilot agents with new lifecycle controls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
