{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to reference previous prompts in Copilot for Power Automate desktop in Power Automate. This feature will reach general availability on November 17, 2025.<br><br>\n<b>How does this affect me? </b><br>\nThis feature enables you to reference prior prompts in the same conversation, which eliminates repetitive input and makes automation creation more intuitive and efficient. The key benefits of this feature include:<ul>\n<li><b>Contextual Understanding: </b>Copilot retains details from earlier prompts, such as file paths, parameters, or objects, for seamless reuse. </li>\n<li><b>Efficiency: </b>Simplifies complex workflows by removing the need to retype information across multiple steps. </li>\n<li><b>Improved Accuracy: </b>Ensures consistency and minimizes errors by accurately referencing previous inputs. </li>\n<li><b>Intuitive User Experience: </b>Facilitates smoother, smarter automation creation with minimal effort. </li>\n</ul>\n<b>What action do I need to take?</b><br> \nThis message is for awareness, and no action is required.<br><br>\nIf you would like more information on this feature, please visit <a href=\"https://aka.ms/12593/reference-previous-prompts-copilot-power-automate-desktop\" target=\"_blank\">Reference previous prompts in Copilot for Power Automate desktop</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-19T22:10:38Z",
  "HasAttachments": false,
  "Id": "MC1175628",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-19T22:12:12.62Z",
  "Services": [
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-19T22:10:38Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Automate - Reference previous prompts in Copilot for Power Automate desktop",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
