{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new filtering capability in Microsoft Copilot that allows users to refine their view of past conversations. This enhancement helps users quickly locate relevant chats aligned with their workflows, making it easier to revisit prior prompts, responses, and context.</p><p><i>i. example of new filtering experience in Microsoft Copilot</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/581a0a7b-5b20-4d2d-ac96-3d92dded3619/ecba97de9db8b44a2b50aa6a51f0299d1eb75801.png\" style=\"width: 400px;&quot;\" =\"\"=\"\" alt=\"Screenshot of a Copilot chat window highlighting the Filter feature.\"><i><br></i></p><p><br></p><p>For more information, refer to Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497910\" target=\"_blank\">497910</a>.&nbsp;</p><p>\n</p><p><b>When this will happen</b></p><ul><li><b>General Availability (Worldwide): </b>We will begin rollout in&nbsp;late August&nbsp;2025 and expect to complete by early September 2025.\n</li><li><b>General Availability (GCC and GCC High): </b>We will begin rollout in late September 2025 and expect to complete by early October 2025.\n</li><li><b>General Availability (DoD):</b> We will begin rollout in late September&nbsp;2025 and expect to complete by late October 2025.\n</li></ul><p><b>How this affects your organization</b></p><p>Previously, users could only browse their full Copilot chat history without filtering options. With this update, selecting <i>All conversations</i> in the navigation pane will display the full history, and users can apply filters to narrow results based on their current needs.\n</p><p>This feature is on by default and requires no admin configuration.\n</p><p><b>What you can do to prepare</b></p><p>No admin action is required. We recommend informing your users about this new capability so they can take full advantage of the improved navigation experience in Copilot. If your organization provides training or onboarding for Copilot, consider including this update in your materials.\n</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497910"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot will add a chat history filtering feature to help users quickly find relevant past conversations. Rollout begins late August 2025 worldwide, with no admin action needed. Users can filter chats for easier context recall, improving navigation and workflow efficiency."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134741",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T23:14:09.973Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-13T23:13:41Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Copilot: filter chat history for easier context recall",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
