{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 12, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>Outlook Mobile is introducing a new Copilot Chat overlay experience for iOS and Android devices. This enhancement allows users to interact with Copilot while continuing to use their email, calendar, and contacts. The overlay is context-aware, enabling users to ask Copilot questions about the content currently on their screen. Users with Microsoft 365 Copilot licenses will benefit from richer, personalized responses powered by Microsoft 365 Graph.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide, GCC, GCCH, and DoD): </b>We will begin rolling out in late September 2025 (previously early September) and expect to complete by early March 2026.</p><p><b>How this affects your organization</b></p><p>Once rolled out, all users will receive the new Copilot Chat overlay experience in Outlook Mobile by default. This update does not change Copilot Chat availability at the organization or user level. Existing licensing and admin controls remain unchanged.</p><p><i>Copilot Chat overlay in Outlook Mobile (iOS) - Interact with Copilot while viewing email content for contextual assistance:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/331d128c-4726-470e-aa94-c9c40fed9ff2/4f8623185f70a7f8404bffb93ef50486b881e0d3.jpg\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>Copilot Chat overlay in Outlook Mobile (Android) - Seamless access to Copilot via the bottom navigation bar to ask questions about on-screen content:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/4df285fe-a731-4eba-9d45-301c206c8db3/8ebe735df585c026fff7113424a41d11ba023e41.jpg\" style=\"width: 400px;\" alt=\"user settings\"><b></b></p><p><b>What you can do to prepare</b></p><p>No action is required.</p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td><b>Compliance area</b></td><td><b>Impact</b></td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>The Copilot Chat overlay introduces context-aware AI capabilities that analyze on-screen content to provide personalized responses.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Users can now interact with Copilot directly within Outlook Mobile via an overlay, enhancing usability and contextual relevance.</td></tr><tr></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook Mobile will roll out a context-aware Copilot Chat overlay for iOS and Android from late September 2025 to early March 2026. It enables users with Microsoft 365 Copilot licenses to interact with AI while using email, calendar, and contacts, providing personalized, on-screen contextual assistance. No action is needed."
    }
  ],
  "EndDateTime": "2026-04-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1138239",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-12T15:51:12.457Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-20T00:32:03Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Outlook Mobile : Copilot Chat overlay coming to iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
