{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p><b><b>Introduction</b></b>\n</p><p>We’re streamlining how Microsoft Purview policies apply to unmanaged cloud apps accessed via the Edge browser. These updates reduce manual steps for admins and improve policy enforcement across browser environments, especially for organizations managing data sharing to Generative AI (GenAI) apps.</p>\n<p>This change builds on the existing preview feature.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=486368\" target=\"_blank\">486368</a>.</p>\n\n<b><b>When this will happen:</b></b><p></p><ul><li>Public preview is in progress. </li><li>General availability: Rollout will begin in <b>mid-October 2025</b> and is expected to complete by <b>late October 2025</b>.</li></ul><p><b><b>How this affects your organization:</b></b><b><br></b></p><ul><li><b>Who is affected:</b><ul style=\"\"><li style=\"\">Admins managing Microsoft Purview collection and DLP policies targeting unmanaged GenAI apps in the browser.</li><li style=\"\">Organizations using Microsoft Edge for Business and Edge configuration policies that activate Purview policies.</li></ul></li><li><b>What will happen:</b><b><br></b><ul><li><b>Collection Policies</b><b><br></b><ul><li><b>Previously:</b> Required separate Edge configuration policy to apply protections with a browser blocking configuration.</li><li><b>Now:</b> Collection policies apply directly in Edge without blocking configuration.</li></ul></li></ul></li><ul><li><b>DLP Policies</b>\n\n    <ul><li><b>Previously:</b> Admins manually created Edge configuration policies to block unsupported browsers.</li><li><b>Now:</b> Edge configuration policies are automatically created and scoped to match DLP policies when DLP policies are created or updated.</li></ul></li><li><b>User experience:</b><ul><li>Edge for Business: No impact.</li><li>Chrome with Purview extension: Browser usable; access to unmanaged GenAI apps is blocked.</li><li>Firefox and other browsers: Users are blocked from using the browser entirely.</li></ul></li><li><b>DLP Policy Modes:</b>\n  <ul>\n    <li>Audit mode: Policy created but browser blocking is optional.</li>\n    <li>Block mode: Policy created and browser blocking is enforced.</li>\n  </ul>\n</li>\n</ul><li>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>No action is required to enable these changes.</li>\n<li>Inform your DLP and IT Admins of this update.</li>\n<li>If you previously created Edge configuration policies scoped to all users and want to rely on automation:\n  <ul>\n    <li>Disable or delete the old Edge configuration policy.</li>\n    <li>Update your Purview DLP policy to trigger the automated behavior.</li>\n  </ul>\n</li>\n<li>Learn more: <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-dlp-purview-configuration\" target=\"_blank\">Set up Microsoft Purview DLP policies in the Edge management service</a>&nbsp;</li>\n</ul></li></ul>\n\n<b><b>Compliance considerations:</b></b></p><p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Modifies DLP policies or enforcement</td><td>Automates Edge configuration policy creation and blocking enforcement for unmanaged GenAI apps for DLP policies.</td></tr>\n<tr><td>Introduces or modifies AI/ML capabilities</td><td>Restricts user interaction with unmanaged GenAI apps based on DLP policy scope.</td></tr>\n<tr><td>Allows user/admin to enable or disable</td><td><p>Admins can disable or delete existing Edge configuration policies to rely on automation. Admins can disable or delete Purview DLP policies blocking actions to unmanaged apps in the browsers to disable Edge configuration policy that blocks other browsers.</p><p></p><p></p></td></tr>\n</tbody></table>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "486368"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview DLP now automates blocking of unmanaged GenAI apps in Edge for Business, removing the need for separate Edge configuration policies. Rollout begins mid-October 2025. Admins should update or disable old policies to use this automation, enhancing data protection and policy enforcement."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1151234",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-10T22:43:59.813Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-10T22:43:39Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview DLP and Edge for Business: Automated blocking of unmanaged GenAI apps in unprotected browsers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
