{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\nWe’re introducing <i>custom site inclusion for Site Lifecycle Management (SLM) policies</i> in SharePoint. This new capability gives you greater control over which sites are governed by SLM, enabling more precise and flexible retention strategies based on your organization’s needs.</p>\n\n<p><b><b>When this will happen:</b></b></p><p>\nGeneral Availability (Worldwide): Available now</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n</ul><p><b>Who is affected:</b></p><ul><li>Microsoft 365 admins managing SharePoint site lifecycle policies</li><li>Organizations using Site Lifecycle Management (SLM) in SharePoint</li>\n\n</ul><p><b>What will happen:\n</b></p><ul>\n\n\n\n\n</ul>\n<p></p><ul><li>Admins can now upload a CSV file to define a custom scope of up to 10,000 SharePoint site URLs for SLM policy enforcement.</li><li>Sites with existing retention policies or holds are automatically included in the scope.</li><li>The inactivity period setting has moved from the <i>Scope</i> page to the <i>Configuration</i> page in both the policy creation wizard and the policy details panel.</li><li>This feature is available by default and does not require additional configuration to enable.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<p><b>Instructions for using custom site inclusion in SLM policies:</b></p>\n<ol>\n<li>Upload a CSV file:<ul>\n<li>Use the new option to upload a CSV file containing up to 10,000 SharePoint site URLs to define the custom scope for policy execution.</li>\n<li>Sites with retention policies and retention holds are automatically included in this scope.</li>\n</ul>\n</li>\n<li>CSV file requirements:<ul>\n<li>Ensure the file contains no duplicate URLs.</li>\n<li>All URLs must be valid, complete, and belong to your tenant’s domain.</li>\n<li>The file format must be CSV.</li>\n</ul>\n</li>\n<li>Policy wizard update:<ul>\n<li>The inactivity period selection has moved from the <i>Scope</i> page to the <i>Configuration</i> page in both the create policy wizard and the policy details panel.</li></ul></li></ol><p>Screenshot: <i>Custom Inclusion of sites</i></p><p></p><ul></ul><p></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/9fc6bd7e-ea61-4810-905e-dbf65f7f1563/916d66e4ee7a1228d5f2e2d4255289a87148aacf.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p>Additional preparation steps:</p><ul><li>Notify your SharePoint and Microsoft 365 admins about this new capability.</li><li>Update internal documentation to reflect the new policy configuration options.</li><li>Prepare a CSV file with the list of SharePoint site URLs you want to include in your custom policy scope.</li></ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Site Lifecycle Management now supports custom site inclusion via CSV upload of up to 10,000 URLs for precise policy enforcement. The inactivity period setting moved to the Configuration page. This feature is available worldwide by default, requiring no extra setup. Admins should prepare CSV files and update documentation accordingly."
    }
  ],
  "EndDateTime": "2025-10-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1154789",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-17T23:04:31.94Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-17T23:04:25Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "New: Custom site inclusion for SharePoint Site Lifecycle Management (SLM) policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
