{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 10, 2026: We have updated the timeline and content. Thank you for your patience.</p><p>We've made an update to ensure that custom formatters also apply to the new components that we've introduced as part of this refresh. Now if you hide \"new folder\" from the command bar, for example, it will also be hidden from the breadcrumb dropdown menu.</p><p>When space allows, we will now expand the breadcrumb to show more levels of folder hierarchy. We've also updated the command bar to show more commands when space is available.&nbsp;</p><p><b><b>Introduction</b></b></p><p>Microsoft is introducing a refreshed user experience for SharePoint document libraries to improve usability and navigation. These updates are based on customer feedback and aim to streamline common actions, enhance visibility of filters and views, and improve folder navigation—all without disrupting existing customizations.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/2838b8da-5ba1-4382-bdae-9e58a719ccb3\" style=\"width: 400px;\" alt=\"user settings\"></p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=500870\" target=\"_blank\">500870</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Targeted Release:</b> Begins early November 2025 and completes by mid-December 2025 (previously late November).</li>\n<li><b>General Availability (Worldwide, GCC, GCC High, and DoD):</b> Begins early January 2026 and completes by late February 2026 (previously late January).</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> <ul><li>All users of SharePoint document libraries across Microsoft 365 tenants.</li><li><i>Note</i>: Some users may have access to this feature before other users within your organization.</li></ul></li><li><b>What will happen:</b></li><ul>\n  <li><b>Simplified command bar:</b> The command bar has been reorganized for clarity and efficiency. The \"New\" and \"Upload\" actions are now combined into a single \"Create or Upload\" hero button, docked at the upper right.</li>\n  \n  <li><b>Improved breadcrumb navigation:</b> The breadcrumb has been redesigned to make navigating between folders faster and more intuitive. Users can now:\n    <ul>\n      <li>See their current folder context clearly.</li>\n      <li>Jump back to any parent folder with a single click.</li>\n      <li>Use the dropdown next to the folder name in the breadcrumb to create folders or upload files directly into the current folder.</li>\n      <li>When at the root of a library, use the \"Other Libraries\" sub-menu to navigate between libraries in the same site.</li>\n    </ul>\n  </li>\n\n  <li><b>More visible custom views, view creation, and view saving:</b> Custom views and view creation are now displayed more prominently inside pills directly under the breadcrumb. When sorts, filters, or groups are applied but not saved to the view, a visual indicator shows that others won’t see these changes until they’re saved.</li>\n\n  <li><b>Filter pills: </b>Filter pills provide a faster way to refine your view. Instead of opening the full filter pane, users can:\n    <ul>\n      <li>Apply file type filters directly from the pill bar at the top of the document library.</li>\n      <li>See all active filters as pills in this bar.</li>\n      <li>Use the clear button to remove all filters and return to the saved view.</li>\n    </ul>\n  </li>\n\n  <li><b>View options button: </b>Common view customization options are now surfaced under a new \"Options\" button, including:\n    <ul>\n      <li>Layout options</li>\n      <li>Sort and group options</li>\n      <li>Field visibility and formatting</li>\n    </ul>\n  </li>\n\n  <li><b>Command bar custom formatter behavior:</b> Any command configured with the following attributes will now appear in a distinguished area on the far right (or far left for right-to-left locales) of the command bar:\n    <ul>\n      <li><code>\"primary\": true</code></li>\n      <li><code>\"position\": 0</code></li>\n    </ul>\n    Full details are documented here: <a href=\"https://learn.microsoft.com/sharepoint/dev/declarative-customization/view-commandbar-formatting\">View command bar formatting documentation</a>\n  </li>\n\n  <li><b>No impact to other customizations: </b>Other than the command bar custom formatter behavior described above, this change will not affect existing customizations made through SPFX, column formatting, or view formatting.</li>\n</ul></ul>\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required to prepare for this change.</li>\n<li>If you use custom command bar formatters, review the updated placement behavior: <a href=\"https://learn.microsoft.com/sharepoint/dev/declarative-customization/view-commandbar-formatting\" target=\"_blank\">View command bar formatting documentation</a>.</li><li>Before rollout, we will update this post with new documentation.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is refreshing SharePoint document libraries to improve usability with a simplified command bar, enhanced breadcrumb navigation, more visible custom views, and filter pills. Updates include combined actions, clearer folder context, and better command bar formatting, rolling out from November 2025 to February 2026 without impacting existing customizations."
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/blog/spblog/ux-updates-ai-actions--forms-in-document-libraries/4466700"
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1179157",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-10T17:35:43.04Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-24T22:10:28Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "(Update) Updated SharePoint document library user experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
