{
  "ActionRequiredByDateTime": "2026-01-30T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 9, 2025: We are updating this post as a reminder. Thank you for your patience.&nbsp;</p><p><b><b>Introduction:</b></b>\n</p><p>As part of the Microsoft Secure Future Initiative (SFI) and in alignment with the “Secure by Default” principle, we’re <b>retiring the legacy IDCRL </b>(Identity Client Run Time Library) <b>authentication protocol</b> in<i> SharePoint Online</i> and <i>OneDrive for Business</i>. This change helps strengthen your organization’s security posture by enforcing modern authentication standards—OpenID Connect and OAuth—which reduce exposure to outdated and vulnerable authentication methods.</p>\n\n<p><b><b>When this will happen:</b></b>\n</p><ul>\n<li><b>Starting January 31, 2026:</b> Legacy client authentication will be blocked by default. Organizations may temporarily re-enable it using PowerShell until April 30, 2026.</li>\n<li><b>Starting May 1, 2026:</b> Legacy client authentication will be permanently blocked and cannot be re-enabled.</li>\n</ul><p></p>\n\n<p><b><b>How this affects your organization:</b></b>\n</p><p><b>Who is affected:</b>\n</p><ul>\n<li>Organizations using clients, scripts, or applications that rely on the legacy IDCRL authentication protocol to access SharePoint Online or OneDrive for Business.</li>\n</ul>\n<b>What will happen:</b>\n<ul>\n<li>Legacy authentication calls using IDCRL will be <b>blocked by default starting January 31, 2026</b>.</li>\n<li><b>Temporary re-enablement is possible via PowerShell </b>until April 30, 2026.</li>\n<li>After May 1, 2026, IDCRL authentication will be permanently retired and cannot be re-enabled.</li>\n<li>Applications using IDCRL will fail to authenticate unless updated to use modern protocols.</li>\n</ul><p></p>\n\n<p><b><b>What you can do to prepare:</b></b>\n</p><p>We recommend <b>migrating from legacy authentication protocols to modern authenticatio</b>n as soon as possible.&nbsp;</p><p>To prepare for this retirement:</p><ul>\n<li><a href=\"https://devblogs.microsoft.com/microsoft365dev/migrating-from-idcrl-authentication-to-modern-authentication-in-sharepoint/\" target=\"_blank\">Migrate all clients, scripts, and applications</a> to use OpenID Connect or OAuth protocols.&nbsp;</li>\n<li>Review current configurations for IDCRL authentication.</li>\n<li>Notify IT admins, app owners, and security teams about the upcoming retirement.</li>\n<li>Updat<b>e</b> internal documentation to reflect the new authentication defaults.</li><li>Use telemetry to identify usage of legacy authentication protocols and monitor migration progress.</li>\n<li>Use PowerShell to manage legacy authentication settings if needed:\n<ul>\n<li>Set <code>AllowLegacyAuthProtocolsEnabledSetting</code> and <code>LegacyAuthProtocolsEnabled</code> to <code>TRUE</code> to temporarily allow legacy authentication until April 30, 2026.</li></ul></li><li>Learn more:<ul><li><a href=\"https://devblogs.microsoft.com/microsoft365dev/migrating-from-idcrl-authentication-to-modern-authentication-in-sharepoint/\" target=\"_blank\">Migrating from IDCRL authentication to modern authentication in SharePoint | Microsoft 365 Developer Blog | Microsoft Dev Blogs</a></li><li><a href=\"https://learn.microsoft.com/powershell/module/microsoft.online.sharepoint.powershell/set-spotenant?view=sharepoint-ps#-legacyauthprotocolsenabled\" target=\"_blank\">Set-SPOTenant (Microsoft.Online.SharePoint.PowerShell) | Microsoft Learn</a></li></ul></li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring the legacy IDCRL authentication protocol in SharePoint Online and OneDrive for Business by January 31, 2026, enforcing modern OpenID Connect and OAuth protocols. Legacy authentication will be blocked by default, with temporary re-enablement via PowerShell until April 30, 2026, and permanent retirement from May 1, 2026. Organizations should migrate to modern authentication promptly."
    }
  ],
  "EndDateTime": "2026-06-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1184649",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-09T17:47:23.01Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-11T00:37:53Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft SharePoint: Retirement of IDCRL authentication protocol and enforcement of OpenID Connect and OAuth protocols",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
