{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b><br>\nTo help corporate communicators and network admins manage content visibility, Viva Engage now allows conversations to be muted directly from the Viva Engage app in Teams for iOS and Android. Muting a conversation removes the thread from appearing in the home feed and email digests, helping reduce undesired clutter and streamline communication.</p>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=503019\" target=\"_blank\">503019</a>.</p>\n\n<p><b><b>When this will happen:</b></b><br>\nGeneral Availability (Worldwide): Rollout will begin in early October 2025 and is expected to complete by mid-October 2025.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n</ul><p><b>Who is affected:</b> Viva Engage network admins and corporate communicators using the Viva Engage app in Teams on iOS and Android.</p><ul>\n</ul><p><b>What will happen:</b>\n  <ul>\n    \n    \n    \n    \n  </ul>\n</p><ul><li>A new option to mute conversations will be available in the Viva Engage mobile app within Teams.</li><li>Muted threads will no longer appear in the home feed or email digests.</li><li>This feature is enabled by default and does not require admin configuration.</li><li>There is no impact to end-user experience unless they are designated as network admins or corporate communicators.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Inform Viva Engage corporate communicators and network admins about this new capability.</li>\n<li>Update any internal documentation that references content moderation or feed management in Viva Engage.</li>\n<li>No additional configuration is required.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b><br>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "503019"
    },
    {
      "Name": "Summary",
      "Value": "Viva Engage will allow network admins and corporate communicators to mute conversations directly in the Teams app on iOS and Android, removing muted threads from home feeds and email digests. This feature, enabled by default, will roll out worldwide from early to mid-October 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-11-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1157708",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-22T22:49:26.74Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-22T22:49:20Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Viva Engage: Mute a conversation from Teams for iOS",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
