{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 3, 2025: We have updated the timeline. Thank you for your patience.</p><p><b><b>Introduction:</b></b></p><p>To enhance the extensibility of Microsoft 365 Copilot, we’re introducing support for <b>Declarative Agents </b>in Copilot Chat&nbsp;within classic Outlook for Windows. Declarative Agents will be available for Copilot Chat users (without a Microsoft 365 Copilot license) and Microsoft 365 Copilot users (with a Microsoft 365 Copilot license). Declarative Agents allow users to customize their Copilot experience by integrating plugins, enterprise connectors, and orchestration logic. This update aligns classic Outlook with other Copilot Chat experiences, delivering consistent agent capabilities across platforms.</p><p>This update is tracked under Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481559\" target=\"_blank\">481559</a>.</p><p><b><b>When this will happen:</b></b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out late October 2025 and expect to complete by mid-December 2025.</p><p><b><b>How this will affect your organization:</b></b></p><p></p><p style=\"font-family: Arial; font-size: 10pt; margin-left: 25px;\"></p><p>Who is affected:</p><ul><li>Organizations using <b>classic Outlook for Windows </b>with Microsoft 365 Copilot Chat</li><li>Admins managing Copilot extensibility and agent deployment</li></ul><p>What will happen:</p><p></p><ul></ul><p></p><ul><li>Declarative Agents will be available in <i>Copilot Chat within classic Outlook for Windows</i></li><li>Users will see a right-side panel in <i>Outlook </i>showing:<ul><li>Agents previously installed by the user</li><li>Agents deployed by the admin</li><li>Entry points to browse agents in the app store</li><li>Option to create a new agent</li></ul></li><li>Declarative Agents in <i>Copilot Chat</i> are <b>enabled by default</b> <b>for Microsoft 365 tenants with Copilot licenses</b></li><li>No admin opt-in is required to use agents in Copilot Chat</li><li>Advanced agent capabilities (access to SharePoint or Graph connectors) require explicit admin opt-in and billing setup</li><li>Admins can manage agents through the Integrated apps section of the Microsoft 365 admin center, including:<ul><li>Enabling or disabling Declarative Agents for the organization</li><li>Assigning access to specific users or groups</li><li>Blocking or removing agents from the organizational catalog</li><li>Managing agent visibility and availability</li></ul></li></ul><p><b>Licensing tiers:</b></p><ul><li><b>Microsoft 365 Copilot: </b>Requires a Microsoft 365 Copilot license. Users get full access to Declarative Agents, including those integrated with plugins, enterprise connectors, and advanced orchestration features</li><li><b>Copilot Chat:</b> Designed for users without the Copilot license. These users can still access Copilot Chat and build knowledge-only Declarative Agents, but with limited capabilities</li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>Review agent management settings in the <i style=\"font-family: Arial; font-size: 10pt;\">Integrated apps</i> section of the Microsoft 365 admin center</li><li>Ensure Copilot extensibility is enabled for your organization if you plan to use agents.</li><li>If you plan to use advanced agent capabilities (such as Graph or SharePoint connectors), configure billing and opt-in via the Microsoft 365 admin center or Power Platform admin center.</li><li>Communicate this update to helpdesk and support teams.</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/overview-declarative-agent\">Declarative agents for Microsoft 365 Copilot overview | Microsoft Learn</a></li><li><a style=\"font-size: 13.3333px;\" title=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" rel=\"noreferrer noopener\" href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\">Manage agents for Microsoft 365 Copilot in Integrated Apps</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481559"
    },
    {
      "Name": "Summary",
      "Value": "Declarative Agents in Copilot Chat will be available in classic Outlook for Windows starting late October 2025, enabling users to customize their experience with plugins and connectors. Enabled by default for Copilot license holders, admins can manage agent settings via the Microsoft 365 admin center."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-01-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162288",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-03T15:39:18.487Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T23:12:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Declarative Agents in Copilot Chat coming to classic Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
