{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We’re updating <b>Memory</b> in <i>Microsoft 365 Copilot</i> to improve personalization and enhance the user experience. With this update, Copilot will personalize responses using chat history, helping users receive more relevant and contextual replies. We’re also introducing refreshed user controls in <i>Copilot settings</i> to make it easier to view and manage what Copilot remembers.</p><p><b><b>When this will happen:</b></b></p><ul><li><b>Targeted Release: </b>Begins rolling out early October 2025 and expected to complete by mid-October 2025.</li><li><b>General Availability:</b> Begins mid-October 2025 and expected to complete by late October 2025.</li></ul><p><b><b>How this affects your organization:</b></b></p><p>All users of Microsoft 365 Copilot in tenants where Memory is enabled.</p><p>What will happen:</p><ul><li>Copilot will use chat history to personalize responses, making interactions more tailored and helpful:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/122f6f1e-b00d-4e9c-95af-1b22df3850cd/58819321eef3d70e1e30bc6f0779be0d0ef5f2ae.png\" alt=\"user settings\" style=\"width: 400px;\"></p><li>Users will see a redesigned Memory settings page that improves visibility and control over what Copilot remembers.</li><li>Existing admin and user-level Memory settings are respected. If Memory is toggled off, it will remain off.</li><li>No changes to admin controls or policy enforcement.</li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>Review the updated Memory settings experience with your users once available.</li><li>No admin action is required unless you wish to update internal documentation or training materials.</li></ul><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/graph/control-enhanced-personalization-privacy\" target=\"_blank\">Enhanced personalization control overview | Microsoft Graph | Microsoft Learn</a>&nbsp;</li><li><a href=\"https://learn.microsoft.com/graph/api/resources/enhancedpersonalizationsetting?view=graph-rest-beta\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">enhancedPersonalizationSetting resource type | Microsoft Graph | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed (e.g. documents, emails, chats, etc.)?</td><td>Yes. Copilot will now use chat history to personalize responses, which changes how existing customer data is processed to generate contextual replies.</td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. This update enhances Copilot’s personalization model by incorporating chat history, allowing it to generate more tailored responses.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes. Users will receive more personalized and contextual responses from Copilot based on their prior chat interactions.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users can manage what Copilot remembers through the updated Memory settings page in Copilot settings.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot’s Memory update, rolling out October 2025, uses chat history to personalize responses and offers a redesigned Memory settings page for better user control. Existing admin settings remain unchanged, and no admin action is required unless updating documentation or training."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1158329",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-23T23:06:38.697Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-23T23:06:08Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Updates to memory and personalization",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
