{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 13, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>Microsoft Planner will soon support <b>Microsoft Information Protection (MIP)</b> sensitivity labels at the content level. This enhancement enables encryption, restricts unauthorized actions such as copying, printing, or exporting plan contents, and adds visual markings like watermarks for clear sensitivity awareness. By enforcing content-level protections, Planner helps organizations prevent data leaks, maintain compliance, and enable secure collaboration without impacting productivity. This update aligns Planner with Microsoft Purview standards for consistent enforcement of security and data protection policies.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=523819\" target=\"_blank\">523819</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide): Rollout will begin in early December 2025 and is expected to complete by late January 2026 (previously mid-December 2025).</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b> Admins and users of Microsoft Planner across Microsoft 365 tenants.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Planner will support Microsoft Information Protection (MIP) sensitivity labels at the content level.</li>\n<li><b>Container-level labels</b> (already supported) control who can join a plan and enforce restrictions like guest access and sharing limits.</li>\n<li><b>Content-level labels (new):</b>\n<ul>\n<li>Block copy, print, and export actions.</li>\n<li>Enforce read-only access for highly confidential plans.</li>\n<li>Restrict duplicating or exporting plans.</li>\n</ul>\n</li>\n<li>Feature will be <b>enabled by default</b> and progressively available across all tenants by December 15, 2025.</li>\n</ul><p>Screenshot 1: <i>Label Picker</i></p>\n<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/7b12ba14-0612-4be8-80ef-f69fd7fde471\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<p>Screenshot 2: <i>Label Details</i></p>\n<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/24880ea7-567b-4e0f-adbc-d7e50fb6777b\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Screenshot 3: <i>Label induced restrictions</i></p>\n<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/758886c9-d2c4-4ded-ac55-3399e9b0eb60\" style=\"width: 400px;\" alt=\"user settings\"></p>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No changes are required for existing labels.</li>\n<li>Review Purview label protection settings (copy/print/export restrictions) and confirm RMS usage rights align with expected Planner behaviors.</li>\n<li>Update governance guidance and user training for label behaviors in Planner.</li><li>Update help and user training for label behaviors in Planner.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/purview/sensitivity-labels\" target=\"_blank\">Learn about sensitivity labels</a>&nbsp;(updates in progress)</p><ul>\n</ul>\n\n<p><b>FAQ</b></p>\n<p><b>Question:</b> What label types does Planner support now?<br>\n<b>Answer:</b> Planner has long supported container‑level labels (Teams/M365 Group/roster access controls). With this release, Planner adds enforcement for content‑level labels (block copy/print/export, read‑only, etc.) on plans and tasks consistent with Microsoft Purview policies and RMS usage rights.</p>\n\n<p><b>Question:</b> Which plan types are covered and when?<br>\n<b>Answer:</b> Rollout begins with Roster Plans followed by Group‑backed Plans.</p>\n\n<p><b>Question:</b> Do I need to change any Purview policies or configurations?<br>\n<b>Answer:</b> No changes are required for existing labels; however, you should review label protection settings (e.g., copy/print/export restrictions) and confirm RMS usage rights align with expected Planner behaviors. Update governance guidance accordingly.</p>\n\n<p><b>Question:</b> How does this interact with Loop and Teams meeting notes/TLC?<br>\n<b>Answer:</b> Loop meeting notes apply a single content label across the page and its components (including Task List components (TLC)). Planner now inherits and enforces those restrictions on the corresponding roster plan, preventing prior sync breaks when restrictive labels were applied.</p>\n\n<p><b>Question:</b> What happens to guest/external users under different label combinations?<br>\n<b>Answer:</b> Container labels determine who can be added; content labels determine what actions are permitted. For example, guests can be added when the container allows it, but content‑level restrictions may prevent plan access or actions (copy/export/print).</p>\n\n<p><b>Question:</b> Who can change a plan’s sensitivity label?<br>\n<b>Answer:</b> Typically, owners/editors with the appropriate rights can change labels. Permissions are enforced service‑side and reflected in the UI according to RMS usage rights.</p>\n<p></p>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "523819"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Planner will support Microsoft Information Protection (MIP) content sensitivity labels by early December 2025, enabling encryption and restrictions like blocking copy, print, and export. This enhances data protection, enforces read-only access, and aligns with Microsoft Purview policies, with no required changes to existing labels."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2026-02-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191342",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-13T17:49:01.53Z",
  "Services": [
    "Planner"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-01T23:43:19Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Planner: Support for Microsoft Information Protection (MIP) content sensitivity labels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
