{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 29, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction:</b></b></p><p>\n\n</p><p>We’re introducing a visual refresh of the <b>Access Request and Access Denied</b>&nbsp;page experience across <i>Microsoft 365</i>, redesigned to help users quickly request access to content such as documents, SharePoint sites, or Teams meeting recordings. This update features modern Fluent illustrations, animations, and clearer messaging to make it easier to understand and resolve access issues for a more seamless collaboration experience.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=553214#Roadmap\">553214</a>.</p><p> </p>\n\n<p></p>\n\n\n\n\n\n<p><b><b>When this will happen:</b></b></p>\n\n<p><b>\nGeneral Availabilit<span style=\"background-color: rgb(255, 255, 255);\">y (Worldwide, GCC, GCC High, DoD):</span></b> We will begin rolling out in February 2026 (previously&nbsp;early January)&nbsp;and expect to complete by March 2026 (previously&nbsp;early February)<b>.</b></p>\n\n<p><b>\n<b>How this will affect your organization:</b></b></p>\n<p><b>Who is affected:&nbsp;</b>All users requesting access to content stored on <i>OneDrive</i> and<i> SharePoint</i>.</p><b>What will happen:</b><p></p><ul><li>Users will see a redesigned Access Request page when attempting to access restricted content:&nbsp;</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/1c634d49-0724-4e6a-8bbc-86d24bf25334/14d6749f89c45f98c4a273cfb4d0e29c69044a55.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>The page will feature updated Fluent visuals and animations.\n</li><li>Messaging will be clearer to help users understand the status of their request:</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/6b6bc1f3-3827-4760-833e-d9af2b7c8709/df373642b72eb96268796ff5674fa3d11384ae8e.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>No changes to admin policies or access controls.\n</li><li>The update will be <b>enabled by default</b>.</li></ul><p><b><b>What you need to do to prepare:</b>\n</b></p><p>No action is required to enable this update; it will be <b>applied automatically</b>.</p><p>However, to ensure a smooth experience for your users, we recommend the following:</p><ul><li>Communicate this change to helpdesk and support staff so they can assist users who may have questions about the new visuals or messaging.\n</li><li>Update internal documentation if you reference the Access Request or Access Denied experience in training materials or support guides.\n</li><li>Review any custom workflows or access request processes to ensure they align with the updated experience.\n</li><li>Monitor user feedback after rollout to identify any confusion or support needs related to the new design.</li></ul><p><b><b>Compliance considerations:</b>&nbsp;</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "553214"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is updating the Access Request and Access Denied pages with modern visuals, animations, and clearer messaging to improve user experience. The rollout starts February 2026 and completes by March 2026, with no changes to admin policies. The update is automatic; no user action is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-04-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188599",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-29T20:16:34.44Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-21T00:17:08Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365: Modern Access Request and Access Denied web page",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
