{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To improve discoverability and ensure questions reach the right experts, we’re updating how questions are posted from the Answers tab in Viva Engage.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout will be completed in mid-July 2025.</p><p><b>How this affects your organization:</b></p><p>Currently, questions submitted via the Answers tab are posted as network-level questions, which are not tied to any specific community. This makes them harder to find and less likely to receive timely responses.\n</p><p>With this update:\n</p><ul><li>Users will be required to select a community when posting a question from the Answers tab.\n</li><li>This ensures questions are directed to the most relevant audience, improving visibility and response quality.\n</li><li>Existing questions will remain visible in the Answers tab, but all new questions must be posted to a selected community.\n</li></ul><p>This change is on by default and applies to all users in Viva Engage.\n</p><p><b>What you can do to prepare:</b></p><p>No admin action is required. However, you may want to:\n</p><ul><li>Inform your users about the new posting requirement.\n</li><li>Encourage users to join relevant communities to ensure they can post and respond effectively.\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Viva Engage is updating the Answers tab to require users to select a community when posting questions, improving visibility and response quality. This change will be completed by mid-July 2025, applies to all users, and requires no admin action, though informing users is recommended."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108128",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-02T22:35:58.713Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-02T22:34:43Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Update to Question Posting in Viva Engage Answers Tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
