{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>SharePoint admins can now <b>customize the emails</b> <b>sent from Data Access Governance reports</b> to site owners and admins for site access reviews. Customizing email content helps improve the read-through rate of these emails, which can lead to faster responses and better governance across the tenant.</p>\n\n<p><b><b>When this will happen</b></b></p>\n<p><b>General Availability (Worldwide, GCC, GCCH, DoD): </b>We will begin rolling out in<b> mid-December 2025</b> and expect to complete by<b> mid-January 2026</b>.</p>\n\n<p><b><b>How this affects your organization</b></b></p>\n<ul>\n<li><b>Who is affected:</b> SharePoint Online admins managing Data Access Governance reports</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Admins can customize email content sent to site owners/admins during site access reviews.</li>\n<li>This feature is designed to improve engagement and response rates.</li>\n<li>No changes to existing policies; customization is optional.</li>\n</ul>\n</li>\n</ul>\n\n<p><b><b>What you need to do to prepare</b></b></p>\n<ul>\n<li>Notify your SharePoint administrators about the ability to <a href=\"https://learn.microsoft.com/sharepoint/site-access-review#customize-email-to-site-owners\" target=\"_blank\">customize emails</a> from Data Access Governance reports.&nbsp;</li>\n<li>Update internal documentation and workflows to reflect this change.</li>\n<li>Review Microsoft documentation for guidance on customizing email templates.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/site-access-review#customize-email-to-site-owners\" target=\"_blank\">Customize email to site owners - Initiate site access reviews for Data access governance reports | Microsoft Learn</a></p><ul>\n</ul>\n\n<p><b><b>Compliance considerations</b></b></p>\n<p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint admins can customize emails sent from Data Access Governance reports for site access reviews starting mid-December 2025. This optional feature aims to improve email engagement and response rates without changing existing policies. Admins should update documentation and notify relevant teams accordingly."
    }
  ],
  "EndDateTime": "2026-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1198704",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-17T19:48:35.333Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-17T19:48:29Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint Online: Email customization for site access review from Data Access Governance reports",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
