{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:</b></p><p>Microsoft Security Copilot agents are directly built into the flow of work for security teams in Microsoft Defender, Microsoft Entra, Microsoft Intune and Microsoft Purview. Today, we are introducing a dozen new agents across these products, to bring agentic defense across workflows, enabling adaptive protection.  \n</p><p>\n</p><p>To make the agents easily accessible and help security teams get started more quickly, we are excited to announce that Security Copilot will be included in your Microsoft 365 E5 plan as part of your core entitlement with no additional cost*. No provisioning or licensing changes are required. Rollout starts today with existing Security Copilot customers with Microsoft 365 E5 and will continue for all Microsoft 365 E5 customers in the upcoming months.&nbsp;</p><p>\n</p><p><b>When this will happen</b></p><ul><li>Microsoft 365 E5 customers who already have Security Copilot can get started today with this entitlement.</li><li>All other Microsoft 365 E5 customers can get access to Security Copilot as part of a phased rollout in the upcoming months, with notifications sent 30 days prior to activation.</li></ul><p>\n</p><p><b>How this affects your organization</b></p><p>Your organization will have access to Security Copilot with:\n</p><ul><li>400 security compute units (SCUs)/month for every 1,000 paid users in Microsoft 365 E5 (up to 10,000 SCUs/month across all workspaces). SCU allocation scales based on the number of users in Microsoft 365 E5.\n</li><li>Core agentic experiences across Microsoft Entra, Microsoft Intune, Microsoft Purview, Microsoft Defender, and the Security Copilot portal\n</li><li>Developer tools and APIs for custom agents and integrations\n</li></ul><p>\n</p><p><b>What you can do to prepare:</b></p><p><b>Microsoft 365 E5 customers who already have Security Copilot can get started today with:\n</b></p><ul><li>Security operations in Microsoft Defender: <a href=\"https://security.microsoft.com\" target=\"_blank\">https://security.microsoft.com</a>&nbsp;</li><li>Data security in Microsoft Purview: <a href=\"https://purview.microsoft.com\" target=\"_blank\">https://purview.microsoft.com</a>&nbsp;</li><li>Identity and access in Microsoft Entra: <a href=\"https://entra.microsoft.com\" target=\"_blank\">https://entra.microsoft.com</a>&nbsp;</li><li>Endpoint management in Microsoft Intune: <a href=\"https://intune.microsoft.com\" target=\"_blank\">https://intune.microsoft.com</a>&nbsp;</li><li>Review the <a href=\"https://ttps//aka.ms/scpinclusioninfo\" target=\"_blank\">documentation</a> for details of what’s included with Security Copilot in Microsoft 365 E5</li></ul><p><b>All other Microsoft 365 E5 customers are encouraged to:\n</b></p><ul><li>Review the <a href=\"https://learn.microsoft.com/copilot/security/security-copilot-inclusion\" target=\"_blank\">documentation</a> for details of what’s included with Security Copilot in Microsoft 365 E5\n</li><li>Explore supported use cases in the <a href=\"https://adoption.microsoft.com/en-us/security-copilot/\" target=\"_blank\">Security Copilot Adoption Hub</a>\n</li><li>Watch for the notification email 30 days prior to activation</li></ul><p>*Eligible Microsoft 365 E5 customers will have 400 Security Compute Units (SCUs) per month for every 1,000 user licenses, up to 10,000 SCUs per month. This included capacity is expected to support typical scenarios. Customers will have the option to pay for scaling beyond the allocated amount at a future date at a rate of $6 per SCU on a pay-as-you-go basis. They will receive a 30-day advance notice when this option becomes available. Learn more: <a href=\"https://learn.microsoft.com/copilot/security/security-copilot-inclusion\" target=\"_blank\">Learn about Security Copilot inclusion in Microsoft 365 E5 subscription | Security Copilot | Microsoft Learn</a>\n</p><p></p><p></p><table class=\"table table-bordered\"><tbody><tr><td><b>Question&nbsp;</b></td><td><b>Answer</b></td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. This change introduces agentic AI capabilities through Security Copilot, which interacts with customer data across Microsoft Defender, Microsoft Entra, Microsoft Intune, Microsoft Purview, and the Security Copilot portal.</td></tr><tr><td>Does the change provide users any new way of interacting with generative AI?</td><td>Yes. Users will be able to interact with generative AI experiences embedded in Microsoft security tools, including Defender, Entra, Intune, Purview, and the Security Copilot portal.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes. Admins can manage access to Security Copilot and its capabilities using existing Microsoft 365 and Entra ID group membership controls.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Security Copilot is now included at no extra cost in Microsoft 365 E5, providing integrated AI-driven security agents across Defender, Entra, Intune, and Purview. Customers receive monthly Security Compute Units based on user count, with phased rollout and admin controls via Entra ID group membership."
    }
  ],
  "EndDateTime": "2026-02-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187672",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-18T16:12:36.277Z",
  "Services": [
    "Microsoft Entra",
    "Microsoft Intune",
    "Microsoft Defender XDR",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T16:08:16Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Get ready for security agents: Microsoft Security Copilot will be included in Microsoft 365 E5",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
