{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b>\n</p><p>To simplify the transition experience, starting in October 2025, Microsoft Outlook will automatically set up users’ classic Outlook accounts and settings in the <i>new Outlook for Windows</i>—seamlessly and in the background—if certain conditions are met. This enhancement enables users to work across both Outlook experiences without manual setup or toggling.</p>\n\n<p><b><i>Note:</i> </b>This update does not change the previously communicated migration opt-out timelines: January 2026 for EDU and April 2026 for Enterprise. </p><p><i><b>Note:</b> </i>This update does not force the launch or usage of the new Outlook, nor does it modify any existing classic Outlook settings or defaults.</p>\n\n<p><b>When this will happen</b>\n</p><ul>\n<li><b>Current Channel Production (General Availability): </b>We will begin the roll out in October 2025 and continue to expand it over the next few months.</li></ul><p><b>How this affects your organization</b></p><p>If a user's primary account in <i>classic Outlook</i> is an Exchange Online account, and the new Outlook toggle is available (not hidden by <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install#prevent-users-from-switching-to-new-outlook\" target=\"_blank\">policy</a>), and the new Outlook is installed on their device, then their accounts and settings will be automatically configured in the <i>new Outlook</i> when they launch classic Outlook. This setup occurs in the background and does not alter existing accounts, settings, or defaults.</p>\n\n<p>Additional details:\n</p><ul>\n<li>Users will receive an in-app notification in <i>classic Outlook</i>.</li>\n<li>If users have previously signed into new Outlook, their primary account remains unchanged.</li>\n<li>Any new accounts added in <i>classic Outlook</i> will appear as secondary accounts in <i>new Outlook</i>.</li><li>Only accounts from the active profile in use will be set up in <i>new Outlook</i>.</li><li>Shared mailboxes and delegate permissions will be preserved in the new Outlook setup.</li>\n<li>Users who launch the new Outlook directly from their device will be able to get started with the accounts and settings they use in <i>classic Outlook</i>, without any additional effort.</li>\n<li>This feature is <b>on by default</b> and does not require user interaction unless opting out.</li><li>Users can opt out via <b>Classic Outlook &gt; Options &gt; General &gt; New Outlook Settings &gt; Automatically set up my account and settings in new Outlook</b>.</li></ul><p><b><i>Note:</i></b> If this policy is configured by the admin, users will not be able to change the opt-out setting in Outlook.</p><p></p>\n\n<p>View the list of <a href=\"https://support.microsoft.com/office/import-settings-and-install-add-ins-on-new-outlook-for-windows-b85ce5ff-bef3-45ae-9e95-9d63c514abdc#bkmk_imported_settings_outlook\" target=\"_blank\">settings imported from classic Outlook</a>.</p><p><i>Screenshot 1 - Teaching callouts informing users about the new Outlook background set up:&nbsp;</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/d303d063-c081-4537-a282-392c6bd26d93/2c12d691f1f1dce674cc5c35c1b25545c9a4b3b2.png\" style=\"width: 368.993px;\"></p><p></p><p><i>Screenshot 2 - Teaching callout <b>shown after</b>&nbsp;the new Outlook is successfully set up in the background:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/7ae9f2dd-6260-4869-aaf9-a80b2ca981a7/cbe4310b559f46679f13365cd6d3bdfb044c0fc3.png\" style=\"width: 301.991px;\"></p><p><i></i></p><p><b>What you can do to prepare</b>\n</p><p>Admins can manage this experience using the following policy:</p>\n\n<p><b>Policy name:</b> Manage automatic setup of classic Outlook accounts in new Outlook\n</p><p><b>Registry path:</b><code> <b>HKEY_CURRENT_USER\\Software\\Policies\\Microsoft\\office\\16.0\\outlook\\preferences</b></code>\n</p><p><b>Key:</b> <code>\"NewOutlookAutomaticSetupUserSetting\"</code></p><p><b>Values:</b>\n</p><ul>\n<li><b>Not Configured (Default):</b> Users manage the setting themselves (enabled by default).</li>\n<li><b>Enabled:</b> Enforces automatic setup, and users cannot change the setting.</li>\n<li><b>Disabled:</b> Prevents automatic setup, and users cannot change the setting.</li>\n</ul><p></p>\n\n<p>This setting can also be managed via:\n</p><ul>\n<li><b>Cloud Policy</b> in the Microsoft 365 Apps admin center</li>\n<li><b>Group Policy</b> using the latest ADMX templates</li>\n<li><b>Microsoft Intune</b> using administrative templates</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install\" target=\"_blank\">Control the installation and use of new Outlook | Microsoft 365 Apps | Microsoft Learn</a></li><li><a href=\"https://support.microsoft.com/office/import-settings-and-install-add-ins-on-new-outlook-for-windows-b85ce5ff-bef3-45ae-9e95-9d63c514abdc\" target=\"_blank\">Import settings and install add-ins on new Outlook for Windows | Microsoft Support</a></li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install\">\n</a>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 2025, Outlook will automatically set up classic Outlook Exchange Online accounts and settings in the new Outlook for Windows in the background, if conditions are met. This feature is on by default, preserves existing settings, and can be managed or disabled by admins via policy."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1147392",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-03T23:27:06.15Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-03T23:26:55Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Set up classic Outlook accounts and settings in new Outlook for Windows automatically",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
