{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re excited to announce the general availability (GA) of the <b>Unified Sensor</b> <b>for Microsoft Defender for Identity</b>. This milestone simplifies the activation of identity protections on qualifying domain controllers by extending the existing Microsoft Defender for Endpoint agent. With just a few clicks, you can enable identity alerts, posture recommendations, and automatic attack disruption—no additional agent installation required.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide, GCC, GCCH, and DoD):</b> Available now.</p><p><b><b>How this affects your organization</b></b></p><p>Who is affected: Admins managing domain controllers with Microsoft Defender for Endpoint deployed.</p><p>What will happen:</p><ul><li>The Unified Sensor can be activated on qualifying domain controllers.</li><li>Identity-specific alerts and posture recommendations will begin flowing shortly after activation.</li><li>No downtime is required for domain controllers.</li><li>Existing licenses, capabilities, and alerts remain unaffected.</li><li>Activation does not require additional installations.</li><li>The Unified Sensor v3.x:<ul><li>Cannot be activated on servers with Defender for Identity sensor v2.x already deployed.</li><li>Does not currently support VPN integration or ExpressRoute.</li><li>Does not yet offer full functionality for health alerts, posture recommendations, security alerts, or advanced hunting data.</li></ul></li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>Review <a href=\"https://learn.microsoft.com/defender-for-identity/deploy/prerequisites-sensor-version-3\" target=\"_blank\">deployment prerequisites</a> to ensure your environment is ready.</li><li>Go to the <b><i>Activation page</i></b> in the <i>Microsoft Defender portal</i>.</li><li>Review all your eligible domain controllers (those onboarded with Microsoft Defender for Endpoint, version 2019 or above).</li><li>Activate the new sensor on your domain controllers.</li><li>Ensure your domain controllers meet the following minimum requirements:<ul><li>Windows Server 2019 or later.</li><li>June 2025 Cumulative Update or later.</li><li>Defender for Endpoint must be deployed.</li><li>Domain controller must not already have Defender for Identity sensor v2.x installed.</li><li>Server must have at least 2 cores and 6 GB RAM.</li><li>Power Option should be set to High Performance.</li><li>Time synchronization across servers must be within five minutes.</li></ul></li><li>If using virtualization:<ul><li>For Hyper-V: Disable Dynamic Memory.</li><li>For VMware: Reserve all guest memory.</li></ul></li><li>Licensing requirements include one of the following:<ul><li>Microsoft 365 E5/A5/G5/F5 Security</li><li>EMS E5/A5</li><li>Standalone Defender for Identity license</li></ul></li><li>To support advanced identity detections, consider applying the <b><a href=\"https://learn.microsoft.com/defender-for-identity/deploy/prerequisites-sensor-version-3#configure-unified-sensor-to-support-advanced-identity-detections-preview\" target=\"_blank\">Unified Sensor RPC Audit tag</a></b> via Asset Rule Management in the <i>Microsoft Defender portal</i>.</li><li>Configure Windows auditing to support enhanced detections. You may use the <b>Set-MDIConfiguration </b>PowerShell command to automate audit policy setup.</li><li>Run the <b>Test-MdiReadiness.ps1</b> script to validate your environment before deployment.</li><li>Communicate this update to your security operations team.</li></ul><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/defender-for-identity/deploy/prerequisites-sensor-version-3\" target=\"_blank\">Microsoft Defender for Identity sensor v3.x prerequisites (Preview)</a></li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity's Unified Sensor is now generally available, enabling identity protections on qualifying domain controllers via the existing Defender for Endpoint agent without extra installation. Activation requires Windows Server 2019+, specific updates, and licensing. It simplifies identity alerts and attack disruption with no downtime."
    }
  ],
  "EndDateTime": "2025-11-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1179159",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-24T22:11:17.093Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-24T22:11:09Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity: Activate the Unified Sensor now generally available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
