{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>To enhance collaborative access to SharePoint-based knowledge, we’re introducing SharePoint agents in Microsoft Teams Channels. These agents allow users to interact with SharePoint-based knowledge through simple @mentions, allowing quick access to summaries, answers, and file discovery—without leaving the Teams environment. This builds on existing functionality in group chats and meetings, now with the added benefit of persistent visibility and accessibility in channels. This feature will be available on all web and desktop clients (Windows and macOS). A limited set of functionality will also be available on mobile clients.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481822\" target=\"_blank\">481822</a>\n</p><p><b>When this will happen\n</b></p><p>General Availability (Worldwide): We will begin rolling out on late August 2025 and expect to complete by mid-September 2025.\n</p><p><b>How this affects your organization\n</b></p><p>Once available, users will be able to use SharePoint agents in Teams Channels to retrieve and summarize SharePoint content. This feature is on by default and does not require any configuration changes. It enhances productivity by enabling seamless access to organizational knowledge within the primary collaboration space of Teams Channels.\n</p><p><b>What you can do to prepare\n</b></p><ul><li>This feature will begin rolling out to the worldwide standard release in late August.</li><li>No new admin settings are introduced with this update.</li><li>Existing governance and compliance controls for SharePoint agents will continue to apply.</li><li>Review your organization’s SharePoint agent usage policies and ensure users are aware of the new channel capabilities.</li></ul><p>Learn more: <a href=\"https://support.microsoft.com/office/share-an-agent-from-sharepoint-in-teams-6dcbf7b5-8c13-44e5-a68a-dbd71fb76ad3\" target=\"_blank\">Share an agent from SharePoint in Teams</a>&nbsp;(will be updated before rollout)</p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481822"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint agents in Microsoft Teams Channels enable users to access and summarize SharePoint content via @mentions without leaving Teams. Rolling out globally from late August to mid-September 2025, this feature is on by default, requires no admin changes, and supports existing governance and compliance controls."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1137613",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-18T23:15:57.31Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-18T23:15:33Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Interact with SharePoint content in Teams channels using agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
