{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 7, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re expanding the reach of SMS appointment notifications in Microsoft Teams. Soon, organizers with a Teams Premium license will be able to send SMS notifications to phone numbers in Australia using Microsoft Bookings, the Virtual Appointment Teams meeting template, and other Teams experiences. This update enhances global communication capabilities without changing existing SMS behavior.</p><p>\n</p><p></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in late July 2025 and expect to complete by late September 2025 (previously late August).</p><p></p><p><b>How this will affect your organization:</b>\n</p><p>Previously, SMS appointment notifications in Microsoft Teams did not support Australian phone numbers. </p><p>After this rollout:\n</p><ul><li>Users with a Teams Premium license will be able to send SMS notifications to recipients in Australia.\n</li><li>The Australia country code will be added to the phone number drop-down menu where applicable.\n</li><li>There is no change to how SMS notifications function.\n</li></ul><p>This enhancement applies only to customers with a Teams Premium license. If your organization does not currently use Teams Premium, this feature will not be available.</p><p><b>What you need to do to prepare:</b>\n</p><p>No admin action is required. This update will roll out automatically. However, you may wish to:\n</p><ul><li>Notify your Teams Premium users about this expanded capability.\n</li><li>Update internal documentation to reflect support for Australian phone numbers.\n</li><li>Review your licensing to ensure the appropriate users have access to Teams Premium features</li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://support.microsoft.com/office/use-sms-text-messages-to-remind-customers-of-their-appointments-adda1e2a-03b8-4db2-864d-0a5a3f3a874a\" target=\"_blank\">Use SMS text messages to remind customers of their appointments</a><br></li><li><a href=\"https://learn.microsoft.com/graph/api/virtualappointment-sendvirtualappointmentremindersms?view=graph-rest-1.0&amp;tabs=http\" target=\"_blank\">virtualAppointment: sendVirtualAppointmentReminderSms - Microsoft Graph v1.0 | Microsoft Learn</a><br></li></ul><p><br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Premium will expand SMS appointment notifications to support Australian phone numbers starting late July 2025, completing by late September 2025. This feature requires a Teams Premium license, involves no change in SMS functionality, and requires no admin action. Users should update documentation and notify Teams Premium users."
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1113668",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-07T16:53:03.21Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-11T22:13:37Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams Premium: SMS support expands to Australia",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
