{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Microsoft Viva Amplify now supports custom themes and fonts published to SharePoint’s Brand Center, empowering communicators to align campaigns with organizational branding and maintain visual consistency across channels like Outlook and SharePoint.</p><p>Custom fonts allow organizations to apply their own typography to Viva Amplify communications. These fonts are managed via SharePoint’s Brand Center and can be applied to campaigns for a consistent and professional appearance.\n</p><p>Custom themes enable personalization of communications by applying branded color palettes. Whether sending newsletters, announcements, or event updates, custom themes help ensure your message is polished and on-brand.\n</p><p>This update is associated with Microsoft 365 Roadmap ID<span style=\"background-color: rgb(255, 255, 255);\">&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498322\" target=\"_blank\">498322</a>.</span></p><p><span style=\"background-color: rgb(255, 255, 255);\"><b>When this will happen</b></span></p><p><span style=\"background-color: rgb(255, 255, 255);\"><b>Targeted Release (Worldwide): </b>We began rolling out in mid-July 2025 and expect to complete by late July 2025.\n</span></p><p><span style=\"background-color: rgb(255, 255, 255);\"><b>General Availability (Worldwide &amp; GCC):</b> We will begin rolling out late July 2025 and expect to complete by early August 2025.</span></p><p><span style=\"background-color: rgb(255, 255, 255);\"><b>How this will affect your organization</b></span></p><ul><li>Previously, Viva Amplify campaigns used a default blue theme. If your organization has set a new default SharePoint theme, that theme will now automatically apply to existing Viva Amplify campaigns.\n</li><li>Campaign owners can override the default theme and revert to the original \"Blue\" if desired.\n</li><li>Custom themes created in SharePoint’s Brand Center will now be available to all Viva Amplify campaigns.\n</li><li>Custom fonts can be applied to Viva Amplify communications but must be deployed to user devices via endpoint management tools. Fonts are not embedded in emails.\n</li><li>Font customization is supported only in SharePoint pages and Outlook emails.\n</li><li>Only Viva Amplify campaign owners can change themes or apply custom fonts.\n</li><li>Typically, users will not see changes unless a new default SharePoint theme has been applied.\n</li><li>This feature is on by default for campaign owners.\n</li><li>This feature is available in all languages/locales supported by Viva Amplify.\n</li><li>There are no tenant-level controls to disable custom themes or fonts, but tenant admins can set the default theme via SharePoint.</li></ul><p><b>Visual examples of theme and font customization in Viva Amplify -</b></p><p>Screenshot 1. <i>Campaign site showing default SharePoint theme applied:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/e273412d-b531-4c13-b600-0045632aa95f/0c9021f77f84f24e1a01b8403cb45fc01bbe6c6e.png\" style=\"width: 285.995px;\"></p><p></p><p>Screenshot 2. <i>Theme selection menu with Blue and Cobalt options:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/fcb62498-aa13-43ea-ab28-ca54ae7f1067/9b11450e523b8d996085fcf9c56af7478b17b8a9.png\" style=\"width: 325.995px;\"></p><p>Screenshot 3. <i>Font customization panel in Viva Amplify campaign settings:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/7b38d5c3-5adb-4382-8597-ffa72ec7670a/86c51aa0a85fc59cb2ccba1dbf1b1356c98f2c71.png\" style=\"width: 340px;\"></p><p>Screenshot 4 - <i>Some of the available color palettes for custom themes in Viva Amplify:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/942e3b3b-d0d8-4f16-a81b-4108acfdd2ac/36c62b4001bd515ea2a1a8f5a3948ccf0624a5c6.png\" style=\"width: 250.995px;\"></p><p></p><p><b>What you need to do to prepare</b></p><ul><li>Review your organization's SharePoint theme settings. If a new default has been applied, it will now reflect in Viva Amplify campaigns.\n</li><li>If unpublished content appears visually different, campaign owners can manually switch back to the \"Blue\" or \"Cobalt\" theme.\n</li><li>Ensure endpoint management tools are configured to distribute custom fonts to user devices.\n</li><li>Educate campaign owners on how to apply themes and fonts via the Viva Amplify interface.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498322"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Amplify now supports custom themes and fonts from SharePoint’s Brand Center, enabling branded, consistent communications across channels. Default SharePoint themes apply automatically, with options to override. Custom fonts require deployment via endpoint management. Rollout begins mid-July 2025, with no tenant-level disable controls."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1120158",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-22T22:29:43.15Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-22T22:28:58Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: New support for branded themes and typography in Viva Amplify",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
