{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 17, 2025: We have updated the timeline. Thank you for your patience.</p><p><b><b>Introduction:</b></b></p><p>We're introducing a new <b>Library </b>experience in the Microsoft 365 Copilot app. Library provides a central, visual-first destination in the Microsoft 365 Copilot app where users can easily access their Copilot-generated content like images and Pages and as Copilot-generated content shared with them. This experience helps users easily find and manage their Copilot-generated content in one place, streamlining productivity and reducing content fragmentation.</p>\n\n<b><b>When this will happen:</b></b><p></p><p>\n</p><ul>\n<li><b>Targeted Release (Worldwide):</b> Rollout begins in early October 2025 (previously late September) and is expected to complete by early October 2025 (previously late September).</li>\n<li><b>General Availability (Worldwide):</b> Rollout begins in mid-October 2025 (previously late September) and is expected to complete by mid-October 2025 (previously late September).</li>\n</ul>\n\n<b><b>How this affects your organization:</b></b><p></p><p>\n</p><p><b>Who is affected:</b></p>\n<ul>\n<li>All users with Copilot chat enabled in Microsoft 365.</li>\n</ul>\n<p><b>What will happen:</b></p>\n<ul>\n<li>A new <b>Library</b>&nbsp;section will appear in the Microsoft 365 Copilot app, in the left navigation menu.</li>\n<li>Library will consolidate Copilot-generated images (from Copilot Chat and Create experiences) and Copilot Pages into a single, unified view.</li><li>The Pages section will be removed from the left navigation menu in the Microsoft 365 Copilot app.&nbsp;Users can find their existing Pages in the new Library section instead. There is no change to the experience to create a new Page via Copilot Chat.</li>\n<li>Library is <b>on by default</b> for users with Copilot chat enabled.</li>\n<li>If Copilot chat is disabled by the admin, the Library will not be available.</li>\n<li>No changes to existing admin policies or configurations.</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b><p></p><p>\n</p><ul>\n<li>No admin action is required.</li>\n<li>There are no new controls or configuration steps associated with this change.</li>\n<li>Review the following documentation for more details: <a href=\"https://techcommunity.microsoft.com/blog/microsoft365copilotblog/copilot-pages-for-it-admins---sep-2024-update/4241521\" target=\"_blank\">Copilot pages for IT Admins - Sep 2024 update</a>&nbsp;<atps: techcommunity.microsoft.com=\"\" blog=\"\" microsoft365copilotblog=\"\" copilot-pages-for-it-admins---sep-2024-update=\"\" 4241521copilot=\"\" pages=\"\" for=\"\" it=\"\" admins=\"\" –=\"\" sep=\"\" 2024=\"\" update<=\"\" a=\"\"></atps:></li>\n</ul>\n\n<b><b>Compliance considerations:</b></b><p></p><p>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot app will introduce a new Library experience by mid-October 2025, consolidating Copilot-generated images and Pages into one section. The Pages menu will be removed, with no admin action needed. Library is enabled by default for users with Copilot chat enabled."
    }
  ],
  "EndDateTime": "2025-11-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1148530",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-17T21:11:12.807Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-05T21:55:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Library experience in the Microsoft 365 Copilot app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
