{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b><p>\nStarting October 1, 2025, we will retire the <i>Add to existing remediation</i> option under the <i>Propose remediation</i> action in Microsoft Defender for Office 365. This change is being made due to consistently low usage and is intended to streamline the remediation experience.</p>\n\n<p><b>When this will happen</b><p>\nThis change will take effect on October 1, 2025.</p>\n\n<p><b>How this affects your organization</b><p>\nOur telemetry indicates negligible usage of the <i>Add to existing remediation</i> option. If users in your organization currently rely on this feature, they will need to transition to using the <i>Create new remediation</i> option under <i>Propose remediation</i>. No other functionality is impacted.</p>\n\n<p><b>What you can do to prepare</b><p>\nNo admin action is required. This change will occur automatically. We recommend:\n</p><ul>\n<li>Informing relevant users about this change.</li>\n<li>Updating internal documentation or training materials that reference the retired option.</li>\n</ul>\nFor more information about remediation actions in Microsoft Defender for Office 365, refer to the <a href=\"https://learn.microsoft.com/microsoft-365/security/office-365-security/threat-explorer?view=o365-worldwide\">Microsoft Defender documentation</a>.<p></p>\n\n<p><b>Compliance considerations</b></p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Retirement or removal of features or services</td><td>This is a retirement of a UI option within a security feature.</td></tr>\n<tr><td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td><td>It modifies the remediation workflow, but does not impact DLP, eDiscovery, or retention policies.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>The feature being removed was user-selectable within the UI.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 1, 2025, Microsoft Defender for Office 365 will retire the \"Add to existing remediation\" option due to low usage. Users must switch to \"Create new remediation.\" No admin action is needed, but users should be informed and documentation updated accordingly. Other functionalities remain unaffected."
    }
  ],
  "EndDateTime": "2025-11-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1146813",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-02T23:14:56.737Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-02T23:14:28Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retirement of \"Add to existing remediation\" option in Microsoft Defender for Office 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
