{
  "ActionRequiredByDateTime": "2025-10-03T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>To streamline billing management and improve the admin experience, Microsoft is moving the setup of Pay-as-you-go (PAYG) billing plans for Microsoft 365 Copilot Chat from the Power Platform admin center to the Microsoft 365 admin center. While many organizations already use the existing Pay-as-you-go (PAYG) setup, <b>starting October 3, 2025</b>, all tenants <b>must begin using the Microsoft 365 admin center for Pay-as-you-go (PAYG) setup for Microsoft 365 Copilot Chat</b>, as the Power Platform method will no longer be supported.</p><p><b><b>When this will happen:</b></b></p><p><b>Starting October 3, 2025</b>, admins will no longer be able to set up new Pay-as-you-go (PAYG) billing plans for Microsoft 365 Copilot Chat via the Power Platform admin center.</p><p><b><b>How this affects your organization:</b></b></p><p>Who is affected: Admins managing billing plans for Microsoft 365 Copilot Chat</p><p>What will happen:</p><ul><li>The PAYG billing plan setup will no longer be available via the Power Platform admin center.</li><li>Admins will configure billing plans for Microsoft 365 Copilot Chat via the Microsoft 365 admin center.</li><li>Existing billing plans created in the <i>Power Platform admin center</i> will remain active and manageable in that portal.</li><li>Use of the PAYG billing option does not require a Microsoft 365 Copilot license.</li><li>No impact to user experience.</li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>Inform your admins about the transition to the Microsoft 365 admin center.</li><li>If your organization needs to create a new billing plan after October 3, 2025, use the Microsoft 365 admin center.</li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 3, 2025, Microsoft 365 Copilot Chat Pay-as-you-go billing plans must be set up via the Microsoft 365 admin center, not the Power Platform admin center. Existing plans remain active, and there is no impact on user experience or compliance. Admins should prepare for this transition."
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1164380",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-02T22:14:41.563Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-02T22:14:13Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Information about billing plan setup for Microsoft 365 Copilot Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
