{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>What and Why</b></p><p>\nTo help teams and individuals plan and execute work more efficiently, we’re expanding the capabilities and availability of the Project Manager agent (PMA) to all shared premium plans (both new and existing premium plans). These updates are based on customer feedback and aim to make PMA more accessible, easier to use, and more configurable. Enhancements include broader availability across Premium Plans, support in Planner for Web, a new chat entry point, and improved admin controls.</p><p>PMA is an AI-powered agent in Planner that can take a goal and create a plan by generating structured tasks and support task execution grounded in your plan context and web.</p><p>To access Project Manager agent in Planner, a Microsoft 365 Copilot license is required. Users who also possess Planner Plan 1, Planner and Project Plan 3, or Planner and Project Plan 5 license will gain access to premium features. Individuals without a Microsoft 365 Copilot license can participate in plan collaboration but will not be able to interact with the Project Manager agent, including assigning tasks to the agent.&nbsp;</p>\n\n<p><b>Rollout Schedule</b></p>\n<ul>\n<li><b>PMA in existing Premium Plans:</b> Begins early August 2025; expected completion by early September 2025.</li>\n<li><b>New PMA chat entry point and name:</b> Begins early August 2025.</li>\n<li><b>PMA in Planner for Web:</b>&nbsp;Begins early August 2025.</li>\n<li><b>Advanced PMA admin settings:</b>&nbsp;Begins mid-July 2025.</li>\n</ul>\n\n<p><b>Impact on Your Organization</b></p>\n<ul>\n<li><b>Who is affected:</b><br>\n<ul><li>Organizations using Microsoft Planner with Premium Plans.</li>\n<li>Admins managing Microsoft 365 Copilot and Planner licenses.</li>\n<li>Users with Microsoft 365 Copilot + Planner Plan 1, Project Plan 3, or Project Plan 5.</li></ul></li>\n\n<li><b>What will happen:</b>\n<ul>\n<li>PMA will be enabled in all existing shared Premium Plans—no need to create new plans.</li>\n<li>The Copilot chat pane will move to the bottom-right corner of the canvas and be renamed “Project Manager agent.”</li>\n<li>PMA will be available in Planner for Web.</li>\n<li>Tenant Admins, now have the capability to enable PMA only for a set of users based on the security groups, providing the ability to test PMA in a smaller user base before rolling out to a larger user base</li><li>PMA home page, which was the primary interface for PMA interaction will be removed, instead PMA will be available and accessible in existing views of Planner Premium, such as the Grid view, Goals view and Broad view.</li><li>Previously all the Output from PMA were stored in Loop Workspaces, in future Loop output from PMA will be stored in a dedicated SharePoint folder in the SharePoint site associated with the modern group.</li></ul></li></ul><ul></ul><p></p><ul><li><b>Key capabilities include:</b><ul style=\"\"><li style=\"\">Assign tasks to PMA for execution with results captured in embedded Loop pages.</li><li style=\"\">Use the Goals tab to generate structured tasks from natural language goals.</li><li style=\"\">Ground PMA with context from SharePoint, Word, Loop, or web links.</li><li style=\"\">Access PMA Chat (previously “Copilot in Planner”) via the rocket icon to plan, manage, and track projects.</li></ul></li>\n</ul>\n\n<p><b>Action Required/Recommendations</b></p>\n<ul>\n<li>Notify users and planners about the new capabilities.</li>\n<li>Identify key planning scenarios where PMA can add value.</li>\n<li>Update internal documentation and planning playbooks to reflect AI-assisted planning.</li>\n<li>Review and configure Planner Copilot settings to enable or disable PMA as needed.</li>\n</ul>\n\n<p><b>Compliance Considerations</b></p><p>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Project Manager agent (PMA) is now available in all shared premium plans to enhance planning and execution. Key updates include broader availability, new chat entry point, and improved admin controls. Rollout begins in August 2025. A Microsoft 365 Copilot license is required for full access. No compliance considerations identified."
    }
  ],
  "EndDateTime": "2026-01-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1117098",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-17T22:49:14.943Z",
  "Services": [
    "Planner"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-17T22:48:58Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Announcing Public Preview of Project Manager agent in Shared Premium Plans",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
