{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 5, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re expanding the file types supported in Copilot Chat to align with the Microsoft Search experience. This enhancement allows users to ground their questions in a broader range of content types, improving the relevance and accuracy of Copilot responses.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=492268\" target=\"_blank\">492268</a>.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide): We will begin rolling out in early August 2025 (previously late August) and expect to complete by early August 2025 (previously mid-September).</p><p><b>How this will affect your organization</b></p><p>Users will be able to ask Copilot questions about additional file types, including CAD, ZIP, and MP4. This update enhances Copilot’s ability to retrieve and reason over content from a wider variety of files, improving productivity and search flexibility. </p><p>There are no changes to the user experience with this update — the feature enhancement is entirely on the back end and will not alter the Copilot interface or behavior for users.</p><p>This feature will be on by default.</p><p><b>What you need to do to prepare</b></p><p>No action is required at this time. However, to take advantage of this feature, users must be licensed for Microsoft 365 Copilot Chat. Eligible licenses include:\n</p><ul><li>Microsoft 365 A1/A3/A5 (including MA3/MA5 for students and faculty)\n</li><li>Microsoft 365 Business Basic, Standard, and Premium\n</li><li>Microsoft 365 E3/E5\n</li><li>Microsoft 365 F1/F3\n</li><li>Microsoft Teams (all SKUs including Enterprise, Essentials, and Rooms)\n</li><li>Office 365 A1/A1 Plus/A3/A5\n</li><li>Office 365 E1/E1 Plus/E3/E5\n</li><li>Office 365 F3\n</li></ul><p>Note: Versions labeled \"(no Teams)\" and \"EEA (no Teams)\" are also supported.</p><p>Learn more:&nbsp;</p><ul><li><a href=\"https://support.microsoft.com/topic/file-formats-supported-by-microsoft-365-copilot-1afb9a70-2232-4753-85c2-602c422af3a8\" target=\"_blank\">File formats supported by Microsoft 365 Copilot</a></li><li><a href=\"https://learn.microsoft.com/copilot/manage\" target=\"_blank\">Manage Microsoft 365 Copilot Chat | Microsoft Learn</a></li></ul><p><b>Compliance considerations</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? - Yes. Additional file types are now accessed for grounding Copilot responses.</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data? - Yes. Copilot’s grounding capabilities are extended to more file types.</li><li>Does the change provide users any new way of interacting with generative AI? - Yes. Users can now query Copilot using content from more file types.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "492268"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat now supports additional file types like CAD, ZIP, and MP4 for search grounding, enhancing response relevance. The rollout begins early August 2025, with no user interface changes. Users must have eligible Microsoft 365 Copilot licenses; the feature is enabled by default."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1116511",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-05T20:55:01.137Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-16T22:51:32Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot | Chat now supports new file types in search grounding",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
