{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will enhance Microsoft Purview | Insider Risk Management: by allowing generative AI app activities to be used as triggers in Risky AI usage policies. This enables organizations to define specific conditions that bring users into policy scope based on their interactions with generative AI tools. These activities will continue to contribute to risk scoring.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484083\" target=\"_blank\">484083</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early July 2025 and expect to complete by late July 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late September 2025 and expect to complete by late September 2025.\n</p><p><b>How this will affect your organization:</b></p><p>With this update, admins can configure policies to use generative AI app activities as triggers, expanding the flexibility and precision of Insider Risk Management. This change may affect which users are brought into policy scope based on their AI usage patterns.\n</p><p>This capability will be available by default but requires admin configuration to take effect. You can configure the feature at Insider risk management &gt;<i> Policies &gt; New insider risk policy &gt; Triggering event &gt; Risky or sensitive content in Microsoft Copilot experiences, Enterprise AI apps and web versions of other AI apps:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e9ba38ba-220b-4d0d-b0c8-334402cba075\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Review your current Insider Risk Management policies. Consider editing existing Risky AI usage policies or creating new ones to include generative AI app activities as triggers. You may want to notify your admins and/or users about this change and update internal documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>Learn more: The section called <i>Risky AI usage (preview)</i> in <a href=\"https://learn.microsoft.com/purview/insider-risk-management-policy-templates#risky-ai-usage-preview\" target=\"_blank\">Learn about insider risk management policy templates | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "484083"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview | Insider Risk Management will allow generative AI app activities to be used as policy triggers, enhancing flexibility and precision. Public preview starts in early July 2025, with general availability in late September 2025. Admins should review and update policies accordingly. More details can be found in the Microsoft 365 Roadmap ID 484083."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102774",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-25T00:07:00.28Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-25T00:06:42Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Use Generative AI app activities as policy triggers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
