{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 15, 2026: We are canceling a proposed change related to renaming the existing Calling and Meetings executable. \n</p><p>\n</p><p>No action is required from administrators. This change did not introduce a new binary. It involved renaming the existing executable used for Calling and Meetings as a workaround for a Windows compatibility issue.&nbsp;</p><p><b>What Happened?&nbsp;</b></p><p>To reduce administrative effort, we partnered with the Windows team to deliver the fix for a Windows compatibility issue. With the Windows fix now fully rolled out in Windows 24H2 and 25H2, the executable name change is no longer required and has been rolled back.&nbsp;</p><p>Was this a security, reliability, or compliance issue?&nbsp;</p><ul><li><b>This was not a security or compliance issue.</b>&nbsp;</li><li>It was a platform compatibility issue in Windows.&nbsp;</li><li>No customer data, identity, or tenant configuration was at risk.&nbsp;</li></ul><p><b>Was my tenant impacted?&nbsp;</b></p><p>Only organizations participating in our <i>Technology Adoption Program (TAP)</i> were affected. Specifically, the change applied only to the TAP Admin earlyadopter subset (Ring 1.5).&nbsp;</p><p>If your organization does not participate in the Microsoft Technology Adoption Program, you were <i>not impacted in any way</i>. The change has been fully rolled back for TAP participants, with no lasting configuration or behavioral changes on client machines. No administrator action is required.&nbsp;</p><p><b>What if we haven’t deployed recent Windows updates yet?&nbsp;</b></p><p>We understand that many enterprises deploy Windows cumulative updates on managed timelines.&nbsp;</p><ul><li><i>There is no risk or degradation if the referenced Windows KBs are not installed.&nbsp;</i></li><li>New features that depend on these Windows updates will <i>explicitly check for the presence of the required KBs</i> and will only enable when they are available.&nbsp;</li><li>If the KBs are not installed, those features simply remain disabled—<i>no functionality breaks and no admin action is required</i>.&nbsp;</li></ul><p><b>Windows updates that include the fix</b>&nbsp;</p><p>The Windows compatibility fix is included in Windows updates for versions <i>24H2</i> and <i>25H2</i>, delivered through <a href=\"https://support.microsoft.com/en-us/topic/november-11-2025-kb5068861-os-builds-26200-7171-and-26100-7171-2e0512e4-3ad4-4da6-958c-a468a1af949e\" target=\"_blank\">KB5068861</a>.&nbsp;</p><p><b>What to expect next?</b>&nbsp;</p><ul><li>No changes to admin configuration or tenant settings&nbsp;</li><li>No service disruption&nbsp;</li></ul><p>---Original message---</p><p><b><b>Introduction</b></b>\n</p><p>We’re improving the performance and startup time of calling features in the Microsoft Teams Desktop Client for Windows. To achieve this, we’re introducing a new child process named <i>ms-teams_modulehost.exe</i> that will handle the calling stack separately from the main application process (<i>ms-teams.exe</i>). This change optimizes resource usage and enhances meeting experiences.</p>\n\n<b><b>When this will happen:</b></b>\n<p>Rollout will begin early January 2026 and complete by late January 2026.</p><p>Note: Timelines may shift due to year-end feature flag rollout freeze.</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> All users running the Teams Desktop Client on Windows.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>A new process (<i>ms-teams_modulehost.exe</i>) will appear in Task Manager under the main Teams process (<i>ms-teams.exe</i>).</li>\n<li>This process is dedicated to calling features and improves performance.</li>\n<li>No changes to user workflows or UI; however, admins should ensure endpoint and security software allow this new process.</li>\n</ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Update endpoint management and security software to allowlist <i>ms-teams_modulehost.exe</i> alongside <i>ms-teams.exe</i>.</li>\n<li>Communicate this change to helpdesk staff to avoid confusion during troubleshooting.</li>\n<li>Update internal documentation if you reference Teams process names.</li>\n<li>Make sure the same QoS settings applied to <i>ms-teams.exe</i> are also applied to <i>ms-teams_modulehost.exe</i>. Refer to this page for details: <a href=\"https://learn.microsoft.com/microsoftteams/qos-in-teams\" target=\"_blank\">Implement Quality of Service (QoS) in Microsoft Teams</a><ul><li><b>DO NOT</b> remove QoS settings of <i>ms-teams.exe</i>. Only add QoS settings for <i>ms-teams_modulehost.exe</i>.</li></ul></li>\n</ul>\n\n<b><b>Compliance considerations:</b></b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The planned renaming of the Teams Calling and Meetings executable was canceled due to a Windows fix in versions 24H2 and 25H2. No admin action is needed. A new process, ms-teams_modulehost.exe, will be introduced for calling features to improve performance, requiring endpoint allowlisting and QoS updates."
    }
  ],
  "EndDateTime": "2026-02-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1189656",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-15T16:17:06.323Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-25T00:00:52Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Upcoming Change to Teams Desktop Client on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
