{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We’re introducing<b> refreshed Microsoft 365 app icons</b> for Word, Excel, PowerPoint, and the rest of Microsoft 365 productivity tools. The newly designed Microsoft 365 icons reflect a strategic shift in Microsoft 365—unified, intuitive, and designed for flow across every canvas. As Copilot connects Microsoft 365 apps into a single, intelligent experience, the icons embody that transformation with cleaner shapes, vibrant colors, and a connected design system nodding to Copilot’s influence. The icons are rolling out in the coming weeks across web, desktop, and mobile for both individuals and organizations.</p><p>There are no changes to app functionality or user settings.</p><p><b><b>When this will happen:</b></b></p><p><b>General Availability (Worldwide): </b>Rollout begins in early October 2025 and will roll out in phases across web, desktop, and mobile platforms. Completion is expected by late October 2025.</p><p><b><b>How this affects your organization:</b></b></p><p>Who is affected: All users of Microsoft 365 apps across web, desktop, and mobile platforms.</p><p>What will happen:</p><ul><li>Users will begin to see updated Microsoft 365 app icons:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/1606915f-3a5f-4790-91da-d44a3b9b3551/fc3f3bc247b64f352adb026b781b78de7a78155f.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>This is a visual-only change; there is no impact to app functionality, user settings, or workflows.</li><li>During the rollout, users may see old and new icons side-by-side across apps and devices.</li><li>No changes to URLs, branding names, or service behavior.</li></ul><p><b><b>What you can do to prepare:</b></b></p><p>No admin action is required.</p><p>However, we recommend the following:</p><ul><li>Review and update internal help content, training materials, and screenshots that reference existing app icons.</li><li>Communicate this change to helpdesk staff to reduce potential confusion.</li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is rolling out refreshed app icons for Word, Excel, PowerPoint, and others starting October 2025. The visual update reflects a unified design inspired by Copilot, with no changes to functionality or settings. No admin action is needed, but updating help materials is recommended."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1163778",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-01T23:04:49.32Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-01T23:04:36Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365: Visual refresh of app icons",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
