{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're enhancing the Export-ContentExplorerData PowerShell cmdlet to include confidence level information in exports and introduce a new parameter that allows filtering results based on confidence level. This update helps admins better target and analyze sensitive data detections.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=492620\" target=\"_blank\">492620</a></p><p>\n</p><p><b>When this will happen:</b></p><p>Genral Availability (Worldwide): Rollout will begin in late July 2025 and is expected to complete by late August 2025.\n</p><p><b>How this affects your organization:</b></p><p>Admins using the Export-ContentExplorerData cmdlet will now:\n</p><ul><li>Receive confidence level metadata in the exported results.\n</li><li>Be able to filter exported data by confidence level using a new parameter. Usage: -ConfidenceLevel &lt;high | medium | low&gt;</li></ul><p>This enhancement improves data clarity and enables more precise analysis of sensitive information detections. The feature is off by default and available for use when needed.\n</p><p><b>What you can do to prepare:</b></p><p>No action is required to enable this feature. However, you may want to:\n</p><ul><li>Review internal documentation or scripts that use the Export-ContentExplorerData cmdlet.\n</li><li>Inform relevant teams (e.g., compliance, security) about the new filtering capability.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "492620"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is enhancing the Export-ContentExplorerData PowerShell cmdlet to include confidence level information and a new filtering parameter. This update, rolling out from late July to late August 2025, helps admins better target and analyze sensitive data. No action is required, but reviewing documentation and informing relevant teams is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108838",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-03T23:35:41.693Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:35:01Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Information Protection - Confidence level filtering in Content Explorer Cmdlet",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
