{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 16, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re introducing a new feature that enables AI-generated audio briefings for SharePoint news in <i>Viva Connections</i>. This feature provides users with a hands-free way to catch up on top news items using playback controls such as play, pause, skip, and speed adjustment. A Microsoft 365 Copilot license is required to access this summarization capability. This new feature applies to Teams, Surface Devices, and Web. This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497142\" target=\"_blank\">497142</a>.</p><p><b>When this will happen</b><b></b></p><p><b>Targeted Release (Production tenants):&nbsp;</b>The rollout begins on August 28, 2025, and is expected to complete by September 3, 2025.</p><p><b>General Availability (GCC, GCC High, DoD):</b>&nbsp;The rollout begins on August 28, 2025, and is expected to complete by September 30, 2025 (previously September 15).</p><p><b>How this affects your organization</b></p><p>This feature introduces a new way for users to consume SharePoint news through AI-generated audio summaries of the top 10 news items. These clips will play sequentially in the <i>Viva Connections app</i> on Teams desktop and in the browser experience. This hands-free format supports accessibility and productivity for users who prefer audio content. </p><p>The feature will be <b>on by default for users with a Microsoft 365 Copilot license</b>.</p><p><b>What you can do to prepare</b></p><p></p><ul><li>Inform your users about this new audio briefing capability in Viva Connections.</li><li>Ensure eligible users have a Microsoft 365 Copilot license.</li><li>Review your SharePoint news publishing practices to optimize content for summarization.</li><li>No admin action is required to enable the feature.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/connections/news-reader\" target=\"_blank\">The news reader in Viva Connections | Viva Connections | Microsoft Viva | Microsoft Learn</a></p><i>Screenshot 1 - The audio briefing interface in Viva Connections offers a hands-free way to catch up on top SharePoint news items:</i><p></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/72844bb6-cb14-4c3f-99c3-0e4f6b533f47/cbc9bb82113d03cdaa664a5ae837a8607476f851.png\" style=\"width: 400px;\" alt=\"user settings\"><i></i></p><p><i>Screenshot 2 - Playback speed controls allow users to adjust the pace of audio briefings to suit their listening preferences:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/83da16c2-5d11-4925-bd59-d82acbd4efb8/d448d4ad9d38d071748cba40056fda0f6275cca2.png\" style=\"width: 400px;\" alt=\"user settings\"><b></b></p><p><b>Compliance considerations</b><b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. This feature introduces generative AI summarization of SharePoint news content, which interacts with customer-authored news posts to generate audio briefings.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes. Users can interact with AI-generated audio summaries using playback controls such as play, pause, skip, and speed adjustment.</td></tr><tr><td>Does the change include an admin control and can it be controlled through Entra ID group membership?</td><td>Yes. Admins can manage access to the feature by assigning Microsoft 365 Copilot licenses, which can be scoped using Entra ID group membership.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users can choose whether to engage with the audio briefings in Viva Connections; the feature is available but not mandatory.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497142"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Connections will offer AI-generated audio briefings for SharePoint news, playable with controls like play, pause, and speed adjustment. Available from August 28, 2025, this feature requires a Microsoft 365 Copilot license and supports hands-free news consumption on Teams, Surface, and web."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-11-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143997",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-16T18:07:02.31Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T00:31:31Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: AI-generated audio briefings for SharePoint news in Viva Connections",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
