{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>We’re introducing Knowledge Agent, a built-in SharePoint capability that helps organizations prepare content for AI at scale. It unifies fragmented AI features into a single, context-aware interface that adapts to user roles and surfaces intelligent actions directly in the flow of work. This enhancement supports high-quality, trustworthy responses from Microsoft 365 Copilot and custom agents.</p>\n\n<b><b>When this will happen:</b></b>\n<ul>\n<li><b>Public Preview (Worldwide):</b> Begins mid-September 2025; completes by late February 2026.</li>\n</ul><p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:</b></p>\n<ul>\n<li>Users with a Microsoft 365 Copilot license on tenants opted into Knowledge Agent preview.</li>\n<li>Admins managing SharePoint content and agents.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>A floating button will appear in the lower-right corner of SharePoint surfaces, launching a context-aware menu with intelligent actions.</li>\n<li>Role-based capabilities include:\n  <ul>\n    <li>Content managers can structure, tag, and enrich content using smart metadata and AI recommendations.</li>\n    <li>Site owners can identify stale pages, broken links, and content gaps.</li>\n    <li>Content creators can generate pages and documents using natural language prompts.</li>\n    <li>Collaborators and viewers can surface grounded insights via natural language chat.</li>\n  </ul>\n</li>\n</ul>\n\n<p><b>Impact to SharePoint agents users:</b></p>\n<ul>\n<li>Ready-made SharePoint site agents are now exclusively available to customers licensed for Knowledge Agent. These agents are no longer accessible through the Microsoft 365 Pay-As-You-Go (PAYG) billing model under the SharePoint agents meter.</li>\n<li>PAYG customers can still create custom-built, no-code SharePoint agents using the same SharePoint agents meter, but they will not have access to the ready-made site agents unless they meet the Knowledge Agent licensing requirements.</li>\n<li>The SharePoint ribbon icon has changed from the Copilot logo to a hexagon to indicate Knowledge Agent-enabled sites.</li>\n<li>Agent creation remains available via:\n  <ul>\n    <li>Site homepage</li>\n    <li>Agent chat pane</li>\n    <li><i>AI actions</i>&nbsp;menu in the command bar of a document library</li>\n    <li>Content menu of selected file(s) in a document library</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Knowledge Agent Public Preview begins September 18, 2025.</li>\n<li>Learn more about opting into the preview:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/knowledge-agent-get-started\">Get started with Knowledge Agent (preview)</a>.</li><li>For tenants who have opted in, it is possible to opt out for specific sites.</li><a href=\"https://aka.ms/knowledgeagentoptin\">\n</a><li>No setup is required for individual features.</li>\n<li>Learn more via the <a href=\"http://aka.ms/KnowledgeAgentLaunch\">Knowledge Agent blog</a>.</li></ul><a href=\"https://aka.ms/knowledgeagentblog\"></a>\n\n<b><b>Compliance considerations:</b></b>\n<table border=\"1\" cellpadding=\"5\" cellspacing=\"0\">\n<tbody><tr><th>Consideration</th><th>Explanation</th></tr>\n<tr><td>Introduces or modifies AI/ML capabilities</td><td>Knowledge Agent introduces new AI-driven features that interact with customer content to provide intelligent actions and insights.</td></tr>\n<tr><td>Provides new user interaction with generative AI</td><td>Users can interact with SharePoint content using natural language prompts and chat.</td></tr>\n<tr><td>Modifies access to existing features</td><td>Changes availability of ready-made SharePoint agents based on licensing.</td></tr>\n<tr><td>Includes admin control</td><td>Admins can opt in/out of preview and manage site-level availability.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Knowledge Agent (preview) is a new AI-powered SharePoint feature launching mid-September 2025, unifying AI tools into a role-adaptive interface for content optimization and Copilot support. It changes agent licensing, adds intelligent actions, and allows admins to control site participation without individual feature setup."
    }
  ],
  "EndDateTime": "2028-10-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1155312",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-18T17:08:07.403Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-18T17:08:00Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Introducing Knowledge Agent (preview): AI-powered content optimization for SharePoint and Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
