{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 25, 2025: After further review, we will not be rolling this out to GCC, GCCHihg, DoD, USSec, USNat during the timeline outlined below. We will communicate via Message center when we are ready to proceed. Thank you for your patience.</p><p>Updated September 11, 2025: This release is intended solely for commercial cloud environments. Separate release timelines will be communicated for special clouds and on-premises segments in dedicated posts.</p><p>We’re introducing the new Microsoft Teams calendar experience, designed to unify and enhance productivity across Microsoft 365. This calendar integrates familiar features with innovations like Microsoft Copilot and Microsoft Places, enabling seamless collaboration from anywhere. It works consistently across Teams, the new Outlook for Windows, Outlook on the web, and Places. As part of this update, the legacy calendar experience will be deprecated, and the toggle to switch between old and new calendars will be removed.</p>\n<p><b>When this will happen</b></p><p></p><p>\n</p><ul>\n<li><b>Public Preview:</b>&nbsp;Early November 2025 - Mid-November 2025</li>\n<li><b>Targeted Release:</b>&nbsp;Early November 2025 - Mid-November 2025</li>\n<li><b>General Availability (Worldwide):</b>&nbsp;Early November 2025 - Mid-November 20255</li>\n<li><b>General Availability (Gallatin, GCC, GCC High, DoD, USSec):</b>&nbsp; After further review we have decided not to proceed with this change at this time. We apologize for any inconvenience.</li>\n<li><b>General Availability (USNat):</b>&nbsp; After further review we have decided not to proceed with this change at this time. We apologize for any inconvenience.</li>\n</ul>\n\n<b>How this affects your organization</b><p></p><p>\n</p><p>Once this update is deployed, users accessing the Calendar app in Microsoft Teams will see the new calendar experience by default. The toggle to switch between the old and new calendar will be removed, and only the new Microsoft 365 calendar will be available. This change may impact users accustomed to the legacy calendar interface.</p>\n\n<b>What you can do to prepare</b><p></p><p>\n</p><p>No admin action is required. We recommend informing your users about the upcoming change and updating any internal documentation or training materials that reference the legacy calendar experience.</p>\n<p>For more information about the new calendar experience, visit the <a href=\"https://learn.microsoft.com/microsoftteams/teams-calendar-overview\">Microsoft Teams documentation</a>.</p><p><b>Compliance considerations</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will remove the toggle for the legacy calendar, making the new integrated Microsoft 365 calendar the default starting early November 2025 for commercial clouds. GCC, GCC High, DoD, USSec, and USNat environments will not receive this update yet. No admin action is needed; inform users accordingly."
    }
  ],
  "EndDateTime": "2026-02-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129730",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-25T14:08:00.077Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-05T23:18:10Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Remove toggle for Calendar in Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
