{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>A new capability of sharing export download links with external users will be available for Microsoft Purview eDiscovery (Premium) users. This feature enhances collaboration by allowing external legal counsel, auditors, or other stakeholders to securely access eDiscovery export files—without requiring tenant login credentials.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498160\" target=\"_blank\">498160</a>.</p><p></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2025 and expect to complete by end of September 2025.\n</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out early October 2025 and expect to complete by end of October 2025.</p><p></p><p><b>How this will affect your organization:</b>\n</p><p>This feature will simplify the process of sharing eDiscovery export files with external parties, reducing manual steps and improving compliance workflows. Organizations can maintain strict control over data access while enabling secure collaboration with external users.</p><p></p><p><b>What you need to do to prepare:</b>\n</p><p>Admins should review their organization’s policies for sharing sensitive data externally and familiarize themselves with the new export configuration options such as enabling link sharing and configuring link duration. Update internal guidance and training materials to reflect this new capability.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498160"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview eDiscovery (Premium) will allow sharing export download links with external users without tenant login, enhancing secure collaboration. Rollout begins mid-September 2025 worldwide and early October 2025 for GCC environments. Admins should review sharing policies and update guidance accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1147383",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-03T23:23:37.323Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-03T23:23:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery - Guest access for export downloads",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
