{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We're pleased to announce the availability of SharePoint agents in the Microsoft Teams app store. These agents enable users to interact with SharePoint content directly within Teams, offering intelligent assistance for document discovery, content summarization, and collaboration.\n</p><p>By discovering and utilizing the most recently used agents personalized to each user, users can quickly access the most relevant SharePoint agents to use them in their flow of work. Up to 25 agents will appear towards the end of the agents section on the store. Users can find the agent details by selecting a listing, and choose to add them to chats or channels to streamline their workflows.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=481824\" target=\"_blank\">481824</a>.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide): Rollout begins in late August 2025 and is expected to complete by late August 2025.</p><p><b>How this affects your organization</b></p><p>This update introduces a new way for users to interact with SharePoint content using intelligent agents within Teams. The agents are personalized per user and cannot be centrally managed or hidden from the store by admins. This may increase visibility of SharePoint content and usage within Teams.</p><p>The feature is <b>on by default</b> and does not require configuration.</p><p><b>What you can do to prepare</b></p><ul><li>Review existing SharePoint agent management methods to ensure alignment with organizational policies.</li><li>Inform users that agent visibility in the store is personalized and based on their activity and shared content.</li><li>If a user has never used a SharePoint agent, it won't appear—so there's no need to worry about irrelevant agents showing up.</li><li>No additional admin controls are available to manage agent visibility in the store.</li><li>We will update this post with new documentation soon.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p><p></p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "481824"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint agents are now available in the Microsoft Teams app store, allowing personalized intelligent interaction with SharePoint content within Teams. Rolling out worldwide in late August 2025, the feature is on by default, cannot be centrally managed, and enhances content discovery and collaboration."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143301",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T22:05:24.977Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T22:05:20Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "SharePoint agents are available in Teams app Store",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
