{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>Organizations undergoing rebranding, mergers, acquisitions, divestitures, or tenant consolidations often need their SharePoint domain name in URLs to reflect their new identity. The<b> SharePoint Online Tenant Rename</b> feature enables this change. We are announcing general availability of advanced tenant rename with no site count limitation. With this update, the feature is now accessible to all customers, regardless of the total number of sites in the tenant.</p>\n\n<b>When this will happen:</b>\n<p>General availability begins worldwide on October 16, 2025. Rollout started in early October and is expected to complete by mid-October 2025.</p>\n\n<b>How this affects your organization:</b>\n<ul>\n<li><b>Who is affected:</b> Admins managing SharePoint Online and OneDrive for Business tenants globally.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Rename support is now available for all Microsoft 365 tenants, regardless of site count.</li>\n    <li>High reliability is maintained across rename operations.</li>\n    <li>Business-as-usual continuity is ensured during and after rename.</li>\n    <li>Compatible with Microsoft 365 partner scenarios including Microsoft Teams and PowerApps.</li>\n    <li>Not supported for vanity domains or Multi-Geo customers.</li>\n  </ul>\n</li>\n</ul>\n\n<b>What you can do to prepare:</b><p></p><p>\n</p><ul>\n<li>Confirm total site count using the SharePoint admin center (SPAC) or PowerShell before scheduling. </li><li><b>Licensing requirement:</b> Tenants with site count greater than 10,000 must have SAM licenses purchased for all users in the organization.</li>\n<li>Review unsupported features or limitations (such as Hub site limitations, vanity domains, third-party integrations).</li>\n<li>Communicate any impact to site owners using public documentation.</li>\n<li>Validate custom scripts, PowerShell automations, and integrations that rely on the old domain name.</li>\n<li>Learn more: <a href=\"https://learn.microsoft.com/sharepoint/change-your-sharepoint-domain-name\">Change your SharePoint domain name | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online Tenant Rename is now generally available without site count limits, enabling domain name changes for all tenants starting October 16, 2025. It supports business continuity, Microsoft 365 integrations, and requires SAM licenses for tenants with over 10,000 sites. Vanity domains and Multi-Geo are unsupported."
    }
  ],
  "EndDateTime": "2026-11-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1173930",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-16T22:56:37.03Z",
  "Services": [
    "SharePoint Online",
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-16T22:56:30Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint and OneDrive: General availability of tenant rename with no scale limitations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
