{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction \n</b></p><p>We're streamlining the Microsoft 365 Copilot mobile app on iPhone and iPad to help users interact with their content more naturally and efficiently. This update will introduce file previews of Word, Excel, PowerPoint files in the mobile app. In these file previews, users can easily view file contents and comments, as well as use Copilot Chat to command and ask questions about the file. As part of this change, users will be prompted to open the standalone Word, Excel, and PowerPoint apps to edit their files. This change is rolling out in September for iPhone devices and coming later for iPad devices.</p><p><b>When this will happen</b></p><p>This update will be generally available for iPhone devices on September 15, and iPad devices soon after. \n</p><p><b>How this affects your organization</b></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/fdba1ea8-7912-4dd9-9b11-bdc2a44e864c/a1658e8a9409ddfc2f233ceb2ff00ecb8b60e658.png\" style=\"width: 400px;\" alt=\"user settings\"><b></b></p><p></p><p><b>August 22, 2025:&nbsp;</b></p><p>When users edit or try to create a Word, Excel, or PowerPoint file in the Microsoft 365 Copilot app on an iOS (iPhone or iPad) device, they will begin seeing a popup banner encouraging installation of standalone Word, Excel, or PowerPoint app. Users can choose to ignore the banner and continue in the Microsoft 365 Copilot app, with no change to functionality.</p><p><b>September 15, 2025:&nbsp;</b></p><ul><li>The Microsoft 365 Copilot app for iPhone will transition to a file preview experience for Word, Excel, and PowerPoint files where they can view file contents and comments and use Copilot Chat to command and ask questions about the files. Users will not be able to edit files in the Microsoft 365 Copilot iPhone app. Instead, they will be prompted to open or install the standalone apps (ie. Microsoft Word iPhone app) to edit files.</li><li>Teams, OneDrive, and Outlook apps will stop opening these files in the Microsoft 365 Copilot iPhone app for editing and instead prompt users to install or open the respective standalone apps. \n</li><li>When opening a Word, Excel, or PowerPoint file in the Microsoft 365 Copilot iPhone app via Search result, Copilot Chat response, or share to Microsoft 365 Copilot action from a third-party app, users will get a streamlined experience where they can preview the file contents and get Copilot Chat assistance on the file directly in the preview. \n</li><li>In the Create experience in the Microsoft 365 Copilot iPhone app, users will get a chat-centered experience when creating a document rather than the template options in Word, Excel, or PowerPoint experience. With this, they will directly see a Copilot Chat conversation experience when selecting the Word, Excel or PowerPoint option from the Create Screen. There, they can create a file via a chat prompt. They may open the file in the standalone Word, Excel, or PowerPoint apps once created for further editing. \n</li></ul><p><b>After September 15, 2025:  \n</b></p><p>We will roll out a similar set of updates to the Microsoft 365 Copilot app for iPad.</p><p><b>What you can do to prepare</b></p><p><b></b></p><p>No admin action is required. However, we recommend:  \n</p><ul><li>Informing iOS users about updates to file experiences in the Microsoft 365 Copilot app and encouraging installation of Microsoft Word, Excel, and PowerPoint apps from the iOS App Store. \n</li><li>Updating internal documentation and training materials to reflect the new file handling behavior for the Microsoft 365 Copilot iOS app.</li><li>For organizations using mobile device management (MDM), consider pushing the standalone Word, Excel, PowerPoint and OneDrive apps to managed iOS devices.&nbsp;</li></ul><p>\n</p><p><b>Compliance considerations</b></p><table border=\"1\">\n<tbody>\n<tr>\n  <td>Does the change provide end users any new way of interacting with generative AI?</td>\n  <td>Users can now more easily interact with files via Copilot Chat for summaries and insights.</td>\n</tr>\n<tr>\n  <td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n  <td>Users can no longer edit Word, Excel, and PowerPoint files in the Microsoft 365 Copilot app; users must use standalone apps.</td>\n</tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot iOS app will offer file previews and Copilot Chat for Word, Excel, and PowerPoint files starting September 15, 2025, on iPhone, with editing requiring standalone apps. Similar updates will follow for iPad. Users will see prompts to install or open standalone apps for editing."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1137596",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-18T22:58:52.02Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-18T22:57:34Z",
  "Tags": [
    "Feature update"
  ],
  "Title": "Streamlined file preview and Copilot Chat experience in Microsoft 365 Copilot app for iOS",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
