{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>To maintain app performance, security, and access to the latest features, Microsoft To Do will soon require updated operating systems. The iOS version of To Do will support only iOS 17 and later, and the Mac version will support only macOS 13 and later. Users on earlier versions will no longer receive app updates.\n</p><p><b>When this will happen\n</b></p><p>This change will begin rolling out in late August 2025 and end mid-September 2025.\n</p><p><b>How this affects your organization\n</b></p><p>Users running iOS 16 or earlier and macOS 12 or earlier will no longer receive updates to the Microsoft To Do app. This may impact app performance, security, and access to new features for those users.\n</p><p>This change does not affect users already on supported OS versions. No functionality will be removed from existing installations, but users on unsupported versions will not receive future updates.\n</p><p><b>What you can do to prepare\n</b></p><p>To ensure users continue receiving updates and support:\n</p><ul><li>Encourage users to update their devices to iOS 17 or later and macOS 13 or later.\n</li><li>Review your organization's device management policies to ensure compatibility with these OS versions.\n</li><li>Communicate this change to affected users in advance to minimize disruption.\n</li><li>For more information about supported platforms, visit the <a href=\"https://support.microsoft.com/todo\" target=\"_blank\">https://support.microsoft.com/todo</a>.\n</li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft To Do will stop supporting iOS 16 and macOS 12 starting late August to mid-September 2025. Updates will require iOS 17 or macOS 13 and later. Users on older versions won't receive updates, potentially affecting app performance and security. Organizations should encourage OS upgrades and update device policies."
    }
  ],
  "EndDateTime": "2025-10-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129721",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-05T23:00:59.873Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-05T23:00:45Z",
  "Tags": [
    "Retirement"
  ],
  "Title": "Microsoft To Do ending support for iOS 16 and macOS 12",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
