{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 30, 2025: We have updated the content. Thank you for your patience.</p><p><b>Introduction</b></p><p>To streamline reporting experiences and focus development efforts on modern integration paths, we’re retiring the legacy <i>Power BI integration within SharePoint lists and libraries</i>. This change supports improved performance and flexibility through supported alternatives like <i>Export to Power BI</i> and <i>Power BI Desktop</i> connections.</p>\n\n<b>When this will happen:</b>\n<ul>\n<li>Retirement begins mid-November and ends mid-December 2025.</li><li>There will be no extensions.</li>\n</ul>\n\n<b>How this affects your organization:</b>\n<ul>\n<li><b>Who is affected:</b> Organizations currently using the <i>Visualize the List</i> or <i>Visualize the Library</i> feature in SharePoint Online.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will no longer be able to create new reports directly from SharePoint lists or libraries using the legacy integration.</li>\n    <li>Previously published reports created using this integration will no longer be accessible.</li>\n    <li>The <i>Export to Power BI</i> feature and <i>Power BI Desktop</i> connectivity remain supported and unchanged.</li>\n  </ul>\n</li>\n</ul>\n\n<b>What you can do to prepare:</b>\n<ul>\n<li>No admin action is required. However, we recommend the following steps:</li>\n  <ul>\n    <li>Notify users who rely on the <i>Visualize the List</i> or <i>Visualize the Library</i> feature.</li>\n    <li>Update internal documentation to reflect the retirement and guide users to supported alternatives.</li><li>Inform users that they can view the list of published reports directly from the same Integrate menu of the list or library. More information in: <a href=\"https://learn.microsoft.com/power-bi/create-reports/service-quick-create-sharepoint-list\" target=\"_blank\">Create a report quickly from a SharePoint list or library in the Power BI service - Power BI | Microsoft Learn</a></li>\n    <li>Share these resources with users:\n      <ul>\n        <li>Export to Power BI from SharePoint list: <a href=\"https://learn.microsoft.com/power-bi/connect-data/create-dataset-sharepoint-online-list\" target=\"_blank\">Create a semantic model from a SharePoint List - Power BI | Microsoft Learn</a><br></li><li>Create a report on a SharePoint list in Power BI Desktop: <a href=\"https://learn.microsoft.com/power-bi/connect-data/desktop-sharepoint-online-list\" target=\"_blank\">Create a report on a SharePoint List in Power BI Desktop - Power BI | Microsoft Learn</a></li><li>Blog post: <a href=\"https://powerbi.microsoft.com/blog/deprecation-of-power-bi-integration-within-sharepoint-lists-and-libraries/\" target=\"_blank\">Deprecation of Power BI Integration within SharePoint Lists and Libraries | Microsoft Power BI Blog | Microsoft Power BI</a></li></ul></li></ul></ul><p><b>Compliance considerations:\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Power BI’s legacy “Visualize the List” and “Visualize the Library” features in SharePoint Online will retire between mid-November and mid-December 2025. New reports via these features and access to existing ones will end. Users should switch to supported alternatives like Export to Power BI and Power BI Desktop."
    }
  ],
  "EndDateTime": "2026-01-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1156359",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-30T19:28:27.067Z",
  "Services": [
    "SharePoint Online",
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-20T05:06:53Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Retirement"
  ],
  "Title": "Retiring Power BI “Visualize the List” and “Visualize the Library” Features in SharePoint Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
