{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>IT Administrators will be able to set up Word, Excel, and PowerPoint Windows applications to limit the creation of new files to only Cloud Locations (OneDrive, SharePoint, or third-party Clouds). \n</p><p>This configuration is called <code>enablecloudonlysaveasmode</code><b style=\"background-color: rgb(255, 255, 0);\"></b>  is available only to IT Administrators and deployed using Group Policies. This policy is available now in the <a href=\"https://www.microsoft.com/download/details.aspx?id=49030\" target=\"_blank\">Administrative Template files for Microsoft Office</a> (version 5516.1000 or newer). \n</p><p>For the policy to apply, users should be using a Windows version of Word, Excel and PowerPoints Version 2506 (Build 19029.20000) or newer.  \n</p><p>This new Policy is part of a new set of tools for IT Administrators to move their organizations towards higher Cloud usage and <b>Increase security and compliance</b>:  Files in the Cloud are automatically protected by your company’s security rules and labeling, so you don’t have to take extra steps to keep them safe and compliant.  \n</p><p>This policy setting controls whether Word, Excel, and PowerPoint users can use non-Cloud locations (local and network) to create new files. If you enable this policy setting, users will only have Cloud Locations available to perform <i style=\"\">Save As</i> and <i>Save new files</i>. If you disable or don’t configure this policy setting, users can use any location (Cloud, Local, and Network) to perform <i>Save As</i> and <i>Save new files</i>. Note: This policy setting only applies to subscription versions of Office, such as Microsoft 365 Apps for Enterprise. \n</p><p><b>When this will happen</b></p><ul><li><b>Public Preview: </b>We will begin rolling out late August 2025 and expect to complete by mid-September 2025. \n</li><li><b>General Availability</b> (Worldwide, GCC, GCC High, and DoD): We will begin rolling out mid-September 2025 and expect to complete by late September 2025.</li></ul><p><b>How this will affect your organization</b></p><p>If you do nothing, this change will have no impact on your organization. \n</p><p>If you enable the new Policy, Office will limit the creation of new Word, Excel, or PowerPoint files to Cloud Locations; <i>Save </i>and <i>Save a Copy</i> operations will only present Cloud locations and all local destinations will disappear from Office programs.  \n</p><p><img src=\" https://cxcs.microsoft.net/file/ccp/en-us/3401498a-887b-40aa-a85e-f5a17876dcfe\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>If Known Folders have been redirected to OneDrive (KFM), these folders are considered Cloud folders and they will be available for <i>Save </i>and <i>Save a Copy</i> operations. \n</p><p><b>What you need to do to prepare</b></p><p>If your organization already keep all Office files in the Cloud, this policy will prevent users from accidentally saving files outside of the Cloud. \n</p><p>If users in your organization still use local files, this policy will promote the creation of new files in the Cloud and prevent additional files to be created locally. You can communicate this change to end users explaining the advantages of saving the files to the Cloud instead of saving to local folders: \n</p><ul><li>Easy collaboration: It’s easy to work with others—just share your Cloud file to start collaborating right away. You and your team can add comments and make changes together, and AutoSave keeps your work updated in real time. \n</li><li>Never lose your progress: Don’t worry about losing your work—files in the Cloud include AutoSave on, meaning your documents are automatically saved for you as you work.​ \n</li><li>Access from anywhere: Files you create in Word, Excel, or PowerPoint on Windows are instantly available from your Mac, web browser, iPhone, or Android device. When you make changes on one device, they are available from everywhere.  \n</li></ul><p>To minimize impact on users, we recommend moving (redirecting) known folders to OneDrive (<a href=\"https://learn.microsoft.com/sharepoint/redirect-known-folders\" target=\"_blank\">Redirect and move Windows known folders to OneDrive - SharePoint in Microsoft 365</a>) \n</p><p>To deploy this policy: \n</p><p>If you use  Active Directory, Microsoft Entra or hybrid environments,  you can use Group Policy Objects. Group policy can represent policy settings in the file system or in Active Directory Domain Services. When used with Active Directory, Group Policy settings are contained in a Group Policy Object (GPO). (<a href=\"https://learn.microsoft.com/windows-server/identity/ad-ds/manage/group-policy/group-policy-overview\" target=\"_blank\">Group Policy overview for Windows</a>; <a href=\"https://learn.microsoft.com/entra/identity/domain-services/manage-group-policy\" target=\"_blank\">Create and manage group policy in Microsoft Entra Domain Services - Microsoft Entra ID</a>)  \n</p><p>You can also use  Cloud Policy Service: <a href=\"https://config.office.com/officeSettings/officePolicies\" target=\"_blank\">Cloud Policy service for Microsoft 365</a> lets you enforce policy settings for Microsoft 365 Apps for enterprise on a user's device, even if the device isn't domain joined or otherwise managed. When a user signs into Microsoft 365 Apps for enterprise on a device, the policy settings roam to that device. (<a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Microsoft 365 Apps</a>)</p><p>Learn More:</p><ul><li><a href=\"https://learn.microsoft.com/sharepoint/redirect-known-folders\" target=\"_blank\">Redirect and move Windows known folders to OneDrive - SharePoint in Microsoft 365</a></li><li><a href=\"https://www.microsoft.com/download/details.aspx?id=49030\" target=\"_blank\">Download Administrative Template Files (ADMX/ADML) for Microsoft Office</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Microsoft 365 Apps</a></li><li><a href=\"https://learn.microsoft.com/windows-server/identity/ad-ds/manage/group-policy/group-policy-overview\" target=\"_blank\">Group Policy overview for Windows</a></li><li><a href=\"https://learn.microsoft.com/entra/identity/domain-services/manage-group-policy\" target=\"_blank\">Create and manage group policy in Microsoft Entra Domain Services - Microsoft Entra ID</a></li></ul><p>\n<b>Compliance considerations</b></p><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n  <tbody><tr>\n    <th>Question</th>\n    <th>Answer and Explanation</th>\n  </tr>\n  <tr>\n    <td>Does the change store new customer data, if so, where, and is the data cached or permanently stored?</td>\n    <td>New files created in Word, Excel, and PowerPoint will be stored in Cloud Locations (e.g., OneDrive, SharePoint, or third-party Clouds) instead of local or network drives. These files are permanently stored in the Cloud.</td>\n  </tr>\n  <tr>\n    <td>Does the change alter how existing customer data is processed, stored, or accessed (e.g. documents, emails, chats, etc.), if so how and to what extent?</td>\n    <td>The policy restricts the ability to create and store new files locally, shifting data creation to Cloud Locations where files are subject to organizational compliance policies.</td>\n  </tr>\n  <tr>\n    <td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td>\n    <td>Files saved in the Cloud are automatically subject to Microsoft Purview compliance controls, including Information Protection labels, Data Loss Prevention (DLP), and retention policies.</td>\n  </tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "IT Administrators can restrict new file creation in Word, Excel, and PowerPoint on Windows to Cloud Locations only, enhancing security and compliance. This policy, deployable via Group Policy from August 2025, limits saving new files to OneDrive, SharePoint, or third-party Clouds, promoting cloud usage and protection."
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1137593",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-18T22:56:04.7Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-18T22:55:21Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Restrict new file creation in Office desktop apps to Cloud Locations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
