{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>To help organizations better understand how Microsoft 365 Copilot Chat is being used—especially by users without Copilot licenses—we’re introducing new usage intensity metrics in the Microsoft 365 admin center. These metrics provide visibility into prompt activity and engagement across Word, Excel, PowerPoint, and OneNote, enabling admins to track adoption and usage trends more effectively.</p>\n<p>This update is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=495549\" target=\"_blank\">495549</a>.</p>\n\n<p><b>When this will happen</b></p>\n<p><b>General Availability (Worldwide):</b> We will begin rolling out in mid-August 2025 and expect to complete by early September 2025.</p>\n\n<p><b>How this affects your organization</b></p>\n<ul>\n  </ul><p>In the Microsoft 365 admin center, under <b>Reports → Usage → Microsoft 365 Copilot Chat</b>, the following new metrics will be available:</p><ul><li><b>Prompt activity metrics</b><ul><li>Total and average prompt counts at both tenant and user levels\n</li><li>Daily prompt submission trends across Copilot Chat apps\n</li></ul></li><li><b>User engagement metrics</b><ul><li>Active days per user\n</li><li>Last activity date (UTC) per app (Word, Excel, PowerPoint, OneNote)\n</li></ul></li><li><b>App-level visibility</b><ul><li>Breakdown of Copilot Chat usage across Word, Excel, PowerPoint, and OneNote\n</li></ul></li></ul><p>All metrics focus on users <b>without Microsoft 365 Copilot licenses</b>, defined as users who have Microsoft 365 licenses but do not have Copilot service plans enabled. These users are identified through the absence of enabled Copilot service plans and are grouped accordingly in the report. User-level data is anonymized by default.\n</p><p>The report includes usage from Copilot Chat across multiple entry points including Teams, Outlook, Microsoft Edge, Copilot.cloud.microsoft, the Microsoft 365 Copilot app, <span style=\"background-color: rgb(255, 255, 255);\">Word, Excel, PowerPoint and OneNote. </span>Metrics are refreshed <b>daily</b>, though occasional delays may occur.\n</p><p>This feature is <b>on by default </b>and available to <b>all tenants</b> in Worldwide (Standard Multi-Tenant) cloud instances. There are <b>no admin controls</b> to configure this feature.\n</p><p><b>Note:</b> If the Copilot Chat feature in Word, Excel, PowerPoint, or OneNote has not yet been deployed to your organization, you may see zero active users for those apps in the usage report.\n</p><p>This update <b>will impact existing custom reports</b>, including those exported to Power BI<span style=\"background-color: rgb(255, 255, 255);\">.&nbsp;</span>Admins should review and update their reporting logic accordingly.</p>\n\n<p><b>What you can do to prepare</b></p>\n<ul><li>Review your current usage reports and update any custom dashboards or exports to include the new metrics.\n</li><li>If you use Copilot Chat usage reports as the basis for custom reporting (such as Power BI dashboards), consider updating your reports to include these new metrics. This will enhance your ability to track engagement and adoption across Microsoft 365 apps.</li><li>If needed, update report settings to display user names by navigating to <b>Settings → Org Settings → Services → Reports</b> and adjusting the anonymization setting.</li></ul>\n<p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/activity-reports/microsoft-copilot-usage?view=o365-worldwide\" target=\"_blank\">Microsoft 365 reports in the admin center – Microsoft 365 Copilot Chat usage | Microsoft 365 | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/activity-reports/activity-reports?view=o365-worldwide\" target=\"_blank\">Microsoft 365 Reports in the admin center | Microsoft 365 | Microsoft Learn</a><p></p></li></ul><p><i>Screenshot - Summary view of Copilot Chat usage across apps:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/3593c89a-4c0d-4857-a2b6-4eaf3678eb49/26bc9597702e2fdfc9d820fc476a2dacf2aa1e85.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b>Compliance considerations</b></p><p><b></b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Introduces new metrics that analyze user interaction with generative AI via Copilot Chat across Word, Excel, PowerPoint, and OneNote.</td></tr><tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Metrics reflect user engagement with Copilot Chat features across multiple Microsoft 365 apps.</td></tr><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td><td>Enhances reporting capabilities in the Microsoft 365 admin center with new metrics and export options for tracking Copilot Chat usage.</td></tr></tbody></table><p><b></b></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "495549"
    },
    {
      "Name": "Summary",
      "Value": "New Microsoft 365 admin center metrics track Copilot Chat usage intensity and app-specific engagement for users without Copilot licenses across Word, Excel, PowerPoint, and OneNote. Available worldwide from mid-August 2025, these daily-updated metrics enhance adoption reporting and impact existing custom reports."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1136041",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-15T22:49:15.043Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-15T22:49:07Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: New usage intensity and host apps metrics available in Copilot Chat usage report",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
