{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\nTo improve security and trust across Microsoft cloud services, Microsoft introduced the <b>cloud.microsoft</b> domain in early 2023. This unified, dedicated DNS domain space hosts Microsoft’s first-party authenticated SaaS products and experiences.<p></p><p>\nAs part of this transition, <b>Microsoft Teams is now available at https://teams.cloud.microsoft</b>, in parallel with its previous domain. This change enhances security by using Microsoft’s exclusive top-level domain, <b>.microsoft</b>, which helps prevent spoofing and builds user trust.</p><p>\nLearn more by reading the 2023 blog post&nbsp;<a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/introducing-cloud-microsoft-a-unified-domain-for-microsoft-365-apps-and-services/3804961\" target=\"_blank\">Introducing cloud.microsoft: a unified domain for Microsoft 365 apps and services</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\nMicrosoft Teams is already available at <b>cloud.microsoft</b>. Redirection from the previous domain will begin gradually over the coming months.<p></p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n</ul><p><b>Who is affected: </b>Admins managing Microsoft Teams, Teams apps, and network configurations. All users accessing Microsoft Teams.</p><ul>\n</ul><p><b>What will happen:</b>\n  </p><ul>\n    <a href=\"https://teams.cloud.microsoft/\" targetsoft<=\"\" a=\"\">\n    \n    \n    \n    </a></ul><p></p><ul><li>Users will be automatically redirected to <b>teams.cloud.microsoft</b>.</li><li>No user action is required; existing links and bookmarks will continue to work.</li><li>Users may notice that the new application domains are lacking the “.com” extension. This is by design, as “.microsoft” is Microsoft’s own top-level domain – and this exclusivity allows for additional security and protection against spoofing.</li><li>Admins can disable redirects via the Teams Admin portal if needed.</li><li>The <b>cloud.microsoft</b> domain has been a part of standard <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/urls-and-ip-address-ranges\" target=\"_blank\">Microsoft network guidance on domains and service endpoints</a> since April 2023.&nbsp;</li></ul><p></p><p></p><b><b>What you can do to prepare:</b></b><p></p>\n<ul><p>\n</p><li>Educate users to recognize and expect <b>cloud.microsoft</b> as a key domain for Microsoft cloud experiences. You can refer them to <a href=\"https://support.microsoft.com/office/what-is-cloud-microsoft-7ba4c8b9-d062-4444-84a5-fca6c3006d2b\" target=\"_blank\">What is cloud.microsoft? - Microsoft Support</a> for more information.&nbsp;</li><li>If your organizational websites, tools, or other materials reference the old URL, those links will be automatically redirected. However, it’s good practice to update those assets to avoid user confusion.</li><li>Update internal documentation, websites, and tools that reference the old Teams URL.</li><li>Partner with developers of in-house Teams apps (including those used in Outlook and Microsoft 365) to follow guidance in:\n<a href=\"https://devblogs.microsoft.com/microsoft365dev/action-required-ensure-your-microsoft-teams-apps-are-ready-for-upcoming-domain-changes/\" target=\"_blank\">Action required: ensure your Microsoft Teams apps are ready for upcoming domain changes</a>.</li><li>Confirm that *<b>.cloud.microsoft</b> is not blocked on your enterprise network. This should require no action if standard <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/urls-and-ip-address-ranges\" target=\"_blank\">Microsoft network guidance on domains and service endpoints</a> is being followed.&nbsp;</li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is transitioning to the secure cloud.microsoft domain by September 2025, enhancing security with Microsoft's exclusive top-level domain. Users will be auto-redirected with no action needed. Admins should update references, educate users, and ensure network access to *.cloud.microsoft. Compliance impact is minimal."
    }
  ],
  "EndDateTime": "2026-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162275",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-29T23:04:52.863Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T23:04:46Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Product transitions to the cloud.microsoft domain – September 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
