{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re enhancing the Add Shortcut to OneDrive experience to make it more intuitive and consistent across Microsoft 365. This update improves discoverability and supports a more streamlined file access workflow in OneDrive and SharePoint document libraries.</p><p><b>When will this happen</b></p><p>General Availability (Worldwide): We will begin rolling out in late July 2025 and expect to complete by mid-August 2025.</p><p><b>How this will affect your organization</b></p><p>Users will see the<b> “Add Shortcut to OneDrive”</b> command appear before the <b>“Sync”</b> command in the command bar. This change is designed to encourage use of the shortcut feature while maintaining access to Sync. The command will also adopt a consistent name and icon across Microsoft 365 apps.</p><p><i>Updated layout showing the new position of the “Add Shortcut to OneDrive” command in OneDrive and SharePoint:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/809a782b-61dc-4491-9b52-8ac7ee4f057d/94700420f589f5e29dae136242d216efc2b55c36.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>This update is on by default and requires no action to enable.</p><p><b>What you need to do to prepare</b></p><ul><li>There are no prerequisites or configuration changes required—this update is applied automatically.\n</li><li>Update internal documentation and training materials to reflect the new command order and icon.\n</li><li>Inform helpdesk and support teams to reduce potential confusion.</li></ul><p>Before rollout, we will update this post with new documentation.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is updating the order of the \"Add Shortcut to OneDrive\" and \"Sync\" commands in OneDrive for Business and SharePoint document libraries to improve usability. This change will roll out from late July to mid-August 2025 and requires no action from users. Update internal documentation accordingly."
    }
  ],
  "EndDateTime": "2025-09-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1117105",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-17T22:55:38.29Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-17T22:55:22Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft OneDrive for Business | Updated order of Shortcut and Sync commands",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
