{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to configure quality evaluation framework with Quality Evaluation Agent in Dynamics 365 Customer Service. This feature will reach general availability on October 31, 2025.<br><br>\n<b>How does this affect me?</b><br>\nThe evaluation framework allows AI supervisors to define business quality standards for both customer service representatives and AI agents through detailed evaluation criteria. This feature enables autonomous and AI-assisted assessments of customer interactions across channels (cases, conversations, emails, surveys). Evaluation is comprised of three key components:<ul><li><b>Evaluation criteria</b>: Structured forms with questions, scoring logic, and instructions that define what quality means for a business. Supervisors can use out of the box criteria as guidelines or create customized criteria.</li>\n<li><b>Evaluation plans</b>: Rules that determine when and how evaluations are triggered, based on specific conditions like SLA breaches or sentiment drops. Supervisors can use on-demand evaluation to select cases and request them to be evaluated.</li>\n<li><b>Evaluations</b>: The actual scoring and analysis of interactions evaluated, producing summaries, insights, and coaching recommendations for supervisors.</li></ul>\n<b>What action do I need to take?</b><br>\nThis message is for awareness, and no action is required.<br><br>\nIf you would like more information on this feature, please visit the <a href=\"https://aka.ms/ADO12492\"target=\"_blank\">Configure quality evaluation with quality evaluation agent</a> article.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-24T14:21:41Z",
  "HasAttachments": false,
  "Id": "MC1178985",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-24T14:28:40.733Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-24T14:21:41Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Service – Configure quality evaluation with quality evaluation agent",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
