{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p><b>Prevent screen capture</b> is a Microsoft Teams Premium feature that helps protect sensitive meeting content by blocking screenshots and recordings across supported platforms. When enabled by the meeting organizer, this feature restricts screen capture using native device tools and most third-party apps. It enhances meeting confidentiality and is especially useful for high-security discussions. Attendees on unsupported platforms will join in audio-only mode. Organizers and co-organizers can <b>enable this feature via Meeting Options</b>. It is not governed by meeting policy.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=490561\" target=\"_blank\">490561</a>.</p><p><b>When this will happen\n</b></p><p><b>Targeted Release: </b>We begin rolling out in mid-September 2025 and expect to complete by late September 2025.</p><p><b>General Availability (Worldwide): </b>We begin rolling out in&nbsp;mid-October 2025 and expect to complete by late October 2025.</p><p><b>How this affects your organization\n</b></p><p>When enabled, platform-specific behavior includes:\n</p><ul><li><b>Windows desktop: </b>Screenshots show a black rectangle around the meeting window, including pop-outs.\n</li><li><b>Mac desktop: </b>Captured content disappears, effectively hiding the meeting window and pop-outs.\n</li><li><b>Android (phones and tablets): </b>Screenshots and recordings are blocked. Users see a message indicating screen capture is restricted. Applies to key views such as stage, chat, participant list, notes, banners, Copilot panels, and more.\n</li><li><b>iOS (phones and iPads): </b>Screenshots and recordings are allowed, but live video (such as participant feeds) will not be captured. Profile pictures or static content will appear instead. Additional protections for more screens are planned for a future release.\n</li></ul><p>This feature is <b>off by default </b>and <b>must be manually enabled per meeting</b>.</p><p><i>Screenshot - Meeting options with Prevent screen capture (default off). To enable it, please turn on the toggle:&nbsp;</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/eb6cd5a7-b002-4429-8f73-ada38eda0268/96b3cc7f425fb35e99271f7b7208236aec4f9394.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p><b>What you can do to prepare\n</b></p><ul><li>Inform meeting organizers and security/compliance teams about the availability and purpose of this feature.\n</li><li>Review and update internal guidance for Teams Premium usage.\n</li><li>Ensure mobile devices are Intune-enrolled to support screen capture prevention.\n</li><li>Familiarize organizers with enabling the feature via <b>Meeting Options</b>.</li></ul><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights)?</td><td>Yes. The feature restricts access to visual meeting content, which may impact how users capture or retain personal data shared during meetings.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes. The feature is enabled via Meeting Options by organizers and co-organizers. Admins can manage Teams Premium licensing and device enrollment via Entra ID.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Meeting organizers and co-organizers can enable or disable the feature per meeting.</td></tr></tbody></table><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490561"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"490561\":[{\"RoadmapId\":490561,\"Platform\":\"Android\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-09-22T01:17:05.1333555Z\",\"LatestRing\":null},{\"RoadmapId\":490561,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-09-22T01:17:05.1333555Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":490561,\"Platform\":\"iOS\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-09-22T01:17:05.1333557Z\",\"LatestRing\":null},{\"RoadmapId\":490561,\"Platform\":\"Web\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2025-09-22T01:17:05.1333557Z\",\"LatestRing\":\"TargetedRelease\"},{\"RoadmapId\":490561,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-09-22T01:17:05.1333559Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Premium introduces a \"Prevent screen capture\" feature to block screenshots and recordings during meetings, enhancing confidentiality. Enabled by organizers via Meeting Options, it restricts capture differently across platforms, is off by default, and requires manual activation per meeting. Rollout begins mid-September 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1140178",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-22T22:41:23.837Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-22T22:41:16Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Prevent screen capture (Premium feature)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
