{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>What and Why</b></p>\n<p>We’re introducing a new integration between Viva Glint and Viva Pulse that enables managers and leaders to take timely, targeted action following an organization-wide Glint engagement survey. This feature helps maintain momentum on engagement efforts by recommending Pulse questions aligned to the top strengths and opportunities identified in the Glint survey. This supports a more continuous feedback loop and empowers managers to track progress and make mid-point adjustments.</p>\n\n<p><b>Rollout Schedule</b></p>\n<ul>\n<li><b>General Availability:</b> Available now.</li>\n</ul>\n\n<p><b>Impact on Your Organization</b></p>\n<ul>\n<li><b>Who is affected:</b>\n  <ul>\n    <li>Viva Glint customers with eligible licenses (Viva Suite or Viva Workplace Analytics and Employee Feedback).</li>\n    <li>Glint admins and managers using Viva Pulse.</li>\n  </ul>\n</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Managers can launch a Viva Pulse survey after a Glint engagement survey to gather follow-up insights.</li>\n    <li>Recommended Pulse questions are based on Glint survey results.</li>\n    <li>The integration is <b>off by default</b> and must be enabled by a Glint admin.</li>\n    <li>No changes will occur unless the integration is explicitly enabled.</li>\n    <li>Available only to tenants with the required Viva licenses.</li>\n  </ul>\n</li>\n</ul>\n\n<p><b>Action Required / Recommendations</b></p>\n<ul>\n<li>Review your current Viva Glint and Pulse configuration.</li><li> Notify Glint admins that the integration is available but off by default.</li>\n<li>Enable the integration in the Viva Glint admin settings if desired.</li>\n<li>Ensure your organization has one of the following licenses:\n  <ul>\n    <li>Viva Suite</li>\n    <li>Viva Workplace Analytics and Employee Feedback</li>\n  </ul>\n</li>\n<li>Communicate this change to helpdesk or internal support teams.</li>\n<li>Update internal documentation as needed.</li>\n</ul>\n<p>Learn more: <a href=\"https://learn.microsoft.com/en-us/viva/pulse/viva-integrations/take-actions-after-glint-survey\">Take actions after Viva Glint engagement surveys | Microsoft Learn</a></p><p><b>Compliance Considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Viva Pulse now integrates with Viva Glint, allowing managers to take targeted actions after Glint engagement surveys. This feature is available to Viva Glint customers with eligible licenses and must be enabled by a Glint admin. It helps maintain engagement momentum by recommending Pulse questions based on Glint survey results. Learn more [here](https://learn.microsoft.com/en-us/viva/pulse/viva-integrations/take-actions-after-glint-survey)."
    }
  ],
  "EndDateTime": "2025-08-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1115311",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-14T23:58:06.277Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-14T23:58:00Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Take actions with Viva Pulse after Viva Glint engagement surveys is now GA!",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
