{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n<p>We're introducing enhanced Microsoft 365 Copilot connectors for people data to help organizations enrich Microsoft 365 people profiles with authoritative information from external systems. This update improves Copilot’s ability to deliver contextually relevant and personalized responses across Microsoft 365 experiences such as profile cards and people search.</p>\n<p>Administrators can configure connectors to supported systems like <b>BambooHR</b> directly from the <i>Copilot &gt; Connectors &gt; Gallery</i>, under the <i>Human resources &amp; recruiting</i> category. Additionally, customers and partners can build <b>custom connectors via Microsoft Graph</b> to ingest people-related data from other sources. These capabilities allow Copilot to ground its responses in richer, more accurate people data.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=480736\" target=\"_blank\">480736</a>.</p>\n\n<b><b>When this will happen:</b></b>\n<ul>\n<li><b>Public Preview (Worldwide):</b> Began mid-May 2025 and completes by mid-November 2025.</li>\n<li><b>General Availability (Worldwide):</b> Begins mid-November 2025 and completes by mid-December 2025.</li>\n</ul>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n</ul><p><b>Who is affected:</b> Microsoft 365 administrators, developers building custom connectors, organizations using Microsoft 365 Copilot, people search, or profile cards.</p><ul>\n</ul><p><b>What will happen:</b>\n  </p><ul>\n    <li>Administrators can configure connectors via Microsoft Admin Center under <i>Copilot &gt; Connectors &gt; Gallery</i>.</li>\n    <li><b><a href=\"https://aka.ms/peopleconnectors/bamboohr\" target=\"_blank\">BambooHR</a></b> is available as a prebuilt connector.</li>\n    <li>Developers can build custom connectors using <b>Microsoft Graph</b>.</li>\n    <li>Enriched people profiles will be accessible in Microsoft 365 experiences and Copilot.</li>\n    <li>Improved grounding for Copilot responses using external authoritative data.</li>\n    <li>The feature is available for administrators to configure for all tenants once rolled out.</li>\n  </ul>\n<p></p><ul>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Review the <a href=\"https://aka.ms/peopleconnectors/build\">Microsoft Learn documentation</a> for guidance on configuring or developing connectors.</li><li>Monitor for updates between Public Preview and General Availability.</li>\n<li>Evaluate your organization’s data sources for people-related information.</li>\n<li>Communicate this change to IT and helpdesk teams.</li>\n<li>Update internal documentation if needed.</li><li>Learn more about <a href=\"https://learn.microsoft.com/graph/peopleconnectors#compliance-privacy-and-data-usage\" target=\"_blank\">Copilot connectors compliance, privacy, and data usage</a>.</li>\n</ul>\n\n<b><b>Compliance considerations:</b></b></p><p>\n<table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Introduces or modifies AI/ML capabilities</td><td>Copilot will use enriched people data from external sources to improve contextual responses.</td></tr>\n<tr><td>Adds integration to 3rd party software products</td><td>BambooHR is available as a connector, and custom connectors can be built for other systems.</td></tr>\n<tr><td>Alters how existing customer data is accessed</td><td>External people data will be surfaced in Microsoft 365 experiences and Copilot.</td></tr>\n<tr><td>Includes admin control</td><td>Admins can configure connectors via Microsoft Admin Center.</td></tr>\n\n</tbody></table></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "480736"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot now supports HR and employee profile data via connectors like BambooHR and custom Microsoft Graph connectors, enhancing people profiles with authoritative external data. Administrators configure these in the Admin Center. Public preview runs mid-May to mid-November 2025; general availability starts mid-November 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1163760",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-01T22:36:02.88Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-01T22:35:46Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New support for HR and employee profile data in Microsoft 365 Copilot connectors",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
