{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 10, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>We are introducing three new ways to simplify how Admins manage <b>People Skills</b>:</p>\n<ol>\n<li><b>Admin control:</b> Turn off <b>People Skills user experiences</b></li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/ceb56457-7f7e-4367-a5d5-3abb21a1edf1\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li><b>Feature access management:</b> Configure <b>People Skills</b> settings in the Microsoft 365 Admin Center</li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/68608730-52c2-4d7b-a705-f00d2fba0d1d\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li><b>Ability to import custom skills library:</b> <b>Upload </b>from your local device</li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/77bc9fbe-802a-46ca-a17b-785272d8496a\" style=\"width: 400px;\" alt=\"user settings\"></p></ol><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=529865\" target=\"_blank\">529865</a>.</p><ul>\n</ul>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide): We will begin rolling out mid-December 2025 and expect to complete by mid-January 2026 (previously mid-December 2025).</p>\n\n<p><b><b>How this will affect your organization:</b></b></p>\n<p><b>Who is affected:</b> Admins managing People Skills in Microsoft 365.</p>\n<p><b>What will happen:</b></p>\n<ul>\n</ul><p><b>Admin control to turn off People Skills user experiences:&nbsp;</b></p><p>As an Admin, you can use the Turn off People Skills user experiences control to manage how People Skills appears across your organization. This control lets you:</p><ul>\n<ul>\n</ul><li>Disable People Skills user experiences for your entire organization, user group subsets, or individual users.</li><li>Pilot People Skills to a small group of users in your organization before rolling it out broadly.</li></ul><p></p><ul></ul><p></p><p>When People Skills is turned off for a user, all People Skills user experiences will be removed for that user. Refer to <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-overview#where-does-people-skills-data-appear\" target=\"_blank\" style=\"font-family: sans-serif; background-color: rgb(255, 255, 255);\">Where does People Skills data appear?</a> for a list of applications that use People Skills data and will be impacted by this Admin Control.</p><p><b></b></p><p><b>Why use this new admin control?</b></p><ul>\n<ul>\n</ul><li><b>Privacy and compliance:</b> Organizations in regulated industries or Workers Council regions may need to prevent skills data from appearing on user profiles for certain users or groups. Such organizations may use this new Admin Control to turn off People Skills for a specific geographic region (e.g., Germany) who may have Workers Council requirements to limit exposure of People Skills data for impacted users.</li><li><b>Pilot control:</b> Deploy People Skills to a limited audience scope before full rollout.</li><li><b>Deployment flexibility:</b> Limit skills exposure during testing or phased deployment.</li><ul>\n\n</ul><ul>\n</ul>\n\n</ul><p><b>Feature access management interface for People Skills settings:&nbsp;</b></p><p>You can configure People Skills directly in the Microsoft Admin Center using Feature access management—no need to rely on PowerShell commands anymore. This will make configuration of People Skills settings much easier. People Skills Admin settings you can manage directly in the M365 Admin Center interface include:</p><ul>\n<ul>\n</ul><li><b>People Skills user experiences control:</b> Turns all People Skills user experiences on or off for selected users.</li><li><b>People Skills AI inferencing control:</b> Determines whether AI can generate Skills for users and add them to their profiles on their behalf.</li><li><b>People Skills profile visibility control:</b> Controls whether a user’s skills (AI-generated, Confirmed, or Imported) are shared with others on the Microsoft 365 Profile card.</li><li><b>Show AI Skills control:</b> Controls whether AI-Generated Skills appear on a user’s profile.</li><li><b>Show Imported Skills control:</b> Allows or restricts imported skills (organization-added skills) from appearing on user’s profile.</li><ul>\n\n\n\n</ul><ul>\n</ul>\n\n</ul><p><b>Ability to import custom Skills library from your local device:&nbsp;</b></p><ul><li>We will offer the option of importing a custom Skills Library directly from your local device. This allows you to have greater flexibility in how you upload and manage your custom Skills Library.</li>\n</ul>\n\n<p><b><b>What you need to do to prepare:</b></b></p>\n<ul>\n<li>This message is for awareness, and no action is required.</li>\n<li>If you plan to limit or disable People Skills, review the new admin controls in the Microsoft 365 Admin Center after rollout.</li>\n<li>For details on applications impacted when People Skills is turned off, refer to Microsoft documentation.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-sharing-inferencing-controls\" target=\"_blank\">Manage privacy and sharing controls in People Skills</a></p><ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "529865"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is enhancing People Skills admin controls by enabling admins to turn off user experiences, manage settings via the Admin Center without PowerShell, and import custom skills libraries. Rollout begins mid-December 2025, allowing phased deployment, privacy compliance, and easier configuration. No action required now."
    },
    {
      "Name": "Platforms",
      "Value": "Mac"
    }
  ],
  "EndDateTime": "2026-02-23T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191920",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-10T20:46:20.243Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-03T21:40:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Improved People Skills Admin configuration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
