{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're introducing General Availability (GA) for Microsoft Purview Data Loss Prevention (DLP) for Microsoft 365 Copilot. This update enhances your organization's data protection capabilities by enabling DLP policies to detect sensitivity labels in enterprise grounding data and restrict access to sensitive content within Microsoft 365 Copilot. With GA, alerting and policy simulation capabilities will also be available.\n</p><p>This message is associated with Microsoft 365 Roadmap ID:&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=423483\" target=\"_blank\">423483</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Rollout will begin in late June 2025 and is expected to complete by late July 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><ul><li>If your organization already has DLP for Microsoft 365 Copilot policies in place, admins will be able to edit those policies to enable alerts and policy simulation.\n</li><li>If no existing policies are configured, admins with the appropriate licensing can create new policies in the Microsoft Purview portal under the Data Loss Prevention solution.\n</li><li>Admins can also use Data Security Posture Management for AI (DSPM for AI) to view recommendations for creating Microsoft 365 Copilot policies.\n</li></ul>\n<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/40a5af2c-2add-4f8f-90df-e1ed4b610bc4\" width=\"400\" height=\"\"></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b6e3b3e1-83fb-4007-b925-ee1a27ac503a\" width=\"400\" height=\"\">\n</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/14030091-d91d-444c-9930-705cd72ef621/6bbd5008d3641208dd521394d4a14fba0bf62029.png\" width=\"400\" height=\"\"></p>\n<p>This feature is off by default and requires admin configuration.\n</p><p><b>What you can do to prepare:</b>\n</p><ul><li>Admins should create new DLP policies using the Copilot location to take advantage of this feature.\n</li><li>To enable alerting or test policies in simulation mode, these settings must be configured individually within each DLP policy.\n</li><li>For more information:<ul><li>Refer to <a href=\"https://learn.microsoft.com/purview/dlp-learn-about-dlp?view=o365-worldwide\" target=\"_blank\">Data Loss Prevention</a> documentation to learn more.\n</li><li>Refer to <a href=\"https://learn.microsoft.com/purview/dlp-microsoft365-copilot-location-learn-about\" target=\"_blank\">Learn about the Microsoft 365 Copilot location (preview)</a> for details about DLP for Microsoft 365 Copilot.</li></ul></li></ul><p><b>Compliance considerations:</b>\n</p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tYes - DLP policies will now inspect enterprise grounding data for sensitivity labels and restrict access within Microsoft 365 Copilot, which changes how data is processed and accessed.</li><li>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with data?\tYes - The feature integrates with Microsoft 365 Copilot, which uses AI to generate content. DLP enforcement now applies to Copilot interactions, modifying how AI agents handle sensitive data.</li><li>Does the change modify, interrupt, or disable any Purview capabilities?\tYes - It modifies DLP enforcement by extending it to Copilot scenarios and introduces new capabilities like alerting and simulation within existing DLP policies.\n</li><li>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?\tYes - Admins gain new visibility and control through alerting and simulation features and can use DSPM for AI to receive policy recommendations.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "423483"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention (DLP) for Microsoft 365 Copilot is now generally available, allowing organizations to use DLP policies to detect sensitivity labels and restrict access to sensitive content. The rollout begins in late June 2025 and completes by late July 2025. Admins can edit or create new policies and use alerting and simulation features."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1105017",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-27T23:23:36.677Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-27T23:23:18Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Restrict Microsoft 365 Copilot using content with sensitivity labels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
