{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 8, 2026: We have updated the content. Thank you for your patience.</p><p><b><b>Introduction</b></b></p>\n<p>We are pleased to announce that <b>SharePoint Online Management Shell </b>now supports<b> App-Only Certificate-Based Authentication</b>. This update addresses the business need for secure, unattended automation in environments where (for example)<b>&nbsp;Multi-Factor Authentication (MFA)</b> is enforced. With this enhancement, customers can run automation scripts using app identities, ensuring compliance with security policies while maintaining operational efficiency.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>This feature is now generally available. Minimum version of SPO Management Shell required for this is 16.0.26712.12000</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b> SharePoint administrators and automation engineers using <b>SharePoint Online Management Shell</b> for scripting and automation.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Customers can now authenticate scripts using app identities registered in <b>Microsoft Entra ID</b> (formerly Azure AD), instead of user credentials.</li>\n<li>This enables seamless execution of unattended scripts, even when MFA is enforced.</li>\n<li>We expect most scenarios to work with App-Only authentication. However, there could be rare cases where an API needs an explicit user token for security reasons. In such cases, tenant admins should use interactive flows with admin/user credentials. Feel free to reach out to us if needed.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<p>Follow these one-time steps to register your app and enable certificate-based authentication:</p>\n<ol>\n<li><b>Step 1:</b> <a href=\"https://learn.microsoft.com/powershell/exchange/app-only-auth-powershell-v2?view=exchange-ps#step-1-register-the-application-in-microsoft-entra-id\">Register the application in Microsoft Entra ID</a>.</li>\n<li><b>Step 2:</b> Assign API permissions to the application:\n    <ul>\n        <li><b>Tenant Admin APIs</b> allow <b>App-Only</b> permissions for SPO resources using the&nbsp;<code>Sites.FullControl.All</code>&nbsp;App-only scope.</li>\n        <li>We are in the process of supporting more granular scopes for tenant APIs. For up-to-date information, refer to <a href=\"https://learn.microsoft.com/powershell/exchange/app-only-auth-powershell-v2?view=exchange-ps#step-1-register-the-application-in-microsoft-entra-id\">SharePoint Admin APIs Authentication and Authorization</a>.</li>\n        <li>You can assign permissions by:\n            <ul>\n                <li>Selecting and assigning API permissions from the portal.</li><li>Assigning admin role to the service principal in optional.</li>\n                <li>Modifying the app manifest to assign API permissions (required for Microsoft 365 GCC High and DoD organizations).</li>\n            </ul>\n        </li>\n        <li>Learn more: <a href=\"https://learn.microsoft.com/powershell/exchange/app-only-auth-powershell-v2?view=exchange-ps#step-2-assign-api-permissions-to-the-application\" target=\"_blank\">Step 2: Assign API permissions to the application</a></li>\n    </ul>\n</li>\n<li><b>Step 3:</b> <a href=\"https://learn.microsoft.com/powershell/exchange/app-only-auth-powershell-v2?view=exchange-ps#step-3-generate-a-self-signed-certificate\">Generate a self-signed certificate</a> or obtain one from a certificate authority.</li>\n<li><b>Step 4:</b> <a href=\"https://learn.microsoft.com/powershell/exchange/app-only-auth-powershell-v2?view=exchange-ps#step-4-attach-the-certificate-to-the-microsoft-entra-application\">Attach the certificate to the Microsoft Entra application</a>.</li>\n</ol>\n<p>Once these steps are completed, update the <code>Connect-SPOService</code> line at the beginning of your scripts to use the app identity instead of user credentials. For examples, refer examples 7, 8, and 9 in this article: <a href=\"https://learn.microsoft.com/powershell/module/microsoft.online.sharepoint.powershell/connect-sposervice?view=sharepoint-ps\">Connect-SPOService (Microsoft.Online.SharePoint.PowerShell)</a>.</p><p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online Management Shell now supports app-only certificate-based authentication for secure, unattended automation, even with MFA enforced. Available from version 16.0.26712.12000, it uses app identities registered in Microsoft Entra ID. Administrators must register apps, assign permissions, generate certificates, and update scripts accordingly."
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188595",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-08T17:15:00.297Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-21T00:14:43Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "App-only certificate-based authentication now available in SharePoint Online Management Shell",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
