{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re retiring Cognitive Services and Azure Machine Learning (Azure ML) features in Power BI. This change supports our investment in Microsoft Fabric, where Auto ML and other AI capabilities will continue to evolve and improve.\n</p><p><b>When this will happen\n</b></p><p>The retirement will begin on August 11, 2025, and complete by September 15, 2025. The retirement starting in August will NOT impact your current models that use these services, we will still refresh and support items until Sept 15th when it will be deprecated. In August, we will remove the ability to add new models that leverage these services.</p><p><b>How this affects your organization\n</b></p><p>If your organization is using Cognitive Services or Azure ML in Power BI, please note:</p><p>Starting August 11:\n</p><ul><li>Users will no longer be able to create new models using Cognitive Services or Azure ML.\n</li><li>The UI entry point for these features will be removed.</li><li>Existing models will continue to refresh</li></ul><p>Until September 15:\n</p><ul><li>Existing models that use AI services will continue to refresh.\n</li><li>After September 15, refresh support for these models will be discontinued.\n</li></ul><p>These changes will happen automatically. No admin action is required. Please notify your users, update internal documentation, and share information about AI services in Fabric.\n</p><p><b>What you can do to prepare\n</b></p><ul><li>Review existing Dataflows for dependencies on Cognitive Services or Azure ML.\n</li><li>Transition to Auto ML in Fabric for supported AI scenarios.\n</li><li>Learn more: <a href=\"https://learn.microsoft.com/en-us/fabric/data-science/ai-services/ai-services-overview\" target=\"_blank\">AI services in Fabric (preview)</a></li><li>Learn more: <a href=\"http://Learn more: https://powerbi.microsoft.com/en-us/blog/cognitive-services-and-azure-ml-for-dataflows-will-be-fully-retired-by-september-15th-2025/\" target=\"_blank\">Microsoft Power BI Updates Blog: Cognitive services and Azure ML will be fully retired by September 15th, 2025</a></li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Power BI is retiring Cognitive Services and Azure Machine Learning features by September 15, 2025, transitioning AI capabilities to Microsoft Fabric. New model creation stops August 11, 2025; existing models refresh until September 15. No admin action needed; users should prepare by migrating to Fabric AI services."
    }
  ],
  "EndDateTime": "2025-10-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1124567",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-30T00:08:55.937Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T00:08:51Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Power BI Cognitive Services and Azure Machine Learning features retiring; transition to Fabric AI services",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
