{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 16, 2025: We have updated the content. Thank you for your patience.</p><p>We’re introducing several enhancements to the modernized eDiscovery interface in Microsoft Purview to streamline workflows, improve usability, and provide greater administrative control. These updates include:</p><ul><li>Ability to delete searches</li><li>Ability to delete exports created from searches</li><li>Auto-population of the custodian field in review sets and exports\n</li><li>Advanced indexing improvements, including indexing all Exchange items with attachments in scope\n</li><li>A new tenant-level premium feature toggle to control eDiscovery case license toggle value during case creation.</li><li>A new analytics process report for deeper insights into review set analytics (e.g., deduplication)\n</li><li>Expanded search condition builder with support for logical operators (AND, OR, NEAR) in the keywords field</li><li>Export packages to include user input export name for easier association with the export process</li><li>Bulk import of data sources</li><li>Ability to configure the maximum export package size, along with an updated default value.</li></ul><p>These updates are designed to enhance the eDiscovery experience by offering more flexible, powerful tools and reducing administrative overhead.</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=494160\" target=\"_blank\">494160</a>&nbsp;</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide/GCC/GCCH/DoD): Rollout will begin in late June 2025 and is expected to complete by the end of August 2025.</p><p><b>How this will affect your organization:</b></p><ul><li>The tenant-level premium toggle sets the default value for newly created cases, giving admins centralized control over premium settings without affecting existing cases.</li><li>The ability to delete searches and direct exports introduces a change in lifecycle management, which may impact audit trails or collaboration workflows.\n</li><li>Logical operators in the search condition builder will enhance query precision but may require updates to search strategies.\n</li><li>Advanced indexing improvements will improve content discoverability, especially in complex or high-volume cases.\n</li></ul><p><b>What you can do to prepare:</b></p><ul><li>Review and update internal documentation, training materials, and workflows to reflect these changes.\n</li><li>Ensure your teams are aware of the new search and direct export deletion capability and its implications for audit and collaboration.\n</li><li>Update search guidance to incorporate logical operators for more effective query construction.\n</li><li>Evaluate how the new analytics report and indexing enhancements can support your review and prioritization processes.</li></ul><p><b>Compliance considerations:</b></p><ul><li>Alters how existing customer data is processed, stored, or accessed: Yes - Advanced indexing improvement may affect how data is processed and accessed within eDiscovery.</li><li>Modifies or disables Purview capabilities (eDiscovery, audit logging, etc.): Yes - The ability to delete searches and direct exports directly impact eDiscovery workflows and may affect audit logging.\n</li><li>Alters how admins monitor/report on compliance activities: Yes - The new tenant level license toggle affects how admin control the use of eDiscovery premium features in their eDiscovery workflow.&nbsp;</li><li>Modifies how users access/export/delete/correct personal data (GDPR DSR): Maybe - The ability to delete searches and direct exports could affect how personal data is retained or accessed, depending on organizational policies and configurations.</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "494160"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview compliance portal is introducing enhancements to the modernized eDiscovery interface, including deletion capabilities for searches and exports, auto-population of fields, advanced indexing, a tenant-level premium feature toggle, new analytics reports, expanded search conditions, bulk data import, and configurable export package sizes. Rollout begins late June 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1105008",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-16T21:21:57.967Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-27T23:14:03Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Modern eDiscovery additional enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
