{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing a new capability in the Microsoft Purview portal’s eDiscovery (Premium) experience that allows you to generate and download hit-by-term query reports directly from a review set. This enhancement helps you quickly assess keyword performance and query effectiveness using KQL.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=171751\" target=\"_blank\">171751</a> and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=384871\" target=\"_blank\">384871</a>.</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCCH, DoD): Rollout will begin in early July 2025 and is expected to complete by the end of July 2025.</p><p><b>How this affects your organization:</b></p><p>This update does not change your current eDiscovery workflows. However, when using the new eDiscovery experience in Microsoft Purview, you’ll now see a Query report option within each review set. This feature enables you to:\n</p><ul><li>Paste in a KQL-based compound query to generate a hit-by-term report.\n</li><li>View keyword performance metrics such as hit count, hit percentage, and data volume.\n</li><li>Download the report as a .csv file.\n</li><li>Quickly review items with hits in a single view.\n</li></ul><p>Note: This feature is only available in the new eDiscovery (Premium) experience and is not supported in the classic experience.\n</p><p><b>What you can do to prepare:</b></p><ul><li>Review your current eDiscovery workflows and determine if this reporting capability can enhance your review process.\n</li><li>Update internal documentation or training materials as needed.</li></ul><p><b>Compliance considerations:</b></p><ul><li>Alters admin monitoring/reporting for compliance: Yes - The new report provides enhanced visibility into keyword/query performance, supporting compliance monitoring.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "171751,384871"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview compliance portal's eDiscovery (Premium) will introduce a new feature in July 2025, allowing users to generate and download hit-by-term query reports from review sets. This feature enhances keyword performance assessment using KQL and is only available in the new eDiscovery experience."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1105009",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-27T23:15:05.947Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-27T23:14:48Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: eDiscovery - Review set query report",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
