{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re retiring the Reuse Slide feature from the PowerPoint Ribbon to streamline the user experience and reduce redundancy. Users can continue to reuse content by copying and pasting slides between presentations or duplicating existing presentations.\n</p><p><b>When this will happen:</b></p><p>This change will roll out by July 31, 2025</p><p><b>How this affects your organization:</b></p><ul><li>Users will no longer see or be able to use the Reuse Slide feature in the PowerPoint Ribbon after the rollout is complete.\n</li><li>There is no admin action required.\n</li><li>Users can continue to reuse content by:\n<ul><li>Copying and pasting slides between presentations.\n</li><li>Creating a copy of an existing presentation to build from.\n</li></ul></li></ul><p><b>What you can do to prepare:</b></p><ul><li>Notify your users about this upcoming change to avoid confusion.\n</li><li>Update internal documentation or training materials that reference the Reuse Slide feature.\n</li><li>Encourage users to adopt the alternative methods for reusing slides.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "PowerPoint is retiring the Reuse Slide feature from the Ribbon by July 31, 2025. Users can reuse slides by copying and pasting between presentations or duplicating presentations. No admin action is required, but users should be informed and internal documentation updated."
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1111178",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-08T21:57:18.67Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-07T23:59:21Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "PowerPoint: Deprecation of Reuse Slides Button in Ribbon",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
