{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n<p>To enhance creative flexibility in Copilot Chat, users will soon be able to upload multiple reference images in a single conversation. This update streamlines the image generation process and reduces repetitive steps, based on feedback from users seeking more dynamic visual creation capabilities.</p><p>Screenshot 1: <i>Multiple images can be uploaded from a user's device</i></p><p><img src=\" https://cxcs.microsoft.net/file/ccp/en-us/3e7a07a7-1ac2-4c8a-be2a-9a72ac2b28f4\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p>\n\n</p><p>Screenshot 2:<i> In Copilot Chat,&nbsp;Select the + (plus) sign and choose Upload images and files</i></p><p>&nbsp;<img src=\" https://cxcs.microsoft.net/file/ccp/en-us/ebff11a0-f5e9-496b-b24f-e847069577eb\" style=\"width: 455px;\"></p><p><b><b>When this will happen:</b></b>\n<p>General Availability (Worldwide): Rollout will begin in late September 2025 and is expected to complete by the end of September 2025.</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> All users of Copilot Chat in Microsoft 365 environments.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Users will be able to upload multiple reference images in a single Copilot Chat session.</li>\n    <li>This feature enhances image generation by allowing richer visual context.</li>\n    <li>The feature will be ON by default for all tenants.</li>\n    <li>No changes to existing admin policies or configurations are required.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>No admin action is required at this time.</li>\n<li>If desired, you might:\n  <ul>\n    <li>Inform helpdesk and support teams of this new capability.</li>\n    <li>Update internal documentation if you provide guidance on Copilot Chat usage.</li>\n    <li>Review user feedback after rollout to assess adoption and value.</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>Compliance considerations:</b></b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Users of Copilot Chat in Microsoft 365 will soon be able to upload multiple reference images per session, enhancing image generation. This feature, enabled by default, will roll out globally in late September 2025 with no admin action required. Organizations may update support and documentation accordingly."
    }
  ],
  "EndDateTime": "2025-10-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1157709",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-22T22:49:55.917Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-22T22:49:48Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "[Copilot Chat] Upload multiple reference images to create new images",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
