{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>Updated August 13, 2025: We have updated the content. Thank you for your patience.&nbsp; &nbsp;&nbsp;</p><p><b>What and Why</b></p><p>\n</p><p>Starting in early August, Microsoft is introducing a new tenant-level service plan—Insights by MyAnalytics Backend—to support existing user-level service plans: Microsoft MyAnalytics (Full) and Insights by MyAnalytics. This backend-only update ensures alignment with security classification requirements while maintaining current MyAnalytics functionality. No changes are being made to user-facing features or SKU entitlements.</p>\n\n<b>Rollout Schedule</b><p></p><p>\n</p><ul>\n<li>Rollout begins: Late-September 2025 (previously early August) with expected completion: Mid-October 2025 (previously mid-August).</li>\n</ul>\n\n<b>Impact on Your Organization</b><p></p><p>\n</p><ul>\n<li><i>Who is affected:</i>\n  <ul>\n    <li>Tenants with users assigned to Microsoft MyAnalytics (Full) or Insights by MyAnalytics service plans.</li>\n    <li>Admins managing service plan assignments in the Microsoft 365 admin center.</li>\n  </ul>\n</li>\n<li><i>What will happen:</i>\n  <ul>\n    <li>A new tenant-level service plan called Insights by MyAnalytics Backend will appear in the Microsoft 365 admin center.</li>\n    <li>This plan will be enabled and greyed out, indicating it is not assignable or removable by admins.</li>\n    <li>Existing user-level service plans remain unchanged and assignable.</li>\n    <li>Admins will see both the new backend plan and the existing user-level plans in the admin center.</li>\n    <li>No changes to SKU entitlements or service capabilities.</li>\n  </ul>\n</li>\n</ul>\n\n<p><i>Example screenshot of service plan assignment view:</i><br>\n<img src=\"https://cxcs.microsoft.net/file/ccp/en-us/34b8e0a6-563c-4e0a-aca2-044efb0f0410\" width=\"400\" height=\"\"></p>\n\n<b>Action Required / Recommendations</b><p></p><p>\n</p><ul>\n<li>Inform helpdesk and support staff about the new backend plan visibility.</li>\n<li>Update internal documentation if you reference MyAnalytics service plans.</li>\n<li>Continue managing user-level service plan assignments as usual.</li>\n<li>If you have questions, contact your Viva Insights support channel.</li>\n</ul>\n\n<b>Compliance Considerations</b><p></p><p>\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p><p><b>\n</b></p><p><b> \n</b></p><p><b>\n</b></p><p><b>\n</b></p><p><b>\n</b></p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing a new tenant-level service plan, Insights by MyAnalytics Backend, starting late September 2025 to support existing user-level MyAnalytics plans. It will appear in the admin center as enabled but non-assignable, with no changes to user features, SKUs, or compliance requirements."
    }
  ],
  "EndDateTime": "2025-11-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1115981",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T18:51:22.03Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-15T22:52:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "New Tenant-level Service Plan in Viva Suite SKU",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
