{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 16, 2025: We have updated the timeline. Thank you for your patience.</p><p>We’re expanding offline capabilities in the new Outlook for Windows. Users will soon be able to create, edit, and delete single calendar events even when not connected to the internet. This enhancement improves productivity and flexibility when working offline.\n</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=490059\" target=\"_blank\">490059</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout will begin in mid-August 2025 and is expected to complete by mid-September 2025.</p><p><b>How this will affect your organization:</b></p><p>Users with offline mode enabled in the new Outlook for Windows will be able to:\n</p><ul><li>Create new single calendar events while offline.\n</li><li>Edit or delete existing calendar events that have been previously synchronized within the offline timeframe set in Outlook settings.\n</li></ul><p>Note: Support for recurring (series) events while offline is not currently available.\n</p><p>This functionality is controlled by the existing mailbox policy setting:\n</p><p><code>OWAMailboxPolicy -OfflineEnabledWin</code>.\n</p><p>If this policy is set to True, offline calendar functionality will be available. If set to False, it will be disabled. This update does not change the default value of the policy.\n</p><p><b>What you need to do to prepare:</b></p><p>Ensure that offline mode is enabled for users who need this functionality. At the user level, this can be verified in the new Outlook under:\n</p><p><i>Settings &gt; General &gt; Offline\n</i></p><ul><li>Enable offline email, calendar, and people\n</li></ul><p>Admins can manage this setting using the Set-OwaMailboxPolicy cmdlet. Learn more here:&nbsp;<a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Set-OwaMailboxPolicy</a>&nbsp;</p><p>For end-user guidance, see: <a href=\"https://support.microsoft.com/en-us/office/work-offline-in-outlook-2460e4a8-16c7-47fc-b204-b1549275aac9#picktab=new_outlook\" target=\"_blank\">Work offline in Outlook</a></p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tYes – calendar data is now accessible and editable offline</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "490059"
    },
    {
      "Name": "Summary",
      "Value": "Offline support for creating, editing, and deleting single calendar events in the new Outlook for Windows will be available from mid-August to mid-September 2025. This feature requires the OWAMailboxPolicy -OfflineEnabledWin to be set to True. Recurring events are not supported offline. Admins can manage settings via Set-OwaMailboxPolicy cmdlet."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-10-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1101906",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-16T14:46:35.673Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-24T00:00:18Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Offline Support for Calendar - Create, Edit and Delete Event support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
