{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 9, 2026: We have updated this post to reflect timeline updates. Thank you for your patience.&nbsp;</p><p>We will retire the Microsoft Lens app from iOS and Android in a phased approach starting January 9th, 2026. We recommend users to use the scan capability in the OneDrive app.</p><p><b>This change applies to the Microsoft Lens mobile app on iOS and Android.</b></p><p><b>How this affects your organization\n</b></p><p>The app will be removed from the stores on February 9, 2026. Users who already have the app downloaded on their devices can continue to use the scanning capability in the app until March 9, 2026. After that, users will no longer be able to create new scans in the app. Users can continue to access their previous scans from MyScans in the app after the change while they still have the app on their devices, although this capability will not be supported by Microsoft. Please note that users need to be signed into your last active account on the Microsoft Lens app to access past scans.<br></p><p><b>What you can do to prepare\n</b></p><p>This change will happen automatically on the specified dates above. No admin action is required. Please notify your users of this change, update any internal documentation, and encourage users to use the OneDrive app for their scanning needs.<br><br>For more information, read the <a href=\"https://support.microsoft.com/topic/retirement-of-microsoft-lens-fc965de7-499d-4d38-aeae-f6e48271652d\">support article</a>.&nbsp;</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Lens app for iOS and Android will be removed from stores on February 9, 2026, and scanning will stop on March 9, 2026. Users should switch to OneDrive's scan feature. No admin action is needed; notify users accordingly."
    }
  ],
  "EndDateTime": "2026-03-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1131064",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-09T17:44:12.23Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-07T23:39:53Z",
  "Tags": [
    "Updated message",
    "Retirement"
  ],
  "Title": "Microsoft Lens app will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
