{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>To improve administrative control and support organizational transitions, SharePoint Embedded now allows administrators to update the principal owner of user-owned containers directly through the SharePoint Admin Center (SPAC) or via SharePoint PowerShell cmdlets. This update addresses common scenarios such as user departures or team restructuring.</p>\n\n<b><b>When this will happen:</b></b>\n<p>General Availability (Worldwide): Rollout will begin in late September 2025 and is expected to complete by late October 2025.</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> SharePoint administrators managing user-owned containers in SharePoint Embedded.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Admins will be able to update the principal owner of user-owned containers via SPAC or PowerShell.</li>\n    <li>This capability is limited to user-owned containers only.</li>\n    <li>The update helps maintain continuity and access control when users leave or teams change.</li>\n    <li>No changes will be made to existing containers unless action is taken by an admin.</li>\n    <li>The feature will be <b>available by default on SPAC</b>; no opt-in required.</li><li>The feature will not be readily available by default on PowerShell. The admin has to update it to the latest version.&nbsp;</li>\n  </ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Review user-owned containers that may need ownership updates.</li>\n<li>Use SPAC to select a container and update the principal owner via the <i style=\"\">General </i>tab.</li>\n<li>Alternatively, use the updated SharePoint PowerShell cmdlets to perform the same action. Ensure your SharePoint PowerShell module is updated to the latest version.</li>\n<li>Communicate this change to helpdesk or support teams.</li>\n<li>Update internal documentation if ownership management is referenced.</li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Embedded will allow admins to update the principal owner of user-owned containers via the SharePoint Admin Center or PowerShell starting late September 2025. This helps manage ownership during user or team changes, requires no opt-in on SPAC, and needs PowerShell updates. No compliance issues noted."
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1152315",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-12T23:00:26.11Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-12T23:00:08Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Update Principal owner of a SharePoint Embedded user-owned container through SPAC and PowerShell",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
