{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the general availability of Sales Qualification Agent in Dynamics 365 Sales, which autonomously researches and engages leads, and hands off to sellers only those that have demonstrated purchase intent. This feature will reach general availability on October 26, 2025, for early access environments, and continue rolling out for additional geos over the subsequent weeks.<br><br>\n<b>How does this affect me? </b><br>\nWith this agent, you can now build higher quality pipelines while your sellers spend more time building relationships and less time prospecting. Some features include:<ul>\n<li><b>AI-Powered Lead Research: </b>The agent autonomously researches leads by combining your CRM data with public web sources as well as custom knowledge sources through Copilot Studio, creating rich lead and company profiles. It assesses a lead's importance based on target profile criteria you define, as well as signals from emails with the lead and recent marketing interactions. </li>\n<li><b>Instant Insights: </b>Get actionable recommendations, 360-degree lead and account summaries, recent company news, competitor insights and clear prioritization—letting sellers focus on the leads most likely to convert. </li>\n<li><b>Personalized Outreach: </b>The updated agent not only automatically drafts but also sends customized emails with key talking points. It also reminds leads that don't engage, increasing the response rates of your prospecting efforts. </li>\n<li><b>Smart Engagement with Q&A and intent detection: </b>With new automation, the agent can send personalized follow-up emails and analyze responses to detect purchase intent, ensuring high-touch engagement and boosting your pipeline’s quality. It can answer the lead's questions using your configured knowledge sources, moving the lead further down the consideration journey. </li>\n<li><b>Easy Customization with configurable automation level: </b>Admins can tailor qualification rules, add industry-specific research sources, and fine-tune the agent’s handover criteria to your unique sales strategy. You can control the level of automation you want - from research and pre-qualification all the way to full engagement.</li></ul>\n<b>Why Try the New Sales Qualification Agent? </b><br>\nYou’ll empower your team to spend less time on manual lead triage and more time building relationships, accelerating the path from lead to qualified opportunity.<br><br>\n<b>What action do I need to take? </b><br>\nThis message is for awareness, and no action is required. <br><br>\nIf you would like more information on this feature, please visit <a href=\"https://aka.ms/11715/sales-qualification-agent\" target=\"_blank\">Sales Qualification Agent overview (preview)</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-26T23:03:00Z",
  "HasAttachments": false,
  "Id": "MC1159615",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-25T23:09:06.213Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-25T23:03:17Z",
  "Tags": [],
  "Title": "Dynamics 365 Sales - Boost pipeline by autonomously researching leads with Sales Qualification Agent",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
