{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re retiring the Transform to Web Page feature in Microsoft Word. Starting October 1, 2025, this feature will no longer be available. As an alternative, we recommend using the Start from a Document flow in Microsoft Sway to create web-based content from Word documents.\n</p><p><b>When this will happen\n</b></p><p>This change will take effect on September 30, 2025. After this date, the Transform to Web Page feature will be removed from Microsoft Word.\n</p><p><b>How this affects your organization\n</b></p><p>If your organization currently uses the Transform to Web Page feature, users will no longer be able to access it after the retirement date. Users can continue creating web-based content by using the Start from a Document option directly in Sway, which offers a similar experience.\n</p><p>No admin action is required for this change.\n</p><p><b>What you can do to prepare\n</b></p><ul><li>Notify your users about the upcoming retirement of the Transform to Web Page feature.\n</li><li>Update any internal documentation or training materials that reference this feature.\n</li><li>Encourage users to use the Start from a Document flow in Sway as the new method for creating web content from Word documents.\n</li><li><a href=\"https://support.microsoft.com/sway\" target=\"_blank\">Learn more about Sway and how to use it</a>.\n</li></ul><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Transform to Web Page\" feature in Microsoft Word will retire on September 30, 2025. Users should switch to the \"Start from a Document\" flow in Microsoft Sway for creating web content. No admin action is needed, but users should be notified and documentation updated."
    }
  ],
  "EndDateTime": "2025-11-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1131776",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-08T23:42:15.297Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-08T23:41:53Z",
  "Tags": [
    "Retirement"
  ],
  "Title": "Microsoft Word: “Transform to Web Page” feature retiring September 30, 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
