{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\nWe’re introducing a new <b>Remote Procedure Call (RPC) Configuration Health Alert for sensors v3.x</b> in Microsoft Defender for Identity. This capability proactively monitors RPC configuration across your environment, helping administrators quickly identify and remediate misconfigurations that could impact detection accuracy or security posture. Additionally, applying the Unified Sensor RPC Audit tag enables advanced identity detections, improving security visibility and unlocking additional detection capabilities.<p></p>\n\n<p><b><b>When this will happen:</b></b></p><b>General availability (Production, GCC, GCCH):</b> We will begin rolling out early December 2025 and expect to complete by mid-December 2025.<p></p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p></p><ul>\n<li><b>Who is affected:</b> Admins managing Microsoft Defender for Identity v3.x sensors.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>A new health alert will monitor RPC configuration status on v3.x sensors.</li>\n<li>Applying the <b>Unified Sensor RPC Audit tag </b>will enforce configuration on existing and future v3.x sensors that match rule criteria.</li>\n<li>The tag will be visible in <b>Device Inventory </b>and<b>&nbsp;Advanced Hunting</b>, providing transparency and auditing capabilities.</li>\n<li>This feature improves detection accuracy and overall security coverage.</li>\n</ul>\n</li>\n</ul>\n<p></p>\n\n<p><b><b>What you can do to prepare:</b></b></p>\nTo apply the <b>RPC Audit tag</b> on your v3.x sensors:\n<p></p><ol>\n<li>In the Microsoft Defender portal, navigate to: <b>System </b>&gt; <b>Settings </b>&gt; <b>Microsoft Defender XDR</b> &gt; <b>Asset Rule Management</b>.</li>\n<li>Select <b>Create a new rule</b>.</li>\n<li>Enter a <b>Rule name</b> and <b>Description</b>, then set conditions using <b>Device name</b>, <b>Domain</b>, or <b>Device tag</b>. Ensure the Defender for Identity v3.x sensor is deployed on targeted devices.</li>\n<li>Add the tag <b>Unified Sensor RPC Audit</b>.</li>\n<li>Review and submit the rule.</li>\n</ol>\nFor more details, refer to <a href=\"https://learn.microsoft.com/defender-for-identity/\" target=\"_blank\">Microsoft Defender for Identity documentation</a>.\n<p></p>\n\n<p><b><b>Compliance considerations:</b></b></p>\nNo compliance considerations identified; review as appropriate for your organization.<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity introduces a new RPC Configuration Health Alert for v3.x sensors, rolling out December 2025. It monitors RPC settings, improves detection accuracy, and enables the Unified Sensor RPC Audit tag for enhanced security visibility and auditing via Device Inventory and Advanced Hunting."
    }
  ],
  "EndDateTime": "2026-01-14T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187390",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-17T23:49:38.8Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-17T23:49:31Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Unified sensor (v3.x) – new Remote Procedure Call (RPC) configuration health alert for Microsoft Defender for Identity",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
