{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>We’re introducing new <b>Microsoft Secure Score recommendations</b> for Microsoft Defender for Endpoint (MDE) to help organizations strengthen their security posture. These recommendations are designed to proactively block common attack techniques and improve endpoint protection.<p></p><p><b><b>When this will happen:</b></b></p><p>Public Preview: Rollout begins in early November 2025 and is expected to complete by mid-November 2025.</p><p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:&nbsp;</b>Admins managing Microsoft Defender for Endpoint and Microsoft Secure Score.</p><p><b>What’s changing:</b></p><p><b>Lightweight Directory Access Protocol (LDAP)</b> is a protocol used to access and manage directory information, commonly for authentication and authorization in enterprise environments.</p><p>Customers in Public Preview will see the following new recommendations in Microsoft Secure Score:</p><ol><li>Require LDAP client signing to prevent tampering and protect directory authentication&nbsp;</li><li>Encrypt LDAP client traffic to protect sensitive data in transi&nbsp;</li><li>Enforce LDAP channel binding to protect authentication sessions from interception&nbsp;</li><li>Require LDAP server signing to ensure integrity of directory traffic</li></ol><p>Secure Score will be updated based on the implementation of these recommendations.</p><p><b><b>What you can do to prepare:</b></b></p><ul><li>Review the new recommendations in Microsoft Secure Score once available.</li><li>Complete the recommended actions to improve your organization’s security posture.</li><li>Communicate these changes to your security and endpoint management teams.</li><li>Learn more about Microsoft Secure Score: <a href=\"https://learn.microsoft.com/he-il/defender-xdr/microsoft-secure-score?view=o365-worldwide\" target=\"_blank\">Microsoft Secure Score | Microsoft Defender XDR | Microsoft Defender | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New Microsoft Secure Score recommendations for Microsoft Defender for Endpoint will roll out in November 2025, focusing on LDAP security enhancements like client signing, traffic encryption, channel binding, and server signing to improve endpoint protection and prevent attacks. Admins should review and implement these changes."
    }
  ],
  "EndDateTime": "2025-12-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181656",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-30T15:43:44.063Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-30T15:43:36Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Secure Score: New recommendations for Microsoft Defender for Endpoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
