{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>\n</p><b>Introduction</b><p>We are retiring the standalone <i>Share to Teams</i> experience in Outlook for users who do not have the Teams desktop app installed. This retirement supports our goal of streamlining the sharing experience and reducing maintenance overhead, while ensuring a consistent and modern user experience across Outlook clients.\n</p><p></p><p><b>When this will happen</b></p><ul><li>Retirement begins: September 22, 2025\n</li><li>Retirement completes: October 3, 2025\n</li></ul><p><b>How this affects your organization</b></p><p>After September 22, 2025, users who select the <i>Share to Teams</i>&nbsp;button in Outlook without having the Teams desktop app installed will be redirected to a launcher page prompting installation. The standalone web dialog previously used for sharing will no longer be available.\n</p><p></p><ul><li>Users with the Teams desktop app will continue to share via the Teams client.\n</li><li>Users without the app will be prompted to install it via a launcher page.\n</li><li>Mac users may encounter an error due to Apple’s restrictions on launcher dialogs.\n</li></ul><p>This change affects the following Outlook clients:\n</p><p></p><ul><li>Outlook for Windows (New and Classic)\n</li><li>Outlook for Mac (New and Legacy)\n</li><li>Outlook Web App (OWA)\n</li></ul><p><b>What you can do to prepare</b></p><p></p><p>No admin action is required. However, we recommend notifying your users of this retirement and encouraging installation of the Teams desktop app to maintain access to the <i>Share to Teams</i> functionality.</p><p><b>Compliance considerations</b></p><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p></p><p></p><p></p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The web-based \"Share to Teams\" feature in Outlook will retire between September 22 and October 3, 2025. Users without the Teams desktop app will be prompted to install it, while those with the app continue sharing via Teams. No admin action is required, but user notification is recommended."
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1140180",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-22T22:42:52.557Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-22T22:42:28Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retirement of web-based “Share to Teams” experience from Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
