{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 26, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re introducing a new way to search in Microsoft Teams using structured, SQL-like query commands in the search bar. This enhancement allows users to filter messages, files, and conversations more precisely using keywords such as from:username, with:username, in:channel, or is:type (message, file, group chat, channel). This feature is especially useful for developers and power users who prefer to express specific search intent to narrow down search results and easily find what they are looking for.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=496590\" target=\"_blank\">496590</a>.</p><p><b>When this will happen</b></p><p><b>Targeted Release: </b>We began rolling out in early August 2025 and expect to complete by early August 2025 - Completed</p><p><b>General Availability (Worldwide): </b>We began rolling out mid-August 2025 and expect to complete by mid-August 2025 - Completed\n</p><p><b>General Availability (GCC, GCCH, and DoD): </b>We began rolling out late August 2025 and expect to complete by late September 2025.</p><p><b>How this affects your organization</b></p><p>This feature enhances the search experience in Microsoft Teams by enabling structured, SQL-like queries. It will be available on the following platforms at launch:\n</p><ul><li>Teams Web\n</li><li>Teams Desktop\n</li><li>Teams Mac</li></ul><p>Users will be able to filter messages, files, and conversations using commands such as is:, in:, from:, and with:. This applies to all Teams content that is accessible to the user, including private chats, shared channels, and files.\n</p><p>Once available, the feature will be on demand—users can begin typing one of the supported commands in the search bar to activate it.\n</p><p>If a user enters an unsupported or malformed query, the system will default to standard search results. Users can also leverage query suggestions to help formulate correct queries.\n</p><p>This update provides a faster, more accurate way to locate content, especially in large or complex Teams environments.</p><p><b>What you can do to prepare</b></p><p>No admin action is required. You may wish to:\n</p><ul><li>Inform users about this new capability.\n</li><li>Encourage users to try structured search queries.\n</li><li>Share training materials or internal documentation to support adoption.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "496590"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams now supports structured, SQL-like search queries (e.g., from:, in:, is:) for precise filtering of messages, files, and conversations across platforms. Rolled out globally by August 2025, this feature requires no admin action but encourages user awareness and training for adoption."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-11-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130388",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-26T21:23:46.507Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:31:40Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams | Search with key query language",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
