{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to design proactive customer engagement workflows in Dynamics 365 Contact Center. This feature will reach general availability on October 31, 2025.<br><br> \n\n<b>How does this affect me? </b><br> \n\nThis feature allows Journey authors to define dynamic caller ID rules based on customer attributes, allowing each call to present a trusted and contextually relevant identity. Additionally, journeys can optionally reserve customer service representatives before call initiation, ensuring they're prepared and available, reducing wait times and increasing first-call resolution. <br><br> \n\nEnhancements to dial modes include a predictive dialer that automatically initiates calls based on agent availability and customer responsiveness. This dialer helps journey authors efficiently scale outreach across large customer segments. A preview timer gives service representatives a configurable window to review customer history before the call begins. <br><br> \n\n<b>What action do I need to take? </b><br> \nThis message is for awareness, and no action is required. <br><br> \n\nIf you would like more information on this feature, please visit <a href=\"https://aka.ms/12081/tailor-proactive-engagements-configuration-options\" target=\"_blank\">Tailor proactive engagements with configuration options</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-30T03:50:00Z",
  "HasAttachments": false,
  "Id": "MC1163119",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-01T04:03:19.02Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-01T03:50:56Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center – Tailor proactive engagements with configuration options",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
