{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>In early 2026, a major update of Planner will begin rolling out. This update will introduce several new capabilities. In addition, several features will be retired from Microsoft Planner. These changes will <b>begin rolling out between mid-January</b> <b>2026 and mid-February 2026</b>. </p><p><b><b>When this will happen:</b></b></p><p>Refer to the sections below for details on timing.</p>\n<p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected: </b>All users of Microsoft Planner in your organization, including those using Planner components in Loop, integrations with <b>Viva Goals</b>, and <b>premium Planner plans</b>.</p><p><b>What will happen:</b></p>\n<p>In early 2026, we will begin rolling out a new major update of the <b>Planner app in Teams</b>&nbsp;<b>desktop and web </b>as well as <b>Planner on the web</b>. This update will come with several new enhancements, and we will also be retiring several features at this time. See each section below for more detail on the timing.</p><p><b>New features in the upcoming Planner update:\n</b></p><ul><li>These changes will be available with the new update, which we expect to begin rolling out between mid-January 2026 and mid-February 2026.</li><li><b>Tasks chats in basic plans </b>will allow&nbsp;team members to collaborate directly on tasks using rich text formatting and @mentions, making it easier to discuss work and notify teammates about what needs attention.\n</li><li><b>Custom templates </b>will allow you to create reusable, pre-designed plan layouts tailored to your organization’s needs, ensuring consistency and saving time. They provide the ability to standardize content while allowing easy customization for specific scenarios.</li><li><b>Project manager agent </b>will now be available in all plans for M365 Copilot licensed users, including basic plans.</li></ul><p><b>Features in Planner that will be retired:</b></p>\n<ul><li>We expect this rollout to begin between <b>mid-January 2026</b> and <b>mid-February 2026</b>.</li><li>The following changes will take effect as this build rolls out to your organization:</li><ul><li><b>A new <i>Task chat experience </i>will replace the prior <i>comments experience </i>for <i>basic plan</i> tasks:</b> <ul><li>As noted above, the previous task comments experience will be replaced by a new task chat feature that supports messages about the task that can include @mentions and rich text formatting, in response to a longstanding top customer request. Due to customer feedback on our notifications experience, the new chat feature only sends an email/Teams notification to a colleague that’s been @mentioned in the message. </li><li>The task chat experience will be available on Planner in Teams web/desktop and the Planner web experience, and the old experience for viewing comments will no longer be directly visible on a task. Instead, the task details pane will show a link to open a page in Outlook where task comments can be seen.</li><li>Users can continue to use and see the previous task comments experience in the iOS Planner app, Android Planner app, and Planner in Teams mobile. New task chat messages will not be visible in the mobile experience at this time.</li><li>There are no changes to email notifications for the existing task comments experience, meaning that an email notification will be sent to all group members associated with the plan when a task comment is added.</li><li>There is no change to the <b>premium plan</b> conversations feature at this time.</li></ul></li><li><b>The whiteboard tab for <i>premium plans</i> will be retired.</b> <ul><li>This feature automatically created a whiteboard for <b>premium plans</b> in Planner and allowed users to create tasks in Planner from that whiteboard's sticky notes. </li><li>The <b>whiteboard tab</b> will be unavailable on the <b>premium plan</b> after retirement of this feature.</li><li>Users will be unable to create tasks from a whiteboard as a result. </li><li>Any existing whiteboard content will remain available via the <b>Whiteboard app</b>. </li><li>There is no replacement for this feature at this time.</li></ul></li></ul></ul><p><b>Features in Planner that will be temporarily unavailable:</b></p><ul><li>We expect this rollout to begin between <b>mid-January 2026</b> and <b>mid-February 2026</b>.</li><li><b>Convert a <i>basic plan</i> to a <i>premium plan</i>&nbsp;will be temporarily unavailable.</b></li><ul><li> The ability to convert an existing <b>basic plan</b> to a <b>premium plan</b> will be unavailable. </li><li>We plan to make similar functionality available again in the future. </li><li>In the meantime, users will need to create a new <b>premium plan</b> and manually copy the tasks into the new plan.</li></ul></ul><p><b>Features outside of Planner that will be retired without replacement:</b></p><ul><li><b>Planner integration in <i>Viva Goals</i>. </b><ul><li><b>Viva Goals</b> will be retired on <b>December 31, 2025</b>, as previously announced. Refer to Viva Goals retirement for more information.</li><li>When <b>Viva Goals</b> is retired, the entry point in <b>Viva Goals</b> for use with Planner will no longer be available.</li></ul></li><li><b><i>iCalendar feed</i> integration retirement. </b><ul><li>This feature will be retired between <b>mid-January 2026</b> and <b>mid-February 2026</b>.</li><li>This feature allowed users to subscribe to their Planner tasks as an <b>iCalendar feed</b> that could be viewed in iCalendar-compatible applications like Outlook. </li><li>After this feature is retired, users will not be able to create new <b>iCalendar feeds</b> for their tasks or plans, and they will stop seeing their tasks in the <b>iCalendar feeds</b> they previous created. </li><li>There is no replacement for this feature at this time.</li></ul></li><li><b>Planner component retirement in <i>Loop pages</i>.</b> <ul><li>This feature will be retired between <b>mid-January 2026</b> and <b>mid-February 2026</b>. </li><li>Loop pages support various options for capturing task information.</li><li>This control, which could previously be inserted by typing  /planner  in a Loop workspace, was one of the available options.</li><li>We recommend the Task List Control in Loop to capture tasks.</li><li>After the retirement of this control, which is expected to begin in January 2026 and will roll out independent of the Planner update rollout, it will no longer be possible to add a new component of this type in a Loop workspace. </li><li>Workspaces where these components were already present will display the Planner plan URL where the component was previously located.</li><li>Tasks previously entered in these components will remain available in Planner.</li></ul></li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>These changes will happen automatically by the specified dates.</li><li>No admin action is required.</li><li>Notify users about this change.<ul><li>Update relevant documentation as appropriate.</li><li>Share the recommended alternate options where appropriate, as described above.</li></ul></li></ul><p><b><b>Compliance considerations:</b>\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In early 2026, Microsoft Planner will roll out a major update with new features like task chats and custom templates, while retiring features including the old task comments, whiteboard tab for premium plans, iCalendar feed, Planner integration in Viva Goals, and Planner components in Loop pages. Some features will be temporarily unavailable. No admin action is needed."
    }
  ],
  "EndDateTime": "2027-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1193421",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-09T00:56:00.733Z",
  "Services": [
    "Planner"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-09T00:22:56Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retirement of several Microsoft Planner features in early 2026 as part of a Planner update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
