{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b>Introduction</b>\n<p>The <b>Publish reports</b> capability for <i>Viva Insights analysts</i> is becoming generally available. This feature enables analysts to share embedded Power BI reports or custom report links with their organization, improving access to insights and collaboration. Analysts can publish:</p>\n<ul>\n<li>Embedded Power BI reports (unfiltered) to users with access to the Copilot Dashboard in Viva Insights through the Microsoft admin center.</li>\n<li>Embedded Power BI reports (filtered) to managers, showing only their team’s data based on the manager hierarchy.</li>\n<li>Custom report links to users and groups in their organization.</li>\n</ul>\n<p>All recipients will receive an email notification directing them to the published report. Recipients with access to the Viva Insights web app will see these reports on their <i>Reports </i>tab.</p>\n<p>Insight admins have full control over publishing. They can disable the capability or choose which analysts can use it through the VFAM policy. They can also view and remove any published reports.</p>\n<p>For customers in the public preview, access to published reports in the Viva Insights Teams app will be removed, and Teams publish notifications will be turned off. Users who do not have access to the Viva Insights web app should bookmark any existing published links to maintain access.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398974\" target=\"_blank\">398974</a>.</p>\n\n<b>When this will happen</b><p><b>General Availability (Worldwide): </b>Rollout will begin in&nbsp;<b>early December 2025 </b>and is expected to complete by <b>mid-December 2025</b>.</p>\n\n<b>How this affects your organization</b><ul>\n<li><b>Who is affected:</b> Viva Insights analysts, Insight admins, and users receiving published reports.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Analysts can publish embedded Power BI reports or custom report links to their organization.</li>\n<li>Recipients will receive email notifications for published reports.</li>\n<li>Published reports will appear on the Reports tab in the Viva Insights web app for users with access.</li>\n<li>Insight admins can manage publishing permissions and remove published reports.</li>\n<li>Teams notifications and access to published reports in the Viva Insights Teams app will be removed.</li>\n<li>This feature is <b>ON by default</b> for all analysts.</li>\n</ul>\n</li>\n</ul>\n\n<b>What you can do to prepare</b><ul><p>\n</p><li>Review and update the Analyst Report Publish <a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">VFAM policy</a> if you want to disable this feature for specific analysts or entirely. This can be managed through the <a href=\"https://learn.microsoft.com/Viva/control-access-admin-center\" target=\"_blank\">Microsoft admin center</a>.</li><li>Ensure that Viva Insights is enabled in your organization and that users are assigned the Viva Analyst role to use this feature. Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/setup-overview\" target=\"_blank\">Viva Insights setup checklist | Microsoft Learn</a></li>\n<li>If your tenant participated in the preview, ensure users bookmark any published custom report links before Teams access is removed.</li>\n<li>Communicate this change to helpdesk staff and update internal documentation as needed.</li>\n<li>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/publish-reports\" target=\"_blank\">Publish reports (preview) | Viva Insights | Microsoft Viva | Microsoft Learn</a></li><p></p></ul><ul><p></p></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><ul><p></p></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398974"
    },
    {
      "Name": "Summary",
      "Value": "The Publish reports feature in Microsoft Viva Insights is generally available from December 2025, allowing analysts to share embedded Power BI reports or custom links with their organization. Insight admins control publishing permissions, and recipients get email notifications and see reports in the Viva Insights web app. Teams app access and notifications will be removed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187388",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-17T23:47:40.633Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-17T23:47:28Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights: Publish reports capability is becoming generally available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
