{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>You can now save a meeting as a draft on your calendar when you're not ready to send invites. This update gives users more flexibility when planning events, especially when details are still being finalized.</p>\n\n<b>When this will happen</b><p></p><p>\n</p><ul>\n<li><b>General Availability (Worldwide, GCC, GCC High, DoD):</b> Rollout will begin in July 2025 and is expected to complete by late August 2025.</li>\n</ul>\n\n<b>How this affects your organization</b><p></p><p>\n</p><p>Users will be able to save events as drafts when creating a meeting with at least one attendee. To do this, select the <b>Discard</b> button while composing the event, then choose <b>Save as a draft</b>. Draft events will appear on the calendar with a “<b>Draft</b>” prefix in the title.<br>This feature is available on mobile and will be <b>on by default</b>.</p>\n\n<p></p><p><b>What you can do to prepare</b></p><p>\n</p><ul>\n<li>No admin action is required. You may want to:</li>\n<li>Inform your users about this new capability.</li>\n<li>Update internal training materials or documentation as needed.</li>\n</ul><b>Compliance considerations</b><p></p><a href=\"https://support.microsoft.com/outlook\">\n</a><p></p><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook will allow saving meetings as drafts starting July 2025, showing “[Draft]” in titles. Users can discard and save events as drafts with attendees, available by default on mobile. No admin action is needed; inform users and update training as needed. No compliance issues identified."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1125489",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-30T23:47:43.65Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-30T23:47:37Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Outlook | Save an Event as a Draft",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
