{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:</b></p><p>The Microsoft Defender for Identity team is rolling out improvements to several detections based on customer feedback and internal analysis. These updates are designed to reduce alert noise and improve detection accuracy, helping security teams focus on the most actionable threats. An active Microsoft Defender for Identity (MDI) license is required to benefit from these improvements.</p><p><b>When this will happen:</b></p><p>These improvements will begin rolling out gradually starting in late September 2025 and will complete by mid-October 2025.</p><p><b>How this affects your organization:</b></p><p>Who is affected: Admins managing Microsoft Defender for Identity in commercial tenants.</p><p>What will happen:</p><ul><li>Several existing detections will be updated to reduce false positives and improve precision.</li><li>You may observe a decrease in the number of alerts raised for the following detections:<ul><li>Suspicious communication over DNS&nbsp; &nbsp; &nbsp; </li><li>Suspected Netlogon privilege elevation attempt (CVE-2020-1472 exploitation)</li><li>Honeytoken authentication activity</li><li>Remote code execution attempt over DNS</li><li>Suspicious password reset by Entra Connect account</li><li>Data exfiltration over SMB</li><li> Suspected skeleton key attack (encryption downgrade)</li><li>Suspicious modification of the Resource-Based Constrained Delegation attribute by a machine account</li><li>Remote code execution attempt</li></ul></li></ul><p>No changes to configuration or policy settings are required.</p><p><b>What you can do to prepare:</b></p><ul><li>&nbsp;No action is required at this time.</li><li>&nbsp;Review alert volumes and detection behavior after rollout to assess impact.</li><li>&nbsp;Communicate this change to your security operations team.</li><li>&nbsp;Update internal documentation if you track detection logic or alert thresholds.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/defender-for-identity/alerts-overview\" target=\"_blank\">Security alerts - Microsoft Defender for Identity | Microsoft Learn</a></p><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity will update several detections from late September to mid-October 2025 to reduce false positives and improve accuracy, lowering alert noise without requiring configuration changes. Admins should review alert volumes post-rollout and inform their security teams accordingly."
    }
  ],
  "EndDateTime": "2025-11-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1151683",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-11T22:17:50.7Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-11T22:17:44Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity | Detections improvements to reduce noise and improve accuracy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
