{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>To simplify cross-tenant migrations, we're introducing a unified interface that enables administrators to move user data—including Exchange mailboxes, OneDrive files, and Teams chats and meetings—across Microsoft 365 tenants. This streamlines migration workflows and supports seamless collaboration during organizational transitions.</p><p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Public Preview (Worldwide):</b> Begins early December 2025.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> Admins managing Microsoft 365 tenant-to-tenant migrations; organizations planning mergers, acquisitions, or restructuring.</li>\n<li><b>What will happen:\n  </b><ul>\n    <li>A new set of PowerShell Graph commands will be available to migrate Exchange mailboxes, OneDrive content, and Teams chats and meetings across tenants.</li>\n    <li>The feature is <b>opt-in</b>; no changes will occur unless enabled by your organization.</li>\n    <li>Migration workflows are consolidated into a single experience, reducing complexity.</li>\n    <li>Admins can initiate and monitor migrations from a centralized location.</li>\n  </ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required unless your organization chooses to use the feature.</li>\n<li>If planning a migration:\n  <ul>\n    <li>Review internal migration policies and timelines.</li>\n    <li>Communicate availability of this feature to IT and helpdesk teams.</li></ul></li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/migration-orchestrator-1-overview?view=o365-worldwide\" target=\"_blank\">Migration orchestrator overview - Microsoft 365 Enterprise | Microsoft Learn</a></p><p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early December 2025, admins can opt-in to a unified interface with new PowerShell Graph commands to migrate Exchange mailboxes, OneDrive files, and Teams chats across Microsoft 365 tenants, simplifying tenant-to-tenant migrations during organizational changes. No action is required unless used."
    }
  ],
  "EndDateTime": "2026-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1198079",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-16T23:42:24.23Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-16T23:42:14Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Migrate User Data Across Tenants: Mailboxes, OneDrives, and Teams Chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
