{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>To support enhanced monitoring and governance, <b>Microsoft Fabric</b> is introducing a <b>new tenant setting </b>that allows admins to control whether user identifiers are included in <i>OneLake diagnostic logs</i>. This change aligns with customer feedback around privacy and compliance, giving organizations more flexibility in managing diagnostic data.</p><p><b><b>When this will happen:</b></b></p><ul><li>OneLake diagnostics will become generally available in mid-October 2025.</li><li>The new tenant admin setting will be available starting October 28, 2025.</li></ul><p><b><b>How this affects your organization:</b></b></p><p>Who is affected: </p><ul><li>Admins managing Microsoft Fabric and OneLake environments.</li><li>Workspace Admins and Tenant Admins.</li></ul><p>What will happen:</p><ul><li>Workspace Admins will be able to enable OneLake diagnostics to monitor data interactions:</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/03d882f0-58fd-4e49-9b2e-7cd4929d9148/20783af476b2859ed66e8ae402902bbc877030e8.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>By default, diagnostic events will include End User Identifiable Information (EUII), such as User Principal Name (UPN) and IP address.</li><li>A new tenant admin setting will be available to opt out of logging EUII.</li><li>The setting will be enabled by default—EUII will be logged unless the toggle is disabled.</li></ul><p>Example scenarios supported by OneLake diagnostics:</p><ul><li><b>Security investigation: </b>Track which users accessed sensitive datasets, when, and from where. Helps identify unauthorized access attempts or unusual patterns.</li><li><b>Performance troubleshooting:</b> Diagnose latency or failure issues by correlating diagnostic events with user actions or system interactions.</li><li><b>Usage analytics and optimization: </b>Understand which datasets are most frequently accessed, by whom, and how often. Supports data governance and resource optimization.</li><li><b>Integration monitoring: </b>Monitor external systems interacting with OneLake (via APIs or connectors), ensuring integrations are functioning as expected and diagnosing issues when they arise.</li></ul><p><i></i></p><p><b><b>What you can do to prepare:</b></b></p><ul><li>Review your organization’s privacy and compliance policies.</li><li>Starting mid-October:<ul><li>Workspace Admins can enable OneLake diagnostics (EUII will be redacted at this stage).</li></ul></li><li>By October 28:<ul><li>Tenant Admins should review the new admin toggle in the Fabric Admin Portal.</li><li>If you wish to prevent EUII from being logged:<ul><li>Disable the toggle in the Fabric Admin Portal.</li></ul></li></ul></li><li>Communicate this change to your helpdesk and update internal documentation as needed.</li></ul><b>Compliance considerations:</b><table class=\"table table-bordered\"><tbody><tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Yes. Diagnostic logs will include or exclude EUII based on admin settings.</td></tr><tr><td>Does the change modify how admins can monitor, report on, or demonstrate compliance activities?</td><td>Yes. Admins gain visibility into data access and usage patterns, similar to Azure Storage Diagnostics.</td></tr><tr><td>Does the change include an admin control and can it be controlled through Entra ID group membership?</td><td>Yes. The new tenant setting is available in the Fabric Admin Portal and can be toggled by Tenant Admins.</td></tr></tbody></table>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Fabric will introduce a tenant setting on October 28, 2025, allowing admins to control inclusion of user identifiers in OneLake diagnostic logs. By default, End User Identifiable Information is logged, but admins can opt out for privacy and compliance. This supports security, troubleshooting, and usage analytics."
    }
  ],
  "EndDateTime": "2025-12-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1158904",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-24T22:48:58.51Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-24T22:48:49Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Fabric: Upcoming tenant settings for OneLake diagnostic logs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
