{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re retiring support for rendering Loop components in Word for the web, effective September 1, 2025.</p><p>This change aligns the Word web experience with Word desktop, where Loop components are already displayed as read-only placeholders.\n</p><p><b>When this will happen:</b></p><p>This change will roll out automatically and take effect on September 1, 2025.\n</p><p><b>How this affects your organization:</b></p><p>Loop component creation in Word for the web was previously deprecated. With this update, existing Loop components will no longer render interactively in Word web documents. Instead, users will see a read-only placeholder with a link to open the Loop component externally.\n</p><p>This ensures continued access to content without data loss but removes in-document interactivity.\n</p><p>Our reporting indicates that your organization may have users who open Word web documents containing Loop components. No admin action is required, but this change may impact user workflows.\n</p><p><b>What you can do to prepare:</b></p><ul><li>Notify your users about the upcoming change and the new placeholder experience.\n</li><li>Update internal documentation to reflect the change in behavior.\n</li><li>Encourage users to access Loop components via the provided external link if interactivity is needed.\n</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Support for rendering Loop components in Word for the web will be retired on September 1, 2025. Existing Loop components will display as read-only placeholders with links to open them externally. Organizations should notify users, update documentation, and encourage accessing Loop components via external links. No admin action is required."
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1107493",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-01T23:23:10.517Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-01T23:22:59Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retirement of Loop Component Rendering in Word for the Web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
