{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing Role-Based Access Control (RBAC) in Microsoft Places to help IT administrators securely delegate management responsibilities to centralized Places administrators or local stakeholders such as building or desk managers. This update enhances operational efficiency and aligns access with real-world roles.</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=488103\" target=\"_blank\">488103</a></p><p>\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Rollout is expected to begin and complete in August 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With this update, Microsoft Places will support RBAC through Exchange Online and Microsoft Entra. This enables:\n</p><ul><li>Places administrator role (available in Entra): A centralized IT role responsible for onboarding, enabling/disabling features, and assigning local admin roles.\n</li><li>Building administrators: Can manage one or more buildings and associated spaces (floors, sections, rooms, desks, workspaces).\n</li><li>Desk administrators: Can manage desks within specific building sections, including desk modes, metadata, and assignments.\n</li></ul><p>Building and desk administrator roles are managed via the Exchange admin center. This change decentralizes Places management, reduces IT overhead, and ensures only authorized users manage specific resources.\n</p><p><b>What you can do to prepare:</b>\n</p><p>If your organization is using or planning to onboard to Microsoft Places, review the updated documentation (to be published at rollout) and plan for role assignments to support onboarding and daily operations.</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? Maybe – access to room and desk metadata is delegated, but no change to data storage.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488103"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Places is introducing Role-Based Access Control (RBAC) to delegate management to centralized or local administrators, enhancing operational efficiency. The update, associated with Microsoft 365 Roadmap ID 488103, will roll out in August 2025. Organizations should review documentation and plan role assignments for onboarding and operations."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1108847",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-03T23:38:58.353Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-03T23:38:53Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Places: Built in Admin roles support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
