{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 26, 2025: We have updated the content below to provide additional information. Thank you for your feedback.</p><p><b><b>Introduction</b></b>\n</p><p>We’re improving the performance and startup time of calling features in the Microsoft Teams Desktop Client for Windows. To achieve this, we’re introducing a new child process named <i>ms-teams_modulehost.exe</i> that will handle the calling stack separately from the main application process (<i>ms-teams.exe</i>). This change optimizes resource usage and enhances meeting experiences.</p>\n\n<b><b>When this will happen:</b></b>\n<p>Worldwide, GCC, GCC High, and DoD: Rollout will begin early January 2026 and complete by late January 2026.</p><p>Note: Timelines may shift due to year-end feature flag rollout freeze.</p>\n\n<b><b>How this affects your organization:</b></b>\n<ul>\n<li><b>Who is affected:</b> All users running the Teams Desktop Client on Windows.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>A new process (<i>ms-teams_modulehost.exe</i>) will appear in Task Manager under the main Teams process (<i>ms-teams.exe</i>).</li>\n<li>This process is dedicated to calling features and improves performance.</li>\n<li>No changes to user workflows or UI; however, admins should ensure endpoint and security software allow this new process.</li>\n</ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Update endpoint management and security software to allowlist <i>ms-teams_modulehost.exe</i> alongside <i>ms-teams.exe</i>.</li>\n<li>Communicate this change to helpdesk staff to avoid confusion during troubleshooting.</li>\n<li>Update internal documentation if you reference Teams process names.</li><li>Make sure the same QoS settings applied to <i>ms-teams.exe</i> are also applied to <i>ms-teams_modulehost.exe</i>. Refer to this page for details: <a href=\"https://learn.microsoft.com/microsoftteams/qos-in-teams\" target=\"_blank\">Implement Quality of Service (QoS) in Microsoft Teams</a><ul><li><b>DO NOT</b> remove QoS settings of <i>ms-teams.exe</i>. Only add QoS settings for <i>ms-teams_modulehost.exe</i>.</li></ul></li>\n</ul>\n\n<b><b>Compliance considerations:</b></b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Desktop Client for Windows will introduce a new process, ms-teams_modulehost.exe, to handle calling features separately, improving performance and startup time. Rollout begins January 2026. Admins should allowlist the new process in security software and inform helpdesk staff; no user workflow changes expected."
    }
  ],
  "EndDateTime": "2026-02-23T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1189656",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-26T18:18:12.733Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-25T00:00:52Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Upcoming Change to Teams Desktop Client on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
