{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 9, 2025: We have updated the content. Thank you for your patience.</p><p>We’re introducing a streamlined experience for managers in the <a href=\"https://analysis.insights.cloud.microsoft/\" target=\"_blank\">Viva Insights web app</a>, which unites new tools and insights into a single location. \n</p><p>The changes include default- on access to a team-scoped version of the Copilot Dashboard and additional reports, along with delegation capabilities. Analysts will also be able to publish a library of embedded reports from Advanced analysis to managers, with each manager automatically seeing data tailored to their team.\n</p><p>This new web app experience will replace all manager capabilities previously offered in the Viva Insights Teams app, including the Organizational behavior insights and Copilot chat insights. Those manager capabilities will be phased out to provide a centralized place for managers to access insights.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?id=497111\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">497111</a></p><p><b>When will this happen</b></p><p>General Availability (Worldwide): We will begin rolling out mid-September 2025 and expect to complete by late September 2025.&nbsp;</p><p><b>How will this affect your organization</b></p><p>The <a href=\"https://analysis.insights.cloud.microsoft/\" target=\"_blank\">Viva Insights web app</a>&nbsp;will now serve as the single destination for manager insights, with new capabilities. \n</p><p>Key new capabilities in the web app include:\n</p><ul><li>Copilot Dashboard, tailored to the manager’s team, with pages for Adoption, Impact, and Learning.\n</li><li>Additional Copilot analytics reports, such as the Copilot for Sales adoption report, tailored to the manager’s team. \n</li><li>Analyst-published embedded reports, enabling managers to gain access to an extensive library of reports available within Advanced analysis, automatically tailored to their teams.\n</li><li>Delegation support, allowing managers to share their view with others in their organization.\n</li></ul><p>Managers using Organization insights in the Viva Insights Teams app will soon see a banner informing them of the new location to access these capabilities. Once these capabilities launch worldwide, managers will no longer be able to access Organization insights in the Teams app.</p><p><b>What do you need to do to prepare</b></p><p>No action is required by admins. Still, you might want to:</p><p>1. Prepare for default-on enablement of manager insights</p><ul><li>If you haven’t previously enabled manager insights, managers with 10 or more team members will receive access by default to Copilot insights when team views launch in late September. Admins can customize this threshold as needed (minimum allowed is 5) in the Manager settings tab of the Viva insights web app.</li><li>If your organization has already enabled manager insights and set a minimum team size threshold, those settings will continue to apply. Managers who meet the threshold and are enabled by admins will automatically gain access to the new capabilities in the Viva Insights web app.</li><li>If you wish to turn off this capability, admins can access Manager settings after this feature releases and set the \"Grant managers scoped access to Copilot insights\" toggle to off.</li></ul><p>Note: There are no changes in the license requirements needed to access team-scoped insights in the Viva insights web app. This means that managers will continue to require a Viva Insights or a Microsoft 365 Copilot license.&nbsp;</p><p>&nbsp;2. Manage delegation controls</p><ul><li>If delegation is already in use by managers in your organization, existing delegates will automatically gain access to these new capabilities in the web app. Admins can manage delegation at the tenant or group level through the Microsoft 365 admin center.\n</li></ul><p>3. Turn on report publishing\n</p><ul><li>Admins can enable analysts to publish a broad set of Power BI reports from Advanced analysis directly to managers, giving them access to insights similar to those that exist in the Organizational behavior reports, and more! To do this, your organization must opt into the public preview for report publishing.\n</li></ul><p>4. Inform managers where to go\n</p><ul><li>A new, more powerful experience is coming. Let your managers know that these capabilities will soon be available in the&nbsp;<a href=\"https://analysis.insights.cloud.microsoft/\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Viva Insights web app</a>.</li></ul><p>To learn more, please see:\n</p><ul><li><a href=\"https://learn.microsoft.com/en-us/viva/insights/org-team-insights/copilot-dashboard\" target=\"_blank\">Connect to the Microsoft Copilot Dashboard for Microsoft 365 customers | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/en-us/viva/feature-access-management\" target=\"_blank\">Microsoft Viva Feature access management | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/en-us/viva/insights/advanced/setup-maint/manager-settings\" target=\"_blank\">Configure manager settings | Microsoft Learn</a></li></ul><p><b>Compliance considerations</b></p><ul><li>Introduces or modifies AI/ML capabilities: Yes – Copilot chat insights in the Viva Insights Teams app will no longer be available. \n</li><li>Alters how existing customer data is accessed: Yes – reports tailored to manager’s teams provide new access pathways to existing data.\n</li><li>Includes admin controls: Yes – Admins can manage manager insights, delegation, and report publishing.</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497111"
    },
    {
      "Name": "Summary",
      "Value": "Manager insights in Viva Insights will move to the Viva Insights web app with a new team-scoped Copilot Dashboard, additional reports, delegation, and analyst-published reports. This replaces the Teams app manager features starting mid-September 2025. No admin action is required, but settings can be customized."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1136039",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-09T21:12:03.907Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-15T22:48:15Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Manager insights now in Viva Insights web app, with new team view for Copilot Dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
