{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>To streamline app management and reduce clutter, Teams apps with version numbers below 1.12 will be removed from the Integrated apps view in the Microsoft 365 admin center. These apps will continue to be fully visible and manageable in the Teams admin center.</p>\n\n<p><b>When this will happen</b></p>\n<p><b>General Availability (Worldwide):</b> We will begin rolling out in late August 2025 and expect to complete by mid-September 2025.</p>\n\n<p><b>How this affects your organization</b></p>\n<p>Apps below version 1.12 will no longer appear in the Microsoft 365 admin center. However, there is no change to how these apps are managed—they remain fully supported in the Teams admin center, and the upgrade path and user experience are unchanged.</p>\n\n<p><b>What you can do to prepare</b></p>\n<ul>\n<li>No action is required.\n</li><li>If your organization relies on the Microsoft 365 admin center for app visibility, consider updating apps to supported versions to retain visibility there.\n</li><li>There is no required timeline for upgrading apps to version 1.12 or higher. Admins may choose to upgrade at their discretion.\n</li><li>There is no change to the user experience—apps below version 1.12 will simply not appear in MAC &gt; Settings &gt; Integrated apps.</li><liadmins should=\"\" continue=\"\" using=\"\" the=\"\" teams=\"\" admin=\"\" center=\"\" to=\"\" manage=\"\" apps=\"\" with=\"\" version=\"\" 1.12=\"\" and=\"\" below.<=\"\" li=\"\">\n</liadmins></ul>\n\n<p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center | Microsoft 365 | Microsoft Learn</a></p><p><b>Compliance considerations</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Teams apps version 1.12 and earlier will be removed from the Microsoft 365 admin center's Integrated apps view starting late August 2025 but remain fully manageable in the Teams admin center. No action is required, and user experience remains unchanged."
    }
  ],
  "EndDateTime": "2025-10-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134169",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T23:00:29.657Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-12T23:00:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams app versions 1.12 and earlier will no longer appear in Microsoft 365 admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
