{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are introducing a new Copilot setting in the Microsoft 365 admin center to make it easier for admins to pin the Microsoft 365 Copilot app to the Windows taskbar. Pinning this app to the Windows taskbar gives users easier access to Copilot Chat, Search, Agents, and more, if these capabilities are already available to them. \n</p><p>This setting applies to all Windows 10 and 11 Intune-managed devices which have the Microsoft 365 Copilot app installed. The setting is off by default as shown below.</p><p><i>New setting to pin Microsoft 365 Copilot  app to the Windows taskbar</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1c0525c4-ec61-43e3-9a08-b07381e6e032\" width=\"400\" height=\"\"></p><p><b>When this will happen:</b>\n</p><p>General Availability (Production): The new default off admin setting will begin rolling out at the end of July and finish rolling out in the weeks after.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Global and Intune administrators can manage this setting. \n</p><p>When this setting is enabled, the pinned Microsoft 365 Copilot app will appear to the right of any other apps that are already pinned on the taskbar.</p><p><i>User experience</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/564c0e57-647b-4226-8695-f2ab17999716\" width=\"400\" height=\"\"></p><p>\n</p><p>Users who already pinned the Microsoft 365 Copilot app on their Windows taskbar will experience no change.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Since this setting needs the Microsoft 365 Copilot app to be installed on the device, deploy the Microsoft 365 Copilot app to devices where you wish to have the app pinned. \n</p><p>To learn more about this setting, refer to the article <a href=\"https://go.microsoft.com/fwlink/?linkid=2326492\" target=\"_blank\">Pin Microsoft 365 Copilot to the Windows taskbar.</a></p><p><b>Compliance considerations</b>:\n</p><p>No compliance considerations identified, review as appropriate for your organization.</p><p><br></p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "A new setting in the Microsoft 365 admin center allows admins to pin the Microsoft 365 Copilot app to the Windows taskbar for easier access. This setting, off by default, applies to Intune-managed Windows 10 and 11 devices. It will roll out starting at the end of July."
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1115982",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-05T22:26:34.22Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-15T22:52:54Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Copilot setting for pinning the Microsoft 365 Copilot app to the Windows Taskbar",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
