{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We're introducing new filtering and sorting capabilities to Microsoft Teams attendance reports, making it easier to find and analyze the sessions that matter most. With this update, you can:\n</p><ul><li>Set a minimum attendee count\n</li><li>Sort reports more effectively by date and time</li></ul><p>These enhancements streamline reporting workflows and improve data visibility. Additional refinements are planned in future updates.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide and GCC): </b>We will begin rolling out on August 18, 2025 and expect to complete by August 18, 2025.</p><p><b>General Availability (GCCH and DoD): </b>We will begin rolling out on August 31, 2025 and expect to complete by August 31, 2025.</p><p><b>How this will affect your organization</b></p><p>These new filters will help your users quickly locate relevant attendance data, improving efficiency and accuracy in reporting. The feature is available by default and applies to both existing and future attendance reports. </p><p>At the time of release, this enhancement will be available on Windows and macOS only. Once released, it will be immediately available to all tenants, including for existing meetings and events. There will be no option to revert to a previous version.</p><p><i>New filter options in Microsoft Teams attendance reports allow users to set a minimum attendee count to find relevant reports faster:</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/60cc0add-2a20-4308-80c9-5594198fc7fc/ce9fb47bb8125491998bdaa79f62915e1c9a2c6a.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i></i></p><p><i></i></p><p><i>Enhanced sorting capabilities let users view attendance reports by date and time, streamlining access to relevant session data:</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/43fcfc1c-e214-4977-8f5a-287571c22275/66d47f5eeb32b3b8fe9d9bf61d5e8db3a3bc75d1.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b>What you need to do to prepare</b></p><p>No action is required. The improvements will be available automatically upon rollout. We recommend informing users who rely on attendance reporting so they can take advantage of the new capabilities.</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams attendance reports will gain new filters to set minimum attendee counts and enhanced sorting by date and time, improving report efficiency. The update rolls out worldwide on August 18, 2025, and for GCCH/DoD on August 31, 2025, available by default on Windows and macOS with no action needed."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1122161",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-25T22:36:47.843Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-25T22:36:26Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: New filters and sorting for attendance reports",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
