{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\nTo improve clarity and consistency in the <i>Microsoft 365 Admin Center</i>, we’re updating the navigation structure. Starting in December, the <i>Marketplace</i> node will become a Level 1 (L1) item in the left-hand navigation, positioned above <i>Billing</i>. This change replaces the current <i>Purchase Services</i> node and aligns with Microsoft’s broader effort to standardize admin experiences across services.<p></p>\n\n<p><b>When this will happen:</b></p>General Availability (Worldwide, GCC, GCCH, and DoD): Rollout will begin in early December 2025.<p></p>\n\n<p><b>How this affects your organization:</b></p>\n<ul>\n<li><b>Who is affected:&nbsp;</b>Global and billing admins in SMEC and Enterprise environments who currently access the <i>Purchase Services</i> node in the <i>Microsoft 365 Admin Center</i>.\n(Note: SMB customers already see <i>Marketplace</i> in this location.)</li><li><b>What will happen:</b>\n<ul>\n<li>The <i>Purchase Services</i> node will be retired.</li>\n<li>A new <i>Marketplace</i> node will appear as a Level 1 (L1) item above <i>Billing</i> in the left-hand navigation.</li>\n<li>This is a visual and navigational update only.</li>\n<li>No changes to functionality, permissions, or user workflows.</li>\n<li>The update will be applied by default; no admin action is required.</li>\n</ul>\n</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>Inform helpdesk or support teams of the updated navigation label and location.</li>\n<li>Update internal documentation if it references <i>Purchase Services</i> or its previous location.</li>\n<li>Review the <i>Marketplace</i> experience to ensure familiarity with the updated placement.</li><li>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/admin-overview/admin-center-overview?view=o365-worldwide\" target=\"_blank\">Microsoft 365 admin center - Overview - Microsoft 365 admin | Microsoft Learn</a>&nbsp;(documentation will be updated closer to rollout)</li>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\nNo compliance considerations identified, review as appropriate for your organization.<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting December 2025, the Microsoft 365 Admin Center will replace the Purchase Services node with a new Marketplace node as a Level 1 item above Billing. This visual update affects global and billing admins, requires no action, and involves no changes to functionality or permissions."
    }
  ],
  "EndDateTime": "2026-01-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1177178",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-21T23:17:38.813Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-21T23:17:14Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Admin Center Marketplace and Purchase Services node name change",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
