{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 7, 2025: We have added clarification for customers impacted by this feature. Thank you for your patience.</p><p><b><b>Introduction</b></b></p>\n<p>We're introducing a new capability in <i>Microsoft Teams</i> that allows users to <b>start a chat with anyone</b> who has an <b>email address</b>—even if they’re not currently using Teams. The recipient will receive an email invitation to join the chat session as a guest, enabling seamless communication and collaboration. This update simplifies external engagement and supports flexible work scenarios.</p><p>This capability will be available to small and medium business customers with a Teams Essentials, Business Basic, Business Standard, or Business Premium license.</p><p>This feature will be available across Android, Desktop, iOS, Linux, and Mac platforms.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=513271\" target=\"_blank\">513271</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Targeted Release:</b> Rollout will begin in early November 2025 and is expected to complete by mid-November 2025.</li>\n<li><b>General Availability (Worldwide):</b> Rollout will begin in January 2026.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>All Microsoft Teams users in your organization.</li>\n</ul>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Users will be able to initiate chats with any external contact using their email address.</li>\n<li>External users will receive an email invitation and can join the chat as guests.</li>\n<li>The chat experience will be governed by your organization’s Entra B2B Guest policy.</li>\n<li>Chats will remain within your organization’s boundary.</li>\n<li>This feature will be <b>enabled by default</b>.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Update internal documentation to reflect this new capability.</li>\n<li>Inform helpdesk and support teams about the change.</li><li>To disable the feature, set the <b>UseB2BInvitesToAddExternalUsers </b>attribute of TeamsMessagingPolicy to<b> false</b>. <a href=\"https://learn.microsoft.com/powershell/module/microsoftteams/set-csteamsmessagingpolicy?view=teams-ps#-useb2binvitestoaddexternalusers\" target=\"_blank\">Set-CsTeamsMessagingPolicy documentation here</a>.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "513271"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will allow users to chat with anyone via email, even non-Teams users, who join as guests. Available to small and medium businesses, this feature rolls out from November 2025 and is enabled by default. Organizations can disable it via TeamsMessagingPolicy settings."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Linux, Mac"
    }
  ],
  "EndDateTime": "2026-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1182004",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-07T23:26:54.187Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-31T23:20:44Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Chat with anyone with an email address",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
