{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 12, 2025: We have updated the timeline. Thank you for your patience.</p><p>We’re introducing enhanced Microsoft Graph API capabilities that now support full Create, Read, Update, and Delete (CRUD) operations for Microsoft Places directory objects. This update enables developers and partners to programmatically manage Places data—including buildings, floors, sections, rooms, and desks—using a consistent and extensible API surface.</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=488101\" target=\"_blank\">488101</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Available now.</p><p><b>How this will affect your organization:</b></p><p>There is no immediate impact by default. However, these APIs provide a more efficient and scalable way to onboard and maintain location data in Microsoft Places. Organizations using third-party systems to manage location hierarchies can now integrate directly with Microsoft Places, ensuring data accuracy and consistency across systems.\n</p><p><b>What you can do to prepare:</b></p><ul><li>If you're planning to onboard to Microsoft Places or expand its use across regions, consider using these APIs to streamline your data import and management processes.\n</li><li>If you're currently using a third-party system of record, contact your provider to understand their plans for integrating with these APIs.</li><li>Review: <a href=\"https://learn.microsoft.com/en-us/graph/api/resources/places-api-overview?view=graph-rest-beta\" target=\"_blank\">Working with the Places API in Microsoft Graph</a></li></ul><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed? Yes – it introduces new API endpoints for managing location data.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "488101"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Graph API now supports full CRUD operations for Microsoft Places directory objects, enabling programmatic management of buildings, floors, rooms, and desks. Available worldwide, this update helps organizations integrate and maintain location data efficiently, especially when using third-party systems. No immediate impact by default."
    },
    {
      "Name": "Platforms",
      "Value": "Developer"
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1133514",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T21:24:59.31Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-11T23:36:44Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Places: Graph API support for directory objects",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
