{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to visualize and work with hierarchical data from multiple tables in Dynamics 365 Sales. This feature will reach general availability on October 31, 2025.<br><br><b>How does this affect me?</b><br>With the Hierarchical Relationship Visualizer, sellers can view and work with data in a convenient parent-child visualization. The hierarchy view provides full editability of the records you choose to display, so your team can easily view, edit, and update customer information in context without leaving the visualization.<br><br><b>Configurable properties:</b><ul><li>Admins define hierarchy views for their teams. The feature currently supports single-table hierarchies, with support for multiple-table complex hierarchies coming later in the year.</li><li>Customize what data appears on each tile, along with the size, color, and picture or icon. You can show up to seven fields on each tile.</li><li>Define hierarchies by using relationships in your data. You can use single-table (self-referencing) relationships, cross-table relationships, or the Dataverse Connections table for flexible relationships between any two records.</li></ul><b>Intuitive UI controls:</b><ul><li>Zoom in and out and expand and collapse branches so you can efficiently work with customers of all sizes.</li><li>Switch between vertical and horizontal display modes to optimize the view based on the shape of the hierarchy.</li><li>Select a tile to open the details form in a side pane, so you can make updates, add meeting notes, and make other edits without leaving the hierarchy view.</li></ul>Once the feature has been deployed to your environment's station, you will see the \"Visual hierarchy\" appear on the App settings menu. Once published, users viewing a record from a table with a defined hierarchy will see the \"View hierarchy\" button on the command bar that takes them to the hierarchy view for that record.<br><br><b>What action do I need to take?</b><br>This message is for awareness, and no action is required.<br><br>If you would like more information on this feature, please visit the <a target=\"_blank\" href=\"https://aka.ms/ADO12540\">Visualize and work with hierarchical data from multiple tables</a> article.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-01T14:23:05Z",
  "HasAttachments": false,
  "Id": "MC1163506",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-01T14:26:05.583Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-01T14:23:05Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Sales – Visualize and work with hierarchical data from multiple tables",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
