{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\nWe're introducing a new admin toggle in Viva Engage that allows Engage and network admins to control who can use the <i>Move conversation</i> feature across communities. This update supports organizations that want to limit this capability to specific roles, helping reduce unintended content movement.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=501458\" target=\"_blank\">501458</a>.</p>\n\n<p><b><b>When this will happen:</b></b><br><b><i>General Availability (Worldwide): </i></b>Rollout will begin in early October 2025 and is expected to complete by late October 2025.<br></p>\n\n<p><b><b>How this affects your organization:</b></b><b><br></b></p><p><b>Who is affected:</b></p><ul><li>Viva Engage network admins and Engage admins</li><li>Corporate communicators, community admins, and community experts</li><li>All users with access to conversations in Viva Engage</li></ul><p><b style=\"\">What will happen:</b></p><ul><li>A new toggle will be available to control access to the <i>Move conversation</i> feature.</li><li>By default, the toggle is <i>ON</i>, meaning all users with access to a conversation can move it (current behavior).</li><li>When the toggle is <i>OFF</i>, only the following roles can move conversations:<ul><li>Engage admins</li><li>Network admins</li><li>Corporate communicators</li><li>Community admins</li><li>Community experts</li></ul></li><li>No changes will occur unless the toggle is manually turned <i>OFF</i>.</li></ul>\n\n<p><b><b>What you can do to prepare:</b></b><br>\nNo admin action is required unless you want to restrict the <i>Move conversation</i> feature. If so:</p><ul><li>Review the new toggle setting in the Viva Engage admin center once available.</li><li>If desired, turn the toggle <i>OFF</i> to limit the move capability to permissioned roles.</li><li>Communicate this change to your helpdesk or internal support teams.</li><li>Update internal documentation if you reference this feature.</li></ul>\n\n<p><b><b>Compliance considerations:</b></b><br>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "501458"
    },
    {
      "Name": "Summary",
      "Value": "Viva Engage will add an admin toggle (rolling out October 2025) to control the Move conversation feature. By default, all users can move conversations; turning the toggle off restricts this to specific roles like admins and corporate communicators. No action is needed unless restriction is desired."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1148527",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-05T21:53:19.553Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-05T21:53:10Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Engage – New admin toggle to manage Move conversation feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
