{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 29, 2025: We have updated the timeline. Thank you for your patience.</p><p>The new Outlook for Windows and Outlook for the Web now support email templates, enabling users to create, save, and reuse templates for faster, more consistent communication. This update also supports importing existing templates saved as .oft files, streamlining the transition from classic Outlook experiences.</p><p>This message is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=485757\" target=\"_blank\">485757</a></p>\n\n<b>When this will happen:</b><p></p><p>\n</p><p><b>Targeted Release (Worldwide): </b>Rollout will begin in early September 2025 (previously late August) and is expected to complete by mid-September 2025 (previously early September).</p><p><b>General Availability (Worldwide):</b> Rollout will begin in mid-October 2025 (previously early October) and is expected to complete by early November 2025 (previously late November).</p><p><b>General Availability (GCC, GCC High, DoD):</b> Rollout will begin in early November 2025 (previously early-October) and is expected to complete by early December 2025 (previously late November).</p>\n\n<b>How this affects your organization:</b><p></p><p>\n</p><ul>\n  <li>Create, edit, and use templates directly from the compose window.</li>\n  <li>Manage templates via the Settings page.</li>\n  <li>Access saved templates across devices and between the new Outlook and Outlook on the web.</li>\n</ul>\n<p>Templates are stored in the user’s account, allowing them to roam with the user for a consistent experience across devices. This feature is on by default and requires no admin configuration.</p>\n\n<b>What you can do to prepare:</b><p></p><p>\n</p><p>No action is required to prepare for this change. You may wish to inform your users about the new template functionality to help them take advantage of it once available.</p>\n<p>#newoutlookforwindows</p><p>\n</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "485757"
    },
    {
      "Name": "Summary",
      "Value": "The new Outlook for Windows and Outlook for Web will support creating, saving, and reusing email templates, including importing .oft files. Rollout starts September 2025, with templates accessible across devices and enabled by default, requiring no admin setup. Users can manage templates from the compose window and settings."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-01-12T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1129129",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-29T14:08:20.373Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-04T22:52:57Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "(Updating) Outlook: Create and save email templates in the new Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
