{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "The public IP addresses of Dynamics 365 Marketing services in all regions are being updated. These new IPs are already available for allowlisting, and Dynamics 365 Marketing services will begin using them beginning August 4, 2025.<br><br><b> How does this affect me?</b><br>If you use custom analytics, as detailed in <a target=\"_blank\" href=\"https://aka.ms/ADO11610\">Prepare for analytic reporting with Power BI</a>, and restrict access to your storage accounts by firewall rules <b>using IP addresses</b>, you will be affected by the change.<br><br> If your custom analytics meet these criteria and are impacted, the marketing analytics export will be stopped due to unauthorized access to customer blob storage from Dynamics 365 Marketing services.<br><br>To verify if this affects your Analytics configuration, you can review the entity <i>Analytics configuration and check Service status</i>.<b> If your organization is using allowlisting by VNets (subnets), you will not be affected by this change</b>.<br><br><b>What action do I need to take?</b><br>Administrators with firewalls or network rights should adjust their allowlists accordingly. A list of all public IP addresses divided by geo is available here: <a target=\"_blank\" href=\"https://aka.ms/ADO11610/2\">Dynamics 365 Customer Insights - Journeys public IP addresses</a>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-08-28T18:04:25Z",
  "HasAttachments": false,
  "Id": "MC1123571",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-28T18:09:32.533Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-28T18:04:25Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Dynamics 365 Marketing – The public IP addresses of Dynamics 365 Marketing service are updating",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
