{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>What and Why:</b></p><p>We're introducing the ability to pin the AppBar directly from the hamburger (≡) context menu in Microsoft Teams. This update provides users with more flexibility in customizing their Teams layout, making it easier to access frequently used apps and tools. This change aligns with user feedback requesting more intuitive layout controls.</p>\n\n<p><b>Rollout Schedule:</b></p>\n<p>General Availability (Worldwide): Rollout will begin in late July 2025 and is expected to complete by the end of July 2025.</p>\n\n<p><b>Impact on Your Organization:</b></p>\n<p><b>Who is affected:</b> All Microsoft Teams users across all tenants.</p>\n<p><b>What will happen:</b></p>\n<ul>\n  <li>Users will see a new option to “Pin AppBar” when right-clicking the hamburger menu.<p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/e002d16f-a75a-4bc7-855d-cc27633779e9\" width=\"400\" height=\"\"></p></li>\n  <li>This feature will be ON by default.</li>\n  <li>No admin configuration is required.</li>\n  <li>There is no change to existing policies or user permissions.</li>\n</ul>\n\n<p><b>Action Required/Recommendations:</b></p>\n<p>No action is required at this time. However, you may wish to:</p>\n<ul>\n  <li>Inform helpdesk staff of this UI enhancement.</li>\n  <li>Update internal documentation if you maintain Teams usage guides.</li>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce the ability to pin the AppBar from the hamburger context menu, enhancing layout customization. This feature will be available worldwide from late July 2025, affecting all users without requiring admin configuration. No compliance issues are identified, and informing helpdesk staff is recommended."
    }
  ],
  "EndDateTime": "2025-09-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1112454",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-10T00:18:10.457Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-10T00:17:21Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Pin AppBar from Hamburger context menu",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
