{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>Microsoft’s native eSignature service for SharePoint enables users to request simple electronic signatures directly from Word and PDF documents stored in SharePoint. This feature ensures documents remain within Microsoft’s trusted boundaries, enhancing security and compliance. This capability is now expanding to all Microsoft 365 markets, except China, Indonesia, and Türkiye.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=497419\" target=\"_blank\">497419</a>.</p><p>\n</p><p><b>When this will happen\n</b></p><p>Rollout begins in late August 2025 and is expected to complete by late September 2025.\n</p><p><b>How this affects your organization</b></p><p>Once enabled by a Global or SharePoint Administrator in the Microsoft 365 admin center, users will be able to:\n</p><ul><li>Request eSignatures from Word documents using Microsoft Word Desktop (Beta and Current Channels) when stored in SharePoint sites with eSignature enabled.\n</li><li>Request eSignatures from PDF documents hosted in SharePoint eSignature-enabled sites.\n</li></ul><p>This feature is <b>off by default </b>and requires admin configuration to enable.\n</p><p><b>What you can do to prepare\n</b></p><p>To enable SharePoint eSignature:\n</p><ul><li>Review <a href=\"https://learn.microsoft.com/microsoft-365/syntex/esignature-overview\" target=\"_blank\">Overview of eSignature</a> documentation.</li><li>In the Microsoft 365 admin center, toggle the Word option ON for your tenant.\n</li><li>Deploy the Group Policy setting “Allow the use of SharePoint eSignature for Microsoft Word” using:\n<ul><li>Cloud Policy Service\n</li><li>Microsoft Intune\n</li><li>Group Policy Manager\n</li></ul></li></ul><p><b>Note:</b> SharePoint eSignature for PDFs does not require Group Policy configuration.\n</p><p>Inform your users about the new eSignature experience available in Word and PDF documents stored in SharePoint.\n</p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "497419"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint eSignature, allowing electronic signatures on Word and PDF documents stored in SharePoint, will roll out globally (except China, Indonesia, Türkiye) from late August to September 2025. It is off by default, requires admin enablement, and enhances document security within Microsoft 365."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-11-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1127224",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-01T23:17:06.103Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-01T23:16:58Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "SharePoint eSignature now globally available (excluding China, Indonesia, and Türkiye)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
