{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re expanding access to Microsoft Purview Diagnostics beyond Global Administrator to include Compliance Administrator, Security Administrator, and Organization Management roles. This enhancement enables more administrators to run diagnostics, improving visibility and troubleshooting capabilities across your compliance and security operations.\n</p><p>This update is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=500894\" target=\"_blank\">500894</a>.</p><p><b>When this will happen</b></p><p><b>Public Preview: </b>We will begin rolling out in late September 2025 and expect to complete by early November 2025.\n</p><p><b>General Availability (Worldwide): </b>We will begin rolling out in&nbsp;mid-December 2025 and expect to complete by early January 2026.</p><p><b>How this affects your organization</b></p><p>Administrators assigned the Compliance Administrator, Security Administrator, or Organization Management roles will now be able to execute Microsoft Purview Diagnostics. This change enhances operational flexibility and reduces reliance on Global Admins for diagnostic tasks.\n</p><p>This feature is <b>on by default</b> and does not require manual enablement.</p><p><b>What you can do to prepare</b></p><p>No action is required to prepare for this update. However, we recommend reviewing role assignments to ensure appropriate access is granted.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "500894"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Diagnostics access is expanding from Global Administrators to include Compliance Admin, Security Admin, and Org Management roles. Rolling out from late September 2025 (preview) to January 2026 (general availability), this enables more admins to run diagnostics without manual setup. Review role assignments as needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-04-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143283",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T21:46:06.943Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T21:45:40Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | DLP - Enable Diagnostics for Compliance Admin, Security Admin, and Org Management roles",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
