{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>Cloud Update is now generally available in the Microsoft 365 Apps admin center (config.office.com), bringing modern, cloud-based controls to help you keep Microsoft 365 Apps current, secure, and Copilot-ready with less effort.</p><p>With Cloud Update, you can assign custom rollout waves, set exclusion windows for business-critical freeze periods, pause deployments, and roll back if needed—all from a single, lightweight experience.</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>The rollout began in early August 2025 and is now complete.</p><p><b>How this affects your organization</b></p><ul><li><b>If you participated in the preview: </b>You will see the same experience, now without “Preview” labels.</li><li><b>If you are new to Cloud Update: </b>You can now simplify monthly update management for Microsoft 365 Apps using automation.</li></ul><p>Key benefits:</p><ul><li><b>Simpler, safer monthly updating:</b> Automate servicing while retaining control with pause, rollback, exclusion windows, and custom rollout waves.</li><li><b>Copilot readiness: </b>Keeping devices on a supported monthly channel and managed by Cloud Update helps ensure readiness for Microsoft 365 Copilot experiences.</li><li><b>Centralized management:</b> Enable and manage Cloud Update in the Microsoft 365 Apps admin center (config.office.com).</li></ul><p><i>Screenshot 1 - Cloud Update dashboard shows overall progress and profile status:&nbsp;</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/af10809c-78ca-46e1-847a-580ed4334313/49ee5670df8bf84933d5b591dc23d463d20166e8.png\" style=\"width: 400px;\" alt=\"admin settings\"></p><p><i>Screenshot 2 - Monthly Enterprise profile dashboard shows wave rollout progress and management controls:&nbsp;</i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/5b10f9fc-bff5-423b-8165-3ac1154d0694/a98c4f37aa6a7efc1bfcee6b519696474d3d39a1.png\" style=\"width: 400px;\" alt=\"admin settings\"></p><p></p><p>This feature is <b>off by default</b> and must be enabled by an admin.</p><p><b>What you can do to prepare</b></p><p>Before enabling Cloud Update, review the following prerequisites:</p><p><b>Supported admin roles:</b></p><ul><li>Office Apps Administrator (recommended)</li><li>Security Administrator</li><li>Global Administrator</li></ul><p><b>Note:</b> Global Reader is supported in the admin center but cannot manage Cloud Update.</p><p><b>Supported subscription plans:</b></p><ul><li>Education: Microsoft 365 A3, A5</li><li>Business: Microsoft 365 Business Standard, Business Premium</li><li>Enterprise: Office 365 E3, E5; Microsoft 365 E3, E5</li></ul><p><b>Note:</b> GCC, GCC High, DoD, and Microsoft 365 operated by 21Vianet are not supported.</p><p><b>Supported environments and versions:</b></p><ul><li>Devices must run supported versions of Microsoft 365 Apps on Windows 10/11 or supported Windows Server editions.</li><li>Devices must have access to required endpoints (such as *.office.com, *.config.office.com).</li></ul><p><b>Microsoft Entra group requirements:</b></p><ul><li>Groups can include both user and device objects.</li><li>Devices must be Microsoft Entra joined or hybrid joined.</li><li>Nested groups are supported.</li><li>Groups should contain no more than 20,000 objects.</li></ul><p><b>Update controls available:</b></p><ul><li><b>Pause: </b>Temporarily stop update deployments (Monthly Enterprise Channel only).</li><li><b>Rollback: </b>Revert devices to one of the two previous monthly builds (Monthly Enterprise Channel only).</li><li><b>Exclusion windows: </b>Prevent updates during critical business periods.</li><li><b>Exclude groups:</b> Exclude specific devices or users from Cloud Update management.</li><li><b>Rollout waves: </b>Configure phased deployments across groups.</li><li><b>Update deadlines:</b> Enforce update installation within a defined time window.</li></ul><p>No admin action is required before the rollout, but enabling and configuring Cloud Update is necessary to begin using it.</p><p><a href=\"https://learn.microsoft.com/microsoft-365-apps/best-practices/adopting-cloud-update\" target=\"_blank\">Enable and configure Cloud Update</a> in the Microsoft 365 Apps admin center to begin using the feature.</p><p>Learn more:</p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/cloud-update-reaches-general-availability-transforming-microsoft-365-apps-manage/4440710\" target=\"_blank\">Cloud Update Reaches General Availability: Transforming Microsoft 365 Apps Management | Microsoft Community Hub</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/cloud-update\" target=\"_blank\">Overview of cloud update in the Microsoft 365 Apps admin center - Microsoft 365 Apps | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/best-practices/adopting-cloud-update\" target=\"_blank\">Enabling and configuring cloud update - Microsoft 365 Apps | Microsoft Learn</a></li></ul><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. Cloud Update supports Copilot readiness by ensuring devices are on supported channels, which may involve telemetry and update coordination across user devices.</td></tr><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td><td>Yes. Cloud Update provides centralized controls and visibility into update status, which can support compliance reporting and lifecycle management.</td></tr><tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Yes. Cloud Update must be enabled by an admin and can be managed by roles such as Office Apps Administrator, Security Administrator, or Global Administrator.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Cloud Update is now generally available in the Microsoft 365 Apps admin center, enabling automated, controlled monthly updates with pause, rollback, exclusion windows, and rollout waves. It supports Copilot readiness, centralized management, and requires admin enablement with specific roles and subscription plans. GCC and some environments are unsupported."
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143992",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-29T00:28:51.5Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T00:28:43Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Apps admin center: Cloud Update feature now generally available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
