{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 24, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re introducing a new feature: <b>M365 Copilot Chat adoption metrics </b>in the <i>Microsoft Copilot dashboard</i>. This feature provides organizations with enhanced visibility into how users who are not licensed for Microsoft 365 Copilot are engaging with Copilot Chat. These insights include usage trends, retention and intensity metrics, app-level breakdowns, and filtering by organizational attributes—helping organizations better understand adoption patterns and tailor support strategies.</p><p>This feature will be available to tenants with at least 50 assigned Viva Insights licenses or 50 assigned Microsoft 365 Copilot licenses (includes Viva Insights service plan).</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499899\" target=\"_blank\">499899</a>.</p><p><b>When this will happen</b></p><p><b>Public Preview: </b>We will begin rolling out at the end of October 2025 and expect to complete by end of November 2025.</p><p><b>General availability (Worldwide): </b>After further review, this has been delayed to a later date. We apologize for any inconvenience.</p><p><b>How this affects your organization</b></p><p>Users with access to the Microsoft Copilot dashboard will see new analytics cards and visualizations focused on Microsoft 365 Copilot Chat adoption for unlicensed users. These insights will appear in the dashboard’s <i>adoption </i>tab and include:</p><ul><li><b>Usage trends over time:</b> Track active users and adoption growth.</li><li><b>Adoption by group: </b>Compare usage across departments or roles.</li><li><b>Usage intensity and retention: </b>Understand recurring usage and engagement levels.</li><li><b>App-level breakdowns:</b> Identify which apps and entry points drive adoption.</li><li><b>Filtering and drilldown: </b>Segment data by organizational attributes to tailor change management strategies.</li></ul><p>This feature will be <b>on by default</b> for existing dashboard users. No additional administrator action is required to enable it.</p><p><b>What you can do to prepare</b></p><p>Review the impact of this feature on your organization’s reporting and privacy practices. You may also want to update internal training and documentation to reflect the new insights available.</p><p>Starting in September 2025:</p><ul><li>A new administrator control will be available for <b>Global administrators</b>, <b>Viva Insights administrators</b>, and <b>AI administrators</b> to turn off this feature at the tenant level. To disable this feature, use<b> Viva Feature Access Management (VFAM)</b> in <i>Microsoft admin center </i>or <i>PowerShell</i>.</li><li>These same roles will also be able to <b>exclude specific users or groups</b> from being included in aggregated insights using the updated exclusion list feature.</li></ul><p>Administrators should read the communication regarding the detailed scope and availability of this exclusion feature here (Roadmap ID: 500161).</p><p>Administrators should review any existing exclusions, assess their impact, and take appropriate action to exclude or include additional users or groups as needed.</p><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/copilot-dashboard\" target=\"_blank\">Connect to the Microsoft Copilot Dashboard for Microsoft 365 customers | Viva Insights | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Control access to features in Microsoft 365 | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://www.microsoft.com/microsoft-365/blog/2025/01/15/copilot-for-all-introducing-microsoft-365-copilot-chat/\" target=\"_blank\">Copilot for all: Introducing Microsoft 365 Copilot Chat | Microsoft Blog</a></li><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/manage-settings-copilot-dashboard#create-an-exclusion-list-for-the-dashboard-hide-users-from-aggregates\" target=\"_blank\">Manage settings for the Microsoft Copilot Dashboard and Viva Insights web app | Viva Insights | Microsoft Viva | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-overview\" target=\"_blank\">Microsoft 365 Copilot overview | Microsoft 365 Copilot | Microsoft 365 | Microsoft Learn</a></li></ul><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does this change store new customer data, and if so, where?</td><td>Yes. Aggregated usage data for unlicensed users is stored and visualized in the Microsoft Copilot dashboard.</td></tr><tr><td>Does this change alter how existing customer data is processed, stored, or accessed?</td><td>Yes. It introduces new metrics and visualizations based on user interactions with Copilot Chat.</td></tr><tr><td>Does this change introduce or significantly modify AI/ML capabilities that interact with customer data?</td><td>Yes. Metrics reflect interactions with generative AI features in Copilot Chat.</td></tr><tr><td>Does this change modify how admins can monitor, report on, or demonstrate compliance activities?</td><td>Yes. Admins gain new reporting capabilities through the dashboard’s adoption metrics.</td></tr><tr><td>Does this change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services?</td><td>Yes. Admins can exclude users from aggregated insights using the exclusion list feature.</td></tr><tr><td>Does this change include an admin control, and can it be managed through Entra ID group membership?</td><td>Yes. Admins can disable the feature or exclude users/groups via VFAM or PowerShell.</td></tr></tbody></table><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499899"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing M365 Copilot Chat adoption metrics in the Microsoft Copilot dashboard, providing insights on unlicensed user engagement. Available to tenants with 50+ licenses, it offers usage trends, retention, app breakdowns, and filtering. Rolling out from October 2025; admins can control or exclude users via VFAM or PowerShell."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1143280",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-24T15:31:10.653Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-27T21:44:16Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot dashboard (in Viva Insights): Adoption metrics for Microsoft 365 Copilot Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
