{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a set of enhancements to Viva Engage Storyline that make it easier to create, manage, and personalize posts. These updates include:</p>\n<ul>\n<li>Cover photos and featured posts for Storyline pages</li>\n<li>Drafting and scheduling posts in advance</li>\n<li>Support for Ask Me Anything (AMA) sessions</li>\n<li>Delegate posting on behalf of others</li>\n</ul>\n<p>These features are designed to help communicators, leaders, and team members engage their audiences with greater clarity and customization.</p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=500018\" target=\"_blank\">500018</a></p>\n\n<b>When this will happen</b>\n<p>General Availability (Worldwide): Rollout begins in late September 2025 and is expected to complete by late October 2025.</p>\n\n<b>How this affects your organization</b>\n<p>These enhancements provide users with more flexibility and control over their Storyline communications. Key benefits include:</p>\n<ul>\n<li>Personalizing Storyline pages with cover photos and featured posts</li>\n<li>Planning and scheduling content ahead of time</li>\n<li>Hosting interactive AMA sessions</li>\n<li>Delegating posting responsibilities</li>\n</ul>\n<p>These updates are designed to improve communication consistency and increase engagement across your organization. Features will be <b>on by default</b> and available to all eligible users once rolled out to your tenant.</p>\n\n<b>What you can do to prepare</b>\n<p>No admin action is required. These features will roll out automatically.</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "500018"
    },
    {
      "Name": "Summary",
      "Value": "Viva Engage Storyline enhancements launching late September to October 2025 include cover photos, featured posts, post drafting and scheduling, AMA sessions, and delegate posting. These default-on features improve personalization, planning, interaction, and communication engagement without requiring admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1136036",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-15T22:46:15.443Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-15T22:46:06Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Engage Storyline and post enhancements: cover photos, drafts, AMAs, and more",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
