{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\nWe’re introducing a redesigned Microsoft Teams Store that enhances the agent-first discovery experience. This update simplifies how users find, explore, and manage apps and agents, aligning with feedback for a more intuitive and efficient interface.</p>\n\n<p><b><b>When this will happen:</b></b></p><p>\nPreview (Worldwide): We will begin rolling out late October 2025 and expect to complete by late January 2026.</p>\n\n<p><b><b>How this affects your organization:</b></b></p><p>\n<b>Who is affected:</b> </p><ul><li>All Microsoft Teams users across commercial and education tenants.</li></ul><p><b>What will happen:</b>\n</p><ul>\n<li>Users will see a modernized Teams Store interface.</li>\n<li>A new “Agent” filter pill will appear under every category for faster agent discovery.</li>\n<li>App tiles will be streamlined to show only essential information.</li>\n<li>Search will be prominently centered on the page.</li>\n<li>Categories will be simplified with subcategories for easier navigation.</li>\n<li>The app details page will be redesigned to highlight the most relevant information.</li>\n<li>A new “Your Apps &amp; Agents” hub will allow users to view and manage all installed apps and agents in one place.</li>\n<li>No action is needed from users or admins.</li>\n</ul>\n<p></p>\n\n<p><b><b>What you can do to prepare:</b></b></p><p>\nNo action is required at this time. However, you may wish to:\n</p><ul>\n<li>Communicate this change to helpdesk staff to reduce potential confusion.</li>\n<li>Update internal documentation or training materials that reference the Teams Store interface.</li>\n<li>Review app and agent usage in your tenant to anticipate user questions.</li>\n</ul>\n<p></p>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Store is being redesigned for a more intuitive app and agent discovery experience, rolling out worldwide from late October 2025 to January 2026. Changes include a modern interface, new agent filter, streamlined app tiles, centered search, simplified categories, and a unified app management hub. No user or admin action is needed."
    }
  ],
  "EndDateTime": "2026-03-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1182697",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-04T00:41:34.06Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-04T00:41:27Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Teams Store (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
