{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 27, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>We’re introducing a new sign-in experience that enhances flexibility and accessibility for a limited number of users on Microsoft Teams for the web. This change introduces new sign-in options—<i>Continue with Apple</i> and <i>Continue with Google</i>—on the sign-in page (teams.microsoft.com or teams.com) for users routed through login.microsoftonline.com/common.</p><p><b>NOTE:</b> These options are intended for consumer Microsoft accounts and <i>may</i> be visible to both consumer and enterprise users, depending on your authentication configuration.\n</p><p><b>When this will happen:</b>\n</p><p>We will begin rolling out this private preview (Worldwide) in mid-September 2025 (previously late August) to a small number of Teams for the web users and expect to complete by mid-October 2025. We expect to expand this feature to other Microsoft apps later in 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout:\n</p><ul><li>Users can sign in or sign up for a Microsoft account using Apple or Google credentials.\n</li><li>Some users will be prompted to confirm whether they are using a personal or work/school account.\n</li><li>Existing sign-in methods remain unchanged, including entering an email/username or using <i>Sign-in options</i> to access organizational accounts.\n</li><li>Organizations using custom URLs (such as login.microsoftonline.com/contoso.com) will <b>not</b> be affected.</li><li>In the case of Teams on the web, the custom URLs will be https://teams.microsoft.com?tenantId=&lt;YOUR_DOMAIN_NAME&gt; <b>or</b> https://teams.microsoft.com?tenantId=&lt;YOUR_TENANT_ID&gt;</li></ul><p><i>Screenshots of the new experience:\n</i></p><p>1. Users can select <i>Continue with Apple</i> or <i>Continue with Google</i> to sign in or sign up for a consumer Microsoft account using an Apple or Google credential. This image shows the Google option:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/a77574ce-7170-4b70-82cd-37cc7022fdd7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>2. A subset of users who click these options will see a screen that confirms whether they are using a personal or work/school account. In this image, the user has selected the work/school option:</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f7cd81f8-2aef-4626-bebc-4ca33f25464b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>3. Users can still enter their email/username at the top of the sign-in screen, and sign into a specific organization with <i>Sign-in options</i>:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f130bb08-5ee4-416d-aef7-fd0e3e44dec7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>No action is required. This feature is only being added to login.microsoftonline.com/common. Users accessing login.microsoftonline.com with a custom URL will not see this feature.</p><p><i>You can show a custom URL for your organization by passing a domain hint to apply company branding at the initial sign-in screen. Custom URLs for Teams on the web will be https://teams.microsoft.com?tenantId=&lt;YOUR_DOMAIN_NAME&gt; or https://teams.microsoft.com?tenantId=&lt;YOUR_TENANT_ID&gt;.\n</i></p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/en-us/entra/fundamentals/how-to-customize-branding\" target=\"_blank\">Add company branding to your organization's sign-in page - Microsoft Entra | Microsoft Learn</a>\n</li><li><a href=\"https://devblogs.microsoft.com/identity/custom-url-domains/\" target=\"_blank\">Adding branded URLs to authentication with Microsoft Entra External ID Custom URL Domains | Microsoft Entra Identity Platform</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams on the web will introduce a private preview of \"Continue with Apple\" and \"Continue with Google\" sign-in options for consumer accounts starting mid-September 2025. Enterprise users with custom URLs won't be affected, and no action is required from organizations. Existing sign-in methods remain unchanged."
    }
  ],
  "EndDateTime": "2026-02-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102784",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T16:33:55.713Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-25T00:12:42Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams on the web: New Private Preview for Sign in with Apple and Google for consumers may affect enterprise",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
