{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction:</b></b></p><p>We're introducing <b>version history</b> in <i>Microsoft 365 Copilot Pages</i> to help users confidently refine their work. This feature allows users to view and restore previous versions of a page—whether changes were made manually, through Copilot, or collaboratively. This update supports transparency and control in content creation, aligning with customer feedback.</p><p><b><b>When this will happen:</b></b></p><ul><li><b>Public Preview (Worldwide): </b>Begins early October 2025 and completes by late October 2025.</li><li><b>General Availability (Worldwide): </b>Begins late October 2025 and completes by late October 2025.</li></ul><p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected: </b>Users with Entra ID (work or school) accounts who have access to Microsoft 365 Copilot Pages and underlying SharePoint or OneDrive storage.&nbsp;</p><p style=\"margin-left: 25px;\"><b>Note: </b>A Microsoft 365 Copilot license is <b>not required</b> to use version history in Copilot Pages.</p><p><b>What will happen:</b></p><ul><li>Users will be able to view and restore previous versions of Copilot pages:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/1ceda3ed-a013-4681-a92d-ecc8395e0c49/2f15eac885b7f51ef980feb4d441c4691601f0d8.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>Version history will include changes made manually, via Copilot, or by collaborators.</li><li>The feature will be enabled by default.</li><li>No admin configuration is required.</li></ul><p>Admin controls and licensing:</p><ul><li>IT admins cannot disable version history for Copilot Pages.</li><li>Admins can manage how many versions are stored using existing versioning settings in the underlying <i>SharePoint</i> or <i>OneDrive library</i>.</li><li>Copilot Pages are configured to save up to 50 versions per file.</li><li>There are no Copilot Page-specific versioning controls today.</li><li><b>Version history is available to users with SharePoint or OneDrive storage</b>—even if they do not have a Microsoft 365 Copilot license.</li><li>Copilot Pages are not currently available to personal Microsoft accounts (such as Microsoft 365 Personal or Family).</li></ul><p><b><b>What you can do to prepare:</b></b></p><p>No action is required at this time.</p><p>You may choose to:</p><ul><li>Communicate this change to helpdesk staff.</li><li>Update internal documentation if you reference Copilot Pages functionality.</li><li>Review training materials to ensure users are aware of the version history feature.</li><li>Review your SharePoint or OneDrive versioning settings if you want to adjust how many versions are retained.</li></ul><p>Learn more:&nbsp;</p><ul><li><b>to be updated for WW General Availability rollout phase in late Oct. 2025</b> -&nbsp;<a href=\"https://support.microsoft.com/topic/how-microsoft-365-copilot-pages-works-d155bd99-c3cc-4ef8-8da4-c0a92bfce29b\" target=\"_blank\">How Microsoft 365 Copilot Pages works | Microsoft Support</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-compliance-summary?view=o365-worldwide\" target=\"_blank\">Summary of governance, lifecycle, and compliance capabilities for Loop | Microsoft 365 | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Pages will add version history in October 2025, allowing users to view and restore previous page versions, including manual, Copilot, or collaborative changes. This feature is enabled by default, requires no license, and cannot be disabled by admins. No action is needed to prepare."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162965",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-30T23:21:51.807Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-30T23:21:35Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Version history now available in Copilot Pages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
