{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 22, 2026: We have updated the timeline. This feature will be enabled for en-US only initially. Thank you for your patience.&nbsp;</p><p><b><b>Introduction:</b></b>\n</p><p><b>Read Aloud</b> is evolving from a passive listening tool into an interactive experience. By integrating Copilot Q&amp;A, users can now ask questions and refine their understanding of document content in real time—without interrupting their workflow. This enhancement supports accessibility, improves comprehension, and helps users stay focused while gaining insights faster.</p><p>A Microsoft 365 Copilot license is required to use this feature.</p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=523205\" target=\"_blank\">523205</a>.</p>\n\n<p><b><b>When this will happen:</b></b>\n</p><p>General Availability (Worldwide): Rollout will begin in early February 2026 (previously early January) and is expected to complete by early March 2026 (previously end of January).</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b>\nAll users of Read Aloud in <i>Microsoft 365</i>.\nUsers with a Microsoft 365 Copilot subscription will receive the enhanced experience.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Users with Copilot will see a new interactive voice-driven Read Aloud experience.</li>\n<li>The entry point remains the same as classic Read Aloud.</li>\n<li>Users without Copilot will continue to use the classic Read Aloud functionality.</li>\n<li>No changes to admin policies or configurations are required.</li>\n<li>The feature is enabled by default for eligible users.</li>\n</ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No admin action is required.</li>\n<li>Notify your users about the upcoming change.</li>\n<li>Update internal documentation if you reference Read Aloud functionality.</li>\n<li>If you manage helpdesk communications, consider sharing a short blurb about the new experience.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n<tbody><tr><th>Compliance Question</th><th>Answer</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. The integration of Copilot Q&amp;A introduces AI-driven voice interactions that access document content to provide contextual answers.</td></tr>\n<tr><td>Does the change provide end users any new way of interacting with generative AI?</td><td>Yes. Users can now interact with generative AI via voice during Read Aloud sessions to ask questions and receive real-time insights.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users with Copilot can choose whether to engage with the interactive experience or continue using classic Read Aloud.</td></tr>\n</tbody></table>\n``",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "523205"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot's Read Aloud now supports real-time voice Q&A for en-US users, enhancing accessibility and comprehension. Available from February 2026, users with a Copilot license get an interactive experience, while others retain classic Read Aloud. No admin action is needed; users can enable or disable the feature."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-04-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1183010",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-22T18:32:19.163Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-05T00:20:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Q&A in Read Aloud enables real-time voice interactions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
