{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re introducing a new tenant-level admin control in Microsoft 365 admin center that enables IT admins to manage who can create org-wide sharing links for user-built agents. This feature introduces <b>granular control and governance</b> over who in an organization can create <b>org-wide sharing links</b> for user-built agents in Microsoft Copilot Studio Agent Builder.</p><p>This feature is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D500736&amp;searchterms=500376\" target=\"_blank\">500376</a>.</p><p>\n</p><p><b>When this will happen</b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out in mid-September 2025 and expect to complete by late September 2025.\n</p><p><b>How this affects your organization</b></p><p>By default, existing behavior remains unchanged. Once available, admins will be able to configure whether all users, no users, or only specific users or groups are permitted to create org-wide sharing links for agents built in Copilot Studio Agent Builder. This control helps organizations align agent sharing permissions with internal governance policies and collaboration needs.</p><p><b>What you can do to prepare</b></p><p>Admins can access the new control by navigating to:\n</p><p><b>Microsoft 365 admin center &gt; Copilot &gt; Settings &gt; Data access &gt; Agents\n</b></p><p>No action is required unless you want to customize sharing permissions. We recommend reviewing your organization’s sharing policies and updating settings as needed.</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Manage agents for Microsoft 365 Copilot in the Microsoft 365 admin center | Microsoft 365 | Microsoft Learn</a></p><p>\n</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.\n</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "500376"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is introducing a new admin control for tenant-level management of org-wide sharing links for user-built Copilot agents. Rolling out mid-September 2025, admins can specify who can create these links to align with governance policies. Default behavior remains unchanged unless customized."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1138797",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-20T23:39:31.037Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-20T23:39:23Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New admin control in Microsoft 365 admin center for org-wide sharing of user-built Copilot agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
