{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To better reflect the identity and functionality of the Microsoft 365 Copilot app, we are updating the executable name on Windows devices. This change improves clarity for IT admins, developers, and users managing diagnostics or process monitoring. \n</p><p><b>When this will happen:</b></p><p>This update will roll out to affected users with the next app update after September 20, 2025.  \n</p><p><b>How this affects your organization:</b></p><p>With the change, the executable name for the Microsoft 365 Copilot Windows app will change from Webviewhost.exe  to M365Copilot.exe. For users who installed the app via the Microsoft Store, the update will happen automatically on September 20 if their device settings allow for automatic updates. For users who installed the app through other platforms or have settings that do not allow automatic updates, the change will happen once users update their app.  \n</p><p>This update does not affect app functionality or user experience.  \n</p><p><b>What you can do to prepare:</b></p><p>No action is required unless your organization has dependencies on Webviewhost.exe. If so, update those references to M365Copilot.exe to ensure continued functionality.  \n</p><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft 365 Copilot app for Windows will change its executable name from Webviewhost.exe to M365Copilot.exe after September 20, 2025. The update is automatic for Microsoft Store users with auto-updates enabled. No functionality changes occur, but organizations should update dependencies if needed."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1141945",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-25T22:42:05.913Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-25T22:41:48Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Executable name update for Microsoft 365 Copilot app for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
