{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re retiring the Microsoft Lens mobile app for iOS and Android in a phased approach starting September 15, 2025. To continue scanning documents, we recommend using the scan capability in the Microsoft 365 Copilot app, where we will continue to invest in new features and improvements.\n</p><p><b>When this will happen\n</b></p><ul><li>Mid-September 2025: Retirement process begins.\n</li><li>Mid-October 2025: New installs of Microsoft Lens will be disabled in the Apple App Store and Google Play Store.\n</li><li>Mid-November 2025: Microsoft Lens will be removed from app stores.\n</li><li>Mid-December 2025: Users will no longer be able to create new scans in the Microsoft Lens app.\n</li></ul><p><b>How this affects your organization\n</b></p><p>This change affects users of the Microsoft Lens mobile app on iOS and Android. After December 15, 2025, users will no longer be able to create new scans in the app. Existing scans will remain accessible in the app’s MyScans folder, but this functionality will no longer be supported. Users can continue scanning using the Microsoft 365 Copilot app, which offers similar functionality. Scans saved to OneDrive will be accessible via the <i>MyCreations</i> section in the Microsoft 365 Copilot app.\n</p><p><b>What you can do to prepare\n</b></p><p>No admin action is required. We recommend notifying your users about this change, updating any internal documentation that references Microsoft Lens, and encouraging users to install and use the Microsoft 365 Copilot app for scanning needs.</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/retirement-of-microsoft-lens-fc965de7-499d-4d38-aeae-f6e48271652d\" target=\"_blank\">Retirement of Microsoft Lens</a></p><p><b>Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Lens mobile app will retire starting September 15, 2025, with new installs disabled by mid-October and removal by mid-November. After December 15, 2025, new scans can't be created. Users should switch to Microsoft 365 Copilot app for scanning; no admin action is required."
    }
  ],
  "EndDateTime": "2025-12-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1131064",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-07T23:40:18.827Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-07T23:39:53Z",
  "Tags": [
    "Retirement"
  ],
  "Title": "Microsoft Lens app will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
