{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 23, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p>&nbsp;We’re introducing a new visual indicator in the reading pane of Outlook Mobile (iOS and Android) to help users identify messages from unverified senders. This feature aligns with existing functionality in Outlook for desktop and web, bringing a consistent experience across platforms. When a message is from a sender we couldn’t verify as safe, users will see a banner in the reading pane warning them to be cautious.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=491471\" target=\"_blank\">491471</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-July 2025 and expect to complete by late October 2025 (previously mid-September).</p><p><b>How this will affect your organization:</b>\n</p><p>When users receive an email from an unverified sender, they will see a banner in the reading pane explaining why the sender is flagged and warning about potential impersonation. This complements existing safety messages such as:\n</p><ul><li>“External sender”\n</li><li>“Not on safe senders list”\n</li><li>“You don’t often get email from this sender”\n</li></ul><p>This feature is available by default when the unverified signal is received by the service. There are no admin controls to configure or disable this functionality.</p><p><b>What you need to do to prepare:</b>\n</p><p>No admin action is required. However, we recommend informing your users about this new visual cue and its purpose. If your organization provides internal training or documentation on email safety, consider updating it to include this new banner.</p><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/office/phishing-and-suspicious-behavior-in-outlook-0d882ea5-eedc-4bed-aebc-079ffa1105a3\" target=\"_blank\">Phishing and suspicious behavior in Outlook</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "491471"
    },
    {
      "Name": "Summary",
      "Value": "Outlook Mobile will show a new banner in the reading pane for emails from unverified senders, warning users about potential impersonation. This feature, rolling out July to October 2025, aligns with desktop and web versions and requires no admin action, though user awareness is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1112452",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-23T15:48:31.473Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-10T00:16:53Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook | Outlook Mobile: New unverified sender banner in reading pane",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
