{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 4, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b>\n<p>We’re introducing enhancements to the focus area experience in Viva Glint to improve how organizations track and act on employee feedback. With this update, focus areas will now be tied to survey cycles, and goal periods will be retired. This change simplifies reporting and aligns focus areas more closely with survey insights. </p><p>This update is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498922\" target=\"_blank\">498922</a>.</p>\n<b>When this will happen</b>\n<p>General availability: We will begin rolling out mid-November 2025 (previously mid-October) and expect to complete by late November 2025 (previously mid-October).</p>\n<b>How this affects your organization</b>\n<p>After the update, focus areas will be organized by survey cycle instead of goal periods. Glint users will be able to create and report on focus areas based on survey cycles. Goal periods will be retired. Focus areas not linked to a survey cycle (for example, if the cycle has been deleted) will be labeled <i>No survey cycle</i>&nbsp;and remain accessible in the platform. No focus areas will be deleted as part of this change. This update will be enabled by default.&nbsp;</p>\n<b>What you can do to prepare</b>\n<ul><li>No admin action is required for the transition, but we recommend communicating this change to Glint users in your organization. </li><li>Review and update any internal documentation or training materials that reference goal periods.&nbsp;</li></ul>\n<b>Compliance considerations</b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498922"
    },
    {
      "Name": "Summary",
      "Value": "Viva Glint will enhance focus areas by linking them to survey cycles and retiring goal periods, simplifying reporting. The update rolls out mid to late November 2025, with no data deletion. No admin action is needed, but user communication and documentation updates are recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1138786",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-04T19:51:47.957Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-20T23:33:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Viva Glint: Focus area enhancements and retirement of goal periods",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
