{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>\n</p><p>Updated August 25, 2025: We have updated the content to show as intended. Thank you for your patience.</p><p><b>Introduction</b></p><p>We’re enhancing Microsoft Secure Score by introducing new improvement actions based on Microsoft Defender for Identity posture recommendations. These updates provide a more accurate reflection of your organization’s identity security posture and help strengthen your overall security configuration.\n</p><p><b>When this will happen</b></p><p><b></b></p><ul><li>Public Preview: Rollout begins mid-August 2025 and completes by mid-September 2025.\n</li><li>General Availability: Rollout begins mid-September 2025 and completes by late October 2025. Applies to Worldwide, GCC, GCC High, and DoD environments.\n</li></ul><p><b>How this affects your organization</b></p><p>New posture recommendations will appear in Microsoft Secure Score as improvement actions. These include:\n</p><ul><li>Remove <b>stale </b>service accounts\n</li><li>Remove discovered passwords in Active Directory account attributes\n</li></ul><p>These recommendations will be visible only if your tenant has a Defender for Identity sensor deployed in your identity infrastructure. The update is enabled by default and requires no configuration changes.\n</p><p><b>What you can do to prepare</b></p><ul><li>No admin action is required before or after rollout.\n</li><li>Review your current identity configuration to assess potential impact.\n</li><li>Notify relevant administrators and update internal documentation as needed.\n</li><li>Regularly review Microsoft Secure Score to monitor and act on new improvement suggestions.\n</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Secure Score will add new improvement actions based on Microsoft Defender for Identity recommendations, rolling out from mid-August to late October 2025. These include removing inactive service accounts and discovered passwords. No admin action is needed; updates appear if a Defender for Identity sensor is deployed."
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130384",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-25T16:27:37.327Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:26:13Z",
  "Tags": [
    "Updated message",
    "Feature update"
  ],
  "Title": "Microsoft Defender for Identity: New recommendations added to Microsoft Secure Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
