{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to enable intent group and agent group-based metrics and dimensions for real time analytics for record routing in Dynamics 365 Contact Center. This feature will reach general availability on October 20, 2025.<br><br>\n<b>How does this affect me?</b><br>\nThis feature enables intent groups in your environment, allowing you to effectively monitor conversations and track operational metrics using intent attributes. This feature provides immediate insights into customer interactions, allowing supervisors to identify trends, optimize agent performance, and ensure that customer queries are resolved efficiently. Several key improvements include:<ul>\n    <li><b>Landing Page Redesign:</b><ol type='a'>\n        <li>Revamp the landing page to prominently display key operational metrics.</li>\n        <li>Ensure these metrics are available in real-time with auto-refresh capabilities.</li>\n    </ol></li>\n    <li><b>Ongoing Conversation Report</b>:<ol type='a'>\n        <li>Redesign the report to incorporate Line of Business (LOB), Intent Group, and Agent Group concepts.</li>\n        <li>Provide a comprehensive view of ongoing conversations with these new categorizations.</li>\n    </ol></li>\n    <li><b>Agent Report</b>:<ol type='a'>\n        <li>Display key metrics for each agent, allowing users to focus on individual agents.</li>\n        <li>b.\tProvide insights into the performance of each agent and the specific intent groups they support.</li>\n    </ol></li>\n    <li><b>Intent Group Report</b>:<ol type='a'>\n        <li>Display key metrics for each intent group, allowing users to drill down into individual intent groups.</li>\n        <li>Provide insights into the performance of each intent and the agents supporting those groups.</li>\n    </ol></li>\n</ul>\n<b>What action do I need to take?</b><br>\nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-11-14T15:51:30Z",
  "HasAttachments": false,
  "Id": "MC1172377",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-14T15:53:32.237Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-14T15:51:30Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Enable Intent group and agent group-based metrics and dimensions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
