{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p><b>Coming soon to Microsoft Teams Rooms on Android:</b> We are excited to announce that captions will soon support additional languages and translation capabilities. This enhancement aims to improve accessibility and inclusivity of meetings for non-English speaking users using Teams Rooms on Android.&nbsp;&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499800\" target=\"_blank\">499800</a>.</p><p><b>When this will happen</b></p><ul><li>General Availability (Worldwide, GCC): We will begin rolling out early October 2025 and expect to complete by mid-October 2025.</li><li>General Availability (GCC High): We will begin rolling out late October 2025 and expect to complete by mid-November 2025.&nbsp; &nbsp;</li></ul><p><b>How this affects your organization</b></p><p><b>Before the rollout:</b> </p><p>Currently, captions in Teams Rooms on Android only support the English language, which limits usability for non-English speaking users as the captions will result in gibberish if the actual spoken language in the meeting is non-English. There is also no way for admins to set default caption settings.</p><p><b>After the rollout: </b></p><ul><li><b>Additional languages:</b> Users can select from a list of supported languages for captions, ensuring that captions are accurate and meaningful for non-English speakers. Users can change the meeting spoken language directly from Teams Rooms devices by selecting <i>More </i>&gt; <i>Captions </i>&gt; <i>Meeting spoken language</i>.&nbsp;</li><li><b>Real-time translation: </b>Users can translate the meeting spoken language if the room account has a Teams Rooms Pro license or if the meeting organizer has a Teams Premium license, allowing for real-time translation of captions. Users can translate captions by selecting <i>More </i>&gt; <i>Captions </i>&gt; <i>Translation language</i>.&nbsp;</li><li><b>Admin controls:</b> For room accounts with Teams Rooms Pro license, admins will have the option to turn on/off captions by default for calls and meetings as well as turn on/off filtering of any profanity in captions as necessary using the Meetings menu of local device settings.&nbsp;</li></ul><p>Note that you can also control this feature using calling and meeting policies in the <i>Teams admin center</i>. </p><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/meeting-transcription-captions#live-captions\" target=\"_blank\">Manage live captions - Microsoft Teams | Microsoft Learn</a> </li><li><a href=\"https://learn.microsoft.com/microsoftteams/call-recording-transcription-captions#enable-call-captions\" target=\"_blank\">Enable call captions - Microsoft Teams | Microsoft Learn</a></li></ul><p><b>What you can do to prepare</b></p><p>After your Teams Rooms on Android devices are updated to the latest version, configure the desired policy and setting, notify your users about this change, and update your training and documentation as appropriate.  This rollout will happen automatically by the specified date with no admin action required before the rollout.&nbsp;</p>\n\n<b>Compliance considerations</b>\n<table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>New customer data storage</td><td>Spoken language data may be temporarily cached for caption rendering and translation.</td></tr>\n<tr><td>Processing of existing customer data</td><td>Spoken language is now processed for translation and captioning, introducing new audio data flows.</td></tr>\n<tr><td>AI/ML interaction with customer data</td><td>Real-time translation uses AI/ML models to interpret and translate spoken language.</td></tr>\n<tr><td>New communication method</td><td>Translated captions enable cross-language communication during meetings.</td></tr>\n<tr><td>Admin control and Entra ID group support</td><td>Admins with Teams Rooms Pro license can manage caption defaults and profanity filtering via device settings or <i>Teams admin center</i>.</td></tr>\n<tr><td>User control</td><td>Users can manually select spoken and translation languages from Teams Rooms devices during meetings.</td></tr>\n</tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499800"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Android will soon support captions in multiple languages with real-time translation for licensed users, improving accessibility. Admins can control caption defaults and profanity filtering. Rollout begins October 2025, enhancing meeting inclusivity and providing new compliance and data processing features."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-12-14T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1144650",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-29T23:36:18.647Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T23:36:08Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Captions enhancements on Teams Rooms on Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
