{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b><p></p>\n<p>To support compliance with the <i>GB18030 standard</i>—a mandatory Chinese government character encoding standard that ensures software can correctly display and process all Chinese characters—OneDrive is undergoing updates that temporarily affect the folder sync selection experience for users with the <i>zh-CN</i> language setting. During this time, the <i>Choose folders</i> sync dialog may be unavailable or fail to render correctly.</p>\n\n<b><b>When this will happen:</b></b><p><b></b>\n</p><p><b>General Availability:</b></p><p>\nThe folder selection dialog will be unavailable starting <b>September 29, 2025</b>, and is expected to be restored in <b>late October 2025</b><b>.</b></p><p><b><b>How this affects your organization:</b></b>\n</p><p><b>Who is affected:&nbsp;</b>Users who have selected <i>zh-CN</i> as their operating system language.</p>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>The <i>Choose folders</i> sync dialog in OneDrive will be temporarily unavailable or may not render correctly.</li>\n<li>This may impact workflows that rely on selective sync, particularly in environments with limited storage or bandwidth.</li>\n<li>No other OneDrive functionality is affected.</li>\n</ul>\n\n<b><b>What you can do to prepare:</b></b>\n<ul>\n<li>Advise affected users to temporarily switch their operating system language to one of the following:<ul><li><i>zh-HK</i> – Traditional Chinese (Hong Kong)</li><li><i>zh-TW</i> – Traditional Chinese (Taiwan)</li><li>Or any other language setting except <i>zh-CN</i></li></ul></li><li>After changing the language, restart OneDrive to restore access to the folder selection dialog.</li>\n<li>Once the updates are complete, users can revert to <i>zh-CN</i> without issue.</li>\n<li>Communicate this workaround to helpdesk and support teams.</li>\n<li>Update internal documentation if you reference selective sync workflows.</li>\n</ul>\n\n<b><b>Compliance considerations:</b></b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneDrive's folder sync selection dialog will be temporarily unavailable for users with the zh-CN language setting from September 29 to late October 2025 due to GB18030 compliance updates. Users should switch to zh-HK, zh-TW, or another language temporarily to maintain selective sync access."
    }
  ],
  "EndDateTime": "2025-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1158899",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-24T22:46:01.08Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-24T22:45:35Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "OneDrive folder sync selection dialog temporarily unavailable when using zh-CN language setting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
