{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We will retire the IP-based user location detection feature in the Microsoft 365 Suite Admin Portal bookmark creation flow, effective November 10, 2025. This change aligns with our ongoing investment in more secure and reliable location-based targeting using Azure Active Directory (Azure AD). Azure AD location-based targeting offers enhanced flexibility and better alignment with modern identity and access management practices.</p>\n\n<p><b>When this will happen:</b></p>\n<p>This change will take place on November 10, 2025.&nbsp;</p>\n\n<p><b>How this affects your organization:</b></p>\n<ul>\n  <li><b>Who is affected:</b> Admins using the Microsoft 365 Suite Admin Portal to create bookmarks with IP-based location targeting.</li>\n  <li><b>What will happen:</b>\n    <ul>\n      <li>Admins will no longer be able to target bookmarks based on IP-derived user location.</li>\n      <li>Azure AD location-based targeting will remain available and is the recommended alternative.</li>\n      <li>This change will be applied automatically; no configuration changes are required.</li>\n    </ul>\n  </li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n  <li>No admin action is required for this change.</li>\n  <li>Notify relevant users and helpdesk staff about the retirement of IP-based targeting.</li>\n  <li>Update any internal documentation that references IP-based bookmark targeting.</li>\n  <li>Review and familiarize yourself with <a href=\"https://learn.microsoft.com/entra/identity/conditional-access/location-condition\">Azure AD location-based targeting</a> as the supported method going forward.</li></ul><p><!--<p--><b>Compliance considerations:</b></p><p></p>\n<p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "IP-based location detection for bookmark creation in Microsoft 365 Suite Admin Portal will be retired on November 10, 2025. Admins can no longer use IP-based targeting but should use Azure AD location-based targeting instead. No action is required, but users should be informed and documentation updated."
    }
  ],
  "EndDateTime": "2025-12-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1167605",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-07T22:30:45.597Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-07T22:30:21Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of IP-Based Location Detection in Bookmark Creation Flow",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
