{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p></p><p><b><b>Introduction</b></b></p><p>We’re launching a new Viva Insights experience focused solely on Microsoft Copilot and AI agent analytics in the Copilot Analytics Viva Insights web app. By default, <i>Behavioral insights</i>&nbsp;will be disabled for all new customers, and existing customers who haven't previously accessed them. <i>Behavioral insights</i> do not measure Copilot or AI agent usage but provide a deeper understanding of how an organization gets work done such as focus, learning, network, collaboration, and meetings etc. The AI or Viva Insights (VI)&nbsp;admin can enable <i>Behavioral insights</i>&nbsp;via Viva Feature Access Management (VFAM)  User Experience or PowerShell. More details about what's included in <i>Behavioral insights</i> are provided in the table below.</p>\n\n<p><b><b>When this will happen:</b></b></p><ul><li><b>Mid-October 2025: </b>VFAM policy and PowerShell cmdlet available to all customers.</li><li><b>Mid-November 2025: </b>Experience changes begin rolling out to all customers.</li></ul><p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:&nbsp;</b>All Copilot Analytics - Viva insights customers</p><p></p><p><b>What will happen:</b></p><ul><li><b>For existing Viva Insights web app users prior to October 15th, 2025:</b> <i>Behavioral insights</i> will be disabled if one of the following criteria is met. For others, there will be no change.<ul><li>No Analyst assigned since May 2025 and no reports or queries were ever created or published by analyst on Advanced Insights.</li></ul></li><li><b>For new customers post October 15th, 2025: </b><i>Behavioral insights</i> will be disabled by default.</li><li>There may be slight delay between the availability of the VFAM control and the disable policy being set.&nbsp;</li><li>For all customers, this change will begin to have an impact on the experience in mid-November 2025. Until then, the AI or VI admin can enable or disable <i>Behavioral insights</i> as needed. When experience changes roll out in mid-November 2025, updates to the policy will be honored.&nbsp;</li><li><i>Note: </i>This change does not impact data sent to Insights from Viva Skills, Learning, Glint, Organizational data in Microsoft 365. To leverage Insights from these data sets, an Analyst must be assigned in Viva Insights. </li><li>The AI Admin or VI Admin can enable or disable behavioral insights at any time at the tenant level using the <i>Behavioral insights</i>&nbsp;policy in <a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">VFAM</a>&nbsp;UX or using PowerShell: </li><li>The following table details what’s visible and to whom, when behavioral data is enabled and disabled.&nbsp; &nbsp;</li></ul><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n  <tbody><tr>\n    <th>Role</th>\n    <th>Behavioral Insights OFF</th>\n    <th>Behavioral Insights ON</th>\n  </tr>\n  <tr>\n    <td>CXO, GM or delegate</td>\n    <td>\n      <ul>\n        <li>Access only Copilot and AI agent reports (e.g., Microsoft Copilot Dashboard, Custom studio agent report)</li>\n        <li>Access reports shared with them</li>\n        <li>No behavioral insights (e.g., Ways of Working, Meeting Effectiveness)</li>\n      </ul>\n    </td>\n    <td>\n      <ul>\n        <li>Access only Copilot and AI agent reports (e.g., Microsoft Copilot Dashboard, Custom studio agent report)</li>\n        <li>Access reports shared with them</li>\n        <li>No behavioral insights (e.g., Ways of Working, Meeting Effectiveness)</li>\n      </ul>\n    </td>\n  </tr>\n  <tr>\n    <td>Analyst</td>\n    <td>\n      <ul>\n        <li>Access only Copilot and AI agent reports (e.g., Microsoft Copilot Dashboard, Custom studio agent report)</li>\n        <li>No behavioral insights (e.g., Ways of Working, Meeting Effectiveness)</li>\n        <li>Visual customization of PowerBI reports</li>\n        <li>Publish reports to others in the organization</li>\n      </ul>\n    </td>\n    <td>\n      <ul>\n        <li>Full Advanced analysis access to all Copilot and behavioral metrics and reports</li>\n        <li>Create custom queries, set up PowerBI reports, do visual customization</li>\n        <li>Publish reports to others in the organization</li>\n      </ul>\n    </td>\n  </tr>\n  <tr>\n    <td>Admin</td>\n    <td>\n      <ul>\n        <li>Can manage the <i>Behavioral insights</i>&nbsp;policy in VFAM</li>\n        <li>Sees in-product banners about the state of <i>Behavioral insights</i></li>\n      </ul>\n    </td>\n    <td>\n      <ul>\n        <li>Can manage the <i>Behavioral insights</i> policy in VFAM</li>\n        <li>Sees in-product banners about the state of <i>Behavioral insights</i></li>\n      </ul>\n    </td>\n  </tr>\n</tbody></table><p><b><b>What you can do to prepare:</b></b></p><ul><li>Review your privacy and compliance requirements to determine if behavioral insights should be enabled for your organization.</li><li>Use the available VFAM control to enable behavioral insights if that is needed for your organization.&nbsp;</li><li>Inform your admins, analysts, and leaders about the new control and its impact on available reports and metrics.&nbsp;</li><li>Update internal documentation and training materials to reflect the new Copilot-only experience if B<i>ehavioral insights</i> is turned off.&nbsp; </li></ul><p><b><b>Compliance considerations</b></b></p><table border=\"1\">\n<tbody><tr><th>Question</th><th>Explanation</th></tr>\n<tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>introduces a Copilot-only experience in Viva Insights, separating behavioral data from AI agent analytics.</td></tr>\n<tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Admins can manage the <i>Behavioral insights</i> policy via VFAM UX or PowerShell.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Admins can enable or disable <i>Behavioral insights</i> at the tenant level.</td></tr>\n</tbody></table><p></p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting mid-November 2025, Viva Insights will disable Behavioral insights by default for new and some existing customers, focusing on Copilot and AI agent analytics. Admins can enable or disable Behavioral insights via VFAM or PowerShell. Behavioral insights provide deeper organizational work patterns but are separate from AI usage data."
    }
  ],
  "EndDateTime": "2025-12-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1173209",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-16T00:12:42.547Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-16T00:11:47Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Insights web app: Behavioral insights control",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
