{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:</b></p><p>Agent Mode in <i>Microsoft 365 Copilot for Excel</i>, currently available only on the web and soon to be released for desktop apps, introduces a new way for users to interact with Copilot using natural language to build and edit workbooks. This feature allows users to work alongside Copilot, keeping their content editable and synchronized with the latest changes. The early access preview is available through the Frontier program in the <i>Excel Labs add-in</i>. Users maintain complete control over all modifications at any time. Read more about it in our announcement <a href=\"https://www.microsoft.com/microsoft-365/blog/2025/09/29/vibe-working-introducing-agent-mode-and-office-agent-in-microsoft-365-copilot/\" target=\"_blank\">Vibe working: Introducing Agent Mode and Office Agent in Microsoft 365 Copilot</a>.</p><p><b>When this will happen:</b></p><ul><li>We will begin rolling out Agent Mode in <i>Excel Labs</i> (Frontier preview) on September 29, 2025, via the Office Store. Rollout is expected to complete the same day.</li></ul><p><b>How this affects your organization:</b></p><p>Who is affected: </p><ul><li>Users with access to the Excel Labs add-in via the Office Store.</li><li>Admins managing Office add-ins and Microsoft 365 Copilot capabilities.</li></ul><p>What will happen:</p><ul><li>Users will see a new Agent Mode experience in <i>Excel Labs:</i></li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/6893aa9a-cf67-4c5a-8a65-0ee00f87040e/5cbfbcdd962870cac1728ea76bf7c5e8e02f09c6.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>Agent Mode enables natural language interaction with Copilot to build and edit workbooks.</li><li>Content remains editable and synced with workbook changes.</li><li>The feature is available only through the Frontier preview program.</li><li>Admins must enable the Excel Labs add-in for users to access this capability.</li></ul><p><b>What you can do to prepare:</b></p><ul><li>Ensure Office add-ins are enabled in your tenant.</li><li>Enable use of the Excel Labs add-in. Learn more about how to review and manage add-ins in the Microsoft 365 admin center: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-addins-in-the-admin-center?view=o365-worldwide#manage-add-in-downloads-by-turning-onoff-the-office-store-across-all-apps-except-outlook\" target=\"_blank\">Manage add-ins in the admin center - Microsoft 365 admin | Microsoft Learn&nbsp;</a></li></ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/office/get-started-with-copilot-in-excel-d7110502-0334-4b4f-a175-a73abdfc118a\" target=\"_blank\">Get started with Copilot in Excel | Copilot in Excel | Microsoft Support</a></p><p><b>Compliance considerations:</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Agent Mode in Microsoft 365 Copilot for Excel, available via the Excel Labs add-in Frontier preview starting September 29, 2025, enables natural language interaction to build and edit workbooks while keeping content editable and synced. Admins must enable the add-in for user access."
    }
  ],
  "EndDateTime": "2025-10-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1162083",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-29T16:21:53.133Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-29T16:20:41Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Agent Mode available in Excel Labs add-in (Frontier preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
