{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 7, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p>We’re introducing <b>cross-tenant group synchronization</b>, a new capability that enables organizations to <b>synchronize security groups across Microsoft Entra tenants</b>. This feature simplifies collaboration scenarios by allowing shared access to resources across tenants while maintaining centralized group management. It also streamlines administration of multiple tenants by centralizing group membership control, reducing duplication and manual overhead. The new group sync functionality will be part of the Microsoft Entra ID Governance / Microsoft Entra Suite <a href=\"https://learn.microsoft.com/entra/id-governance/licensing-fundamentals#types-of-licenses\">license</a>.&nbsp;</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=518221\" target=\"_blank\">518221</a>.</p>\n<b>When this will happen</b><ul>\n<li><b>Public Preview: </b>Rollout begins in <b>late January 2026</b> and completes by<b> late January 2026</b>.</li>\n<li><b>General Availability (Worldwide, GCC, GCC High, DoD): </b>Rollout begins in late<b> April 2026 </b>and completes by<b> late April 2026</b>.</li>\n</ul>\n<b>How this affects your organization</b><ul>\n<li><b>Who is affected:</b> Admins managing Microsoft Entra tenants who want to enable cross-tenant group synchronization.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>No impact unless you opt in during Public Preview.</li>\n<li>Admins can enable synchronization by updating attribute mappings.</li>\n<li>Cross-tenant access policies in the target tenant must allow group synchronization.</li>\n</ul>\n</li>\n</ul>\n<b>What you can do to prepare</b><ul>\n<li>Identify groups that require synchronization into other tenants.</li>\n<li>Collaborate with admins of other tenants to align on supported scenarios and business processes.</li>\n<li>Review and update attribute mappings and cross-tenant access policies as needed.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/entra/identity/multi-tenant-organizations/cross-tenant-synchronization-configure?pivots=same-cloud-synchronization\" target=\"_blank\">Configure cross-tenant synchronization - Microsoft Entra ID | Microsoft Learn</a></p><ul>\n</ul>\n<b>Compliance considerations</b><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "518221"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Entra introduces cross-tenant security group synchronization, enabling centralized group management and resource sharing across tenants. Public Preview starts late January 2026; general availability begins late April 2026. Admins must opt in, update attribute mappings, and configure cross-tenant access policies to enable this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1198077",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-07T22:52:18.41Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-16T23:40:03Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Entra: Cross-tenant security group synchronization",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
