{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing advanced voice and chat agent analytics on the Omnichannel Historical Bot Dashboard in Dynamics 365 Contact Center. This feature will reach general availability on December 5, 2025.<br><br><b>How does this affect me?</b><br>This feature enhances the existing Omnichannel for Customer Service Historical Bot Dashboard to support:<br><br><b>Segmenting KPIs using user defined Reporting Variable:</b><br>Reporting variables allow organizations to introduce business-specific dimensions (e.g., Line of Business, region, campaign) without engineering effort. Once configured, the Omnichannel Historical dashboard under the Bot page can be customized with these user-defined dimensions and metrics, enabling granular analysis of KPIs such as deflection, escalation rate, and containment.<br><br><b>Capturing exit patterns at question prompts to gauge KPI impact:</b><br>When the Advanced Bot Analytics option is enabled in the Copilot Service Admin Center > Insights > Omnichannel Historical dashboard, users can analyze metrics related to exit patterns from question nodes and identify the reasons for escalations originating from those nodes within the Omnichannel Historical Bot dashboard.<br><br><b>What action do I need to take?</b><br>This message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-01-06T21:56:00Z",
  "HasAttachments": false,
  "Id": "MC1183553",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-06T21:57:56.927Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-06T21:56:59Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Advanced Voice and Chat Agent Analytics on Omnichannel Historical Bot Dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
