{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re updating how we bill for mid-term subscription changes to improve clarity and efficiency.</p><p><b>When this will happen:</b></p><p>Starting November 13, 2025 changes to existing subscriptions—such as adding or removing licenses, cancellations, and upgrades—will be billed the next day instead of at the beginning of the following month. This change ensures more timely and transparent billing, helping you better track and manage your subscription costs.\n</p><p>When you see this change will depend on the country/region your account is in.\n</p><ul><li>Singapore and Italy: November 13, 2025</li><li>Asia-Pacific: November 18, 2025</li><li>Worldwide: January 6, 2026</li></ul><p><b>How this will affect your organization:</b>\n</p><p>If you have an account where your invoices start with a “G”, your organization will be impacted by this change on the date the change is launched in your region.</p><p><b>Example:</b></p><ul><li>If your account is in Singapore or Italy and you add a license to your subscription on November 13, you will receive an invoice for that additional license on November 14th.  \n</li></ul><p><b>Note: </b>With this change is it possible to be billed later for changes made earlier in the month as changes made prior to this update will still be billed around the beginning of the following month.</p><p><b>What you need to do to prepare:</b></p><p>No action is required. This update will be applied automatically to all eligible subscriptions.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2026-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1176303",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-20T18:38:53.81Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-20T18:38:34Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "We’re updating how we bill for mid-term subscription changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
