{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We’re excited to announce that Microsoft Teams now supports apps in Private channels. This update enables richer collaboration scenarios across teams and organizations by allowing users to add and use apps—including bots, tabs, and message extensions—directly within Private channels. This change aligns with customer feedback requesting more consistent and flexible app experiences across collaboration spaces. Support for apps in Private Channels follows the same model as that for shared channels, ensuring a unified experience for users and developers.\n</p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=518215\" target=\"_blank\">518215</a>&nbsp;and applies to Teams for Windows desktop and Teams for Mac desktop.</p>\n\n<p><b>When this will happen:</b></p>\n<ul>\n<li><b>Targeted release:</b> Rollout begins mid-January 2026, and we expect to complete by late January 2026.</li><li><b>General availability (Worldwide):</b> Rollout begins late February 2026, and we expect to complete by late March 2026.</li></ul><p><b>How this affects your organization:</b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>All Microsoft Teams users who participate in Private Channels</li>\n<li>Admins managing Teams app policies</li>\n<li>Developers maintaining Teams apps</li>\n</ul>\n\n<p><b>What’s changing:</b></p>\n<ul>\n<li>Apps can now be added to Private Channels. Previously, only a limited set of tabs were supported.</li><li>This feature is available by default.</li><li>All apps marked to work in Private and Shared Channels will be available.</li><li>Channel owners or members can add apps to a Private Channel, with new governance and consent controls.</li>\n<li>A new channel setting allows owners to control who can add apps.</li>\n<li>Apps must be explicitly added to each channel; installing at the team level will no longer apply to Shared or Private Channels.<p></p><p>Screenshot 1: <i>Apps must be added per channel. Users are prompted for consent when interacting with an app that hasn’t been added. Apps are available through all standard discovery entry points.</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/89b720fd-4c35-4a6a-9412-ec9800558835\" style=\"width: 50%;\" alt=\"user settings\"></p><p></p><p>Screenshot 2: <i>Manage apps in your channels from the new Apps tab in Manage channel settings.</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/1b8ab87c-b7a4-4ebd-9b23-35959d8995a0\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p></li><li>&nbsp;Guest users can use supported apps depending on app and admin settings.</li><li>Only apps updated by developers to support Private Channel functionality and allowed by admins will be available.</li>\n<li>Support for apps in Private Channels will follow the same model and require similar updates.</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n</ul><p><b>Admins:</b></p><ul><li>Review your Teams app policies and ensure required apps are updated for Private Channel support.</li><li>Communicate this change to helpdesk staff.</li><li>Update internal documentation if you detail this feature.</li><li>Confirm that apps used in Private Channels are permitted by your organization’s app governance policies.</li></ul><div><b>Developers:</b></div><ul><li>Update your app manifest to include <code>supportsChannelFeatures</code>: <code>tier1</code>&nbsp;as part of the latest manifest version.</li><li>Use channel-specific APIs for membership, storage, and permissions. Do not assume team membership equals channel membership.</li><li>Review and update Resource-Specific Consent (RSC) permissions if required.</li><li>Test your app in Private Channels and with different user roles (internal, guest) to validate functionality.</li><li>For apps with advanced scenarios (e.g., file access, cross-channel data, custom permissions), review the full developer guidance for targeted updates.</li></ul><p>Before rollout, we will update this&nbsp;post&nbsp;with new documentation.</p><div><b>Compliance considerations:</b><table border=\"1\">\n<tbody><tr><th>Compliance Area</th><th>Explanation</th></tr>\n<tr><td>Does the change store new customer data, if so, where, and is the data cached or permanently stored?</td><td>Apps added to Private Channels may store channel-specific data such as membership, settings, and user interactions. Storage location depends on the app’s architecture and may include Microsoft 365 or third-party services.</td></tr>\n<tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Apps now operate at the channel level, not the team level. This changes how data access and permissions are scoped, requiring updates to app manifests and use of channel-specific APIs.</td></tr>\n<tr><td>Does the change provide a new way of communicating between users, tenants, or subscriptions?</td><td>Apps (including bots and message extensions) within Private Channels enable new interaction paths among channel members, including guest users, depending on admin and app settings.</td></tr>\n<tr><td>Does the change modify, interrupt, or disable any of the following capabilities (Purview)?</td><td>Apps must be explicitly added per channel, which may affect how DLP policies, audit logging, and eDiscovery apply. Admins should validate app behavior in Private Channels to ensure compliance.</td></tr>\n<tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td><td>Admins must review app usage and permissions at the channel level. Monitoring tools may need updates to reflect app activity in Private Channels.</td></tr>\n<tr><td>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services (GDPR Data Subject Rights)?</td><td>Apps in Private Channels may store user interactions and data that must be considered in GDPR-related requests. Admins and developers should ensure data handling aligns with privacy obligations.</td></tr>\n<tr><td>Does the change include an admin control and, can it be controlled through Entra ID group membership?</td><td>Admins can manage app permissions and availability via Teams app policies and channel settings. Entra ID group membership may be used to scope access.</td></tr>\n<tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Channel owners can control who can add apps, and users can interact with apps once added, subject to consent prompts and admin policies.</td></tr>\n</tbody></table></div>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "518215"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams now supports apps in Private Channels, allowing bots, tabs, and message extensions with new governance controls. Rollout starts mid-January 2026. Admins and developers must update policies and apps for Private Channel compatibility, ensuring compliance with data and permission changes at the channel level."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1197145",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-15T20:39:09.42Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-15T20:39:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Apps now supported in Private Channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
