{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing a new activity pane in SharePoint Online to enhance visibility into Content AI model processing (formerly Microsoft Syntex). This update provides real-time insights into document translation and autofill operations, helping users monitor progress, troubleshoot issues, and understand outcomes more effectively.</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=489453\" target=\"_blank\">489453</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout will begin in early July 2025 and is expected to complete by late July 2025.\n</p><p><b>How this affects your organization:</b></p><p>This update introduces a modern, pane-based interface that replaces the legacy “Processing status” column. Key capabilities include:\n</p><ul><li>Real-time status tracking: View “In progress,” “Completed,” or “Failed” statuses for individual files, bulk selections (up to 30), or entire libraries.\n</li><li>Detailed processing outcomes: Completed items display extracted column counts (Autofill), translated languages, and glossary usage (Translation).\n</li><li>Error transparency: Failed items include specific error messages to support faster troubleshooting.\n</li><li>Filtering and history: Users can filter by status or time range and access up to 60 days of processing history.\n</li><li>Improved user experience: The new pane offers a more consistent and actionable interface for monitoring Content AI activities.\n</li></ul><p>This change is designed to reduce support requests, improve self-service troubleshooting, and enhance monitoring for large or multi-file jobs.\n</p><p><b>What you can do to prepare:</b></p><p>No action is required to enable this feature. However, we recommend:\n</p><ul><li>Informing users and site owners that the legacy “Processing status” column will be hidden by default.\n</li><li>Communicating that the new activity pane will provide clearer, real-time visibility into AI processing results.\n</li><li>Reviewing and updating any library views or reporting tools that currently rely on the “Processing status” column.</li></ul><p><b>Compliance considerations:</b></p><ul><li>Changes to data processing/storage/access: Yes - Processing metadata is now surfaced in a new UI, but underlying data handling remains unchanged.\n</li><li>AI/ML capabilities interacting with customer data: Yes - The update enhances visibility into existing AI/ML processes (Translation, Autofill).</li><li>Admin compliance monitoring/reporting: Maybe - Admins may need to update reporting tools if they rely on the legacy column.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "489453"
    },
    {
      "Name": "Summary",
      "Value": "Improved processing visibility for Content AI models in SharePoint Online introduces a new activity pane for real-time insights into document translation and autofill operations. This update, rolling out in July 2025, replaces the legacy “Processing status” column and enhances monitoring, troubleshooting, and user experience. No action is required to enable this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1102786",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-25T00:14:05.68Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-06-25T00:13:57Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Improved processing visibility for Content AI models in SharePoint Online: Autofill and Document Translation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
