{
  "ActionRequiredByDateTime": "2025-12-30T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>As part of our ongoing efforts to modernize and streamline audit logging in Exchange Online, we are retiring the <code>Search-MailboxAuditLog</code> and <code>New-MailboxAuditLogSearch </code>cmdlet. Organizations should transition to the <code>Search-UnifiedAuditLog</code>cmdlet for long-term audit log access and compliance.\n</p><p><b>When this will happen\n</b></p><ul><li><b>March 1, 2025:</b> New audit log data will no longer be written to individual mailboxes.\n</li><li><b>June 2025:</b> Migration tools and documentation will be available to support transition.\n</li><li><b>End of December 2025: </b>The <code>Search-MailboxAuditLog</code> and <code>New-MailboxAuditLogSearch</code> cmdlets will be fully retired.</li></ul><p><b>How this affects your organization\n</b></p><p>After March 1, 2025, mailbox audit log data will become static and read-only. While existing data will remain accessible for historical review, no new data will be written to mailbox audit logs. By the end of 2025, the legacy cmdlets will no longer be available, and any scripts or tools relying on them will fail.\n</p><p>Organizations should ensure they are using the <code>Search-UnifiedAuditLog</code> cmdlet for audit log access going forward. This change supports improved scalability, centralized access, and long-term retention of audit data.\n</p><p><b>What you can do to prepare\n</b></p><p>To ensure a smooth transition:\n</p><ul><li>Review your current usage of <code>Search-MailboxAuditLog</code> and <code>New-MailboxAuditLogSearch</code> to identify dependencies in scripts, tools, or workflows.\n</li><li>Engage with your legal and compliance teams to ensure regulatory requirements are met.\n</li><li>Confirm that auditing is enabled for your tenant.\n</li><li>Use the documentation (available June 2025) to transition to <code>Search-UnifiedAuditLog</code>.\n</li></ul><p>Learn more:&nbsp;<a href=\"https://techcommunity.microsoft.com/blog/microsoft-security-blog/microsoft-exchange-online-search-mailboxauditlog-and-new-mailboxauditlogsearch-w/4366310\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Microsoft Exchange Online: Search-MailboxAuditLog and New-MailboxAuditLogSearch will retire</a></p><p><b>Compliance considerations</b></p><p>\n</p><table>\n<tbody><tr><th>Impacted Area</th><th>Explanation</th></tr>\n<tr><td>Audit logging capabilities</td><td>Yes – This change retires legacy audit log cmdlets and shifts audit access to the unified audit log.</td></tr>\n<tr><td>eDiscovery or Content Search</td><td>Yes – Organizations must use Search-UnifiedAuditLog for audit log searches going forward.</td></tr>\n<tr><td>Retention policies, holds, or deletion workflows</td><td>Yes – Mailbox audit logs become static and read-only after March 2025.</td></tr>\n<tr><td>Admin monitoring and reporting</td><td>Yes – Admins must update monitoring tools and reports to use the unified audit log.</td></tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Search-MailboxAuditLog and New-MailboxAuditLogSearch cmdlets will retire by December 2025. After March 1, 2025, mailbox audit logs become read-only. Organizations must transition to the Search-UnifiedAuditLog cmdlet for audit access, with migration support available from June 2025."
    }
  ],
  "EndDateTime": "2026-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1126353",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-31T23:20:03.853Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-31T23:19:56Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Retirement of Search-MailboxAuditLog and New-MailboxAuditLogSearch Cmdlets by End of 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
