{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 18, 2025: We have updated the timing and content below with additional information. Thank you for your patience.</p>\n<p>In response to customer feedback, we are introducing enhanced flexibility, greater scalability, and streamlined compliance management for private channels in Microsoft Teams.\n</p><p>Note: It is important for compliance managers to review and take appropriate action before migration starts for these changes to private channels. \n</p><p><b>What's changing?</b></p><p>Private channels will transition use a channel mailbox instead of individual user mailboxes. \n</p><p>Organizations with compliance policies (retention, legal hold, data loss prevention, or eDiscovery) for private channels must review these policies and must apply policies to the Microsoft 365 group for the channel’s team before migration begins to ensure continuity of the policy for a private channel.  Existing policies will continue to apply to user mailboxes; post-migration, new data will be governed by policies on the group. Note that policies applied to the team’s group can apply to all channels in the team.\n</p><p>After the transition to updated private channels in your organization, private channels will be updated as follows.\n</p><ol><li>Private channels are no longer limited to 30 per team. Instead, private channels can be added up to the limit of 1000 total channels per team.\n</li><li>Private channels can now have up to 5000 members, instead of 250.\n</li><li>Meetings can now be scheduled in private channels.\n</li><li>Compliance policies for private channels are part of the team’s group policies instead of the individual user level.\n</li></ol><p>The migration of private channels to the updated capabilities will begin in early October 2025 and continue through December 2025. During this period, private channels will continue to operate normally. Admins and compliance managers should complete any required policy changes by September 20, 2025, before the migration begins. Migration can start or end at different times for each tenant during the rollout period. To track progress, a new PowerShell command will be available for tenants to check whether their migration has started or is completed. This post will be updated soon with details on the PowerShell command.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early October 2025 (prevously late September) and expect to complete by mid-December 2025.\n</p><p><b>Action required by compliance managers and admins</b></p><ol><li>Purview eDiscovery and Legal Hold</li>\n<p></p><p>With this change, private channel data will move from user mailboxes to the group mailbox, aligning with how shared channels data is stored. Previously, legal holds were applied to user mailboxes since private channel data resided in each member’s mailbox. Post-migration, the latest version of private channel message data from each user’s mailbox is moved to the private channel’s group mailbox. Message edits and deleted messages will not be copied into the group mailbox.\n</p><p>Note: For users on hold, copies of message edits and deleted messages will remain in the user’s preserved library folder until the hold expires, while the latest version of private channel message data from each user’s mailbox is copied to the private channel’s group mailbox. \n</p><p>Before migration\n</p><p>If a legal hold exists for a private channel, admins must also apply the policy to the team’s group, in addition to the policy already applied to users’ mailboxes, in order for a hold to apply to new data generated and stored in the private channel’s mailbox. Note that policies applied to the team’s group can apply to all channels in the team.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/752d2d97-48d7-4491-a3e7-ecc866373a44  \" width=\"400\" height=\"\"></p><p>Screenshot 1: Setting up a new hold in Microsoft Purview compliance portal.\n</p><p>After migration\n</p><p>For existing holds admins will need to ensure that the hold is applied to the user mailbox as well as the new group mailbox, in order for a hold to apply to existing and new message data. Any new legal holds will need to be applied to the group.\n</p><p>For complete eDiscovery, include both the private channel’s users’ mailboxes and the team’s group mailbox to retrieve pre-migration messages, message history, and post-migration new content.\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/0de1f667-c352-400b-8a94-57237676a30d  \" width=\"400\" height=\"\"></p><p>Screenshot 2: Configuring an eDiscovery search in Microsoft Purview compliance portal.\n</p><li>Purview Data Loss Prevention (DLP)</li> \n<p></p><p>With this change, private channel messages will be included as a part of the DLP policy scoped to the private channel’s team’s group, as opposed to the user mailbox. \n</p><p>Before migration\n</p><p>Admins must modify the “Teams chat and channel messages” policy for private channels to add the team’s group containing the private channel, in addition to the user mailbox, in order to include new private channel messages in a policy. Note that policies applied to the team’s group can apply to all channels in the team.\n</p><p>After migration\n</p><p>Ensure that “Teams chat and channel messages” policy for private channels is scoped to the team’s group containing the private channel. \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/96d2a6b8-fdf0-402c-8475-d8631fe4ae2b \" width=\"400\" height=\"\"></p><p>Screenshot 3: Configuring a data loss prevention policy in Microsoft Purview compliance portal.\n</p><li>Purview Retention Policy</li>\n<p></p><p>After this change, creation of new private channel-specific policies will not be possible in the Purview portal. Instead, “Teams channel messages” policies applied to the team’s group will now include private channels. Existing private channel policies will remain in effect and preserve all held message data in user mailboxes. Editing of existing policies will not be supported but policies can be removed.\n</p><p>Before migration\n</p><p>Apply current private channel retention policies (previously on user mailboxes) to Teams channel messages to include the team’s group, in order to include new private channel messages in a policy. In Microsoft Purview compliance portal, go to solutions &gt; Data Lifecycle Management &gt; Retention policies. Note that policies applied to the team’s group can apply to all channels in the team. \n</p><p>After migration\n</p><p>If the parent team’s group retention policy differs from the private channel’s policy, create a new or equivalent policy to ensure consistent retention.</p><p> \n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/c565bdcb-1dbc-4f94-b060-b5bbc96d368a \" width=\"400\" height=\"\"></p><p>Screenshot 4: Configuring “Teams channel messages” for a retention policy in Microsoft Purview compliance portal.</p>\n<li>Microsoft policies for Optical Character Recognition</li>\n<br><p>Optical character recognition (OCR) is managed via Data Loss Prevention (DLP) policy. Before migration, modify the corresponding DLP policy that needs be applied for OCR to private channels and change locations to all users and groups.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/333895ed-38b5-4688-8357-a7badd5978d0/5bfd9ef4fa9f2655891b6438f46ff9a9073ed02c.png \" width=\"400\" height=\"\"></p>\n</ol><p>Frequently asked questions\n</p><ol><li>How can admins identify a user’s private channel memberships?\n<ul><li>Use Teams Admin Center under team settings, or run PowerShell: Get-TeamChannelUser to list members.\n</li></ul></li><li>When is compliance manager action required?\n<ul><li>If a policy (legal hold, eDiscovery, retention, DLP) applied to a user’s mailbox, in order to include private channel messages, differs from the team policies for the team hosting the private channel. Policies must be applied to the team’s group in order to include new private channel messages in a policy. Note that policies applied to the team’s group can apply to all channels in the team.</li><li>During eDiscovery for users on hold or during migration, search both user mailbox and group mailbox for complete data on a private channel.</li></ul></li><li>What if no action is taken?\n<ul><li>User-level policies will not apply to a private channel’s new message data. Team-level policies will apply to private channels. \n</li></ul></li><li>Why isn’t Microsoft automatically applying policies from user mailboxes to a private channel’s team?\n<ul><li>Tenant admins and compliance managers must assess and apply policies as needed. Group policies apply to all channels in the Team. Some user mailbox policies are intended for all of a user’s messages, and some are intended for private channel messages. Each organization must review and decide on policies.\n</li></ul></li><li>Is there any impact to end users?\n<ul><li>During migration, users may see duplicate search results in Teams searches—both links will navigate to the same content in Microsoft Teams.\n</li></ul></li><li>When will migration happen for my tenant and how long will it take?<ul><li>Migration can start or end at different times for each tenant during the rollout period and can take some weeks depending of the tenant. To track progress, a new PowerShell command will be available for tenants to check whether their migration has started or is completed. The command will be:\n<p><code>Get-TenantPrivateChannelMigrationStatus -TenantId <tenantId></code></p>\n</li></ul></li></ol><p>Please refer to this blog post for more information: <a href=\"https://techcommunity.microsoft.com/blog/microsoftteamsblog/unlocking-the-full-potential-of-private-channels-in-microsoft-teams/4438767\" target=\"_blank\">New enhancements in Private Channels in Microsoft Teams unlock their full potential</a>&nbsp;</p><p>We appreciate your attention to this important update.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams private channels will transition to using a channel mailbox, increasing limits to 1000 channels per team and 5000 members per channel, with meetings supported. Compliance policies will shift from user mailboxes to the team’s group mailbox. Migration starts October 2025; admins must update policies by September 20, 2025."
    }
  ],
  "EndDateTime": "2026-02-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134737",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-09-18T22:50:38.923Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-13T23:09:57Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Private channels increased limits and transition to group compliance",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
