{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 9, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction\n</b></p><p>To ensure optimal performance and security, Outlook for iOS will update its minimum supported operating system requirements. Following the release of iOS 26, Outlook for iOS will only support the two most recent versions of iOS, iPadOS, and watchOS. This change aligns with Microsoft’s commitment to supporting the latest Apple platforms.\n</p><p><b>When this will happen</b></p><p>Rollout will begin in late September 2025 (previously early September) and is expected to complete by late September 2025.\n</p><p><b>How this affects your organization\n</b></p><p>Once iOS 26 is generally available:\n</p><ul><li>Outlook for iOS will no longer receive updates on devices running iOS 17 or earlier.\n</li><li>Users on iOS 17 can continue using the last supported version of Outlook, but over time, the app may stop syncing email and calendar data.\n</li><li>iPadOS 17 and watchOS 10 will also be retired. Supported versions will include iPadOS 18 and 26, and watchOS 11 and 26.\n</li><li>This change does not affect users running iOS 18 or later.\n</li></ul><p><b>What you can do to prepare\n</b></p><ul><li>Notify users of the upcoming OS requirement changes.\n</li><li>Encourage users to upgrade their devices to iOS 18 or later to continue receiving Outlook updates and ensure uninterrupted service.</li></ul><p><b style=\"\">Compliance considerations\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook for iOS will require iOS 18 or later starting late September 2025, dropping support for iOS 17 and earlier. Users on unsupported versions may face syncing issues. iPadOS 17 and watchOS 10 support will also end. Organizations should notify users to upgrade devices accordingly."
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1131777",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-09T19:39:22.04Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-08T23:42:44Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Outlook for iOS: Minimum system requirements updated to iOS 18 and above",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
