{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Expected in mid-February 2026, as part of our modernization efforts, we are updating the Intune Data Warehouse with a new architecture to enhance scalability, performance, and align with the reporting infrastructure. The Intune Data Warehouse provides structured access to historical Intune data through an OData API, enabling you to build custom reports and dashboards using tools like Power BI and Excel. This update includes several key changes to be aware of:</p><ul><li><b>Historical data reset:</b> Once updated, the data will be reset and there will only be approximately <b>30 days of data</b>.\n</li><li><b>Updated licensing definition:</b> The “IntuneLicensed” property will now include all forms of Intune licensing and grace periods.\n</li><li><b>Surrogate key refresh:</b> Surrogate keys will be regenerated as part of the infrastructure update.</li></ul><p><b>How this will affect your organization:</b>\n</p><p>If your organization is using the Intune Data Warehouse you will need to be aware of this upcoming change. Additionally, if you are using the Intune Data Warehouse (beta) Power BI connector, support for this connector will be discontinued. A new connector will be available, requiring use of the OData feed link within the Intune admin center.</p><p><b>What you need to do to prepare:</b>\n</p><ul><li>Ensure your reporting tools are configured to use the OData feed from the Intune admin center.\n</li><li>If you are using the Intune Data Warehouse (beta) Power BI connector, transfer to the OData feed. For instructions refer to: <a href=\"https://learn.microsoft.com/intune/intune-service/developer/reports-proc-create-with-odata#connect-to-the-odata-feed-for-the-intune-data-warehouse-for-your-tenant\" target=\"_blank\">Connect to the OData feed for the Intune Data Warehouse for your tenant</a>\n</li><li>Back up any historical data you wish to retain before this update.\n</li><li>Review any dependencies on surrogate keys and prepare for key refreshes.\n</li><li>Familiarize yourself with the updated licensing definitions and reporting behavior.\n</li></ul><p><b>Additional information:</b></p><p>For more details on the data warehouse and alternative solutions, please refer to: \n</p><ul><li><a href=\"https://learn.microsoft.com/intune/intune-service/developer/reports-api-url\" target=\"_blank\">Intune Data Warehouse API Endpoint </a></li><li><a href=\"https://techcommunity.microsoft.com/blog/intunecustomersuccess/integrating-azure-data-factory-and-the-microsoft-intune-export-api/4093359\" target=\"_blank\">Integrating Azure Data Factory and the Microsoft Intune Export API</a></li></ul><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In mid-February 2026, the Intune Data Warehouse will be updated with a new architecture, resetting historical data to about 30 days, changing licensing definitions, and regenerating surrogate keys. The Intune Data Warehouse (beta) Power BI connector will be discontinued; users must switch to the OData feed."
    }
  ],
  "EndDateTime": "2026-04-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1188216",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-19T23:21:18.677Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-19T23:21:07Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Plan for Change: Update to Intune Data Warehouse infrastructure",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
