{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 2, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>Starting in January 2026, Microsoft will move back to legacy behavior of the <i style=\"\">Reuse Slides</i> feature from PowerPoint for Windows and Mac desktops, only allowing users to reuse slides from local files. This change is part of ongoing efforts to simplify the PowerPoint experience and remove features that duplicate existing capabilities.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n<li>General Availability (Worldwide): We will begin retiring this feature starting in December 2025 and expect to complete in January 2026.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> All users of PowerPoint on Windows and Mac desktops.</li>\n<li><b>What will happen:</b>\n  <ul>\n    <li>The Reuse Slides option will only allow users to reuse slides from presentations saved locally.</li>\n    <li>The modern feature with ability to reuse slides from cloud files will no longer be supported or accessible.</li>\n    <li>No admin controls are available to retain or re-enable the feature.</li>\n  </ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Communicate this change to helpdesk staff.</li>\n<li>Update internal documentation or training materials that reference the <i>Reuse Slides</i> feature.</li>\n<li>If your organization relies on slide reuse workflows, consider alternative methods such as manually copying slides between presentations.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting January 2026, PowerPoint's \"Reuse Slides\" feature will only support slides from local files, retiring cloud-based reuse. This affects all Windows and Mac desktop users, with no admin controls to revert. Organizations should update documentation and consider alternative slide reuse methods."
    }
  ],
  "EndDateTime": "2026-02-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1179161",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-02T22:31:45.177Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-24T22:12:41Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft PowerPoint: \"Reuse Slides\" feature will retire starting 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
