{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing the new Microsoft Places Management web portal—a centralized, intuitive interface that simplifies how administrators manage Places directory data. This new experience replaces the need for PowerShell scripts, offering a more visual and user-friendly way to manage buildings, floors, rooms, and desks.\n</p><p>This new Microsoft Places Management portal can be accessed via the admin view in the Places app or Place Web, within the Space Management tab for those who have the appropriate RBAC permissions mentioned later in this message:</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=487860\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">487860</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out on mid-August 2025 and expect to complete by late August 2025.</p><p><b>How this will affect your organization:</b></p><p></p><p>This update impacts Microsoft Places administrators. The new web portal provides a streamlined experience to:\n</p><ul><li>View a hierarchical list of spaces (buildings, floors, desk-pools, rooms, desks).\n</li><li>Filter buildings by country, state/province, or city, and refine by floor, section, object type, or modes.\n</li><li>Create, delete, or re-parent space objects (based on permissions).\n</li><li>Edit metadata and configure booking settings (based on permissions).\n</li></ul><p>The portal is on by default and available to Global admins, Exchange Online admins, and the newly introduced Places Admin role. No additional setup is required.</p><p><b>What you need to do to prepare:</b></p><p></p><p>No action is needed to enable this feature. Admins can begin using the portal as soon as it becomes available. A Learn article with detailed guidance is in development and will be shared in a future update.</p><p><b>Compliance considerations:</b></p><ul><li>Does the change alter how existing customer data is processed, stored, or accessed?\tYes – Places directory data is now managed via a new interface.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "487860"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is launching the Microsoft Places Management web portal in August 2025, replacing PowerShell scripts with a user-friendly interface for managing buildings, floors, rooms, and desks. Accessible to specific admin roles by default, it offers hierarchical views, filtering, and editing based on permissions, with no setup needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1122163",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-25T22:37:45.793Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-25T22:37:40Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Places Management web portal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
