{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We are enhancing the hybrid meeting experience in Microsoft Teams Rooms with the introduction of the <i>Facilitator Agent</i>. When a <i>Facilitator Agent</i> is invited to a scheduled meeting, participants joining from a Teams Rooms device will see a more structured and interactive view on the front-of-room display. This includes the agent's chat interactions, real-time AI-generated notes, and an agenda timer.\n</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=499891\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">499891</a>.</p><p><b>When this will happen</b></p><p>Public Preview (Worldwide): Rollout began late March 2025 and completes by late September 2025.</p><p>General Availability (Worldwide): Rollout begins late September 2025 and completes by late October 2025.</p><p><b>Meeting experience:</b></p><ul><li>In-room participants will have controls on the center-of-room console to toggle the main screen between the <i>AI notes</i> and the <i>meeting chat.</i></li><li>Users can also view or dismiss the <i>agenda timer</i>.</li><li>This allows for a more focused and productive meeting environment.</li></ul><p><b>What you can do to prepare</b></p><p>No action is needed</p><p><b>Compliance considerations</b></p>No compliance considerations identified, review as appropriate for your organization.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "499891"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows will support a Facilitator Agent in meetings, providing AI-generated notes, chat interactions, and an agenda timer on the front-of-room display. Rollout starts March 2025 (preview) and completes October 2025 (general availability). No action or compliance concerns required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-12-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1144653",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-29T23:38:00.037Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-29T23:37:23Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Teams Rooms on Windows: Support for facilitator agent in scheduled and ad hoc meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
