{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 22, 2025: After further review, this has been delayed to a later date. We apologize for any inconvenience.</p><p><b>Introduction</b></p><p>We're enhancing the quarantine experience in Microsoft Defender and Exchange Online to improve visibility and control over items that have been temporarily deleted. With this update, users will be able to view and restore messages that were previously removed from the quarantine view but still exist in the system.</p><p><b>When this will happen</b></p><ul><li>General Availability (Worldwide): We will communicate via Message center when we are ready to proceed.&nbsp;</li><li>General Availability (GCC, GCC High, DoD): We will communicate via Message center when we are ready to proceed.</li></ul><p><b>How this affects your organization</b></p><p>Users in both Microsoft Defender and Exchange Online quarantine portals will gain the ability to:</p><ul><li>View messages that were temporarily deleted from quarantine using the new Temporarily deleted filter under Release Status.</li><li>Restore these messages back to the quarantine view using the new Restore temporarily deleted option.</li></ul><p>Messages that have been permanently deleted will remain inaccessible. This feature is on by default and applies only to temporarily deleted items.</p><p><b>What you can do to prepare</b></p><ul><li>Inform users about the new filter and restore option to reduce confusion and potential help desk calls.</li><li>Update internal documentation or training materials to reflect the new functionality.</li><li>Monitor user feedback and usage to determine if additional guidance or support is needed.</li></ul><p>No configuration changes are required to enable this feature.</p><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The update to Microsoft Defender and Exchange Online quarantine will allow users to view and restore temporarily deleted messages via a new filter and restore option. The release has been delayed, no configuration is needed, and permanently deleted messages remain inaccessible. Users should be informed and documentation updated."
    }
  ],
  "EndDateTime": "2025-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134736",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-22T18:39:13.903Z",
  "Services": [
    "Exchange Online",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-13T23:09:13Z",
  "Tags": [
    "Updated message",
    "Feature update"
  ],
  "Title": "Quarantine experience update in Microsoft Defender and Exchange Online: Restore temporarily deleted items",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
