{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We are resurfacing MC670435, published September 2023 to remind admins of the Microsoft Teams Premium self-service trial capability. This message serves as a reminder as we begin a broader rollout of the feature announced in 2023.</p><p>\n</p><p><b>When this will happen:</b></p><p>Ongoing rollout.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>When rolled out, users within your organization will be able to directly initiate a Teams Premium trial. These self-service trial licenses will be a part of your Microsoft organizational tenant, and you will be able to manage these licenses like other Microsoft subscriptions. You will be able to cancel these trial licenses at any time.</p><p>You will also be able to fully control whether trials are converted to paid subscriptions. Users will not need to input payment information when signing up. If a user would like to convert to a paid license, they must work with you directly to do so as there is no auto-renew functionality for these trials. If a user isn’t upgraded to a paid subscription, all services included in their Microsoft Teams Premium will end, and the user may lose read only access to data generated by Teams Premium, stored in Microsoft Teams, OneDrive, and SharePoint.<br></p><p>Users in tenants where self-service trials are disabled may still see the “Get Premium” prompt when accessing features that require a premium license. This is expected behavior and helps signal user interest to admins. It can also help identify which users in your organization may need a Teams Premium license, allowing you to better manage and allocate your available licenses.&nbsp; To reduce confusion and prevent users from submitting license requests, admins can customize the license request flow. Instead of showing the default request form, they can configure a custom message explaining that license requests are not supported in their organization. For setup instructions, see <a href=\"https://learn.microsoft.com/en-us/microsoft-365/commerce/licenses/manage-license-requests?view=o365-worldwide#use-your-own-request-process\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Use your own request process – Microsoft Learn</a>.</p><p>Microsoft Teams Premium helps make your Teams meetings more intelligent, protected, and engaging. Unlike other meeting and collaboration tools, Teams Premium brings advanced capabilities for meetings, virtual appointments, and webinars together for one low cost. You can learn more about Teams Premium<a href=\"https://www.microsoft.com/en-us/microsoft-teams/premium\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\"> here</a>.</p><p>The customer data for all services associated with the Microsoft Teams Premium trial will be handled in accordance with the <a href=\"https://www.microsoft.com/licensing/terms/welcome/WelcomePage?programMoniker=MOSA\" target=\"_blank\">Microsoft Online Subscription Agreement</a> and the <a href=\"https://www.microsoft.com/licensing/terms/welcome/welcomepage\" target=\"_blank\">Product Terms</a>.</p><p><b>What you need to do to prepare:</b></p><p>Global or billing admins can use the same <a href=\"https://learn.microsoft.com/microsoft-365/commerce/subscriptions/allowselfservicepurchase-powershell?view=o365-worldwide\" target=\"_blank\">self-service purchase controls</a> to disable self-service trials while making use of subscription management capabilities to oversee and manage trial licenses on the <a href=\"https://go.microsoft.com/fwlink/p/?linkid=842264\" target=\"_blank\">Your Products</a> page in the Billing section of Microsoft 365 admin center.</p><p>Note: This is a new Teams Premium trial and is enabled or disabled independently of past trial offerings.</p><p>Review our updated self-service purchase and trial documentation <a href=\"https://learn.microsoft.com/microsoft-365/commerce/subscriptions/manage-self-service-purchases-admins?view=o365-worldwide%22%20HYPERLINK%20%22https://learn.microsoft.com/en-us/microsoft-365/commerce/subscriptions/manage-self-service-purchases-admins?view=o365-worldwide\" target=\"_blank\">here</a>. We’ve added important information about the way trials work, the data that is collected, and the terms that apply.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is rolling out Microsoft Teams Premium self-service trials, allowing users to start trials managed within the organization's tenant. Admins can control trial activation, conversion to paid subscriptions, and customize license request flows. Data handling follows Microsoft agreements, and admins can disable trials via self-service purchase controls."
    }
  ],
  "EndDateTime": "2027-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181209",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-29T00:22:34.997Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-29T00:22:25Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "[Reminder] Microsoft Teams Premium Self-Service Trials (Originally announced in MC670435)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
