{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Agent Mode</b> in PowerPoint for&nbsp;<i>Microsoft 365 Copilot&nbsp;</i>introduces a conversational way to edit presentations while preserving your deck’s formatting, structure, and branding. This feature enables users to guide Copilot to directly update slides, refine layouts, and iterate on content using enterprise data—helping them focus on ideas and present with confidence.</p><p>To access this feature, you must have a Microsoft 365 Copilot license and be enrolled in the <i>Insiders Beta Channel</i>.</p>\n\n<b>When this will happen:</b>\n<ul>\n<li><b>Frontier Public rollout: </b>Begins in mid-November 2025 for Windows users in the<i> Insiders Beta Channel.</i></li>\n</ul>\n\n<b>How this affects your organization:</b>\n<ul>\n<li><i>Who is affected:</i> Users in your organization who use PowerPoint on Windows and are part of the Insiders Beta Channel.</li>\n<li><i>What will happen:</i>\n  <ul>\n    <li>Users will gain access to Agent Mode in <i>Microsoft 365 Copilot for PowerPoint:</i></li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/6a39dbd7-78f9-4d77-b43f-9a34a9aa9866/a748094affdbe7f4ec0d71d5a15702e2e330184e.png\" alt=\"user settings\" style=\"width: 400px;\"></p><li>They can interact with Copilot via chat to edit and refine presentation content.</li>\n    <li>Formatting and branding will be preserved.</li>\n    <li>Enterprise data can be used to enhance slides.</li>\n    <li>Feature is <b>available by default </b>for eligible users.</li></ul></li></ul><p><i><b>Note: </b>Agent Mode is a Copilot Chat feature in PowerPoint that lets Copilot edit presentations directly. It isn’t available as a standalone feature in PowerPoint.</i></p><p></p><ul>\n  </ul>\n<p></p><ul>\n</ul>\n\n<b>What you can do to prepare:</b>\n<ul>\n<li>No action is required to enable the feature.</li>\n<li>Consider communicating the availability of Agent Mode to helpdesk staff and other users.</li>\n<li>Encourage users to explore the feature to improve presentation workflows.</li>\n<li>Review internal documentation if you provide guidance on PowerPoint or Copilot usage.</li></ul><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/topic/agent-mode-frontier-in-powerpoint-008f17aa-8e5f-4cda-ba6c-0588000bdad7\" target=\"_blank\">Agent Mode (Frontier) in PowerPoint | Microsoft Support</a></p><ul>\n</ul>\n\n<b>Compliance considerations:</b><table class=\"table table-bordered\"><tbody><tr><td><b>Question</b></td><td><b>Answer</b></td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>Yes. Agent Mode in <i>Microsoft 365 Copilot </i>introduces generative AI capabilities that allow users to interact with presentation content and enterprise data through chat-based commands.</td></tr><tr><td>Does the change provide users any new way of interacting with generative AI?</td><td>Yes. Users can now guide Microsoft 365 Copilot in <i>PowerPoint </i>using natural language chat to edit presentations.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Yes. Users can choose whether to engage with Agent Mode in <i>Microsoft 365 Copilot </i>within <i>PowerPoint</i>.</td></tr></tbody></table><p><br></p><ul>\n</ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Agent Mode in Microsoft 365 Copilot for PowerPoint allows users to edit presentations conversationally while preserving formatting and branding. Available mid-November 2025 for Windows Insiders Beta Channel users with a Copilot license, it uses enterprise data to enhance slides and is enabled by default."
    }
  ],
  "EndDateTime": "2025-12-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187796",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-18T20:48:49.833Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T20:48:18Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft PowerPoint: Agent Mode in Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
