{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to customize fields in the card layout and the open behavior for conversation messaging channels to help customer service representatives increase productivity in Dynamics 365 Contact Center. This feature will reach general availability on October 31, 2025.<br><br><b>How does this affect me?</b><br>These enhancements let administrators configure the channel open experience and conversation card fields in the following ways:<ul><li>Customer service representatives can filter and sort based on user groups.</li><li>Administrators can enable intent-based routing for the inbox by bringing in user group support in line with the existing queue support.</li><li>Administrators can configure the open behavior of conversation messaging channels (other than voice) to open as a new session and within the inbox.</li><li>Administrators can configure the card layout that is displayed in the inbox for the conversation entity by adding, removing, or reordering fields.</li></ul>These enhancements can help customer service representatives be more productive by giving them the option to filter and sort in the inbox based on their needs.<br><br><b>What action do I need to take?</b><br>This message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-10-30T14:33:24Z",
  "HasAttachments": false,
  "Id": "MC1162743",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-09-30T14:34:12.83Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-09-30T14:33:24Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Boost service representative productivity with inbox enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
