{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 11, 2025: We have updated the timeline. Thank you for your patience.</p><p><b>Introduction</b></p><p>Microsoft Edge is introducing AI-powered History search to help users rediscover previously visited sites more easily. This enhanced experience uses an on-device model to understand synonyms, natural language, and minor typos—making it easier to find what you’re looking for. The model is trained locally using your browsing data, which never leaves the device or is sent to Microsoft.\n</p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=495834\" target=\"_blank\">495834</a>.</p><p><b>When this will happen\n</b></p><p><b>General Availability (Worldwide):</b> We will begin rolling out in late August 2025 (previously early August) and expect to complete by late September 2025 (previously early September).</p><p><b>How this will affect your organization</b></p><p>This feature is controlled by the<b> “Enable History search assisted with AI”</b> toggle in Edge settings. Once rollout is complete, the toggle will be <b>on by default</b>.</p><ul><li>After users open their History hub (via Settings and more “...”, then History, or by visiting edge://history), all subsequent website visits will be eligible for semantic search.\n</li><li>Users will be able to search their history using synonyms, natural language phrases, and minor spelling errors.\n</li></ul><p>Admins can manage AI-enhanced search in their browsing history in Microsoft Edge behavior using the <b>EdgeHistoryAISearchEnabled policy</b>.</p><ul><li>If the policy is <b>enabled</b> or <b>not configured</b>, AI-powered search is available.\n</li><li>If the policy is <b>disabled</b>, users will only be able to perform exact match (verbatim) searches.</li></ul><p><b>Known limitations at launch:\n</b></p><p>This feature will be available on Windows desktop only. There may be mobile parity gaps and unsupported environments on other platforms.</p><p><i>Screenshot of the “Enable history search assisted with AI” toggle in Microsoft Edge. This setting, found under Settings &gt; Privacy, search, and services &gt; Address bar and search &gt; History search, controls whether users can perform AI-powered semantic searches in their browsing history.</i></p><p><i>&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/26fd77ac-18f2-4f92-a21b-b8bb55433b7d/51dac43c377d62dc5a2af7122a673702383f3916.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p><i>Screenshot of the new AI-powered History search experience in Microsoft Edge:&nbsp;</i><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/2d5a931d-a151-45f6-acb5-fc0a9046df39/45ddb959a14855fa54b19b439aab6c353ccc27f2.png\" alt=\"user settings\" style=\"width: 700px;\"></p><p><b>What you need to do to prepare</b></p><p>No admin action is required before rollout. However, we recommend:\n</p><ul><li>Reviewing your current Edge policy configurations.\n</li><li>Notifying users about the new search experience.\n</li><li>Updating internal documentation as needed.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-browser-policies/edgehistoryaisearchenabled\" target=\"_blank\">EdgeHistoryAISearchEnabled | Microsoft Edge | Microsoft Learn</a></p><p><b>Compliance considerations</b></p><table class=\"table table-bordered\"><tbody><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with or provide access to customer data?</td><td>This change introduces a new on-device AI model that enables semantic search of browsing history. The model processes customer data locally and does not transmit it to Microsoft.</td></tr><tr><td>Does the change include an admin control and can it be controlled through Entra ID group membership?</td><td>Administrators can manage this feature using the EdgeHistoryAISearchEnabled policy. This policy can be scoped using Entra ID group membership.</td></tr><tr><td>Does the change allow a user to enable and disable the feature themselves?</td><td>Users can enable or disable the feature through the “Enable History search assisted with AI” toggle in Microsoft Edge settings.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "495834"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Edge will roll out AI-powered History search from late August to late September 2025, enabling semantic search of browsing history using an on-device AI model. The feature is on by default, controlled by a toggle and admin policy, available on Windows desktop only, with no data sent to Microsoft."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1130387",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-11T20:37:10.637Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-06T23:31:05Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge: AI-powered History search now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
