{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 8, 2025: We have updated the title. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b>\n</b></p><p>We’re adding more customization to your <b>communities in the Viva Engage app for Microsoft Teams in iOS</b>. Soon, as a community admin, you’ll be able to update your communities' cover photos directly from the Teams iOS app. This feature is already available on Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for Android, and supports a consistent and personalized experience across platforms.</p><p>Screenshot 1: <i>A community's cover photo, with options to <b>Take a photo </b>or <b>Upload a picture.</b></i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/bc9212a0-b127-44de-869a-453525cd54a1\" style=\"width: 250px;\" alt=\"user settings\"></p><p>This message is associated with Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=526783\" target=\"_blank\" style=\"\">526783</a>.</p><p><b><b>When this will happen:</b>\n</b></p><p>General Availability (Worldwide): We will begin rolling out in late December 2025 and expect to complete by early January 2026.</p><p>\n</p><p><b><b>How this will affect your organization:</b>\n</b></p><p><b>Who is affected: </b>All Viva Engage community admins<b>&nbsp;</b>using the Viva Engage app in Microsoft Teams.</p><p><b>What will happen:\n</b></p><ul><li>Users will be able to update<b> community cover photos</b> directly from the Teams iOS app.\n</li><li>This feature is <b>enabled by default </b>and does not require admin configuration.\n</li><li>There is no change to existing admin policies or controls.\n</li></ul><p><b><b>What you can do to prepare:</b></b></p><ul><li>Update any internal documentation that references <b>community customization</b>.\n</li><li>No admin action is required to enable this feature.\n</li></ul><p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "526783"
    },
    {
      "Name": "Summary",
      "Value": "Viva Engage community admins can soon update community cover photos directly from the Teams iOS app, aligning with existing desktop, web, and Android capabilities. This feature, enabled by default, will roll out worldwide from late December 2025 to early January 2026, requiring no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "iOS"
    }
  ],
  "EndDateTime": "2026-02-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1191346",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-08T18:49:28.013Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-01T23:56:47Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Engage: Update community cover photos in Teams for iOS.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
