{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re introducing new admin controls for Microsoft Clipchamp and Microsoft Stream to simplify governance and enhance compliance. This update adds five new policy settings that allow administrators to manage video creation and distribution features across both platforms.\n</p><p>This update is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468891\" target=\"_blank\">468891</a>.\n</p><p><b>When this will happen\n</b></p><p>This feature is available now.</p><p><b>How this affects your organization</b></p><p>Admins will gain expanded control over video-related features in Clipchamp and Stream through five new policy settings in the Microsoft 365 Admin Center. These policies support tenant-level enforcement for compliance, security, and governance goals.\n</p><p>The following capabilities can now be enabled or disabled:\n</p><ul><li>AI text-to-speech in Clipchamp\n</li><li>Webcam recording in Clipchamp and Stream\n</li><li>Screen recording in Clipchamp and Stream\n</li><li>Local video downloads in Clipchamp and Stream\n</li><li>User-initiated upgrades to Clipchamp Premium\n</li></ul><p>Once configured, these policies will automatically hide or disable related UI elements across supported surfaces, including the Stream recording tool and Clipchamp video editor.\n</p><p><i>Note: </i>The audio recording policy has been removed from this initial release due to technical blockers. We aim to resolve these issues by the end of CY25 and will provide updates as available.\n</p><p><b>What you can do to prepare\n</b></p><p>No action is required to prepare. These capabilities will be rolled out automatically to your tenant. Admins can configure the new policies in the Microsoft 365 Admin Center once available.</p><p><b>Compliance considerations</b></p><h3><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\" style=\"color: rgb(0, 0, 0); font-family: sans-serif; font-size: 14px;\"><tbody><tr><th>Compliance Area</th><th>Explanation</th></tr><tr><td>AI/ML capabilities</td><td>Introduces admin control over AI text-to-speech in Clipchamp.</td></tr><tr><td>Admin control via Entra ID</td><td>Policies can be enforced at the tenant level and may be scoped using Entra ID group membership.</td></tr><tr><td>Feature enablement by users</td><td>Admins can restrict user-initiated upgrades to Clipchamp Premium.</td></tr></tbody></table></h3>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468891"
    },
    {
      "Name": "Summary",
      "Value": "New admin controls in Microsoft Clipchamp and Stream allow management of video creation and distribution via five policy settings, including AI text-to-speech, webcam/screen recording, local downloads, and Clipchamp Premium upgrades. Policies enforce compliance by hiding or disabling related UI elements. Audio recording control is delayed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1131077",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-07T23:50:00.023Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-07T23:49:53Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "New admin policy controls for video creation and distribution in Microsoft Clipchamp and Microsoft Stream",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
