{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 6, 2025: We have updated the content. Thank you for your patience.&nbsp;</p><p>We’re updating how we bill for mid-term subscription changes to improve clarity and efficiency.</p><p><b>What’s changing:</b></p><p>Starting November 13, 2025 changes to existing subscriptions—such as adding or removing licenses, cancellations, and upgrades—will be billed the next day instead of at the beginning of the following month. This change ensures more timely and transparent billing, helping you better track and manage your subscription costs.&nbsp;</p><p><b>When this will happen:</b></p><p>When you see this change will depend on the country/region your account is in.&nbsp;</p><ul><li>Singapore and Italy: Nov 13&nbsp;</li><li>Asia-Pacific: Nov 18&nbsp;</li><li>Worldwide: Jan 6th</li></ul><p> <b>How this will affect your organization:</b>\n</p><p>If you have an account where your invoices start with a “G” and have purchased directly from Microsoft, your organization will be impacted by this change on the date the change is launched in your region. Purchases made through a partner or a volume licensing agreement are not impacted by this change.</p><p><b>Example \n</b></p><p><b>\n</b></p><p>If your account is in Singapore or Italy and you add a license to your subscription on November 13, you will receive an invoice for that additional license on November 14th. Any consumption charges for Azure will continue to be billed on the monthly invoice available at the beginning of the following month.&nbsp;</p><p><b>Additional details about this change&nbsp;</b></p><p>During the month your region transitions:&nbsp;</p><ul><li>If you make no changes after the transition, previous changes remain on their original invoice schedule.&nbsp;</li><li>If you make changes after the transition, any pending charges from before the transition are invoiced immediately. You’ll also receive a separate invoice for the new changes.</li></ul><p> <b>What you need to do to prepare:</b></p><p>No action is required. This update will be applied automatically to all eligible subscriptions.&nbsp;</p><p><br></p><p><br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting November 13, 2025, mid-term subscription changes will be billed the next day instead of the following month, improving billing transparency. The rollout dates vary by region, affecting direct Microsoft purchases with \"G\" invoices. No action is needed; changes apply automatically."
    }
  ],
  "EndDateTime": "2026-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1176303",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-11-06T17:00:35.38Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-20T18:38:34Z",
  "Tags": [
    "Updated message",
    "Admin impact"
  ],
  "Title": "We’re updating how we bill for mid-term subscription changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
