{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire the Technology Experience score and its three sub-scores (Network Connectivity, M365 Apps Health, and Endpoint Analytics) from Adoption Score in Microsoft 365 Admin Center starting Jan 15, 2026, and ending Jan 30, 2026.</p><p>After this change is made, the all-up Adoption Score will be equal to the People Experiences sub-score. This sub-score captures end user progress towards deeply embedding M365 and Copilot in their day-to-day productivity workflows. The total Adoption Score will reduce from a maximum of 900 to a maximum of 600. \n</p><p>This change will happen automatically by the specified date. To prepare for the change, inform any admins or report readers that regularly use Adoption Score that they will see change to their total Adoption Score value on the date of the change. End users are not impacted by this change.&nbsp;</p><p><b>\n</b></p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Technology Experience score and its sub-scores will be retired from the Microsoft 365 Adoption Score between Jan 15-30, 2026. The Adoption Score will then reflect only the People Experiences sub-score, reducing the maximum score from 900 to 600. This change is automatic and affects admins, not end users."
    }
  ],
  "EndDateTime": "2026-03-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1193412",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-09T00:15:51.99Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-09T00:15:32Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft 365 Admin Center: Retirement of Technology Experiences score from Adoption Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
