{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re excited to announce new enhancements to the rollback feature in <i>Cloud Update</i>, available in the <i>Microsoft 365 Apps admin center</i> (config.office.com). These updates provide IT admins with greater flexibility and control, making it even easier to keep Microsoft 365 Apps current, secure, and Copilot-ready, while ensuring a safety net for your organization.\n</p><p>With the latest improvements, you can now roll back updates by device, group, or across all eligible devices, helping you quickly address issues and maintain productivity with minimal disruption.</p><p>\n</p><p><b>When this will happen\n</b></p><p>Public Preview (Worldwide): The enhanced rollback experience is rolling out now and will be available to all Cloud Update customers over the coming weeks.\n</p><p><b>How this affects your organization\n</b></p><p>You’ll have new options available for rolling back devices, including support for Microsoft Entra ID groups and the ability to roll back all eligible devices. The experience is streamlined and integrated into the existing Monthly Enterprise profile page.</p><p>To access the new rollback capabilities:</p><ol><li>Navigate to the Microsoft 365 Apps admin center at <a href=\"https://config.office.com/.\" target=\"_blank\">https://config.office.com/.</a></li><li>From the navigation bar, expand Cloud Update and select Monthly Enterprise. If this is your first time visiting this experience, review the documentation in the Learn More section and enable Cloud Update.</li><li>From the Monthly Enterprise profile page, select <b>Actions </b>&gt; <b>Roll back devices</b>.</li></ol><p><b>Key benefits</b></p><ul><li>Rollback by group: Roll back updates for Microsoft Entra ID groups, ideal for scenarios affecting larger sets of users or devices.\n</li><li>Rollback all devices: Roll back updates for all devices on the latest Monthly Enterprise Channel release (N-0), eliminating the need for individual device or group management.</li><li>Resume by device: Resume updates for select devices to support testing and validation.</li><li>Resume all devices: Resume updates for all devices once you are ready to proceed with your rollout or resume automatically when the next update is available.</li></ul><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/aff8a6e6-8a26-4172-89d9-2c28922ddbae/227a17f78e2a4a1291ab08407138ced12acf61e2.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p></p><p><b>What you can do to prepare\n</b></p><ul><li>Review the new rollback options in the <i>Microsoft 365 Apps admin center</i>.\n</li><li>Ensure devices are on the Monthly Enterprise Channel and managed by Cloud Update.</li><li>Test the new group and all-device rollback scenarios in your environment.\n</li><li>Share your feedback. Your input is essential to help us refine these features before general availability. Use the feedback button in the <i>Microsoft 365 Apps&nbsp;admin center</i>.</li></ul><p><b>Learn more\n</b></p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/cloud-update\" target=\"_blank\">Overview of cloud update in the Microsoft 365 Apps admin center - Microsoft 365 Apps | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/best-practices/adopting-cloud-update\" target=\"_blank\">Enabling and configuring cloud update - Microsoft 365 Apps | Microsoft Learn</a></li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Apps admin center now offers enhanced rollback in Cloud Update (public preview), allowing IT admins to roll back updates by device, group, or all devices. This improves flexibility, control, and productivity while supporting Microsoft Entra ID groups and streamlined management via the Monthly Enterprise profile page."
    }
  ],
  "EndDateTime": "2026-01-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1187848",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-18T23:33:42.723Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-18T23:32:59Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Apps admin center: Enhanced rollback capabilities in Cloud Update (public preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
