{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p><p>We're introducing a new behavior in Outlook Mobile that improves draft handling. When users close a draft message in progress, it will now automatically minimize instead of closing completely. This allows users to quickly resume editing via a new button in the message list, enhancing productivity and reducing accidental draft loss.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): Rollout will begin in early September 2025 and is expected to complete by early March 2026.</p><p><b>How this affects your organization</b></p><p>Once this change is deployed, users will notice that closing a draft message no longer discards it or hides it from view. Instead, the draft will minimize and remain accessible via a button in the message list. This feature is on by default and does not require user or admin configuration.</p><p>This change is designed to reduce interruptions and improve the user experience by making draft recovery more intuitive.</p><p><b>What you can do to prepare</b></p><p>No admin action is required.</p><p>We recommend the following:</p><ul><li>Inform your users about this change to reduce confusion.</li><li>Update internal documentation or training materials where applicable.</li></ul><p><b>Compliance considerations</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook Mobile will automatically minimize draft messages when closed, allowing quick resumption via a button in the message list. This rollout starts September 2025, requires no admin action, and aims to improve draft handling and user productivity. Inform users and update documentation accordingly."
    }
  ],
  "EndDateTime": "2026-04-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1134174",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-12T23:03:28.427Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-08-12T23:03:20Z",
  "Tags": [
    "Feature update"
  ],
  "Title": "Outlook Mobile for iOS and Android: Draft messages now minimize automatically when closed",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
