{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction:\n</b></p><p>We're introducing a new feature in Outlook that helps users quickly find and access all files shared within a conversation thread. Instead of scrolling through individual messages to locate attachments, users will see a <b>Browse Files</b> button at the top of the conversation view that opens a consolidated list of all shared files. This feature is supported exclusively on Outlook for iOS and Android.</p><p><b></b><b>When this will happen:\n</b><b></b></p><p><b>General Availability (Worldwide, DoD, GCC, GCCH):</b> Rollout began in early July 2025 and completed in late July 2025.</p><p><b>How this affects your organization:\n</b></p><p>Once this feature is available, users who have set their Mail view to “Newest on Top” will see a new Browse Files button at the top of conversation threads. Selecting this button will display all classic attachments shared in that conversation, improving discoverability and productivity.\n</p><ul><li>The <b>Browse Files </b>button is <b>always visible</b> when the <b>“Newest on Top”</b> setting is enabled.\n</li><li>This feature is <b>exclusive to mobile clients</b>—only available in <b>Outlook for iOS and Outlook for Android</b>. It is <b>not supported</b> in Outlook on the web or desktop.\n</li><li>Users can only reference <b>local files</b> (classic attachments); links to files in <b>OneDrive or SharePoint </b>are not supported.\n</li><li>This feature is <b>on by default</b> and requires<b> no admin configuration</b>.</li></ul><p><i>New “Browse Files” button in conversation view:</i><i></i></p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/745a274e-5df6-45ff-b50a-10cf8f705b1c/d1ca48f19d28ef152833c9d9dfeae799940ee3c1.png\" style=\"width: 400px;\" alt=\"user settings\"><i></i></p><p><b></b></p><p><b></b></p><p><b></b></p><p></p><p></p><p><b>What you can do to prepare:</b></p><p>No admin action is required before the rollout.\n</p><p>Consider notifying your users about this update and updating any relevant training or documentation to reflect:\n</p><ul><li>The feature’s availability only on mobile clients.\n</li><li>The visibility condition tied to the “Newest on Top” setting.\n</li><li>The limitation to classic attachments (no cloud file links).</li></ul><p><b>Compliance considerations:\n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><p><i></i></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook for iOS and Android now features a \"Browse Files\" button in conversation threads (with \"Newest on Top\" view) to quickly access all classic attachments. This mobile-only feature rolled out worldwide in July 2025, requires no admin setup, and excludes OneDrive or SharePoint links."
    }
  ],
  "EndDateTime": "2025-08-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1120868",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-24T00:27:45.153Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-24T00:27:33Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Outlook for iOS and Android | Browse conversation files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
