{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re introducing a new “What’s New” section in Microsoft Teams Admin Center—a centralized hub designed to help Teams admins stay informed about recent and upcoming feature updates. This in-context experience consolidates key changes, admin controls, and learning resources, making it easier for IT admins to act quickly and confidently.</p>\n<p>With this new experience, admins can:</p>\n<ul>\n<li>View updates relevant to their tenant, including Teams and Teams Admin Center changes.</li>\n<li>Access new admin settings, policies, and Microsoft Learn resources.</li>\n<li>Check visibility for Targeted Release preferences.</li>\n</ul>\n<p>This means less time searching, more time acting—helping admins stay informed and ready for change.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p><b>General Availability (Worldwide):</b> Rollout will begin in <b>mid-November 2025</b> and is expected to complete by <b>early December 2025</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b> Admins managing Microsoft Teams via the Teams Admin Center.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>A new “What’s New” section will appear in the Teams Admin Center.</li>\n<li>Updates will be tailored to your tenant.</li>\n<li>Admins will see:\n  <ul>\n    <li>New admin controls</li>\n    <li>Links to relevant Message center posts</li>\n    <li>Microsoft Learn resources</li>\n    <li>Visibility into the tenant’s Targeted Release preference</li>\n  </ul>\n</li>\n<li>The feature is <b>on by default</b> and requires <b>no configuration</b>.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<p>No action is required to enable this feature.</p>\n<p>Admins are encouraged to:</p>\n<ul>\n<li>Explore the “What’s New” section to stay informed.</li>\n<li>Use the provided resources to plan rollouts effectively.</li>\n<li>Share this update with helpdesk or IT support teams as needed.</li>\n</ul>\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "A new “What’s New” section in the Teams Admin Center will launch worldwide from mid-November to early December 2025. It provides admins with tenant-specific updates, new controls, resources, and Targeted Release visibility. The feature is on by default, requires no setup, and helps admins stay informed and act quickly."
    }
  ],
  "EndDateTime": "2026-01-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1181208",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-10-29T00:22:05.96Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-10-29T00:21:59Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Teams admin center: \"What's New\" section",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
