{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 13, 2025: We have updated this message with additional information to clarify the Meeting joins experience. Thank you for your patience.</p><p><b>What and Who</b></p><p></p><p>To enhance the security and integrity of Microsoft Teams meetings, we are introducing a new feature that validates Teams meeting join URLs. This update helps ensure that meeting links are not altered or rewritten by security products in ways that could render them unusable or flagged as malicious.<b><br></b>\n\n</p><p><b>Rollout Schedule</b></p><p></p><ul><li><b>Worldwide:</b> September 30, 2025</li>\n<li><b>GCC, GCC High, DoD:</b> November 30, 2025</li>\n</ul>\n\n<p></p><p><b>Impact on Your Organization</b><b><br></b></p><ul><li><b>Who is affected:</b> <ul><li>Organizations using security products that inspect or rewrite URLs, and users who join Microsoft Teams meetings via meeting links.</li></ul></li></ul><p></p><ul>\n<li><b>What will happen:</b>\n  <ul>\n    <li>Microsoft Teams will validate join URLs to ensure they have not been modified.</li>\n    <li>If a join URL is rewritten or altered by a security product, it may be marked as malicious.</li>\n    <li>Users may be prevented from joining meetings if URLs are not in their original format.</li>\n    <li>This feature is enabled by default and does not require admin configuration.</li></ul></li></ul><p>Note: Meeting joins will only be blocked if the join links are re-written in the calendar event details (Join URL). If the links are only re-written in the meeting description (or meeting body), it won’t impact the ability to join.</p><p>Microsoft's advanced email security platform, including <b>Safe Links</b> (URL inspection/rewriting), will not be impacted by this update.</p><p>Safe Links behavior:</p><ul><li>Does not rewrite the URLs behind the “Join Teams meeting” or “Join” buttons.</li><li>Only rewrites URLs within the meeting invitation body.</li><li>Any temporary rewriting (if applied) is removed by Exchange Online upon send/receive.</li></ul><p>Potential impact:</p><ul><li>This change may affect <b>third-party security service</b>s that rewrite both the body URLs and the “Join” button URLs.</li></ul><p>Action required:</p><ul><li>No action is needed for customers using Safe Links. There is <b>no requirement</b> to add Teams meeting URLs to the Safe Links “allowed list.”</li><li>For the customer using 3P solutions, they must ensure Teams join links are excluded from rewriting.</li>\n</ul>\n\n<p></p><p><b>Compliance Considerations</b></p><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will validate meeting join URLs starting September 30, 2025 (November 30 for GCC/DoD) to prevent altered links from being used or flagged as malicious. Safe Links is unaffected, but third-party security products rewriting join URLs must exclude them to avoid blocking meeting access. No admin action needed for Safe Links users."
    }
  ],
  "EndDateTime": "2026-01-12T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1120871",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-13T17:41:54.01Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-07-24T00:28:12Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Important Update: Teams Meeting Join URL Validation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
