{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to enable process mining integration in process map in Power Automate. This feature will reach general availability on December 12, 2025.<br><br> \n \n\n<b>How does this affect me?</b><br> \n\nThis feature enables you to access flow-centric health and performance metrics directly within the process map, and enable seamless, one-click process mining integration for advanced analysis. Built-in process mining provides instant variant analysis, allowing you to quickly identify slow or unreliable routes and uncover process variations.<br><br> \n \nStandard insights available without process mining integration:<ul> \n\n<li>Flow runs and performance metrics</li> \n\n<li> Failure rates with error trends</li> \n\n<li> Top errors by code</li></ul> \n \n\nEnhanced observability with process mining integration:<ul> \n\n<li> Unlock process mining insights with a one-click experience—no manual log data wrangling or transformation needed.</li> \n\n<li> Visualize and drill down into specific process routes (variants) and bottlenecks with variant analysis.</li> \n\n<li> Trace and analyze slow or unreliable process paths directly within the process map.</li> \n\n<li> Monitor comprehensive process health, performance, and reliability metrics across end-to-end automation.</li> \n\n<li> Go deeper with advanced process analysis in the process mining product.</li></ul> \n \n\nTechnical Information:<ul> \n\n<li> Insights are accessed through the Insights (preview) toggle on the process map.</li> \n\n<li> Advanced insights are enabled with a single click—no manual exports or data prep required (subject to available capacity).</li> \n\n<li> Advanced insights use Power Automate's Process Mining capabilities and consume from your available Process Mining capacity in the tenant.</li> \n\n<li> Metrics are computed from historical flow runs stored in Dataverse and surfaced via the DFAI service.</li> \n\n<li> In high-volume environments, preparing insights may take longer.</li> \n\n<li> Flow runs must be older than 48 hours to be included in analysis.</li></ul> \n \n\nEnablement (basic insights):<ul> \n\n<li> Enabled by default: Basic insights.</li> \n\n<li> Enabled for: All users with access to the Automation Center and process map features.</li> \n\n<li> Disabled for: Environments where “Enable production-ready preview features” is turned off in Power Platform admin center.</li></ul> \n \n\nEnablement (advanced insights):<ul> \n\n<li> Opt-in: Advanced insights through the Insights (preview) side-panel and Enable advanced insights button.</li> \n\n<li> Access requirements: Power Automate Premium license, permission to view flow run data included in the process map, the ability to manually create Process Mining processes, and at least 50 MB of available Process Mining capacity in the environment.</li></ul> \n\n \n<b>What action do I need to take?</b><br> \nThis message is for awareness, and no action is required.<br><br> If you would like more information on this feature, please visit <a href=\"https://aka.ms/ADO12836\" target=\"_blank\">Enable process mining integration in process map</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-12-13T19:12:58Z",
  "HasAttachments": false,
  "Id": "MC1185821",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-11-13T19:17:41.493Z",
  "Services": [
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-11-13T19:12:58Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Automate - Enable process mining integration in process map",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
