{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Expected in late February 2026, we are improving reporting accuracy in Intune by cleaning up stale device records. Devices that have not checked in for 12 months will be classified as inactive and excluded from reporting views. This update ensures that device counts and reporting metrics more accurately reflect your active, managed devices.</p><p><b>How this will affect your organization:</b>\n</p><p>If there are devices that have been offline for more than 12 months, these devices will be removed from Intune reports. You may notice a decrease in the total device count shown in reporting views such as the policy and setting status Summary reports. This reduction is expected and reflects a more accurate and current representation of active devices. Active devices that regularly check in are not affected by this change.</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required; only awareness. If you expect a device to appear in reports, ensure it checks in. To initiate a check‑in, power on the device, connect to the network, and start a sync or Company Portal check‑in as applicable.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting late February 2026, Intune will exclude devices inactive for 12+ months from reports to improve accuracy. This may reduce reported device counts but reflects active devices only. No action is needed; ensure devices check in to remain in reports."
    }
  ],
  "EndDateTime": "2026-04-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1230448",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-10T22:58:34.59Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-10T22:58:13Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Plan for Change: Improving Intune reporting accuracy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
