{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are reiterating the guidance for connector settings to ensure customers are using healthy configurations. The key problematic configurations we are seeing are:\n</p><ol><li>When a tenant has an Inbound connector of type OnPremises and the connector does certificate-based authentication using a certificate with a subject/SAN for a domain that is NOT an Accepted Domain of the tenant.\n</li><li>When a tenant has an Inbound connector of type OnPremises and the connector does IP-based authentication, but the IP is used by other tenants.\n</li></ol><p>These anti-patterns typically occur when you are using a 3rd party service to relay email through Exchange Online but could also occur if your organization has a single on-premises Exchange Server connecting to multiple Exchange Online tenants.\n</p><p>These configurations can cause incorrect mail flow because Exchange Online is a multi tenant service and relies on message attribution to determine which tenant an incoming message belongs to. When messages are received through an Inbound connector of type OnPremises, attribution is determined using the following priority order:\n</p><ol><li>The domain on the TLS certificate presented by the sending server\n</li><li>The P1 MailFrom (envelope sender) domain</li><li> The P1 RcptTo (recipient) domain</li></ol><p><b>How this will affect your organization:</b>\n</p><p>We may perform internal changes, such as tenant moves, without notice, which can impact mail flow if a tenant has a bad connector configuration. This means a misconfigured connector that works today may unexpectedly stop working.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>If you have a single on-premises Exchange Server connecting to multiple Exchange Online tenants, your on-premises Exchange environment must use a unique client certificate to send to each unique Exchange Online tenant belonging to your organization. You must configure a unique Send Connector on-premises for each unique tenant in Exchange Online that you want to route on-premises traffic to: <a href=\"https://learn.microsoft.com/exchange/mail-flow/connectors/send-connectors\" target=\"_blank\">Send connectors in Exchange Server | Microsoft Learn</a>. You should also prioritize configuring Inbound connectors of type OnPremises in Exchange Online to use certificate-based authentication, rather than IP based . For best performance, Exchange Online tenants Inbound connector’s should reference the unique client certificate dedicated for that connector path.\n</p><p>If you need to use a third-party add-on service to process email messages sent from your organization and then relay through Exchange Online, the third-party service must support a unique certificate for your organization, and the certificate domain (in Subject name or SAN) must be an accepted domain of your organization. In addition, you must update your Inbound connector of OnPremises type to use the unique certificate domain, via property TlsSenderCertificateName. An example of this scenario is your organization using a third-party CRM cloud service to send emails on behalf your organization to mailboxes of your company or other external users. To learn more, see Scenario: <a href=\"https://learn.microsoft.com/exchange/mail-flow-best-practices/use-connectors-to-configure-mail-flow/integrate-office-365-with-an-email-add-on-service\" target=\"_blank\">Integrate Exchange Online with an email add-on service</a>.</p>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Ensure On-Premises connectors use unique certificates with domains accepted by the tenant and avoid shared IPs across tenants. Misconfigurations can disrupt mail flow due to Exchange Online's multi-tenant nature. Use unique Send Connectors per tenant and prefer certificate-based authentication for reliable email routing."
    }
  ],
  "EndDateTime": "2026-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1226222",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-02T23:47:44.213Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-02T23:47:07Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Prevent/Fix: Guidance for On-Premises Connectors Configuration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
