{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>As of <b>January 9, 2026</b>, you may experience issues deleting <b>Copilot Notebooks</b> if a recent fix has not yet rolled out to your tenant. In early December, we identified a problem where the asynchronous deletion of folders in SharePoint Embedded was not being invoked, causing deletion failures. This fix is now being deployed, and we want you to be aware of the current state and upcoming resolution.</p><p>Tenant-owned <b>Loop workspace SharePoint Embedded (SPE) </b>containers may also experience these deletion failures. These issues will not be resolved with the initial fix rollout. However, you can mitigate them by excluding the affected containers from Microsoft Purview retention policies, as described in the steps below.</p>\n\n<p><b>When this will happen:</b></p>\n<ul>\n<li>The initial fix begins rolling out January 9, 2026.</li>\n<li>Full worldwide rollout is expected by January 31, 2026.</li>\n<li>After this rollout, we’ll evaluate if additional fixes are needed.</li>\n</ul>\n\n<p><b>How this affects your organization:</b></p>\n<ul>\n<li><b>Who is affected:</b> Tenants using <b>Copilot Notebooks</b> stored in SharePoint Embedded.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>If the fix hasn’t reached your tenant, deleting <b>Copilot Notebooks</b> may fail.</li>\n<li>After January 31, deletion should work as expected.</li>\n<li>If issues persist after January, report via a support ticket.</li>\n</ul>\n</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>Work with IT admins to:\n<ul>\n<li>Exclude personal containers from retention policies.</li>\n<li>Remove sensitivity labels or content triggering retention policies.</li>\n</ul>\n</li>\n<li>If a notebook is on Preservation Hold:\n<ul>\n<li>Sign in to the <a href=\"https://purview.microsoft.com/\" target=\"_blank\"><b>Microsoft Purview compliance portal</b></a>.</li>\n<li>Navigate to <b>Solutions &gt; Data Lifecycle Management &gt; Retention policies</b>.</li>\n<li>Locate the policy applying the hold to the affected SharePoint site or container.</li>\n<li>Edit the policy to remove the hold or exclude the container from the policy.</li>\n<li>Save changes and allow time for propagation before retrying deletion.</li>\n</ul>\n</li>\n<li>Temporarily disable retention policies for affected SharePoint sites and SharePoint Embedded containers:\n<ul>\n<li>Sign in to <b><a href=\"https://purview.microsoft.com/\" target=\"_blank\">Microsoft Purview portal</a> &gt; Solutions &gt; Data Lifecycle Management &gt; Policies &gt; Retention policies</b>.</li>\n</ul>\n</li>\n<li><a href=\"https://learn.microsoft.com/microsoft-365/compliance/retention?view=o365-worldwide\">Learn more about retention policies and removing holds</a></li>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting January 9, 2026, deletion of Copilot Notebooks in SharePoint Embedded may fail until a fix fully rolls out by January 31. Tenant-owned Loop workspace containers may also face issues unless excluded from retention policies. Admins should adjust retention settings via Microsoft Purview to mitigate problems."
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1213768",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-06T05:48:13.977Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-06T05:47:30Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Copilot Notebooks deletion issues and upcoming fix",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
