{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p><b>Voice tethering</b> builds on the recent introduction of <b>Sign Language Mode</b> in <i>Microsoft Teams</i>. When a sign language interpreter voices on behalf of a Deaf or hard‑of‑hearing (D/HH) participant, Teams will now attribute captions, transcripts, and meeting intelligence—such as Copilot notes, summaries, action items, and insights—to the D/HH participant rather than the interpreter. This update ensures accurate representation in meetings, clarifies who is contributing to the conversation, and improves downstream meeting accuracy and accountability.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=553223\" target=\"_blank\">553223</a>.</p><p><b><b>When this will happen</b></b></p><ul><li><b>Targeted Release (Worldwide): </b>We will begin rolling out in <b>mid-March 2026</b> and expect to complete by <b>late March 2026</b>.</li><li><b>General Availability (Worldwide, GCC): </b>We will begin rolling out in <b>early April 2026</b> and expect to complete by <b>mid-April 2026</b>.</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i></p><ul><li>Organizations with meeting participants who are Deaf or hard‑of‑hearing and use sign language interpreters in&nbsp;<i>Teams meetings</i>.</li><li>Any users who participate in meetings with <b>Sign Language Mode enabled</b>.</li></ul><p><i>What will happen</i></p><ul><li>Voice contributions made by interpreters will be attributed to the D/HH participant across:<br><ul><li>Live captions</li><li>Meeting transcripts</li><li>Copilot notes, summaries, action items, and insights</li><li>Other Teams meeting intelligence</li></ul></li><li>Meeting data becomes more accurate by ensuring the correct participant is represented.</li><li>Interpreter identity is no longer conflated with the signer they support.</li><li>Sign Language Mode is already available to all users; voice tethering enhances it automatically.</li><li>The feature is <b>on by default </b>when sign language mode and interpreter assignment are used.</li><li>No admin controls are required to enable or manage the feature.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No action is required.</p><p>Optional preparation steps:</p><ul><li>Inform D/HH users and interpreters that speech attribution in meetings will change.</li><li>Update internal training or accessibility resources if you document interpreter workflows.</li><li>Notify helpdesk or support teams that captioning and transcript attribution will appear differently for interpreted meetings.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "553223"
    },
    {
      "Name": "Summary",
      "Value": "Voice tethering in Microsoft Teams attributes captions, transcripts, and meeting intelligence to Deaf or hard-of-hearing participants instead of their sign language interpreters, improving accuracy and accountability. It rolls out worldwide from mid-March to mid-April 2026, is on by default, and requires no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2026-05-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1230459",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-10T23:10:30.667Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-10T23:10:21Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Voice tethering",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
