{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Beginning in <b>March 2026</b>, you may encounter issues in <b>Call Quality Dashboard (CQD)</b> when searching by Meeting ID. CQD is changing the Meeting ID value to match the numeric Meeting ID found in Teams meeting invites. The previous value used for Meeting ID in CQD will now be found in a separate dimension named <b>Thread ID</b>.&nbsp;</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>This change will take place starting<b> mid-March 2026</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Microsoft 365 administrators and IT staff who use CQD.</li>\n<li>Organizations that search for meetings in CQD using <b>Meeting ID</b>.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>CQD will change the <b>Meeting ID</b> value to match the<b> numeric Meeting ID</b> shown in Teams meeting invites.</li>\n<li>The previous Meeting ID value will no longer appear under the Meeting ID dimension.</li>\n<li>The previous value will be available in a new dimension named <b>Thread ID</b>.</li>\n<li>Existing CQD reports or queries that rely on the old Meeting ID may no longer return expected results unless updated.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Update CQD queries and reports to use the <b>numeric Meeting ID</b> from Teams meeting invites.</li>\n<li>If needed, update reports to use the <b>Thread ID </b>dimension for the previous Meeting ID value.</li>\n<li>Notify helpdesk and support teams about this change.</li>\n<li>Update internal documentation and training materials related to CQD reporting.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting mid-March 2026, Call Quality Dashboard will change Meeting ID to the numeric value from Teams invites, moving the old Meeting ID to a new Thread ID dimension. Administrators must update CQD queries, reports, and documentation accordingly to avoid issues. No compliance concerns noted."
    }
  ],
  "EndDateTime": "2026-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1228315",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-06T23:10:34.65Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-06T23:09:50Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Prevent/Fix (Planned) - Search by Meeting ID in Call Quality Dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
