{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We are simplifying how your organization manages Copilot access in Viva Glint. Viva Glint will now use <b>Viva Feature Access Management (VFAM)</b> as the single control plane for Copilot access, consistent with other Microsoft Copilot experiences. As part of this change, the existing Glint service‑level Copilot toggles will be removed, and Copilot will<b> default to ON</b> at the Glint service level.</p>\n<p>This removes unnecessary admin friction caused by the current dual‑gate model and ensures a clearer, more consistent governance experience across Microsoft 365.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=551197\" target=\"_blank\">551197</a>.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide): Rollout will begin in <b>early March 2026</b> and is expected to complete by <b>late March 2026</b>.</p>\n<p><b><b>How this affects your organization</b></b></p><p><b>Who is affected</b></p><ul><li>All organizations using Viva Glint.</li><li>Viva Glint service admins who previously managed Copilot toggles within Glint.</li><li>Global/M365/Viva Glint Tenant Admins who manage feature access using VFAM.</li><li>Users with Glint permissions (Reports + Comments access) who will see Copilot by default unless restricted in VFAM.</li></ul>\n\n<p><b>What’s changing</b></p>\n<ul>\n  <li>The Copilot enable/disable settings currently found in Viva Glint admin pages (per survey program, per role, and Company Admin settings) will be removed.</li>\n  <li>Copilot will <b>default to ON</b> for all customers at the Glint service layer.</li>\n  <li>VFAM becomes the single, authoritative control for Copilot access in Viva Glint.</li>\n</ul>\n\n<p><b>What stays the same</b></p>\n<ul>\n  <li>VFAM access policies (tenant, group, user) continue to apply and <b>default to ON</b>. Learn more:&nbsp;<a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Control access to features in Microsoft 365 | Microsoft Learn</a>.</li>\n  <li>Users will only see Copilot if they have the required Glint permissions (<b>Reports access</b> and <b>Comments access</b>).</li>\n  </ul><p><b>Impact</b></p>\n<ul>\n  <li><b>Glint service admins:</b> No more Copilot toggles to manage; reduced admin workload.</li>\n  <li><b>Global/M365/Viva Glint Tenant Admins:</b> Manage Copilot access exclusively in VFAM.</li>\n  <li><b>Users:</b> Copilot will appear by default, unless disabled in VFAM.</li>\n</ul>\n\n<p><b>Licensing &amp; Compliance Clarifications</b></p>\n<ul>\n  <li>A license for Viva Glint, Microsoft Viva Suite, or Microsoft Viva Workforce Analytics and Employee Feedback is required to access Copilot in Viva Glint.</li>\n  <li>A license for Microsoft 365 Copilot is <b>not required</b> to access Copilot in Viva Glint.</li>\n  </ul><p><b>For compliance and feature FAQs, refer to:</b></p><ul><li><a href=\"https://learn.microsoft.com/viva/glint/setup/copilot-privacy\" target=\"_blank\">Data, privacy, and security compliance for Microsoft 365 Copilot in Viva Glint</a><br></li><li><a href=\"https://learn.microsoft.com/viva/glint/setup/copilot-faqs\" target=\"_blank\">Microsoft 365 Copilot in Viva Glint-Enablement and general FAQs</a><br></li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n\n<p>Admins can take the following steps:</p>\n\n<p><b>Review your VFAM settings</b></p>\n<ul>\n  <li>Go to <b>admin.microsoft.com</b> → <b>Settings </b>→ <b>Viva </b>→ <b>Viva Glint </b>→ <b>Manage settings for Microsoft Copilot in Viva Glint</b>.</li>\n  <li>Verify tenant‑level Copilot access.</li>\n  <li>If you need to restrict Copilot for specific groups or users, configure custom VFAM policies.</li>\n</ul>\n\n<p><b>Inform your Glint service admins</b></p>\n<ul>\n  <li>They will no longer manage Copilot access inside the Glint admin portal.</li>\n</ul>\n\n<p><b>Get help from the product team</b></p><p>Join the <b>Feb 12th Viva Customer Connection Program (VCCP) session </b>to learn more about this update. During the session, you will:</p><ul><li>Get early visibility into what’s changing and why Microsoft is making this update.\n</li><li>Learn how this update simplifies setup and expands access to AI powered insights for managers and leaders. With additional Copilot capabilities coming soon, admins should maintain their current VFAM settings and keep Copilot enabled for all Glint users to ensure they benefit from upcoming enhancements.\n</li><li>Understand what stays the same for permissions, privacy, and compliance. Glint Copilot uses only existing Glint data and honors current permissions, making privacy, security, compliance, and works council review much simpler than M365 Copilot approvals. Additionally, no M365 Copilot premium license is required to enable Glint Copilot for all users.\n</li><li>Ask the product team questions.</li></ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "551197"
    },
    {
      "Name": "Summary",
      "Value": "Viva Glint will default Copilot to ON and remove its internal toggles, using Viva Feature Access Management (VFAM) as the sole control for Copilot access starting March 2026. Admins must manage access via VFAM; users see Copilot by default if they have Glint permissions. No M365 Copilot license is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-05-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1222648",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-27T00:40:07.273Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-27T00:39:34Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Glint: Copilot will default to ON and move to VFAM as the single control",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
