{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>We’re updating Microsoft 365 Copilot image generation experiences by introducing OpenAI’s latest image generation model—GPT‑Image‑1.5—into Microsoft 365 Copilot and Copilot Chat. This update improves prompt adherence, image editing precision, visual fidelity, and generation speed, enabling users to create higher-quality, more accurate visuals across Copilot Chat entry points and the Create experience in the <i>Microsoft 365 Copilot app</i>.</p>\n\n<b><b>When this will happen</b></b>\n<ul>\n<li><b>Rollout start</b> (web, Windows, macOS, and mobile): Late December 2025</li>\n<li><b>Rollout end</b> (web, Windows, macOS, and mobile):<b> </b>Late January 2026</li>\n<li><b>General Availability (Worldwide): </b>We will begin rolling out in <b>mid-December 2025</b> and expect to complete by <b>late January 2026</b>.</li>\n</ul>\n\n<b><b>How this affects your organization</b></b>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Tenants where Copilot image generation experiences are currently available.</li>\n<li>Access level depends on licensing:\n<ul>\n<li>Users with a Microsoft 365 Copilot license have priority access.</li>\n<li>Users without a Microsoft 365 Copilot license have standard access, which may vary based on service capacity.<ul><li>Learn more:&nbsp;<a href=\"https://support.microsoft.com/topic/standard-versus-priority-access-to-features-in-microsoft-365-copilot-chat-12c8d9f8-db32-4f99-8ebe-d8d85879137f\" target=\"_blank\">Standard versus priority access to features in Microsoft 365 Copilot Chat | Microsoft Support</a></li></ul></li></ul></li></ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>GPT‑4o will be replaced by GPT‑Image‑1.5 for supported Microsoft 365 Copilot image generation scenarios.</li>\n<li>New image generation and supported image editing requests will automatically use GPT‑Image‑1.5.</li>\n<li>No new admin controls or configuration changes are introduced; existing policies continue to apply.</li>\n</ul>\n\n<p><b>What users may notice:</b></p>\n<ul>\n<li>Improved instruction following for text-to-image requests.</li>\n<li>More accurate rendering of requested styles, composition, and on-image text.</li>\n<li>More reliable region-specific image editing with fewer unintended changes.</li>\n<li>Higher-quality visuals with more realistic lighting, textures, and composition.</li>\n<li>Faster generation—up to 4× improvement for many prompts.</li>\n<li>More consistent preservation of facial likeness, lighting, and color tone during iterative edits.</li>\n</ul>\n\n<p><b>What does not change:</b></p>\n<ul>\n<li>No change to admin controls or governance settings.</li>\n<li>Compliance, security, and privacy commitments remain the same.</li>\n<li>Customer data handling, storage locations, and processing paths are unchanged.</li>\n<li>Existing Copilot image safety and compliance controls continue to apply.</li>\n</ul>\n\n<b><b>What you can do to prepare</b></b>\n<ul>\n<li>No action is required. Eligible tenants will automatically receive this update during the rollout window.</li>\n<li>If helpful for internal readiness, you may:\n<ul>\n<li>Inform helpdesk or support teams of expected improvements in image quality and editing behavior.</li>\n<li>Review Copilot image governance documentation as needed.</li>\n</ul>\n</li>\n</ul>\n\n<p><b>Additional resources:</b></p>\n<ul>\n<li><a href=\"https://techcommunity.microsoft.com/blog/azure-ai-foundry-blog/introducing-openai%E2%80%99s-gpt-image-1-5-in-microsoft-foundry/4478139\" target=\"_blank\">Introducing OpenAI’s GPT‑Image‑1.5 in Microsoft Foundry | Microsoft Community Hub</a></li>\n<li><a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/understanding-foundation-model-changes-in-microsoft-365-copilot/4440322\" target=\"_blank\">Understanding foundation model changes in Microsoft 365 Copilot | Microsoft Community Hub</a></li>\n</ul>\n\n<b><b>Compliance considerations</b></b>\n<p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will replace GPT-4o with OpenAI’s GPT-Image-1.5 from mid-December 2025 to late January 2026, enhancing image generation quality, speed, and accuracy without changing admin controls or compliance settings. Eligible users receive the update automatically."
    }
  ],
  "EndDateTime": "2026-03-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1200577",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-19T23:42:07.94Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-19T23:41:41Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "OpenAI's GPT-Image-1.5 model is now available in Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
