{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>As AI agents become deeply embedded in enterprise ecosystems, they are evolving beyond simple tools or workflows into an autonomous digital workforce. These agents can interpret user intent, access and manipulate enterprise data, execute actions on behalf of users, and even make real-time decisions. In many ways, they operate like human insiders only with machine-speed data processing capabilities.</p><p>To govern and protect these agents effectively, organizations require visibility into their activities, contextual understanding of their actions, and the ability to flag or block risky behavior. Now, <b>Insider Risk Management can be extended to detect and remediate potentially risky agent activities</b>.</p><p><b>Features:</b></p><ul><li>Copilot Studio &amp; Azure AI Foundry Integration: Detect potentially risky activities of agents hosted on Copilot Studio, Azure AI Foundry, and Agent 365 platforms\n</li><li>Risky AI Usage Policies: Define and enforce policies specific to AI agents accessing sensitive data or performing high-risk actions.\n</li><li>IRM for Agent Users: Extend IRM in Purview to govern agent-driven workflows and protect organizational data.\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=516032\" target=\"_blank\">516032</a>.</p><p><b><b>When this will happen:</b>\n</b></p><ul><li>Public Preview: We will begin rolling out early December 2025 and expect to complete by mid-January 2026.</li><li>General Availability (Worldwide): We will begin rolling out early December 2026 and expect to complete by late December 2026.</li></ul><p><b>How this affects your organization:</b>\n</p><p>On the <b>Overview </b>page in the <b>Insider Risk Management solution</b>, you will be able to access the overall risk profile of agents deployed in your organization.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/f83b8997-0b32-45e3-af75-026bfebdb3c2\" style=\"width: 400px;\" alt=\"user settings\"></p><p>The <b>Risky Agents policy</b> will be automatically deployed for all agents hosted on Copilot Studio and Azure AI Foundry across your organization. Alerts from this policy will be generated when an agent’s activity exceeds the thresholds configured in this automatically deployed Risky Agents policy. These alerts can be found under <b>Agents </b>&gt; <b>Alerts </b>on the left pane.</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/fb686d88-fdb3-468a-8b0c-4fd61ad1a49d\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b><b>What you can do to prepare:</b>\n</b></p><ul><li>Review the public facing documentation to learn more about this exciting new offering: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-policy-templates\" target=\"_blank\">Learn about Insider Risk Management policy templates | Microsoft Learn</a></li><li>Review the new Insider Risk Management interface in the Microsoft Purview portal, which now includes separate sections for Users and Agents. </li><li>Review and tune the Risky Agents policy based on your organization’s requirements. </li><li>If you don’t wish to track agent activities, you can delete the automatically deployed Risky Agents policy.&nbsp;</li></ul><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-adaptive-protection\" target=\"_blank\">Help dynamically mitigate risks with Adaptive Protection | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-policies\" target=\"_blank\">Create and manage Insider Risk Management policies | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-policy-templates\" target=\"_blank\">Learn about Insider Risk Management policy templates | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "516032"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will extend to detect and manage risky AI agent activities in enterprise environments. Features include integration with Copilot Studio and Azure AI Foundry, AI-specific risk policies, and governance of agent workflows. Public preview starts December 2025; general availability by December 2026."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2027-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1200579",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-29T17:26:45.293Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-19T23:42:30Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider risk management- Insider risk management for risky agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
