{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to easily select appropriate field values from a list when working with segments conditions in Dynamics 365 Customer Insights - Data. This feature will reach general availability on February 13, 2026.<br><br>\n<b>How does this affect me?</b><br>\nThis feature allows you to select from a list of valid display names for field values, eliminating the need to enter obscure codes, or keep track of what data values are expected for each field. Choice fields are presented as a list of Name (value) choices in Customer Insights - Data. Key capabilities of this feature include:<ul>\n    <li>\n        <b>Dataverse Choice fields</b>: The Choice field is a common data type in Dataverse which is similar to a picklist or enumeration. Dataverse choice fields can generally be identified by the 'code' suffix Dataverse adds to the display name of the column, such as gendercode. Instead of having to enter a numeric code for fields, Choice fields are now shown as a list of choice names and their code, such as: GenderCode * Male (1) * Female (2).</li>\n    <li>\n        <b>Numeric and String fields</b>: Numeric and string fields are analyzed and if there are < 200 distinct values, the distinct values will be displayed in a dropdown combo box allowing you to select from the existing distinct values or to enter a different value. For performance, we will sample the first 10,000 rows from a data lake for distinct values.</b>\n    </li>\n</ul>\n<b>What action do I need to take?</b><br>\nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-02-16T17:53:55Z",
  "HasAttachments": false,
  "Id": "MC1218646",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-16T17:56:10.477Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-16T17:53:55Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Insights- Data - Select appropriate field values from a list when working with segments conditions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
