{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>By the&nbsp;<b>end of March 2026</b>, Microsoft Defender for Android will no longer support protection of personal profiles on enrolled devices. This change aligns with our enterprise-first security strategy, ensuring resources are focused on protecting corporate data while maintaining user privacy.</p><p><b><b>When will this happen</b></b></p><p>Rollout will begin in <b>mid-March 2026</b> and complete by late <b>March 2026</b>.</p><p><b><b>How this affects your organization</b></b></p><p><b style=\"\">Who is affected: </b>Organizations using <b style=\"\">Microsoft Defender for Endpoint (MDE)</b> on Android in personal profiles on enrolled devices that are managed through <b style=\"\">mobile device management (MDM)</b> configuration policies.</p><ul>\n</ul><p><b>What’s changing:</b></p><p>We're ending support, monitoring, and feature development for protecting personal profiles on enrolled devices (personal profiles managed via MDM configuration policy). Our main objective is to safeguard corporate assets, with emphasis on identity and data contained within the work profile in enrolled environments. We rely on Android’s platform-level separation to ensure robust isolation. Current research indicates that the likelihood of cross-profile attacks compromising enterprise data remains minimal at present.</p><p><b>Current State:</b></p><p>Defender can be enrolled in the personal profile and managed through MDM configuration policies along with controlling work profile configuration (App Configuration policies targeted to managed devices).</p><p><b>Reference link: </b><a href=\"https://learn.microsoft.com/defender-endpoint/android-intune#set-up-microsoft-defender-in-personal-profile-on-android-enterprise-in-byod-mode\" target=\"_blank\">Deploy Microsoft Defender for Endpoint on Android with Microsoft Intune</a></p><p><b>New State:</b></p><p>Deploying and managing Defender in personal profile on enrolled devices via MDM policies will be retired by the end of March 2026. Defender in work profile on enrolled devices and unenrolled <b>mobile application management (MAM)-enabled devices</b>&nbsp;remains unchanged.&nbsp;</p><p><b>Reference link: </b><a href=\"https://learn.microsoft.com/defender-endpoint/android-configure-mam\" target=\"_blank\">Configure Microsoft Defender for Endpoint on Android risk signals using App Protection Policies (MAM)</a></p><p><b>Benefits of the Change:</b></p><p>This update enhances our enterprise-focused strategy by providing more efficient and dependable protection for corporate data. It safeguards user privacy and ensures that Defender exclusively protects corporate assets, maintaining the integrity of personal information in accordance with privacy regulations and platform separation requirements.<b>&nbsp;&nbsp;</b></p>\n\n<p><b><b>What you can do to prepare</b></b></p>\n<ul>\n<li>No action is required from admins or users. </li><li>These changes will be applied automatically in the back end and will not impact your work profile or unenrolled experience.</li></ul>\n\n<b><b>Compliance considerations:</b></b>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Android will end support for protecting personal profiles on enrolled devices by March 2026, focusing solely on securing corporate work profiles. This change enhances enterprise security and user privacy, requires no admin action, and does not affect work profiles or unenrolled devices."
    }
  ],
  "EndDateTime": "2026-04-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1221927",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-23T22:54:28.353Z",
  "Services": [
    "Microsoft Intune",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-23T22:54:09Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Defender for Android ending support for enrolled personal profiles",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
