{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p></p><p><b><b>Introduction</b></b></p><p>To help provide additional transparency about what content has been generated or altered by using AI in <i>Microsoft 365</i>, Microsoft is providing you with a policy setting that visually designates when content, such as video or audio content, is generated or altered by using AI. This policy setting controls your organization’s option to add a visual or audio watermark to video and audio content that your users generate or alter by using AI in <i>Microsoft 365</i>.  \n</p><p>\n</p><p>To turn on watermarks for video and audio content that your users generate or alter by using AI in <i>Microsoft 365</i>, you need to use the “<b>Include a watermark when content from Microsoft 365 is generated or altered by AI</b>” policy. This policy is available only in <a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\"><i>Cloud Policy service for Microsoft 365</i></a>.&nbsp;</p><p><b>Note:</b> Watermarks are not turned on unless you set the policy to <b>Enabled</b>. Your organization is always responsible for following the <a href=\"https://learn.microsoft.com/legal/ai-code-of-conduct\" target=\"_blank\">Microsoft Enterprise AI Services Code of Conduct</a>, including not generating or sharing deceptive AI content.&nbsp;</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=547831\" target=\"_blank\">547831</a>.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide): </b>We anticipate that this policy will be available in <i>Cloud Policy </i>by&nbsp;the <b>second half of February 2026</b>.</p><p></p><p><b><b>How this will affect your organization</b></b></p><p></p><i>Who is affected</i><p></p><p>Users that generate or alter video and audio content by using AI in <i>Microsoft 365</i></p><p></p><p><i>What will happen</i></p><p>If you set the “<b>Include a watermark when content from Microsoft 365 is generated or altered by AI</b>” policy to <b>Enabled </b>in Cloud Policy, a visual or audio watermark is added to video and audio content that is generated or altered by using AI in <i>Microsoft 365</i>. Here are two examples:</p><ul><li>A visual watermark is added to a video generated with Clipchamp.</li><li>An audio watermark is added to an audio overview generated by Copilot from a Word document.</li></ul><b>Notes:</b><ul><li>This policy doesn’t affect images generated or altered by using AI in <i>Microsoft 365</i>.</li><li>Instead, your users will be able to turn on watermarks for images by going to<b> Settings &amp; Privacy &gt; Privacy</b> at <a href=\"https://myaccount.microsoft.com\" target=\"_blank\">https://myaccount.microsoft.com</a>. We anticipate this capability will be available in the <b>second half of February 2026</b>.&nbsp;</li></ul><p></p><p><b><b>What you need to do to prepare</b></b></p><p></p>Review the information in the following article: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/watermarks\" target=\"_blank\">Add watermarks to content generated or altered by using AI in Microsoft 365</a>. If you decide to set the<b> “Include a watermark when content from Microsoft 365 is generated or altered by AI”</b> policy to <b>Enabled</b>, inform your users that a visual or audio watermark will be added to video and audio content that they generate or alter by using AI in <i>Microsoft 365</i>.&nbsp;<p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "547831"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 will offer a policy to add visual or audio watermarks to AI-generated or altered video and audio content, available via Cloud Policy by February 2026. This enhances transparency but does not apply to images, which users can watermark through privacy settings separately."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1221451",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-23T00:54:26.78Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-23T00:53:50Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New policy to add watermarks to content generated or altered by using AI in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
