{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re introducing the <b>Advanced Review Set Explorer&nbsp;</b>(public preview) for review sets in <i>Microsoft Purview eDiscovery (Premium)</i>.</p><p>eDiscovery has long supported Keyword Query Language (KeyQL) because it provides a familiar, approachable, and powerful way to search and filter content—while working consistently across both search and review experiences. For many users and workflows, KeyQL remains the recommended and most efficient way to build queries.</p><p>At the same time, we understand that power users and advanced reviewers often need greater flexibility to slice, aggregate, and analyze review set data in more sophisticated ways. To meet this need, we’re adding a Kusto Query Language (KQL)–based experience to review sets through the Advanced Review Set Explorer.</p><p>With this update, reviewers will have two query options:</p><ul><li>KeyQL, for familiar, streamlined search and filtering experiences</li><li>KQL, for advanced data exploration, aggregation, transformation, and visualization within a review set</li></ul><p>The new Advanced review set explorer's key capabilities include:</p><ul><li>Run advanced review set explorer using Kusto Query Language (KQL)</li><li>Apply complex filters, aggregations, and transformations</li><li>Visualize results with bar, column, and pie charts</li><li>Query across more than 100 metadata properties</li><li>Identify trends, detect patterns, and analyze data distribution</li>\n</ul>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=484086\" target=\"_blank\">484086</a>.</p>\n\n<p><b><b>When this will happen</b></b>\n</p><ul><li><b>Public Preview (Worldwide, excluding government clouds):</b>&nbsp;We will start rolling out in <b>February 2026</b>&nbsp;and expect to complete in&nbsp;<b>February 2026</b>.</li><li><b>General Availability (Worldwide, GCC, GCCH, and DoD):</b> We will start rolling out in <b>July 2026</b> and expect to complete in <b>July 2026</b>.</li></ul>\n\n<p><b><b>How this affects your organization</b></b></p>\n<p><i>Who is affected:</i>\nOrganizations using Microsoft Purview eDiscovery (Premium).</p>\n\n<p><i>What will happen:</i></p>\n<ul>\n  <li>A new Advanced Review Set Explorer will be available in review sets.</li>\n  <li>The feature is <b>enabled by default</b>.</li>\n  <li>Users with eDiscovery review permissions can run KQL queries.</li><li>Users can continue using existing KeyQL‑based searching within review set without change.</li>\n  <li>No existing queries or workflows are modified.</li>\n  <li>Existing admin policies and permissions are unchanged.</li>\n</ul>\n\n<p><b><b>What you can do to prepare</b></b></p>\n<ul>\n  <li>Inform eDiscovery teams that both KeyQL and KQL are supported, and users can choose the option that best fits their needs.</li><li>Consider providing KQL training or reference materials.</li>\n  <li>Update internal documentation or workflows as needed.</li>\n  <li>Inform eDiscovery teams about this new capability.</li>\n  <li>Review Microsoft Learn content on eDiscovery solutions.</li></ul><p><b>Learn more:&nbsp;</b></p><ul><li><a href=\"https://learn.microsoft.com/kusto/query/?view=microsoft-fabric&amp;toc=%2Fazure%2Fsentinel%2FTOC.json&amp;bc=%2Fazure%2Fsentinel%2Fbreadcrumb%2Ftoc.json\" target=\"_blank\">Kusto Query Language overview | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/edisc\" target=\"_blank\">Learn about eDiscovery | Microsoft Purview | Microsoft Learn</a></li>\n</ul>\n\n<p><b><b>Compliance considerations</b></b>\n</p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "484086"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview eDiscovery (Premium) introduces the Advanced Review Set Explorer (public preview in February 2026) enabling Kusto Query Language (KQL) for advanced data analysis alongside existing KeyQL. It offers complex filtering, visualization, and querying across 100+ metadata properties, with no impact on current workflows or permissions."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1221453",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-23T00:55:53.197Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-23T00:55:35Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery – Advanced review set explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
