{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Updated January 15, 2026: We have updated the content. Thank you for your patience.&nbsp;</b></p><p><b><b>Introduction</b></b></p>\n<p>We’re improving scheduled channel meetings in Microsoft Teams by reducing automatic meeting updates in channel conversations. This change helps keep channels cleaner and focused on real user replies, while meeting details remain accessible when you open the meeting thread.</p><p><b><b>When this will happen:</b></b></p>\n<ul>\n<li><b>Targeted Release:</b> Rolling out mid-January 2026, expected to complete by late January 2026.</li>\n<li><b>General Availability (Worldwide):</b> Rolling out early February 2026, expected to complete by late February 2026.</li>\n<li><b>General Availability (GCC, GCCHigh, DoD):</b> Rolling out early March 2026, expected to complete by late March 2026.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> All Microsoft Teams users participating in scheduled channel meetings.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>Automatic meeting updates in channel conversations will be reduced.</li>\n<li>Channel threads will appear cleaner and reply counts will reflect actual user responses.</li>\n<li>Meeting details remain accessible by opening the meeting thread.</li>\n<li>No admin configuration changes are required; the feature is enabled by default.</li>\n</ul>\n</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required. This update will roll out automatically.</li>\n<li>Optional: Communicate this change to helpdesk staff to reduce potential confusion.</li>\n<li>For more information on channel meetings, visit: <a href=\"https://learn.microsoft.com/microsoftteams/plan-meetings\">Meetings in Teams</a>.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will reduce automatic meeting updates in channel conversations starting January 2026, making threads cleaner with reply counts showing real user responses. Meeting details remain accessible in threads. The update requires no admin action and will roll out automatically worldwide by March 2026."
    }
  ],
  "EndDateTime": "2026-04-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1217638",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-26T22:10:32.543Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-14T02:06:16Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Improvements to meeting threads in Microsoft Teams channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
