{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>We’re conducting an experiment that changes how Word, Excel, and PowerPoint file attachments open in Outlook for iOS and Android. For <b>iPad users only, </b>these files may open directly in the Word, Excel, or PowerPoint apps when they are installed, instead of using the in-app previewer.</p>\n\n<p><b>When this will happen:</b></p>\n<p>General Availability (Worldwide, GCC, GCCH, DoD): We will begin rolling out this experiment in <b>early to mid-February 2026</b> and expect to decide whether to proceed with or stop the rollout by the <b>late March 2026</b>.</p>\n\n<p><b>How this affects your organization:</b></p>\n<p><b style=\"\">Who is affected:</b></p>\n<ul>\n<li>Users on <b>iPad devices</b> running Outlook who have the Word, Excel, or PowerPoint apps installed.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>Some iPad users will find that Word, Excel, and PowerPoint attachments open directly in the corresponding app.</li>\n<li>Users without the Office apps installed will continue to use the in-app previewer.</li>\n<li>This is an experiment and may not become permanent.</li>\n<li>No admin configuration is required.</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>No action is required.</li>\n<li>You may choose to notify iPad users or update internal help documentation.</li>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early to mid-February 2026, Outlook for iOS and Android on iPads may open Word, Excel, and PowerPoint attachments directly in their apps if installed, replacing the in-app previewer. This experiment affects iPad users only, requires no admin action, and may not be permanent."
    }
  ],
  "EndDateTime": "2026-05-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227071",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-04T23:59:48.893Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-04T23:59:39Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Files in Outlook for iOS and Android will open in Word, Excel or Powerpoint app on iPad",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
