{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We are adding new, more granular permissions for users to get access to administrative areas in Viva Glint. These areas include <b>Advanced Configuration</b>, <b>Nudges</b>, <b>General Settings</b>, and <b>Viva Integrations</b>. We are also updating the name of the highest privileged role in Viva Glint to <b>“Viva Glint Service Admin,”</b>&nbsp;and for increased security, restricting the ability to assign new <b>Viva Glint Service Admins</b> to the&nbsp;<b>Microsoft Admin Center (MAC)</b>&nbsp;only.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide): Rollout will begin early February 2026 and complete by early February 2026.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b> Admins managing Viva Glint roles and permissions.</p>\n<p><b>What will happen:</b></p><ul>\n<li>Additional permissions will be introduced for <b>Advanced Configuration</b>, <b>General Settings</b>, <b>Nudges</b>, and <b>Viva Integrations</b>.</li>\n<li>Assigning <b>Viva Glint Service Admins</b> will only be possible through the MAC.</li>\n<li><b>M365 Global Admins</b> and <b>Viva Glint Tenant Admins</b> will have sole responsibility for assigning Service Admins.</li><li>All <b>Viva Glint Service Admins</b>&nbsp;will have Advanced Configuration access going forwards</li>\n<li>No changes to existing admin policies; this update enhances security and role clarity.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Review your organization’s needs to determine how to use these new permissions</li>\n<li>Ensure that only <b>M365 Global Admins</b> or <b>Viva Glint Tenant Admins</b> are prepared to assign Service Admins via MAC.</li>\n<li>Update internal documentation and communicate these changes to your helpdesk or support teams.</li>\n</ul><p>Learn more about Viva Glint roles and permissions: <a href=\"https://learn.microsoft.com/viva/glint\">Viva Glint documentation</a>.</p><ul>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Glint introduces granular permissions for Advanced Configuration, Nudges, General Settings, and Integrations. The top role is renamed \"Viva Glint Service Admin,\" assignable only via Microsoft Admin Center by M365 Global or Viva Glint Tenant Admins. Rollout starts and completes in February 2026."
    }
  ],
  "EndDateTime": "2026-03-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1217642",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-14T02:08:39.91Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-14T02:08:24Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Viva Glint – New permissions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
