{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>Microsoft Teams is improving time zone handling in the <i>Teams desktop client for Windows and Mac and Teams on the web</i>. With this update, Teams will automatically apply the new device time zone when a time zone change is detected, without requiring a client restart. This enhancement provides a smoother, more seamless experience for users who travel or work across multiple regions.</p>\n\n<p><b><b>When this will happen</b></b></p>\n<p><b>Targeted Release:</b> Rollout will begin in<b> early February 2026</b> and complete in <b>early February 2026</b>.</p>\n<p><b>General Availability (Worldwide, GCC, GCC High, DoD):</b> Rollout will begin in<b> mid-February 2026</b> and complete in<b> late February 2026</b>.</p>\n\n<p><b><b>How this affects your organization</b></b></p>\n<p><i>Who is affected:</i></p>\n<ul>\n<li>Users on the Teams Desktop Client for Windows and Mac and Teams on the web.</li>\n</ul>\n<p><i>What will happen:</i></p>\n<ul>\n<li>Teams will automatically synchronize to the updated device time zone when a time zone change is detected.</li>\n<li>No restart will be required when the OS time zone changes.</li>\n<li>The active time zone will be shown in <i><b>Teams Settings &gt; General</b></i>.</li>\n<li>This update is applied automatically and does not require any admin configuration.</li>\n</ul>\n\n<p><b><b>What you can do to prepare</b></b></p>\n<p>No admin action is required.</p>\n<ul>\n<li>The feature becomes <b>available once users update to a supported Teams client build</b>.</li><li>Optionally notify users of this improvement.</li>\n<li>Update internal documentation if it references client restarts for time zone changes.</li>\n</ul>\n\n<p><b><b>Compliance considerations</b></b></p>\n<p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will automatically sync with device time zone changes without needing a client restart, starting early February 2026. This applies to Teams desktop (Windows, Mac) and web clients, requires no admin action, and shows the active time zone in Teams settings."
    }
  ],
  "EndDateTime": "2026-03-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1222651",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-27T00:42:36.023Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-27T00:42:29Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Automatic synchronization with device time zone, no client restart required",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
