{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\nWe’re retiring several legacy SharePoint Online features to streamline compliance and data lifecycle management. Starting April 2026, the following features will be retired:\n<p></p><ul>\n<li>Information Management Policies</li>\n<li>In-Place Records Management</li>\n<li>Document deletion policies (deletion only)</li>\n<li>Policies for site closure and deletion (deletion only)</li>\n</ul>\nWe recommend using <b>Microsoft Purview Data Lifecycle Management</b> and <b>Purview Records Management</b>, where we continue to invest in modern, flexible compliance solutions.<p></p>\nFor details on the retirement plan and migration guidance, refer to:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/use-microsoft-purview-risk-and-compliance-solutions\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Use Microsoft Purview risk and compliance solutions instead of older SharePoint features</a>.<p></p>\n\n<p><b><b>When this will happen:</b></b></p>\nRetirement will take place in April 2026<p></p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<b>Who is affected:</b> Organizations using Information Management Policies, In-Place Records Management, or related deletion policies in SharePoint Online.<p></p>\n<b>What will happen:</b>\n<p></p><ul>\n<li>These features will no longer be supported by Microsoft.</li>\n<li>These features may disappear from the user interface (UI).</li>\n<li>Configurations will not be available through UI or programmatically (including enable/disable actions).</li>\n<li>Backend services supporting these behaviors may stop functioning.</li>\n</ul><p></p>\n\n<p><b><b>What you can do to prepare:</b></b></p><p>Microsoft won’t automatically migrate your older information management and SharePoint records management features in SharePoint Online. If you choose not to migrate to supported features, the older features may no longer be supported.</p><p>Between now and April 2026, you have the flexibility to migrate your scenarios on your own schedule. To prepare:</p><ul>\n<li>Review current use of legacy features and confirm compliance goals.</li>\n<li>Plan migration to <b>Microsoft Purview Data Lifecycle Management</b> and <b>Purview Records Management</b>.</li>\n<li>Audit retention schedules for duplicates or outdated policies.</li>\n<li>Confirm applicable licenses for Purview features.</li>\n<li>Implement modern features and verify functionality using tools like <b style=\"\">Policy Lookup</b>.</li>\n<li>Communicate this change to your Data Lifecycle and Records Management teams.</li>\n</ul>\nFor detailed migration strategies and feature mapping, refer to:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/migration-strategies\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Migration strategies for moving to Microsoft Purview solutions</a>.<p></p>\n\n<p><b><b>Compliance considerations:</b></b></p>\nNo compliance considerations identified, review as appropriate for your organization.<p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting April 2026, SharePoint Online will retire legacy features like Information Management Policies and In-Place Records Management. Organizations must migrate to Microsoft Purview Data Lifecycle Management and Purview Records Management, as older features will no longer be supported or accessible. Planning and migration guidance is provided."
    }
  ],
  "EndDateTime": "2026-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1211579",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-03T02:58:06.12Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-03T02:57:54Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Purview DLM: Retirement of SharePoint online information management and in-place records management features",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
