{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p></p><p>We’re adding a<b> new PowerShell cmdlet</b> that lets administrators <b>change the organizer of an existing meeting</b> or <b>meeting series </b>in <i>Exchange Online</i>. This feature supports continuity when a meeting owner changes roles, goes on leave, or is offboarded—removing the need to recreate long‑running series. After the transfer, the new organizer can update meeting properties, and attendees within the tenant won’t need to re‑RSVP.</p><p>A future release will enable users to change the organizer directly in <i>Modern Calendar experiences</i> in<i> Outlook on the web</i>, the <i>new Outlook</i>, and <i>Teams</i>. For user‑initiated transfers, the new organizer must accept the meeting before the transfer completes.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=554937#Roadmap\" target=\"_blank\">554937</a>.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability&nbsp;</b></p><ul style=\"\"></ul><p></p><ul><li><b>Worldwide and GCC: </b>We will begin rolling out in <b>mid-May 2026 </b>and expect to complete by<b> late June 2026.</b></li><li><b>GCC High and DoD: </b>We will begin rolling out in <b style=\"font-weight: bold;\">mid-May 2026 </b>and expect to complete by<b style=\"font-weight: bold;\"> late July 2026</b><b>.</b></li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>: </p><ul><li>Administrators managing Exchange Online</li><li>Meeting organizers and attendees in your tenant may see updated organizer information when applicable.</li></ul><p><i>What will happen</i>:</p><ul><li>Administrators can use a new PowerShell cmdlet to change the organizer of an existing meeting or meeting series.</li><li>The new organizer will have full control of the event, including recurrence, description, attendees, and meeting details.</li><li>For attendees within the tenant, the <b>existing event</b> on attendees’ calendars <b>will be silently updated</b> <b>to reflect the new organizer</b>. These attendees won't need to decline or reaccept the meeting.</li><li>Attendees outside the tenant will receive 2 meeting messages - one ending the series with the previous organizer and another inviting them to a series with the new organizer. These attendees should reaccept the meeting.</li><li><b>Meeting history is preserved</b>, supporting continuity and reducing abandoned meeting series.</li><li>This feature is<b> enabled by default</b>; no configuration is required.</li></ul><b><b>What you can do to prepare</b></b><p></p><p></p><p>No action is required. The feature will roll out automatically.</p><p>To prepare:</p><ul><li>Review upcoming public documentation for the cmdlet when it becomes available (a link will be added to this message).</li><li>Update internal processes for organizer transitions, such as role changes or offboarding.</li><li>You may test the cmdlet ahead of the user‑initiated organizer change experience coming to Outlook on the web, new Outlook, and Teams.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p><p></p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "554937"
    },
    {
      "Name": "Summary",
      "Value": "A new Exchange Online PowerShell cmdlet will allow admins to change the organizer of existing meetings or series, preserving meeting history and updating attendees silently within the tenant. Rollout begins mid-May 2026, requiring no configuration. User-initiated organizer changes in Outlook and Teams will follow later."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-09-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227623",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-06T00:42:42.7Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-06T00:42:26Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Change meeting organizer via PowerShell cmdlet in Exchange Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
