{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re introducing<b> improved support for viewing code blocks</b> in the <i>Microsoft Teams mobile app for iOS and Android</i>. This update responds to customer feedback from technical and developer-focused teams who rely on accurate, readable code formatting when collaborating on the go.</p><p><b><b>When this will happen</b></b></p><ul><li><b>Public Preview: </b>We will begin rolling out in <b>early February 2026</b> and expect to complete by <b>mid-February 2026</b>.</li><li><b>General Availability (Worldwide): </b>We will begin rolling out in<b>&nbsp;mid-February 2026</b> and expect to complete by<b> late February 2026</b>.</li></ul><p><b><b>How this will affect your organization</b></b></p><p><i>Who is affected</i>: All users of the Microsoft Teams mobile app on iOS and Android.</p><p><i>What will happen</i>:</p><ul><li>Users will be able to view code blocks sent from Teams desktop or web clients directly on mobile devices.</li><li>Code blocks will appear as a message object (similar to a file preview) optimized for small screens:<p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/9336bb19-bf3c-4b2e-8fbe-151654d1a18a/47b8bdb4c36e456538cd3b0b084e102007e16024.png\" style=\"width: 400px;\" alt=\"user settings\"></p></li><li>Tapping the preview will open a full-screen reader that includes:<ul><li>Syntax highlighting</li><li>Line numbers</li><li>Scrollable containers for long snippets</li></ul></li><li>No admin controls are added with this update.</li><li>This feature is <b>enabled by default </b>and requires no configuration.</li><li>There is no impact to existing messaging workflows or policies.</li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>No admin action is required. The feature will roll out automatically.</li><li>Optional actions:<ul><li>Notify developer or technical user groups who may benefit from this improvement.</li><li>Update internal documentation if you maintain guidance on using code blocks in<i> Teams</i>.</li></ul></li><li>Review <a href=\"https://support.microsoft.com/office/use-code-blocks-in-microsoft-teams-3b8f43ee-86bd-479b-8ad6-6f52661b21e3\" target=\"_blank\">Microsoft Teams documentation</a> for more about code block formatting.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams mobile app will support improved viewing of code blocks with syntax highlighting, line numbers, and scrollable containers starting February 2026. This feature is enabled by default, requires no admin action, and allows users to view code blocks sent from desktop or web clients on iOS and Android devices."
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1223820",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-29T00:37:16.74Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-29T00:37:09Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: View code blocks on mobile",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
