{
  "ActionRequiredByDateTime": "2026-06-29T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Microsoft is retiring <b>Teams Live Events </b>and the <b>Microsoft Graph APIs</b> used to create them on<b> June 30, 2026</b>. Existing events scheduled before that date will continue to function through February 28, 2027. We <b>encourage customers to migrate to Teams town halls</b>, which offer an enhanced, end-to-end experience for large-scale events. This retirement supports Microsoft’s investment in Teams town halls, which provide an improved experience for digital and hybrid events and include comparable Graph APIs for programmatic creation, management, and integration.</p><p><b><b>When this will happen</b></b></p><ul><li>Teams Live Events and associated Microsoft Graph APIs will retire on <b>June 30, 2026</b>.</li><li>Existing Teams Live Events will continue to function through <b>February 28, 2027</b>.</li><li>Customers will no longer be able to schedule Teams Live Events past June 30, 2026, beginning <b>February 3, 2026.</b></li><li>Customers scheduling through Dynamics 365 will not be able to schedule events past June 30, 2026, beginning<b> February 3, 2026</b>.</li><li>The<code> isBroadcast</code> property within the <code>onlineMeeting</code>Graph resource will remain available until <b>June 30, 2026</b>.</li></ul><p><b><b>How this affects your organization</b></b></p><p>You are receiving this message because our reporting indicates your organization may be using or has access to Teams Live Events.&nbsp;</p><p><i>Who is affected</i>:</p><ul><li>Organizations using Teams Live Events.</li><li>Organizations using Microsoft Graph APIs to create Teams Live Events.</li><li>Organizations scheduling Teams Live Events through Viva Engage or Microsoft Dynamics 365.</li></ul><p><i>What will happen</i>:</p><ul><li>Teams Live Events and the associated Microsoft Graph APIs will no longer be available after retirement.</li><li>Teams town hall is now the recommended option for large scale events.</li><li>New scheduling of Teams Live Events will become limited as the retirement date approaches.</li><li>Existing scheduled events will remain supported through the end of the service window.</li><li>Workflows or applications that depend on the<code> isBroadcast</code> property will need to transition.</li><li><b>Teams town halls</b> and <b>Teams meeting Graph APIs</b> will serve as <b>replacements for large-scale broadcast scenarios</b>.</li><li>Customers should migrate to <b>Teams town halls</b> or <b>Teams meeting Graph APIs</b>.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No admin configuration changes are required. We recommend the following:</p><ul><li><b>Assess dependencies</b></li><li style=\"margin-left: 25px;\">Identify where your organization uses Teams Live Events, including events scheduled through Viva Engage, Dynamics 365, or custom Graph-based solutions.</li><li><b>Plan your transition</b></li><li style=\"margin-left: 25px;\">Move large-scale broadcast and virtual event scenarios to Teams town halls or Teams meetings.</li><li style=\"margin-left: 25px;\">Update or replace workflows that rely on the retiring Graph API functionality.</li><li><b>Prepare users</b></li><li style=\"margin-left: 25px;\">Inform event organizers and producers about the retirement and their transition path.</li><li style=\"margin-left: 25px;\">Update internal training, documentation, and support materials.</li></ul><p><b>Use these resources</b></p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/plan-town-halls\" target=\"_blank\">Plan for Teams town halls | Microsoft Teams | Microsoft Learn</a></li><li><a href=\"https://support.microsoft.com/office/get-started-with-town-hall-in-microsoft-teams-33baf0c6-0283-4c15-9617-3013e8d4804f\" target=\"_blank\">Get started with town hall in Microsoft Teams | Meetings | Microsoft Teams | Microsoft Support</a></li><li><a href=\"https://techcommunity.microsoft.com/blog/microsoftteamsblog/retiring-teams-live-events-the-next-chapter-for-events-at-scale-in-microsoft-tea/4486465\" target=\"_blank\">Retiring Teams live events: The next chapter for events at scale in Microsoft Teams | Microsoft Teams Blog</a><br></li><li><a href=\"https://learn.microsoft.com/graph/cloud-communications-virtual-events-townhall-usecases\" target=\"_blank\">Virtual events town hall API use cases | Microsoft Graph | Microsoft Learn</a></li><li><a href=\"https://adoption.microsoft.com/customer-hub/microsoft-teams-events-readiness/\" target=\"_blank\">Customer Hub events readiness sessions</a>&nbsp;- recommended for Teams Live Events users transitioning to Teams town halls:</li><li style=\"margin-left: 25px;\">What’s new in Microsoft Teams town halls and webinars</li><li style=\"margin-left: 25px;\">Migrating from Teams Live Events to town halls</li><li style=\"margin-left: 25px;\">Tips, tricks, and traps for town halls and webinars in <i>Microsoft Teams</i></li></ul><p><b><b>Compliance considerations</b>\n</b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Teams Live Events and related Microsoft Graph APIs will retire on June 30, 2026, with existing events supported until February 28, 2027. Customers should migrate to Teams town halls, which offer enhanced large-scale event features and comparable APIs. No admin changes are needed, but planning and user preparation are recommended."
    }
  ],
  "EndDateTime": "2027-03-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1226495",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-03T18:07:58.813Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-03T18:07:37Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Teams Live Events is retiring",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
