{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Microsoft Defender for Cloud Apps is updating the <b>Microsoft 365 connector configuration page </b>with revised default values for new connector setups. These improvements are designed to help security administrators more easily understand the Microsoft Entra data signals required to support SaaS Identity–related security features. This update also <b>reduces the likelihood of misconfigurations</b> so that capabilities such as SaaS Identity Discovery, Threat Protection, Response, and Posture insights continue to receive the data they depend on.</p><p>This is also a good opportunity to<b> verify that your existing connector configurations are set correctly for the security features</b> in your environment.</p><p><b><b>When this will happen</b>\n</b></p><p>We will begin rolling out in <b>mid-January 2026</b> and expect to complete by <b>late January 2026</b>.\n</p><p><b><b>How this will affect your organization</b></b></p><p><i>Who is affected:&nbsp;</i>Admins who manage Microsoft Defender for Cloud Apps and configure the Microsoft 365 connector.</p><p><i>What will happen:</i></p><p><b>\n</b></p><ul><li>Existing connectors will <b>not</b> be modified. All current connector settings will remain unchanged for privacy reasons.</li><li>The configuration page in the<i> Microsoft 365 connector </i>will receive an updated layout to clarify required permissions.</li><li><b>New default values will apply only to newly created Microsoft 365 connectors</b>.</li><li>Limiting access to required Microsoft Entra signals may reduce threat detection coverage and posture accuracy.</li></ul><p><b><b>What you need to do to prepare</b>\n</b></p><ul><li><b>Review your current configuration of Microsoft 365 connector settings to ensure required Entra permissions remain enabled:</b></li><p><b>&nbsp;</b><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/6557d0f2-f907-4deb-a3a6-73ec6f6a8916/c95ec38ce274c86801e9f10a26d9c8f56f78edc9.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>To do this:<ol><li> Go to <i style=\"font-weight: bold;\">Microsoft Security platform</i><b> &gt; </b><i style=\"font-weight: bold;\">Settings</i><b> &gt; </b><i style=\"font-weight: bold;\">Cloud apps</i><b> &gt; </b><i style=\"font-weight: bold;\">App connectors</i>.</li><li>Select <b><i>Microsoft 365</i></b>.</li><li>Choose <i><b>Edit settings</b></i>.</li><li>Ensure that all required checkboxes are selected (All except \"Microsoft 365 files\").</li><li>Select <i><b>Connect Microsoft 365</b></i>.</li></ol></li><li>Inform your security and identity teams about the updated UI so they are prepared once the refreshed layout becomes available.</li><li>Update internal documentation as needed.</li></ul><p><b>Learn more:&nbsp;</b><a href=\"https://learn.microsoft.com/defender-cloud-apps/protect-office-365#connect-microsoft-365-to-microsoft-defender-for-cloud-apps\" target=\"_blank\">Connect Microsoft 365 to Microsoft Defender for Cloud Apps - How Defender for Cloud Apps helps protect your Microsoft 365 environment | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Cloud Apps will update the Microsoft 365 connector configuration page in January 2026, adding clearer layouts and new default values for new connectors to reduce misconfigurations. Existing connectors remain unchanged. Admins should review current settings to ensure required Entra permissions are enabled."
    }
  ],
  "EndDateTime": "2026-02-22T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1217650",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-14T02:14:05.163Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-14T02:13:45Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Cloud Apps – Improvements to Microsoft 365 connector configuration page",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
