{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Your Microsoft Intune account has been updated to the latest service build.</p><p><b>How this will affect your organization:</b>\n</p><p>You will see the service release number updated in the Tenant Status blade of the Intune admin center soon. We have introduced some changes that we are excited for you to try out.</p><p><b>What you need to do to prepare:</b>\n</p><p>Review the additional information below to learn more about what’s new in this service release. We will continue to update the What’s new page with any features that are released between now and the next monthly service update. Learn more by reviewing features highlighted in the latest Intune <a href=\"https://aka.ms/IntuneWN2601\" target=\"_blank\">What's new 2601 (January) blog</a> and how the Intune service updates each month is described in the Microsoft Intune Service Updates blog. \n</p><p><b>Additional Information:</b>\n</p><p><a href=\"https://aka.ms/IntuneWN\" target=\"_blank\">Intune What's new</a></p><p><a href=\"https://aka.ms/Intune/ServiceChangeBlog\" target=\"_blank\">Staying up to date on Intune new features, service changes, and service health</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Intune service has been updated to the January 2026 build. The release number will appear in the Tenant Status blade. Users should review the latest features on the What's New page and related blogs to prepare for changes and new capabilities."
    }
  ],
  "EndDateTime": "2026-02-21T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1232098",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-14T01:59:41.817Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-14T01:59:30Z",
  "Tags": [
    "New feature",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "What’s new in the Microsoft Intune Service Update for January 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
