{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n</p><p>This feature provides admin's control over Outbound MTA-STS and SMTP DANE validations for emails sent over outbound connectors in <i>Exchange Online</i>, allowing organizations to choose how strictly the service enforces MTA-STS and SMTP DANE when sending mail to external domains. \n</p><p>Admins will be able to configure each outbound connector to use the following modes: \n</p><ol><li><b>Opportunistic <b>default</b></b>, applies to both MTA-STS and SMTP DANE. Opportunistic Mode means Exchange Online will attempt to perform validations for both MTA-STS and SMTP DANE but still sends the message if the destination doesn't support either protocol.\n</li><li><b>None</b>, which applies to both MTA-STS and SMTP DANE and disables the validation entirely, therefore <b>reducing the security of emails sent over that connector</b> by removing MTA-STS and/or SMTP DANE protections designed to prevent downgrade attacks and spoofed MX redirection.\n</li><li><b>Mandatory</b>, applies only to SMTP DANE and enforces full SMTP DANE and DNSSEC validation, requiring the destination to support Inbound SMTP DANE with DNSSEC and queueing mail if the validation does not succeed.\n</li></ol><p><b><b>When this will happen</b>\n</b></p><p><b>General Availability (Worldwide):</b> We will begin rolling out in<b> late February 2026</b> and expect to complete by<b> late March 2026</b>.</p><p><b><b>How this will affect your organization</b>\n</b></p><p>Connectors will default to Opportunistic Mode. Opportunistic Mode is already the default behavior for Exchange Online outbound connectors.&nbsp;</p><p><b><b>What you need to do to prepare</b>\n</b></p><p>If you do not want to change the MTA-STS and/or SMTP DANE validation behavior for your outbound connectors, there is no action you need to take and you can ignore this post.\n</p><p>If you do want to change the MTA-STS and/or SMTP DANE validation behavior for your outbound connectors, review the documentation on this feature which will be updated and provided in this post prior to release.&nbsp; </p><p><b><b>Compliance considerations</b></b>\n</p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Exchange Online will let admins control MTA-STS and SMTP DANE validation modes on outbound connectors starting late February 2026. Modes include Opportunistic (default), None (disables validation), and Mandatory (enforces SMTP DANE). No action is needed unless changes to validation behavior are desired."
    }
  ],
  "EndDateTime": "2026-05-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1220759",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-22T00:44:11.917Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-22T00:44:04Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "MTA-STS and SMTP DANE mode on connectors",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
