{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p><p>We’re improving <b>meet now channel meetings</b> in Microsoft Teams by reducing automatic meeting updates in<b> channel conversations</b>. This change helps keep channels cleaner and focused on real user replies, while meeting details remain accessible when you open the <b>meeting thread</b>.</p><p><b><b>When this will happen:</b></b></p><ul><li>Targeted Release: Rolling out <b>mid-March 2026</b>, expected to complete by<b> early April 2026</b>.\n</li><li>General Availability (Worldwide): Rolling out <b>early April 2026</b>, expected to complete by <b>mid-April 2026</b>.\n</li><li>General Availability (GCC, GCCHigh, DoD): Rolling out <b>late April 2026</b>, expected to complete by<b> mid-May 2026</b>.</li></ul><p>\n</p><p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected: </b>All Microsoft Teams users participating in <b>meet now</b> <b>channel meetings</b>.\n</p><p><b>What will happen:\n</b></p><ul><li>Channel conversations will show fewer automatic meeting messages.<ul><li>Only a single “Meeting started” message will appear when a Meet now meeting begins.\n<b></b></li><li>Other automatic updates (such as meeting end or recording updates) will appear inside the meeting thread, not as additional channel messages.\n</li></ul></li><li>Reply counts will reflect people’s replies, not automatic system messages.\n</li><li>Meeting details, join options, and recaps remain available by opening the meeting thread.\n</li><li>No admin configuration changes are required; the feature is enabled by default.</li></ul><p>\n</p><p><b><b>What you can do to prepare:</b></b></p><ul><li>No action is required. This update will roll out automatically.\n</li><li>Optional: Communicate this change to helpdesk staff to reduce potential confusion.\n</li><li>For more information on <b>channel meetings</b>, visit: <a href=\"https://learn.microsoft.com/microsoftteams/plan-meetings\">Meetings in Teams</a>.</li></ul><b><b>Compliance considerations:</b></b><p></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will reduce automatic updates in Meet Now channel meeting conversations, showing only a single \"Meeting started\" message in the channel. Other updates will appear inside the meeting thread. This rollout begins mid-March 2026 and requires no admin action. Meeting details remain accessible in the thread."
    }
  ],
  "EndDateTime": "2026-06-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1235118",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-20T22:45:40.387Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-19T23:57:11Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Reduced automatic updates in Meet Now channel meeting threads",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
