{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 17, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p>\n<p>Today, admins must manually review trust and compliance information for Teams apps and agents to determine whether they meet their organization’s security, privacy, and compliance requirements. To make this process more scalable and consistent, Teams will introduce a <b>centralized evaluation experience.</b> Admins will define their organization’s trust requirements once, and the system will generate a score and detailed evaluation report for each app and agent based on those requirements. This will help organizations make faster, more consistent approval decisions.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=532720\" target=\"_blank\">532720</a>.</p>\n\n<p><b><b>When this will happen</b></b></p>\n<p><b>General Availability (Worldwide and GCC): </b>We will begin rollout in<b> late February 2026</b>&nbsp;(previously mid-February) and expect to complete by the <b>end of February 2026</b>.</p>\n\n<p><b><b>How this will affect your organization</b></b></p>\n<p><i>Who is affected:</i> Admins who manage apps and agents in the <i>Teams admin center</i>.</p>\n<p><i>What will happen:</i></p>\n<ul>\n  <li>A new <b>evaluation score settings</b> tab will appear in <i><b>Teams admin center &gt; Teams apps</b></i>.</li>\n  <li>Admins will be able to configure approval requirements—such as GDPR compliance, SOC 2 certification, and data residency—one time for their organization.</li>\n  <li>The system will automatically calculate an <b>evaluation score</b> for each app and agent based on how many requirements are met.</li>\n  <li>A new <b>evaluation score</b> column will appear in <b><i>Teams admin center &gt; Teams apps &gt; Manage apps</i></b>, with options to sort and filter by score.</li>\n  <li>A detailed <b>evaluation report </b>will be available on the<i> <b>App details</b> </i>page, providing requirement-by-requirement detail.</li>\n  <li>This feature will not change app enablement or blocking behavior and will not modify any underlying metadata.</li><li>The feature will be<b> enabled by default </b>and will not require admin action to activate.</li>\n</ul>\n\n<p><b><b>What you can do to prepare</b></b></p>\n<p>No action is required. This feature will be available automatically in the <i>Teams admin center</i>.</p><p>Admins may choose to review their approval workflows once the feature becomes available.</p>\n\n<p><b><b>Compliance considerations</b></b></p>\n<p>No compliance considerations identified. Review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "532720"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce a centralized evaluation experience by late February 2026, enabling admins to set trust requirements once. The system will score and report on apps and agents automatically in the Teams admin center, aiding faster, consistent approval decisions without changing app behavior."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1218713",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-18T17:37:00.54Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-16T21:51:53Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Organization evaluation score for apps and agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
