{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>As part of our ongoing mission to deliver a modern, secure, and scalable one-stop management portal for admins, we are transitioning Teams Android device management from the <b>Teams admin center (TAC)</b> to the <b>Teams Rooms Pro Management portal (PMP)</b>.</p>\n<p>This move consolidates management of all Teams devices, including Teams Rooms on Windows, Teams Rooms on Android, Teams phones, and Teams panels, into a single unified portal, providing IT admins a consistent and seamless experience for managing devices at scale.</p>\n<p><b><b>When this will happen:</b></b></p>\n\n\n\n<ul><li>Public Preview: We will begin rollout in <b>early&nbsp;April 2026</b> and expect to complete by <b>mid-April 2026</b>.&nbsp;</li><li>General Availability (Worldwide, GCC): We will begin rollout in <b>early&nbsp;June 2026</b> and expect to complete by <b>mid-June&nbsp;2026</b>.</li><li>General Availability (GCC High): We will begin rollout in<b> early August 2026</b> and expect to complete by mid-August 2026.</li><li>General Availability (DoD): We will begin rollout in <b>early&nbsp;September 2026</b> and expect to complete by <b>mid-September 2026</b>.</li></ul>\n<p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:</b></p><p>Admins who manage Teams Rooms on Android, Teams phones, and Teams panels.</p><p><b>What will happen:</b></p>\n\n\n\n<ul><li>Starting <b>June 2026</b>, Android device management capabilities, including inventory, updates, health monitoring, and settings will transition from <b>TAC </b>to <b>PMP </b>for the device types, Teams Rooms on Android, Teams phones, Teams panels</li><li>The following capabilities will be available and enhanced in PMP:</li>\n<ul>\n  <li>Device inventories for Android-based Teams Rooms, phones, and panels, including metadata and app information</li>\n  <li>Remote device actions (restart, log collection, sign-in/out, provisioning, and more)</li>\n  <li>Update management</li>\n  <li>Device settings management</li>\n  <li>Device health monitoring</li>\n  <li>SIP device management</li>\n</ul>\n\n<li>PMP will become the primary portal for all Teams device management. By <b>July 2026</b>, overlapping TAC capabilities (updates, settings, restart, sign-in/out, log collection, provisioning) will begin redirecting to PMP.</li></ul><p><b><b>What you need to do to prepare:</b></b></p>\n\n\n<ul><li>No action is required until Android device management reaches General Availability.</li><li>When Android device management reaches General Availability:</li>\n<ul><ul>\n  </ul><li>Your existing Android-based Teams devices will automatically appear in PMP.</li><li>Teams Rooms on Android and Teams panels are already visible in PMP.</li><ul>\n  </ul><ul>\n</ul>\n\n</ul><li>If your organization hasn’t used PMP before:</li><ul><li>Admins with <b>Global</b>, <b>Teams</b>, or <b>Teams Device Administrator </b>roles can access PMP at <a href=\"https://portal.rooms.microsoft.com.\" target=\"_blank\">https://portal.rooms.microsoft.com</a>.</li><li>Ensure required URLs are allowlisted per guidance:&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/rooms/enroll-a-device\" target=\"_blank\">Enrolling a device into the Pro Management Portal | Microsoft Learn</a>.</li><li>Learn more about Pro Management portal features with these <a href=\"https://www.youtube.com/playlist?list=PLyhj1WZ29G65glMRLXqtlq7DGBvXg-TnT\" target=\"_blank\">Teams Rooms Pro Management short YouTube videos</a>.</li><ul>\n  </ul><ul>\n</ul>\n\n</ul><li>Update internal helpdesk and IT documentation to reference PMP as the new management portal.</li><li>Additional migration guidance, timelines, and FAQs will be published closer to the transition date.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified, review as appropriate for your organization.</p><ul><ul>\n</ul></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Teams Android device management is moving from the Teams admin center to the Teams Rooms Pro Management portal between April and September 2026. PMP will unify management of all Teams devices with enhanced features. No immediate action is needed; devices will auto-appear in PMP at General Availability."
    }
  ],
  "EndDateTime": "2026-10-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227622",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-06T00:42:30.253Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-06T00:41:45Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Transitioning Teams Android Device Management from Teams admin Center to the Teams Rooms Pro Management portal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
