{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>To improve security and user experience, Teams Mobile users on Android and iOS will soon be able to choose which browser opens non‑Office and PDF links. This update encourages the use of Microsoft Edge—which supports Single Sign-On (SSO), Copilot, and enhanced security—while still allowing users to choose their preferred browser.</p>\n\n<b><b>When this will happen</b></b><p><b>General Availability (Worldwide):</b>&nbsp;Rollout will begin in<b>&nbsp;February 2026</b> and is expected to complete by&nbsp;<b>late February 2026</b>.</p><p></p><p></p><p><b>General Availability (DoD, GCC, and GCCH):</b>&nbsp;Rollout will begin in <b>late February 2026</b> and is expected to complete by&nbsp;<b>late February 2026</b>.</p><p>During rollout, we will monitor user satisfaction (DSAT), Microsoft Edge installation rates, and retention.</p><p></p><p style=\"margin-left: 25px;\">\n\n</p><p style=\"\"><b><b>How this affects your organization</b></b><i></i></p><p style=\"\"><i>Who is affected:&nbsp;</i>All users of Microsoft Teams Mobile on Android and iOS.</p><p style=\"\"><i>What will happen:</i></p><ul><li>When users tap a non‑Office (Word, Excel, PowerPoint) or PDF link, a pop-up will appear at the bottom of the screen (a bottom sheet) prompting them to choose a browser.</li><li>If Microsoft Edge is not installed and the user selects Edge, they will be prompted to download it.</li><li>A new <b>Links in Teams</b> setting will appear in <i>Teams Mobile settings</i>:</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/ae469ad9-1228-4909-9564-df21cf8a8b02/f4ef9726d91e5391bebee764dd7047c3e9a86d97.png\" alt=\"user settings\" style=\"width: 400px;\"></p><li>This feature will be <b>enabled by default </b>for all tenants.</li></ul><p><i>Admins can manage this feature using PowerShell:</i></p><ul><li><b>Policy name:</b> <code>TeamsMobilityPolicy</code></li><li><b>Attribute</b>:<code>LinksInTeams</code></li><li><b>Allowed values:</b><ul style=\"\"><li style=\"\"><code>OfferBrowserOptions</code> — enables the feature</li><li style=\"\"><code>UseSystemDefaults</code> — disables the feature</li></ul></li></ul><p><b><b>What you can do to prepare</b></b></p><p><b>IT Admins:</b></p><ul><li>Review and configure the <code>LinksInTeams</code>attribute under <code>TeamsMobilityPolicy</code> via PowerShell.</li><li>Update internal documentation and notify helpdesk teams about the new browser-selection experience.</li><li>If your organization prefers to disable this feature, set <code>LinksInTeams</code> to <code>UseSystemDefaults</code>.</li></ul><p><b>Users -&nbsp;To change your preferred browser:</b></p><ol><li>Tap your profile icon in the upper-left corner of the Teams Mobile app.</li><li>Select <b>Settings</b>.</li><li>Select <b>Links in Teams</b>.</li><li>If Microsoft Edge is not installed and selected, you will be prompted to download it.</li></ol><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations have been identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting February 2026, Teams Mobile on Android and iOS will prompt users to choose a browser for non-Office and PDF links, encouraging Microsoft Edge use with SSO and enhanced security. The feature is enabled by default, configurable via PowerShell, and allows users to set their preferred browser in app settings."
    }
  ],
  "EndDateTime": "2026-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1216263",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-09T23:10:06.157Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-09T23:09:10Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Browser selection for links in Teams Mobile",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
