{
  "ActionRequiredByDateTime": "2026-07-13T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Microsoft is<b> retiring SharePoint Designer 2013</b>, which follows the <a href=\"https://learn.microsoft.com//lifecycle/policies/fixed\" target=\"_blank\">Microsoft Fixed Lifecycle Policy</a> and will reach end of support on <b>July 14, 2026</b>. This retirement aligns with our commitment to modernize workflow automation and customization experiences using supported tools such as Power Automate.</p><p><b><b>When this will happen</b></b></p><p>End of support <b>begins in mid-July 2026</b>, with retirement enforcement occurring between<b>&nbsp;mid-July and late July 2026</b> across all Microsoft 365 environments (<b>Worldwide, GCC, GCC High, and DoD</b>).</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>: Organizations that use<b> SharePoint Designer 2013</b>&nbsp;for SharePoint workflows or site customizations.</p><p><i>What will happen</i>:</p><ul><li>Microsoft will no longer provide support, security updates, or fixes for SharePoint Designer 2013.</li><li><b>No extensions or exceptions will be offered beyond the retirement date</b>.</li><li>Workflows built with SharePoint Designer 2013 will require migration to supported alternatives such as Power Automate.</li><li>The SharePoint Migration Tool (SPMT) can migrate supported workflow actions to Power Automate.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>We recommend the following actions<b> before July 14, 2026</b>:</p><ul><li>Review existing SharePoint Designer 2013 workflows and customizations.</li><li>Plan and complete migration to supported technologies.</li><li>Update internal documentation, helpdesk knowledge bases, and user communications.</li><li>Use the <b>SharePoint Migration Tool (SPMT) 4.1 </b>to assess and migrate supported workflow actions to Power Automate.</li><li>Note: The SharePoint Migration Tool lets you migrate SharePoint Designer 2013 workflows to Power Automate.</li><li>Review SharePoint Designer 2013 lifecycle details and workflow migration guidance as part of your planning.</li></ul><p>No extension options will be available after the retirement date.</p><p>Learn more:</p><ul><li><a href=\"https://learn.microsoft.com/sharepoint/dev/business-apps/power-automate/guidance/migrate-from-classic-workflows-to-power-automate-flows#classic-workflows-in-sharepoint\" target=\"_blank\">Guidance: Migrate from classic workflows to Power Automate flows in SharePoint | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/lifecycle/policies/fixed\" target=\"_blank\">Microsoft Fixed Lifecycle Policy | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/sharepointmigration/spmt-workflow-migration-spd\" target=\"_blank\">SharePoint Designer 2010 and 2013 workflow migrations to Power Automate | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/lifecycle/products/sharepoint-designer-2013\" target=\"_blank\">SharePoint Designer 2013 Lifecycle | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Designer 2013 will reach end of support on July 14, 2026, with no extensions offered. Organizations must migrate workflows to supported tools like Power Automate using the SharePoint Migration Tool before this date, as Microsoft will stop providing updates or fixes after retirement."
    }
  ],
  "EndDateTime": "2026-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1230891",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-17T18:57:13.883Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-11T23:18:38Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "SharePoint Designer 2013 reaches end of support on July 14, 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
