{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b><br>\nMicrosoft is retiring the <b>Azure AD Account Linking</b>&nbsp;feature that allowed users to connect a work (Azure AD) account with a personal <b>Microsoft account (MSA)</b> to earn Microsoft Rewards points for Bing search activity performed while signed in with a work account.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul>\n  <li><b>February 17, 2026: </b>the feature is retired. </li><li><b>March 19, 2026</b> (30 days from this notice): the capability will be fully removed.</li>\n</ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n  <li>Users who previously linked an Azure AD account to Microsoft Rewards</li>\n  <li>Organizations where users sign in to Bing, Edge, MSN, or Microsoft 365 with a work account</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n  <li>Users can no longer link Azure AD accounts to Microsoft Rewards after <b>March 19, 2026.</b></li>\n  <li>Account linking entry points will be removed from Bing, Edge, MSN, and the Microsoft 365 Admin Center.</li>\n  <li>Existing Microsoft Rewards point balances are not affected.</li><li>Personal Microsoft accounts continue to work as usual when used independently.</li>\n  <li>No admin controls, configuration changes, or policy updates are required.</li></ul><p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n  <li>No action is required from administrators,</li>\n  <li>Inform helpdesk teams of the change,</li>\n  <li>Update any internal documentation that references earning Microsoft Rewards while signed in with a work account</li></ul><p><b><b>Compliance considerations:</b></b></p><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n  <tbody><tr>\n    <th>Question</th>\n    <th>Explanation</th>\n  </tr>\n  <tr>\n    <td>Does the change modify or retire an existing capability?</td>\n    <td>The Azure AD Account Linking feature for Microsoft Rewards is being retired and will no longer be available.</td>\n  </tr>\n  <tr>\n    <td>Does the change allow users to enable or disable the feature themselves?</td>\n    <td>After the feature is removed, users will no longer be able to enable Azure AD account linking for Microsoft Rewards.</td>\n  </tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring the Azure AD Account Linking feature for Microsoft Rewards by March 19, 2026. Users can no longer link work accounts to earn Rewards points. Existing points remain unaffected, personal accounts work as usual, and no admin actions are required."
    }
  ],
  "EndDateTime": "2026-04-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1234567",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-18T18:42:36.66Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-18T18:41:45Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Rewards: Retirement of Azure AD Account Linking",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
