{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 11, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p><p>We are bringing <b>digital signage capabilities</b> to <b>Teams Rooms on Android</b>, similar to what is available for Teams Rooms on Windows. This update allows IT admins to display dynamic content—such as announcements, news, or organizational information—on front‑of‑room displays when the room is not in a meeting. Tenant‑wide and room‑specific configuration is available through the Teams Rooms Pro Management portal. This feature supports select third‑party digital signage partners and is included with the Teams Rooms Pro license.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=548647#Roadmap\" target=\"_blank\">548647</a>.</p><p><b><b>When this will happen</b></p><ul><li><b>General Availability (Worldwide)</b>: Rolling out in<b>&nbsp;</b>mid-April 2026 (previously early March); expected completion by late April 2026 (previously&nbsp;late March).</li></ul><p><b>[How this affects your organization</b></b></p><p><i>Who is affected:</i></p><ul><li>Organizations using<b> Teams Rooms on Android</b>.</li><li>Admins managing devices through the <b>Teams Rooms Pro Management portal</b>.</li><li>Tenants with <b>Teams Rooms Pro licenses</b>.</li></ul><p><i>What will happen</i>:</p><p>Before the rollout, Teams Rooms on Android show a static front‑of‑room display home screen when not in use.</p><p>After the rollout:</p><ul><li>Admins can enable digital signage to display dynamic content when the room is idle:</li><p>&nbsp;<img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/8e1564ea-bc08-41ce-8393-5e1efc98510b/6a79c648517a40a480a6f1811675ccf6c57a0792.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>Supported signage sources include Appspace, XOGO, and custom web URLs.</li><li>Digital signage is configurable at the tenant level and for individual rooms.</li><li>Users can return to the home screen by tapping the touch console.</li><li>Admins can:<ul><li>Choose whether to show the Teams Rooms banner with room info and calendar preview.</li><li>Configure activation and deactivation timers for signage mode.</li><li>Determine whether signage mode respects or bypasses OS screen‑timeout settings.</li></ul></li><li><b>Custom URL requirements</b>:<ul><li>Must begin with <b>https</b></li><li>Must be publicly accessible with <b>no authentication</b></li><li>Must support viewing within an iframe</li></ul></li><li><b>SharePoint and OneDrive URLs are not supported</b> for custom signage.</li></ul><p>Role-based access:</p><ul><li>Global Admins and Teams Rooms Pro Managers can manage tenant‑wide settings.</li><li>These roles can assign additional permissions using Role-based Access Controls (RBAC) for specific rooms or room groups.</li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>Begin planning your digital signage deployment strategy (centralized, localized, or blended).</li><li>Prepare content within supported signage systems.</li><li>After devices update to the minimum required app version:<ul><li>Enable digital signage in the<i> Teams Rooms Pro Management portal</i> by navigating to <b><i>Settings &gt; Digital Signage</i></b>.</li><li>Add signage sources and apply settings to applicable rooms.</li></ul></li><li>Notify helpdesk and affected users of the upcoming capability.</li><li>Update internal documentation and training materials as needed.</li></ul><p>This rollout will occur automatically within the specified rollout window; no administrative action is required before rollout.</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/MicrosoftTeams/rooms/digital-signage\" target=\"_blank\">Configure digital signage on Teams Rooms | Microsoft Teams | Microsoft Learn</a></p><p><b><b>Compliance considerations</b>\n</b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "548647"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Android will gain digital signage capabilities by mid-April 2026, allowing dynamic content display when rooms are idle. Admins can configure tenant-wide or room-specific signage via the Teams Rooms Pro Management portal, supporting select third-party partners and custom HTTPS URLs without authentication."
    },
    {
      "Name": "Platforms",
      "Value": "Android"
    }
  ],
  "EndDateTime": "2026-05-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227077",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-11T17:18:21.21Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-05T00:01:51Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Digital signage in Teams Rooms on Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
