{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p><b><b>Introduction</b></b></p><p>We are updating the filter pane in SharePoint Document Libraries and Lists to deliver a faster, more flexible filtering experience. The core functionality remains the same—users can continue filtering by metadata fields as before—but these improvements address performance issues and incorporate customer feedback for a more intuitive interface.</p><p>Screenshot: <i>Side-by-side comparison of filter pane before and after changes</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/b9fc847f-ab7a-4648-af45-6668ce5255c1\" style=\"width: 400px;\" alt=\"user settings\"></p>\n\n<p><b><b>When this will happen:</b></b></p><ul><li>Targeted Release<b>:</b> Rollout begins <b>mid-February 2026</b> and is expected to complete by<b> late February 2026.</b></li><li>General Availability (Worldwide, GCC, GCC High, DoD): Rollout begins <b>late February 2026</b> and is expected to complete by <b>mid-March 2026</b>.</li></ul>\n\n<b><b>How this affects your organization:</b></b><b><br></b><p></p><p><b>Who is affected:&nbsp;</b>All users of SharePoint Online Document Libraries and Lists.</p><p><b><b>What will happen:</b></b></p><p>The filter pane will automatically update in its existing location. Users will experience the following enhancements:</p><ul><li><b>Expand and collapse sections:&nbsp;</b>Control which filter sections appear. Users can expand or collapse individual sections or collapse all sections at once to quickly scan all available filters.</li><li><b>See all filterable fields:&nbsp;</b>All filterable fields from library or list content will now display without limitations. Because fields are automatically shown, the ability to <b>pin </b>or remove filter fields has been removed.</li><li><b>Enjoy better performance:&nbsp;</b>Filtering interactions are faster and more responsive across all libraries. Users continue to apply filters as before, including filtering by <b>person</b>, <b>date modified</b>, <b>content type</b>, and any custom metadata columns.</li></ul>\n\n<p><b><b>What you can do to prepare:</b></b></p><ul>\n<li>Update internal documentation or training materials to reflect the new expand/collapse filter pane behavior and removal of the pin/remove filter field functionality.</li>\n<li>Communicate these changes to helpdesk and support staff.</li>\n<li>No admin action or configuration change is required.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>No compliance considerations identified; review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The SharePoint Document Libraries and Lists filter pane will update by February-March 2026, offering faster performance, expandable/collapsible sections, and displaying all filterable fields without pin/remove options. No admin action is needed; update documentation and inform support staff accordingly."
    }
  ],
  "EndDateTime": "2026-04-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1229956",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-09T23:20:53.263Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-09T23:20:42Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Updated Filter Pane in SharePoint Document Libraries and Lists",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
