{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Viva Glint Reporting users like managers and leaders will be able to retrace their navigation flow i.e. drill down and drill up in reports rather than lose their navigation flow within reports. Navigation improvements will replace \"Go Back\" to Reporting home page with an alternative clickable UX to enable users to go back to the last page of reporting they were in. In other words, this feature will cater to Back navigation improvements in Reporting.</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=547836\" target=\"_blank\">547836</a>.</p><p>\n</p><p><b><b>When this will happen:</b></b></p>\n<p>General Availability (Worldwide, GCC): Rollout will begin in early February 2026 and complete by mid-February 2026.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<ul>\n<li><b>Who is affected:</b> Managers and leaders who use Viva Glint Reporting.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>The “Go Back” link at the top of reports will be replaced with a new navigation option.</li>\n<li>Users will be able to return to the previous state of the report rather than the Reporting home page.</li>\n<li>This enables drill-down and drill-up navigation within reports.</li>\n<li>The feature will be ON by default for all tenants.</li>\n<li>No admin configuration is required.</li>\n</ul>\n</li>\n</ul>\n\n<p>Screenshot: \"<i>Go back\" in reports has been replaced by a new navigation experience enabling drill-down and drill-up.</i></p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/d6868d4d-e0d5-4ddc-8d47-f4242b640755\" style=\"width: 400px;\" alt=\"user settings\"></p><p><b><b>What you can do to prepare:</b></b></p><ul>\n<li>No action is required from admins.</li>\n<li>You may want to inform managers and leaders about this improved navigation experience.</li></ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "547836"
    },
    {
      "Name": "Summary",
      "Value": "Viva Glint Reporting will improve navigation by replacing the \"Go Back\" link with a feature allowing users to drill down and up within reports, returning to the previous report state instead of the home page. This will roll out globally in February 2026, enabled by default with no admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1219803",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-21T01:12:24.113Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-21T01:12:13Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva - Viva Glint: Navigation improvements in Reporting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
