{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction \n</b></p><p>We are announcing the retirement of Q&amp;A, Power BI’s legacy natural language tool. Starting December 2026, Q&amp;A experiences will be retired. Moving forward, users can leverage Power BI Copilot, which offers a more advanced and integrated solution for querying data using generative AI. This change reduces feature overlap, accelerates innovation, and provides a consistent experience across Power BI. \n</p><p><b>When this will happen:</b></p><p>Q&amp;A experiences and Q&amp;A Setup will be fully retired by the end of December 2026.</p><p><b>How this affects your organization: \n</b></p><p>Who is affected: All organizations using Q&amp;A experiences in Power BI reports, dashboards, mobile, or embedded analytics. \n</p><p><b>What will happen: \n</b></p><ul><li>Creation of new Q&amp;A visuals or experiences will no longer be permitted after December 2026. \n</li><li>Existing Q&amp;A visuals in reports, dashboards, mobile, and embedded scenarios will stop working and will be removed. \n</li><li>Q&amp;A Setup tools (synonyms, linguistic relationships, teach Q&amp;A, etc.) will be retired. \n</li><li>Users should transition to Power BI Copilot for natural language queries and insights. \n</li></ul><p><b>What you can do to prepare: \n</b></p><ul><li>Review reports and dashboards for Q&amp;A visuals and plan to replace them with Copilot experiences. Learn more:&nbsp;<a href=\"https://powerbi.microsoft.com/blog/deprecating-power-bi-qa/\" target=\"_blank\">Microsoft Power BI Updates Blog: Deprecating Power BI Q&amp;A</a>.</li><li>Familiarize yourself with Power BI Copilot and Prep Data for AI as alternatives to Q&amp;A and Q&amp;A Setup. \n</li><li>Update internal documentation and helpdesk guidance to reflect this change. \n</li></ul><p><b>Compliance considerations: \n</b></p><p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Power BI Q&A, the legacy natural language tool, will retire by December 2026. New Q&A visuals cannot be created, and existing ones will stop working. Users should transition to Power BI Copilot for querying data. Organizations should review and update reports, documentation, and support accordingly."
    }
  ],
  "EndDateTime": "2027-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1218421",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-16T00:15:39.09Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-16T00:15:07Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of Power BI Q&A",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
