{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re adding <b>support for <a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/api/ai-services/retrieval/paygo-retrieval\" target=\"_blank\">pay-as-you-go (PAYG) consumption</a> for the Microsoft 365 Copilot Retrieval API</b>. This update gives organizations a flexible way to extend Retrieval API access to users without Microsoft 365 Copilot licenses, while keeping admin control over data access and billing. Users with Copilot licenses will continue to be able to access the Retrieval API at no additional cost.</p><p><b><b>When this will happen</b>\n</b></p><p><b>\n</b></p><ul><li><b>Public Preview Release (Worldwide):</b> We will begin rolling out in Preview in<b> late January 2026</b> and expect to complete by <b>early February 2026</b>.</li><li><b>General Availability (Worldwide): </b>We will begin rolling out in<b>&nbsp;</b>GA in&nbsp;<b>late February 2026 </b>and expect to complete by <b>early March&nbsp;2026</b>.\n</li></ul><p>\n</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected:</i></p><ul><li>Admins managing Microsoft 365 Copilot services and billing</li><li>Tenants using or planning to use the Copilot Retrieval API</li></ul><p><i>What will happen:</i></p><ul><li>A new PAYG option for the Copilot Retrieval API becomes available in the Microsoft 365 admin center under <i><b>Copilot → Billing &amp; usage → Pay-as-you-go</b></i>.</li><li>When enabled by an admin, non-Copilot licensed users can use the <b>Retrieval API</b> to access these<b> tenant-level </b>Microsoft 365 data sources:<ul><li>SharePoint</li><li>Copilot connectors</li></ul></li><li><b>User-level </b>data sources (for example, <b>OneDrive</b>) will <b>remain unavailable</b> to non-Copilot licensed users.</li><li>A minimum of <b>one</b> Microsoft 365 Copilot license must be active in the tenant to enable the PAYG feature.</li><li>The feature is <b>off by default</b> and requires explicit admin configuration.</li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>Ensure your tenant has <b>at least one Microsoft 365 Copilot license</b>.</li><li>Decide whether to enable PAYG for:<ul><li>Specific groups (recommended), or</li><li>All non-Copilot licensed users.</li></ul></li><li>Review and update any internal documentation related to Copilot usage or data access controls.</li><li>If needed, communicate the change to your helpdesk or impacted user groups.</li><li>Configure the feature in the <i>Microsoft 365 admin center </i>under&nbsp;<i><b>Copilot → Billing &amp; usage → Pay-as-you-go</b></i>.</li></ul><p><b>Learn more:&nbsp;</b><a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/api/ai-services/retrieval/overview\" target=\"_blank\">Overview of the Microsoft 365 Copilot Retrieval API | Extensibility | Microsoft 365 Copilot | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><table class=\"table table-bordered\"><tbody><tr><td><b>Question</b></td><td><b>Answer</b></td></tr><tr><td>Does the change alter how existing customer data is processed, stored, or accessed? If so, how?</td><td>Yes. When admins enable PAYG, non-Copilot licensed users can access tenant-level Microsoft 365 data through the Copilot Retrieval API. User-level data (such as OneDrive) is not accessible to unlicensed users.</td></tr><tr><td>Does the change introduce or significantly modify AI/ML or agent capabilities that interact with customer data? If so, summarize the changes.</td><td>Yes. This expands who can use the Copilot Retrieval API to ground large language model responses in Microsoft 365 data, extending access to non-Copilot licensed users under admin control.</td></tr><tr><td>Does the change include an admin control, and can it be managed through Entra ID group membership?</td><td>Yes. Admins decide whether PAYG is enabled, and they can scope access to specific groups using Entra ID.</td></tr><tr><td>Does the change allow a user to enable or disable the feature themselves?</td><td>Yes. Users gain access automatically once an admin enables PAYG; users cannot self-enable or self-disable the feature.</td></tr></tbody></table>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot introduces pay-as-you-go (PAYG) for the Retrieval API, allowing non-Copilot licensed users tenant-level access to SharePoint and connectors under admin control. Rolling out from January to March 2026, it requires at least one Copilot license and explicit admin enablement. User-level data remains restricted."
    }
  ],
  "EndDateTime": "2026-03-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1222980",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-28T00:18:16.817Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-28T00:18:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Pay-as-you-go consumption for the Copilot Retrieval API",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
