{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction\n</b></p><p>We’re improving how alerts show up in Microsoft Defender XDR incidents to help your SOC prioritize actionable work and keep investigations moving efficiently. Starting <b>January 25, 2026</b>, administrators will see the new built in alert tuning experience in the portal UI. During this initial period, the experience is visible, but the built-in tuning won’t be active yet.\n</p><p>The review &amp; opt out window runs from January 25 through February 5. During this time, you can review the new settings and decide whether to keep the default experience enabled or disable it for your organization.</p><p><b>What’s going live on February 5, 2026\n</b></p><p>On<b> February 5, 2026</b>, the functionality becomes active:\n</p><ul><li>Initial rule set: The initial set of rules focuses on <b>Microsoft Defender for Office 365 (MDO)</b>, with 12 built in rules designed for<b> informational and low severity Defender for Office alerts</b>. More built-in rules will be added over time, expanding coverage to additional workloads. You’ll receive advance notification so you can review upcoming additions and opt out before they take effect in your environment. \n</li><li>Automated triage with AIR: For selected alerts with Automated Investigation and Response (AIR) playbooks, Defender will automatically run an immediate investigation to help determine whether SOC attention is required. \n</li><li>Reopen when needed: If the investigation indicates that additional review is needed, the alert will reopen as <b>“New”</b> and return to your queue for analyst action. \n</li></ul><p><b>Included in this release (MDO alert types)\n</b></p><p>The 12 built in rules in this release apply to the following alert types:\n</p><ul><li>User requested to release a quarantined message\n</li><li>Email reported by user as junk\n</li><li>Email reported by user as not junk\n</li><li>Email reported by user as malware or phish\n</li><li>Tenant Allow/Block List entry is about to expire\n</li><li>Removed an entry in Tenant Allow/Block List</li><li>Email messages removed after delivery</li><li>Email messages from a campaign removed after delivery\n</li><li>Email messages containing malicious file removed after delivery\n</li><li>Email messages containing malicious URL removed after delivery\n</li><li>Admin Submission Result Completed\n</li><li>Admin triggered manual investigation of email</li></ul><p>\n</p><p><b>How this affects your organization\n</b></p><ul><li>Default experience: Built in tuning is designed so analysts can focus on alerts most likely to require action, while automated triage runs in the background for eligible alerts.\n</li><li>Customer control: You remain in control - built in rules are visible in the portal and can be disabled at any time in Alert Tuning.</li></ul><p><b>What you need to do to prepare</b></p><ul><li>No action is required if you want to use the default experience and benefit from more streamlined queues and faster prioritization.\n</li><li>If your SOC prefers to manually review every alert without automated triage, use the opt out window (Jan 25–Feb 5) to disable built in tuning in Alert Tuning.\n</li></ul><p>Multi-Tenant Management (MTO) content distribution\n</p><p>If you manage multiple tenants, you can manage built in alert tuning rules at scale using the MTO portal content distribution capability. Configure which built in rules are enabled/disabled in a source tenant and distribute that configuration across your managed tenants for consistent settings everywhere.</p><p><b>Learn more\n</b></p><ul><li>Public documentation: <a href=\"https://aka.ms/built-in-tuning-rules\" target=\"_blank\">Built-in alert tuning rules</a>&nbsp;</li><li>Announcement blog: <a href=\"https://aka.ms/builtintuningblog\" target=\"_blank\">Microsoft Defender XDR Blog</a></li></ul><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting January 25, 2026, Microsoft Defender XDR introduces built-in alert tuning rules focusing on low-severity Office 365 alerts, with automated triage and reopening if needed. Active from February 5, these rules help SOCs prioritize alerts, with an opt-out window until February 5 and multi-tenant management support."
    }
  ],
  "EndDateTime": "2026-02-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1222979",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-28T00:17:53.913Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-28T00:17:00Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "New Built-in Alert Tuning Rules optimize your incident and alert queues",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
