{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 19, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p><b>Introduction</b></p>\n<p>We’re changing how Word, Excel, and PowerPoint file attachments open in Outlook for iOS. For <b>iPad users only, </b>these files will open directly in the Word, Excel, or PowerPoint apps when they are installed, instead of using the in-app previewer.</p>\n\n<p><b>When this will happen:</b></p>\n<p>General Availability (Worldwide, GCC, GCCH, DoD): We will begin rolling this out in <b>early to mid-February 2026</b> and expect to complete the rollout by&nbsp;<b>late March 2026</b>.</p>\n\n<p><b>How this affects your organization:</b></p>\n<p><b style=\"\">Who is affected:</b></p>\n<ul>\n<li>Users on <b>iPad devices</b> running Outlook who have the Word, Excel, or PowerPoint apps installed.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>iPad users will find that Word, Excel, and PowerPoint attachments open directly in the corresponding app.\n</li><li>Users without the Office apps installed will continue to use the in-app previewer.</li>\n<li>No admin configuration is required.</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>No action is required.</li>\n<li>You may choose to notify iPad users or update internal help documentation.</li>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early to mid-February 2026, Outlook for iOS on iPads will open Word, Excel, and PowerPoint attachments directly in their respective apps if installed, replacing the in-app previewer. Users without these apps will still use the previewer. No admin action is needed."
    }
  ],
  "EndDateTime": "2026-05-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227071",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-19T23:41:02.083Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-04T23:59:39Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Files in Outlook for iOS will open in Word, Excel or Powerpoint app on iPad",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
