{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>Non-Microsoft SharePoint Embedded applications now support container archival. This feature helps organizations reduce storage costs by up to 75% by moving large or inactive content to low-cost storage tiers. It also improves Copilot search relevance by prioritizing active content and reducing noise from outdated data.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<ul><li>Public Preview: Rollout will begin in early February 2026 and is expected to complete by late February 2026.</li></ul><p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b> Admins managing SharePoint Embedded applications and developers integrating with SharePoint Embedded APIs.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>New Graph APIs will be available to archive and unarchive containers, enabling integration with your application workflows.</li><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/31a6b60d-cd6d-433e-80ca-59ae75d0652c\" style=\"width: 400px;\" alt=\"user settings\"></p>\n<li>SharePoint Admin Center will include options to archive and reactivate containers alongside existing container management capabilities.</li>\n<li>Archival support is OFF by default. To enable this functionality, you must opt in using a PowerShell cmdlet.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>Enable archival support by running the appropriate PowerShell cmdlet:&nbsp;&nbsp;<ul><li>For a new container type: Use <code>New-SPOContainerType</code> with the parameter <code>-IsArchiveEnabled</code>. Learn more: <a href=\"https://learn.microsoft.com/powershell/module/microsoft.online.sharepoint.powershell/new-spocontainertype?view=sharepoint-ps\" target=\"_blank\">New-SPOContainerType (Microsoft.Online.SharePoint.PowerShell) | Microsoft Learn</a>.</li><li>For an existing container type: Use <code>Set-SPOContainerType</code> with the parameter<code> -IsArchiveEnabled</code>. Learn more: <a href=\"https://learn.microsoft.com/powershell/module/microsoft.online.sharepoint.powershell/set-spocontainertype?view=sharepoint-ps\" target=\"_blank\">Set-SPOContainerType (Microsoft.Online.SharePoint.PowerShell) | Microsoft Learn</a>.</li></ul></li>\n<li>Update your application to handle archived container status and display appropriate messaging to end users.</li>\n<li>Optionally, expose archival and reactivation options in your application interface.</li>\n<li>Review documentation for Graph API integration and PowerShell cmdlet usage.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Embedded apps will support container archival starting February 2026, reducing storage costs by up to 75% and improving Copilot search by prioritizing active content. Admins must opt in via PowerShell, use new Graph APIs, and update apps to manage archived containers. No compliance issues noted."
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1215074",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-08T00:54:41.323Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-08T00:53:41Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "SharePoint Embedded apps can now archive containers to reduce storage costs and improve Copilot results",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
