{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "Starting on <b>January 26, 2026</b>, we will introduce strict Content Security Policy (CSP) enforcement for <a target=\"_blank\" href=\"https://aka.ms/13661Link1\">Power Apps code apps (preview)</a>. CSP is a security feature that protects apps from malicious content by restricting which external sources an app can access.<br><br><b>How does this affect me?</b><br>After <b>January 30, 2026</b>, Power Apps code apps that call assets outside of Power Apps domains will have those requests blocked by default. The code app will play, but these assets called from an external source will not load.<br><br>Please visit <a target=\"_blank\" href=\"https://aka.ms/13661Link2\">How to: Configure Content Security Policy (preview) - Power Apps</a> for more information about the default CSP configuration.<br><br><b>What action do I need to take?</b><br>To enable your code app to call assets from external sources, you will need to <b>allowlist any required external sources</b> using the CSP configuration settings in the Power Platform admin center.<br><br>To prepare for this change, we recommend you <a target=\"_blank\" href=\"https://aka.ms/13661Link3\">configure CSP by using Power Platform admin center</a> and follow the steps below. We recommend taking these steps if you are unsure about what your CSP configuration should be, and your code app is business critical:<ol><li>Temporarily toggle off the <b>Enforce content security policy</b> setting.</li><li>Toggle on the <b>Enable reporting</b> setting.</li><li>Test which sources need to be added to your allowlist after the enforcement date of January 30, 2026.</li><li>Add the required sources to your allowlist.</li><li>Toggle on the <b>Enforce content security policy</b> setting.</li></ol>If your app does not need to call external assets or is not business critical, leave CSP enforcement enabled and <a target=\"_blank\" href=\"https://aka.ms/13661Link4\">enable reporting</a> mode to monitor policy violations and proactively configure CSP.<br><br>Please contact Microsoft Support if you need further assistance.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-02-17T00:51:52Z",
  "HasAttachments": false,
  "Id": "MC1218747",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-17T00:52:19.67Z",
  "Services": [
    "Power Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-17T00:51:52Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Power Apps – Content Security Policy enforcement for Power Apps code apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
