{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 9, 2026: We have updated the CSP timeline. Thank you for your patience.&nbsp;</p><p>Microsoft is introducing a new paid Extended Service Term (EST) to give customers additional time at the end of a subscription term to make the right subscription choices for their business without any service disruption.</p><p>Customers who don’t choose to renew their subscription by the renewal date will now have the ability to select a paid Extended Service Term (EST) option. This replaces the previous option of an automatic grace period that will be retired.  \n</p><p><b><b>Your Options at Subscription End:</b></b></p><p>When a subscription reaches the end of its term, customers now have three options: \n</p><ol><li><b>Renew on time \n</b><ul><li>Renew (with or without changes to subscription terms) before the end date to continue service without interruption.  \n</li></ul></li><li><b>*New* Extend service with a paid Extended Service Term (EST) \n</b><ul><li>Monthly, paid extension to maintain service while finalizing renewal plans \n</li><li>Can be canceled or converted back to a standard subscription at any time \n</li><li>Prorated charges—pay only for days used \n</li><li>Pricing is 3% higher than the standard monthly rate \n</li><li>Seats and service level cannot be changed while in EST \n</li></ul></li><li><b>Cancel at term end \n</b><ul><li>No additional charges \n</li><li>Service ends immediately at term end \n</li><li>Customer data is retained for <b>90 days, then deleted \n</b></li></ul></li></ol><p>These options provide a clear, predictable experience at expiration, making it easier to renew, temporarily extend service without disruption, or cancel \n</p><p><b><b>Who This Applies To:</b></b></p><p>This change applies to Online Services subscriptions governed by the Microsoft Customer Agreement (MCA). \n</p><ul><li>Customers who purchase directly through Microsoft will make changes through the Microsoft Admin Center or, where applicable, through their Microsoft sales specialist.  \n</li><li>Customers who purchase through a Channel Sales Partner (CSP) have the same options and will work with their partner to select the appropriate action at expiration. \n</li></ul><p><b><b>When This Takes Effect:</b></b></p><ul><li>Customers who purchase directly through Microsoft: Applies to subscriptions purchased or renewed on or after February 9, 2026. \n</li><li>Customers who purchase through a CSP partner: Applies to subscriptions with expiration dates on or after May 4, 2026 (previously April 1) (confirm impacted subscriptions with your partner).&nbsp;</li></ul><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft introduces a paid Extended Service Term (EST) starting February 9, 2026, replacing the automatic grace period. At subscription end, customers can renew on time, pay for a monthly EST with prorated charges and 3% higher rates, or cancel with data retained for 90 days. Applies to Microsoft Customer Agreement subscriptions."
    }
  ],
  "EndDateTime": "2026-05-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1216259",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-09T23:05:27.583Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-09T23:03:36Z",
  "Tags": [
    "Updated message",
    "Admin impact"
  ],
  "Title": "Introducing New Paid Extended Service Term (EST)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
