{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\nWe are retiring the <b>Web Search (Bing)</b> image pivot within the SharePoint page image picker. This feature allowed authors to search the web for images using Bing and insert them into SharePoint pages. Because Microsoft has retired the underlying Bing Search API, the <b>Web Search (Bing) i</b>mage pivot will no longer function reliably and will be removed from SharePoint Pages.</p>\n\n<p><b><b>When this will happen:</b></b></p><p>Retirement will begin in <b>early March 2026</b> and is expected to be completed by<b> late April 2026</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p><b>Who is affected:</b></p>\n<ul>\n  <li>All SharePoint Online tenants</li>\n  <li>SharePoint page authors who insert images using the page image picker</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n  <li>The <b>Web Search (Bing)</b> pivot will be removed from the SharePoint page image picker for all tenants.</li>\n  <li>Authors will continue to have access to <b>Stock images</b>, <b>Local file upload</b>, <b>Site and tenant assets</b>, and <b>Recent files</b>.</li>\n  <li>The change is <b>on by default</b> and applies automatically.</li>\n  <li>No admin configuration or policy changes are required.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<p>No action is required before this rollout. You may want to:</p>\n<ul>\n  <li>Inform SharePoint authors that web-based image search will no longer be available.</li>\n  <li>Update internal training or documentation to highlight supported alternatives.</li>\n  <li>Notify help desk staff so they can assist users after the change.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\nNo compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Web Search (Bing) image pivot in SharePoint page image picker will be retired between March and April 2026 due to the Bing Search API retirement. Authors will lose web image search but retain Stock images, uploads, and site assets. No admin action is needed; inform users accordingly."
    }
  ],
  "EndDateTime": "2026-06-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1230452",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-10T23:04:03.017Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-10T23:03:39Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "SharePoint Pages: Retirement of Web Search (Bing) image pivot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
