{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to use the Desktop Companion App in Embedded mode in Dynamics 365 Contact Center. This feature will reach general availability on February 6, 2026.<br><br> \n\n  \n\n<b>How does this affect me?</b><br> \n\nThe Desktop Companion App in Embedded mode enables agents to access Dynamics 365 Contact Center capabilities directly within their chosen Dynamics 365 environment. Embedded mode extends the Desktop Companion App experience to supported third-party Dynamics 365 vendors, offering consistent and optimized agent desktops across platforms. Key features include:<ul> \n\n \n\n<li><b>Optimized Call Performance:</b> Reduces call latency and improves connection stability by leveraging the native DCA framework instead of relying solely on browser‑based telephony.</li> \n\n<li><b>Enhanced Reliability:</b> Provides a more robust and resilient voice experience, minimizing disruptions caused by browser variations, session timeouts, or client‑side environmental inconsistencies.</li> \n\n<li><b>Scalable Deployment:</b> Allows organizations to standardize their voice experience across supported third-party CRMs, enabling broader adoption and easier operational management.</li></ul> \n\n  \n\n<b>What action do I need to take?</b><br> \nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-02-28T20:21:17Z",
  "HasAttachments": false,
  "Id": "MC1225152",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-30T21:05:33.913Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-30T20:21:17Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center – Desktop Companion App support for Embedded Mode",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
