{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>As part of our ongoing protection investments in<i> Microsoft Teams</i>, we will continue expanding the ways users can report suspicious or incorrect activity. Users can already report security concerns and incorrect detections in chats and channels (MC1037768, MC1147984), and more recently in calls (MC1223828). These user‑submitted reports help identify potential malicious activity and strengthen your organization’s security posture.</p><p>Building on this foundation, we will introduce new capabilities that allow Teams administrators to review and export user‑reported security submissions directly in the <i>Teams admin center</i>. A new<b> Protection reports</b> section will be added under <i><b>Analytics and reports</b></i>, giving admins unified visibility into user‑reported calls, chats, and channels.</p><p>This message relates to Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?searchterms=536571#Roadmap\" target=\"_blank\">536571</a>.</p><p><b><b>When this will happen</b></b></p><p><b>Phase 1 – User‑reported call data</b></p><ul><li><b>Targeted Release: </b>Rollout will begin in<b> mid‑March 2026 </b>and complete in <b>late March 2026</b>.</li><li><b>General Availability (Worldwide)</b>: Rollout will begin in <b>mid‑April 2026</b> and complete in <b>late April 2026</b>.</li></ul><p><b>Phase 2 – User‑reported chats and channels</b></p><ul><li>This phase will add message‑level reporting for security concerns and incorrect detections.</li><li>The timeline will be communicated in a future update to this Message center post.</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>: Teams administrators who have access to <b>Analytics and reports</b> in the <i>Teams admin center</i>.</p><p><i>What will happen</i>:</p><ul><li>A new <b>Protection reports </b>section will appear under<b style=\"font-style: italic;\"> Teams admin center &gt; Analytics &amp; reports</b>:<p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/9063fe57-d14e-401d-b7ce-c676b97a6ec7/476f4992fbfe76a78ca8b425da10f23db24e4b40.png\" style=\"width: 400px;\" alt=\"user settings\"> </p></li><li>Admins will be able to view and export data about user‑submitted security reports for calls (Phase 1) and later chats and channels (Phase 2).</li><li>Reported interactions will begin populating once users submit reports.</li><li>Admins will be able to review reported calls or messages and take appropriate action.</li><li>Admins will be able to view 1‑day, 7‑day, and 30‑day reporting windows.</li><li>This feature<b> will require that user reporting settings be enabled</b> in the <i>Teams admin center</i>.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>To ensure reporting data is available when rollout begins, verify that end‑user reporting features are enabled:</p><ul><li>Enable <b>Report a call</b>: <i><b>Teams admin center &gt; Calling settings</b></i></li><li>Enable <b>Report a security concern </b>and <b>Report incorrect detection</b>: <i><b>Teams admin center &gt; Messaging settings</b></i></li><li>Once enabled and users begin submitting reports, access data at: <b><i>Teams admin center &gt; Analytics &amp; reports &gt; Protection reports &gt; User‑reported security submission</i></b></li><li>Update internal documentation if your helpdesk relies on reporting workflows.</li><li>If you maintain training or onboarding materials about Teams security practices, consider adding guidance on how users can report suspicious interactions.</li></ul><p><b><b>Compliance considerations</b></b></p><table class=\"table table-bordered\"><tbody><tr><td><b>Question</b></td><td><b>Answer</b></td></tr><tr><td>Does the change store new customer data, if so, where, and is the data cached or permanently stored?</td><td>Yes. This change stores new customer data because user‑submitted security reports for calls, chats, and channels are collected and made available in the Teams admin center for administrative review.</td></tr><tr><td>Does the change alter how existing customer data is processed, stored, or accessed?</td><td>Yes. This change alters how existing customer data is accessed because it surfaces reported calls, messages, and detections to Teams administrators for investigation within the new Protection reports area.</td></tr><tr><td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td><td>Yes. This change adds new monitoring and reporting capabilities by providing a dedicated Protection reports section where admins can view and export user‑reported security submissions.</td></tr></tbody></table><p><b></b></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "536571"
    },
    {
      "Name": "Summary",
      "Value": "Teams admins will soon access a new Protection reports section in the Teams admin center to review and export user-reported security submissions for calls (from mid-April 2026) and later for chats and channels. This requires enabling user reporting settings and helps improve organizational security monitoring."
    }
  ],
  "EndDateTime": "2026-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227625",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-06T00:44:09.27Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-06T00:44:02Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "User reported security signals in Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
