{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We are introducing a new file-testing capability on the main Classification page in <i>Microsoft Purview</i>. This update enables users to test files against all available Sensitive Information Type (SIT) classifiers to identify sensitive content. Users can test a single classifier or run tests across all classifiers. This enhancement helps organizations identify sensitive information in files and troubleshoot classification issues more efficiently.</p><p>This message is associated with <b>Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=557554\" target=\"_blank\">557554</a></b>.</p><p><b><b>When this will happen</b></b></p><ul><li><b>Public Preview: </b>We will begin rolling out in<b> late February 2026</b> and expect to complete in <b>late March 2026</b>.</li><li><b>General Availability (Worldwide):</b> We will begin rolling out in<b> late March 2026 </b>and expect to complete in<b> late April 2026</b>.</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i></p><ul><li>Admins and users working with Microsoft Purview Data Loss Prevention (DLP) and data classification capabilities.</li></ul><p><i>What will happen</i></p><ul><li>A new file-testing option will appear on the main Classification page in <a href=\"https://sip.purview.microsoft.com/datalossprevention/overview?tid=72f988bf-86f1-41af-91ab-2d7cd011db47\" target=\"_blank\">Microsoft Purview</a>.</li><li>Users will be able to upload files and test them against one or all SIT classifiers.</li><li>This feature will help identify which classifiers match sensitive content within files.</li><li>This feature will be<b> automatically enabled in all tenants</b>. No policy changes are required.</li><li>Existing DLP and classification configurations will continue to function as they do today.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No action is required. This capability will be automatically available in your tenant.</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/troubleshoot/microsoft-365/purview/diagnostics/purview-compliance-diagnostics\" target=\"_blank\">Self-help diagnostics for Microsoft Purview | Microsoft Purview Troubleshooting | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "557554"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview will add a file-testing feature on the Classification page to test files against Sensitive Information Type classifiers. Rolling out from late February to April 2026, it helps identify sensitive content without policy changes and is automatically enabled for all tenants. No action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1235742",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-20T23:57:53.273Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-20T23:57:33Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention – File Testing Against Sensitive Information Classifiers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
