{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>Microsoft Purview Communication Compliance is undergoing a scheduled infrastructure upgrade. Although this migration is planned outside of normal business hours, some production clusters may experience higher loads, potentially causing brief delays in downstream processing. Brief delays in processing may occur during this migration, but no data will be lost.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>This migration will begin&nbsp;<b>January 5, 2026</b>, and end <b>February 28, 2026</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b><br>Admins managing Microsoft Purview Communication Compliance policies and review workflows.</p>\n<p><b>What will happen:</b></p>\n<ul>\n<li>Updates to policy insights and aggregated counts (<b>New pending today</b>, <b>Total pending</b>, <b>Total resolved</b>) may occur at a slower pace than usual.</li>\n<li>Intermittent errors may occur when reviewing flagged messages.</li>\n<li>Brief delays may be observed between receiving an alert notification and accessing messages for review.</li>\n<li>Certain report views may display outdated data until backlog processing is complete.</li>\n<li>Some export functions, such as exporting reports and files, might be temporarily unavailable.</li>\n<li>No data loss will occur—only temporary slowdowns in processing times.</li>\n</ul>\n<p>This maintenance is scheduled outside of normal business hours to minimize impact. However, global organizations may experience some overlap with active hours.</p>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No action is required from administrators; the upgrade will be implemented automatically.</li>\n<li>We recommend informing your administrative and compliance teams about these possible short-term delays.</li>\n<li>If needed, update internal documentation to reflect potential temporary limitations.</li><li><a href=\"https://learn.microsoft.com/purview/communication-compliance\" target=\"_blank\">Learn about Communication Compliance</a>.</li></ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance will undergo infrastructure migration from January 5 to February 28, 2026, causing temporary delays, intermittent errors, and slower updates in policy insights and reports. No data loss will occur. No action is required, but admins should inform teams of possible short-term slowdowns."
    }
  ],
  "EndDateTime": "2026-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1214183",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-06T22:48:36.643Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-06T22:48:30Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Purview Communication Compliance: Temporary delays in processing due to planned infrastructure migration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
