{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to use the modern architecture for Project Operations Integrated with ERP scenarios on the Microsoft Dataverse platform in Dynamics 365 Project Operations. This feature will reach general availability on March 13, 2026.<br><br><b>How does this affect me?</b><br>The following changes will be made when this feature is enabled:<ul><li>Admins can use modern architecture for existing legal entities with additional transaction support, including project procurement documents and item requirements.</li><li>This feature allows the parallel use of projects from both deployment types, enabling long-running projects to enter transactions and create invoices.</li><li>Customers using the stocked deployment type are not impacted unless transitioning to the Project Operations Integrated with ERP deployment type, which does not require reimplementation of the existing legal entity.</li><li>Legacy functions in both deployment types, such as resource management and project work breakdown structures, will be removed or set to read-only in the finance and operations user interface for the Project Operations Integrated deployment type.</li><li>Projects created using modern architecture will use <b>Unified Resource Scheduling</b> for resource scheduling and <b>Project for the Web</b> for project planning.</li></ul>Please note that modern architecture can be tested in a test environment prior to full implementation.<br><br><b>What action do I need to take?</b><br>This message is for awareness, and no action is required.<br><br>If you would like more information on this feature, please visit <a href=\"https://aka.ms/13958\" target=\"_blank\">Move to the modern architecture</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-04-13T23:59:00Z",
  "HasAttachments": false,
  "Id": "MC1230895",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-11T23:36:40.037Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-11T23:33:44Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Project Operations – Modern architecture for existing legal entities with additional transactions support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
