{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to maximize event ROI with paid registration and seamless payment integration in Dynamics 365 Customer Insights - Journeys. This feature will reach general availability on February 13, 2026.<br><br><b>How does this affect me?</b><br>This feature allows you to offer flexible pricing tiers and increase registration conversion with checkout in real-time journeys by embedding ticketing and payments directly into your event flow. The key capabilities of this feature include the following:<ul><li>Create and manage ticket types for your event and its sessions. Set pricing, limits, and access rules.</li><li>Customize your registration form to include ticket selection as part of a seamless signup flow.</li><li>Integrate with a trusted payment provider of your choice for secure checkout experiences. Reduce friction and abandoned registrations.</li><li>Automatically send attendees a QR code-enabled event pass, making entry and session check-ins effortless.</li><li>Eliminate manual reconciliation with real-time payment tracking.</li></ul><b>What action do I need to take?</b><br>This message is for awareness, and no action is required.<br><br>If you would like more information on this feature, please visit <a href=\"https://aka.ms/13516\" target=\"_blank\">Maximize event ROI with paid registration, seamless payment integration</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-02-14T18:44:28Z",
  "HasAttachments": false,
  "Id": "MC1217921",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-14T18:45:18.367Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-14T18:44:28Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Insights – Journeys – Maximize event ROI with paid registration, seamless payment integration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
