{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re introducing a new tenant-level process report in Microsoft Purview eDiscovery. This report gives eDiscovery administrators and managers a centralized view of all eDiscovery processes across cases in their tenant. This enhancement improves oversight of long‑running processes and helps organizations better manage and monitor eDiscovery processes in the tenant.&nbsp;</p><p>This message is associated with roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=551164#Roadmap\" target=\"_blank\">​551164</a>​. &nbsp;</p>\n\n<p><b><b>When this will happen:</b></b></p>\n\n<ul><li>General Availability (Worldwide): Rollout begins <b style=\"\">mid-February</b><b>&nbsp;2026</b> and is expected to complete by <b>late February 2026</b>.</li><li>General Availability (GCC, GCCH, DoD): Rollout begins <b style=\"\">late</b><b> February 2026</b> and is expected to complete by <b>early March 2026</b>.</li></ul>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p><b>Who is affected:</b></p>\n<ul>\n  <li>eDiscovery administrators and managers using Microsoft Purview eDiscovery (Premium).</li>\n</ul>\n\n<p><b style=\"\">What will happen:</b></p>\n<ul>\n  <li>A new<b> tenant-level process</b> report will be available in the Microsoft Purview portal.</li>\n  <li>Administrators and managers will be able to view process activity across eDiscovery cases in the tenant.</li>\n  <li>They can monitor all processes across cases.</li>\n  <li>The feature is <b>enabled by default</b>; no configuration is required.</li>\n  <li>Only authorized users with eDiscovery administrator or manager roles will see the report.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<p>No action is required; the report will appear automatically when available.</p>\n<p>Optional preparation steps:</p>\n<ul>\n  <li>Review existing <b>role assignments</b> to ensure the correct users have access to tenant-level eDiscovery reporting.</li>\n  <li>Share Microsoft Learn documentation with your eDiscovery operations team: <a href=\"https://learn.microsoft.com/purview/edisc-process-report?view=o365-worldwide\" target=\"_blank\">Use the Process report in eDiscovery</a></li>\n  <li>Update internal documentation if you maintain detailed eDiscovery workflows or reporting guidance.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "551164"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview eDiscovery will introduce a tenant-level process report by late February 2026, providing administrators a centralized view of all eDiscovery processes across cases. Enabled by default, it requires no action but allows role-based access for monitoring and managing eDiscovery activities tenant-wide."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-04-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1225187",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-30T22:50:53.557Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-30T22:50:25Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery: Tenant level process report",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
