{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>To maintain security, performance, and long-term compatibility, Microsoft Teams on the web will require modern browser standards. Beginning <b>May 15, 2026</b>, Teams on the web will only be supported on browsers that are compliant with <b>ECMAScript 2022 (ES2022)</b>.</p>\n\n<p><b>When this will happen</b></p>\n<ul>\n  <li><b>Now through May 14, 2026:</b> Users on unsupported browsers will see reminder banners.</li>\n  <li><b>Beginning May 15, 2026:</b> Teams on the web will be blocked on non-compliant browsers.</li>\n</ul>\n\n<p><b>How this affects your organization</b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n  <li>All tenants using <b>Teams on the web</b></li>\n  <li>Users accessing Teams through <b>unsupported browser versions</b></li><li>IT administrators responsible for browser standards and endpoint management</li></ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n  <li>Reminder banners will appear before enforcement.</li>\n  <li>Blocking page will appear starting<b> May 15, 2026</b> until the browser is updated.</li>\n  <li>The change is <b>enabled by default</b> and cannot be disabled.</li><li>Desktop and mobile Teams clients are <b>not impacted</b>.</li></ul>\n\n<p><b>What you can do to prepare</b></p>\n<ul>\n  <li>Inventory browser versions used to access Microsoft 365 web apps.</li>\n  <li>Ensure users are on<b> supported browsers and versions</b>.</li>\n  <li>Notify helpdesk staff and end users ahead of enforcement.</li></ul><p><b>Browser compatibility guidance</b></p><p>All currently supported versions of Microsoft Edge, Google Chrome, Mozilla Firefox, and Safari are <b>ECMAScript 2022 (ES2022)</b> compliant. Browsers that are out of vendor support should be assumed non‑compliant. A browser is considered “out of vendor support” when its publisher no longer provides updates or security fixes; these browsers should be assumed unsupported for Teams on the web.</p><ul>\n</ul>\n\n<p><b>Compliance considerations</b></p>\n<p>Conditional Access policies may be impacted if users attempt access with unsupported browsers.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting May 15, 2026, Microsoft Teams on the web will require browsers compliant with ECMAScript 2022. Unsupported browsers will show reminders until then, after which access will be blocked. Desktop and mobile clients are unaffected. Organizations should update browsers and inform users to ensure compliance."
    }
  ],
  "EndDateTime": "2026-06-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1230888",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-11T23:14:31.58Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-11T23:14:05Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Teams on the web – Browser Update Required by May 15, 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
