{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n</p><p>We’re adding a<b> new preconfigured quick policy template</b> in<i> Insider Risk Management<b> </b></i><b>to help detect potential data theft </b>from Microsoft Fabric and other non-Microsoft 365 cloud storage services, including Box, Dropbox, Google Drive, Azure, and Amazon Web Services (AWS). This template helps admins create scenario-specific policies with minimal configuration, enabling faster and more consistent onboarding.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=543244\" target=\"_blank\">543244</a>.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide): </b>We will begin rolling out in <b>late February 2026</b> and expect to complete by<b> late February 2026</b>.</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>:</p><ul><li>Insider Risk Management admins with permissions to create and manage policies</li><li>Organizations using Microsoft Fabric or non-Microsoft 365 cloud storage providers (Box, Dropbox, Google Drive, Azure, AWS)</li></ul><p><i>What will happen</i>:</p><ul><li>A new quik policy template will appear in<i> <a href=\"https://sip.purview.microsoft.com/insiderriskmgmt/overviewpage?tid=72f988bf-86f1-41af-91ab-2d7cd011db47\" target=\"_blank\">Insider Risk Management</a> </i>under <i><b>Policies &gt; Create policy</b></i>.</li><li>Admins can use the template to detect potential data theft activities performed by:<ul><li>Users leaving the organization, or</li><li>Users whose accounts have been deleted in <i>Microsoft Entra ID</i></li></ul></li><li>The template supports monitoring across Microsoft Fabric and multiple third‑party cloud sources.</li><li>Policies created with this template require minimal configuration to get started.</li><li>Additional tuning may be needed after deployment to optimize alert volume for your environment.</li><li>This feature is <b>not enabled by default</b>; admins must opt in by creating the policy.</li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>Review your Insider Risk Management role permissions to ensure appropriate admin access.</li><li>When available, create the new quick policy from <i><b>Microsoft Purview &gt; Insider Risk Management &gt; Policies &gt; Create policy</b></i>.</li><li>After deployment, evaluate alert volume and adjust thresholds or settings as needed.</li><li>If your organization uses cloud apps such as Box, Dropbox, Google Drive, Azure, AWS, or Microsoft Fabric, confirm the relevant connectors and integrations are enabled.</li><li>For detailed guidance, review:&nbsp;<a href=\"https://learn.microsoft.com/purview/insider-risk-management-policies#quick-policies\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Create and manage Insider Risk Management policies | Microsoft Learn</a></li></ul><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/5bf59437-f497-4d84-90e7-fbb0980428a3/17ef0844aec8d3a9bc159523a9b20c1ba43fa225.png\" style=\"width: 400px;\"></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "543244"
    },
    {
      "Name": "Summary",
      "Value": "A new quick policy template in Microsoft Purview Insider Risk Management will help detect data theft from Microsoft Fabric and non-Microsoft 365 cloud sources like Box, Dropbox, Google Drive, Azure, and AWS. It requires minimal setup, is not enabled by default, and rolls out worldwide in late February 2026."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-05-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1221449",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-23T00:52:31.963Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-23T00:52:11Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Insider Risk Management – Quick policy to detect data theft from non-Microsoft 365 data sources",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
