{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to use Quality Evaluation Agent (QEA) for Bulk Case Evaluation in Dynamics 365 Customer Service. This feature will reach general availability on March 20, 2026.<br><br> \n\n<b>How does this affect me?</b><br> \n\nThis feature enables supervisors to automate continuous quality assessments across their organization at scale. By scheduling evaluations on targeted sets of cases, teams maintain consistent oversight of quality trends, detect issues early, and measure performance without manual effort or disruption.<br><br> \nQEA Bulk Case Evaluation allows supervisors to create evaluation plans directly on the case entity record and run them on a defined schedule. Each plan targets a subset of cases based on supervisor‑defined conditions, ensuring evaluations focus on the most relevant interactions. Supervisors can edit evaluation plans at any time, with updates applied to future runs while past executions remain preserved for reference. Every execution is logged in a run history view, giving full visibility into when evaluations ran, which cases were included, and how quality outcomes evolved over time.<br><br> \nBulk evaluations are integrated with QEA evaluation criteria versioning and always reference the published criteria version in effect at runtime. This ensures consistent and traceable quality measurements.<br><br> \n<b>What action do I need to take?</b><br>This message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-03-18T19:33:58Z",
  "HasAttachments": false,
  "Id": "MC1234588",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-18T19:34:44.917Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-18T19:33:58Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Service - Quality Evaluation Agent for Bulk Case Evaluation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
