{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\nTo ensure reliable delivery of Teams Events email notifications—and to protect organizations using custom HTML templates—we’re enforcing a requirement that all templates reference a verified custom domain in your Microsoft 365 tenant. This improves deliverability, reduces spoofing risk, and aligns with modern email authentication standards. As previously communicated in MC1176301 (October 2025), templates not configured with a verified domain may no longer function as expected after enforcement.\n</p>\n\n<p><b><b>When this will happen:</b></b><br>\nEnforcement was fully rolled out January 31, 2026.\n</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p><i>Who is affected:</i></p>\n<ul>\n  <li>Organizations with Teams Premium licenses.</li><li>Organizations using custom HTML templates for Teams Events email notifications.</li>\n</ul>\n\n<p><i>What will happen:</i></p>\n<ul>\n  <li>Custom HTML templates must reference a domain verified in your Microsoft 365 tenant.</li>\n  <li>Templates without a verified domain may stop working as expected once enforcement begins.</li>\n  <li>Custom formatting or branding may fail without the required configuration.</li>\n  <li>No impact for organizations using default templates.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n  <li>Verify or confirm ownership of the domain you want to use for product notifications in the Microsoft 365 admin center.</li>\n  <li>Update Teams Events email template settings so your custom HTML references a verified domain.</li>\n  <li>Allow up to 12 hours for global propagation after saving.</li>\n  <li>Update internal documentation and notify Teams Events owners or template maintainers.</li>\n</ul>\n\n<p>Learn more:<br>\n<a href=\"https://learn.microsoft.com/en-us/microsoft-365/admin/email/select-domain-to-use-for-email-from-microsoft-365-products?view=o365-worldwide\">\nConfigure domain selection for Microsoft 365 product notifications</a>\n</p>\n\n<p><b><b>Compliance considerations:</b></b><br>\nNo compliance considerations identified, review as appropriate for your organization.\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Teams Premium organizations using custom HTML templates for Teams Events emails must reference a verified custom domain in Microsoft 365 to ensure delivery and prevent spoofing. Enforcement began January 31, 2026. Default templates are unaffected. Verify domains and update templates accordingly to avoid disruptions."
    }
  ],
  "EndDateTime": "2026-03-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1234575",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-18T18:48:24.793Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-18T18:48:19Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Follow‑up on Required Custom Domain Configuration for Teams Event Email Templates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
