{
  "ActionRequiredByDateTime": "2026-03-30T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re <b>retiring the isBroadcast property</b> used to create Teams Live Events through Microsoft Graph. This change aligns with our investment in the Virtual Event APIs, which offer richer capabilities for Webinars and Town Halls, including improved registration, attendee management, presenter configuration, and reporting. These APIs provide more modern, flexible, and scalable options for organizations managing large virtual events.</p><p><b><b>When this will happen</b></b></p><ul><li><b>March 31, 2026</b>: isBroadcast will be removed from the Microsoft Graph <b>beta </b>endpoint</li><li><b>June 30, 2026</b>: isBroadcast will be removed from the Microsoft Graph <b>v1.0 </b>endpoint</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected:&nbsp;</i>Organizations and developers who use the Microsoft Graph <b>onlineMeeting</b> resource with the<b> isBroadcast </b>property to create Teams Live Events programmatically.</p><p><i>What will happen:</i></p><ul><li>The <b>isBroadcast </b>property will no longer be available in <i>Microsoft Graph</i> after the dates listed above.</li><li>Attempts to create Teams Live Events using<b> isBroadcast </b>will fail.</li><li>Programmatic creation of new Teams Live Events through Microsoft Graph will no longer be supported.</li><li>Developers should transition to the <b>Virtual Event APIs</b>, which support Webinar and Town Hall scenarios.</li><li>Existing Teams Live Events scheduled before the retirement date will continue to function normally.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>If your apps, scripts, or workflows use <b>isBroadcast</b>, you should:</p><ul><li>Review <a href=\"https://learn.microsoft.com/graph/cloud-communications-virtual-events-overview\" target=\"_blank\">updated API documentation and migration guidance</a>.</li><li>Migrate to the<b> Virtual Event APIs</b>:<ul><li><b>virtualEventWebinar </b>for Webinars</li><li><b>virtualEventTownhall</b> for Town Halls</li></ul></li><li>Test updated workflows before the retirement dates.</li><li>Update any internal documentation and notify app owners or developers who maintain integrations.</li><li>If your organization does not programmatically create Teams Live Events using Microsoft Graph, no action is required.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/graph/cloud-communications-virtual-events-overview\" target=\"_blank\">Choose the right Teams meeting type | Microsoft Graph | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The isBroadcast property for creating Teams Live Events via Microsoft Graph will be retired by June 30, 2026. Developers must transition to Virtual Event APIs for Webinars and Town Halls. Existing events remain unaffected; migration and testing are advised before retirement."
    }
  ],
  "EndDateTime": "2026-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1226498",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-03T18:09:05.47Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 apps"
  ],
  "Severity": "high",
  "StartDateTime": "2026-02-03T18:08:55Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of the isBroadcast property for Teams Live Events in Microsoft Graph",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
