{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>To support organizations that will run additional employee listening programs, such as surveys for AI transformation or change management, we will introduce a dedicated <b>Survey designer role</b>. This role will grant selected users the ability to create and run Viva Glint surveys with only the permissions required for that work. It will not provide access to platform settings or sensitive data. This will allow organizations to expand survey creation in a secure and flexible way.</p>\n\n<p><b><b>When this will happen</b></b></p>\n<p><b>General Availability (Worldwide): </b>We<b>&nbsp;</b>will begin rolling out in <b>mid‑February 2026</b> and expect to complete by <b>mid‑February 2026</b>.</p>\n\n<p><b><b>How this affects your organization</b></b></p>\n<p><i>Who is affected:</i></p>\n<ul>\n<li>Viva Glint customers in <i>Microsoft Viva</i></li>\n<li>Admins assigning roles and users who create surveys</li>\n</ul>\n\n<p><i>What will happen:</i></p>\n<ul>\n<li>A new Survey designer role will be available in <i>Viva Glint.</i></li>\n<li>Users assigned this role will be able to create and run Viva Glint surveys, collect employee feedback, and manage survey lifecycle tasks.</li>\n<li>Survey designers won’t have access to broader Viva Glint configuration settings or sensitive admin data.</li>\n<li>The role will be available by default but must be explicitly assigned by an admin.</li>\n</ul>\n\n<p><b><b>What you can do to prepare</b></b></p>\n<ul>\n<li>Review which users may benefit from expanded survey creation capabilities.</li>\n<li>Assign the Survey designer role as needed in <i>Viva Glint role management</i>.</li>\n<li>Update internal documentation as relevant.</li>\n<li>Communicate this role availability to stakeholders who run employee listening programs.</li>\n</ul>\n\n<p><b><b>Compliance considerations</b></b></p>\n<p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Glint will introduce a Survey designer role by mid-February 2026, allowing selected users to create and manage surveys without access to sensitive settings. Admins must assign this role, enabling secure, flexible survey creation for employee listening programs. No compliance issues identified."
    }
  ],
  "EndDateTime": "2026-03-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1218413",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-16T00:09:39.39Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-16T00:09:33Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Viva Glint - Survey Designer Role",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
