{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to adjust or reverse project timesheets in Dynamics 365 Project Operations. This feature will be made available for public preview on March 13, 2026.<br><br><b>How does this affect me?</b><br>This feature gives users insights into potential pricing concerns and the ability to enable a streamlined experience to correct intercompany timesheets. These corrections result in a full reversal and the ability to repost timesheets with the required change or updated pricing.<br><br>If you're using <i>Project Operations for Manufacturing</i>, you will be able to enable the <b>Enable posted intercompany project transactions correction</b> feature to gain access to the following functionality:<ul><li>A new form that shows both incoming and outgoing intercompany timesheets.</li><li>An indicator to alert when any prices are set to zero.</li><li>An indicator to alert when the posted pricing is different than the configuration of date effective pricing.</li><li>The ability for project managers to create corrections without being configured as a delegate.</li><li>Increased traceability into the source of the transaction on the intercompany vendor invoice line.</li></ul><b>What action do I need to take?</b><br>This message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-04-12T04:17:00Z",
  "HasAttachments": false,
  "Id": "MC1231506",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-13T04:17:59.333Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-13T04:17:11Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Project Operations – Public preview of the corrections for intercompany project transactions feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
