{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b>\n</p><p>Microsoft is <b>expanding Edge for Business policy management</b> in the <i>Edge management service</i>. In addition to existing Windows policy configurations, organizations will be able to <b>configure Edge for Business policies for macOS, iOS, and Android devices in one place</b>. This enhancement will streamline cross‑platform policy management and support more consistent browser governance across devices.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=522536\" target=\"_blank\">522536</a>.</p>\n\n<p><b><b>When this will happen</b></b></p>\n<ul>\n<li><b>Public Preview (Worldwide):</b>&nbsp;We began rolling out in <b>mid-November 2025</b> and expect to complete by<b> late January 2026</b>.</li>\n<li><b>General Availability (Worldwide):</b>&nbsp;We will begin rolling out in <b>late January 2026</b> and expect to complete by<b> early February 2026</b>.</li>\n</ul>\n\n<p><b><b>How this affects your organization</b></b></p>\n\n<p><i>Who is affected:</i></p>\n<ul>\n<li>Admins who manage Microsoft Edge for Business using the Edge management service</li>\n<li>Organizations deploying Edge on Windows, macOS, iOS, or Android</li>\n</ul>\n\n<p><i>What will happen:</i></p>\n<ul>\n<li>You will be able to configure Edge for Business policies for macOS, iOS, and Android directly in the <i>Edge management service</i>.</li>\n<li>Existing Windows configuration policies remain unchanged.</li>\n<li>You can edit an existing Windows configuration policy or create new policies that target multiple platforms:&nbsp;</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/362bda52-461e-4b2a-87ff-6469311c0807/1b764d348e0b9fa3dde31b9d2ea97c8f9185397d.png\" style=\"width: 400px;\"></p>\n<li>Some policy settings will continue to apply only to Windows devices.</li>\n<li>No user impact unless your organization deploys new or updated policies.</li>\n</ul>\n\n<p><b><b>What you can do to prepare</b></b>\n</p><p>No action is required before rollout. After the feature becomes available:</p>\n<ul>\n<li>Review existing configuration policies and update them if you want to apply settings to macOS, iOS, or Android.</li>\n<li>Update internal admin documentation if you manage Edge policies across platforms.</li>\n<li>Learn more about configuration policies in the Edge management service.</li>\n</ul>\n\n<p><b>Learn more:&nbsp;</b><a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-management-service\" target=\"_blank\">Get started with configuration policies | Microsoft Edge | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b>\n</p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "522536"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is expanding Edge for Business policy management to allow configuring policies for macOS, iOS, and Android in the Edge management service alongside Windows. Public preview starts mid-November 2025; general availability begins late January 2026. No user impact unless new policies are deployed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1217641",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-14T02:08:05.957Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-14T02:07:59Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge: Cross-platform policies in the Edge management service",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
