{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Starting April 1, 2026, Microsoft Places licensing will move from a user-based model to a space-based model. This change will align licensing with how organizations manage physical workspaces and will make core Places experiences more broadly available. Most users will gain access to Places Finder and the Places app, while advanced capabilities such as desk reservations, auto-release policies, and space-based analytics will require a Shared Space license.</p><p>Customers with an active Teams Premium subscription will be able to continue using existing Places premium capabilities through the remainder of their current subscription term. After renewal, these capabilities will be included in <i>Shared Space licensing</i>.</p><p><b><b>When this will happen</b></b></p><ul><li><b>General availability (Worldwide):</b> April 1, 2026</li><li>On this date, organizations will be able to acquire space-based licenses for Microsoft Places.</li></ul><p><b><b>How this will affect your organization</b></b></p><p><i>Who is affected</i></p><p>Organizations that use Microsoft Places, including:</p><ul><li>Users who interact with Places experiences.</li><li>Admins who will configure or manage Places resources (desks, desk pools, and rooms).</li></ul><p><i>What will happen</i></p><ul><li>Places Finder and the Places app will be available across most user licenses; <b>Teams Premium will no longer be required</b> for these capabilities.</li><li>Licensing for Microsoft Places will <b>transition from a user-based model to a space-based model.</b></li><li>Advanced Places functionality will require a <b>Shared Space license</b>, including:<ul><li>Desk reservation support</li><li>Auto‑release policies for desks and rooms</li><li>Space‑based analytics</li></ul></li><li>Users will be able to reserve individual desks only if those desks are covered by a Shared Space license.</li><li>Desks that are configured as bookable but not covered by a Shared Space license will appear as unavailable to users.</li><li>Auto-release policies for desks and rooms will be enforced only when the space is covered by a Shared Space license.</li><li>Admins will still be able to configure auto-release policies, but these policies will not take effect unless the related spaces are licensed with a Shared Space license.</li><li>Analytics for desks and rooms will be available only for spaces that are covered by a Shared Space license.</li><li>Organizations with Teams Premium will be able to continue using existing Places premium capabilities through the current subscription term. After renewal, applicable Places premium capabilities will require Shared Space licensing.</li></ul><i><b>Note</b>: This change will not introduce a new default-on application; it will modify how existing Places capabilities will be licensed and accessed.</i><p><b><b>What you need to do to prepare</b></b></p><ul><li>Review your organization’s <b>desk, desk-pool, and room configurations</b> and identify which spaces will require a Shared Space license.</li><li>Ensure that the following spaces are covered by Shared Space licenses:<ul><li>Desks that will need to support reservations.</li><li>Spaces that will use auto-release policies.</li><li>Spaces that will require space-based analytics.</li></ul></li><li>If your organization has Teams Premium, plan for Places premium capabilities to move to Shared Space licensing after your next renewal date.</li><li>Update internal documentation and help desk scripts to reflect:<ul><li>That some desks may appear unavailable if they are not covered by a Shared Space license.</li><li>That auto-release policies and analytics will only apply to licensed spaces.</li></ul></li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://techcommunity.microsoft.com/blog/microsoftteamsblog/licensing-updates-extend-access-to-advanced-capabilities-in-microsoft-teams-and-/4488312\" target=\"_blank\">Licensing updates extend access to advanced capabilities in Microsoft Teams and Microsoft Places | Microsoft Teams Blog</a></li><li><a href=\"https://learn.microsoft.com/microsoft-365/places/places-overview\" target=\"_blank\">Microsoft Places overview | Microsoft Places | Microsoft 365 | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting April 1, 2026, Microsoft Places licensing will shift from user-based to space-based, making core features widely available without Teams Premium. Advanced features like desk reservations and analytics will require a Shared Space license. Teams Premium users retain current capabilities until renewal, then must switch to Shared Space licensing."
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1235124",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-20T00:04:38.893Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-20T00:04:32Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Upcoming changes to Microsoft Places licensing and feature access",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
