{
  "ActionRequiredByDateTime": "2026-03-20T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>To align with the Android platform lifecycle and ensure customers remain protected with the most up‑to‑date security capabilities, <b>Microsoft Defender for Android</b> <b>will end support</b> for devices running <b>Android 10</b>. After support ends, Defender on Android 10 devices will no longer receive feature updates, security fixes, or technical support. Devices running Android 11 or later will continue to be fully supported.</p><p><b><b>When this will happen</b></b></p><p>Support for Microsoft Defender on Android 10 devices will end on <b>March 31, 2026.</b></p><p><b><b>How this affects your organization</b></b></p><p><i>You are receiving this message because our reporting indicates your organization might have devices running on Android 10.</i></p><p><i>Who is affected:&nbsp;</i>Organizations with users or managed devices running <b>Android 10 and using Microsoft Defender for Android</b>.</p><p><i>What will happen:</i></p><ul><li>Existing installations of Microsoft Defender for Android on Android 10 devices will continue to function, but:<ul><li>They will no longer receive new features.</li><li>They will no longer receive security updates.</li><li>They will no longer receive technical support.</li></ul></li><li>New installations on Android 10 devices will no longer be available after support ends.</li><li>Devices updated to <b>Android 11 or later</b> will continue to receive full support.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No admin action is required for this change to occur. To prepare:</p><ul><li>Identify Android 10 devices using your organization’s device management tools.</li><li>Encourage users to upgrade eligible devices to Android 11 or later.</li><li>Replace devices that cannot be upgraded, if necessary.</li><li>Update internal documentation and support team guidance.</li><li>Notify impacted users about the upcoming end of support.</li></ul><p>If needed, refer to Microsoft Defender for Endpoint documentation for minimum platform requirements.</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/defender-endpoint/microsoft-defender-endpoint-android\" target=\"_blank\">Microsoft Defender for Endpoint on Android | Microsoft Defender | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Android will end support for Android 10 devices on March 31, 2026. After this date, these devices will no longer receive updates, security fixes, or support. Devices on Android 11 or later will remain fully supported. Organizations should identify and upgrade or replace Android 10 devices."
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1222977",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-28T00:15:58.807Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-28T00:15:36Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Defender for Android: End of support for Android 10 devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
