{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re introducing a new capability in <i>Microsoft Purview eDiscovery (Premium) </i>that allows eDiscovery users to <b>add a statistical sample of search results to a review set</b>. This enhancement helps organizations validate search results earlier in the investigation process, improving confidence in data relevance before committing all results to review.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/b43cf390-37c0-4683-bd5d-4016cb59ad16/2424bdacd6be642e5c5b336b5f841b642f617501.png\" style=\"width: 400px;\"></p><p>With this update, reviewers can include a representative subset of items based on configurable sampling criteria, enabling faster early‑stage assessment while reducing review volume.&nbsp;</p><p>This message is associated with <b>Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=516578#Roadmap\" target=\"_blank\">516578</a></b>.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide)</b>: Rollout will begin in<b> late February 2026</b> and is expected to complete by <b>late February 2026</b>.</p><p><b>General Availability (GCC, GCCH, and DoD)</b>: Rollout will begin in<b> early March 2026</b> and is expected to complete by<b> late March 2026</b>.</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>: Administrators and eDiscovery (Premium) users who manage or review search results and review sets in <i>Microsoft Purview</i>.</p><p><i>What will happen</i>:</p><ul><li>This change does not impact any other Microsoft Purview or Microsoft 365 services.</li><li>Users will see new sampling options after search statistics have been generated for a search.</li><li>Users can choose to add all search results to a review set or add a sample of results based on configurable statistical inputs.</li><li>When sampling is selected, reviewers can specify:<ul><li>Confidence level</li><li>Confidence interval</li><li>Percentage‑based sampling options</li></ul></li><li>This capability integrates with existing eDiscovery workflows.</li><li>No changes are made to permissions, access controls, or review set behaviors.</li><li>No features are being removed or replaced.</li><li>The feature will be <b>available by default</b> when it reaches your tenant.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No prerequisites are required, and no action is needed to prepare for this change. The capability will become available automatically.</p><p>If helpful, you may consider:</p><ul><li>Reviewing internal eDiscovery workflows.</li><li>Updating training or documentation to reflect how sampling can support early validation of search results.</li></ul><p>Learn more about eDiscovery: <a href=\"https://learn.microsoft.com/purview/edisc?view=o365-worldwide\" target=\"_blank\">Learn about eDiscovery solutions | Microsoft Learn</a>\n</p><p>Learn more about adding search results to review set: <a href=\"https://learn.microsoft.com/purview/edisc-search-add-to-review-set?view=o365-worldwide\" target=\"_blank\">Add search results to a review set in eDiscovery | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "516578"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview eDiscovery (Premium) will enable adding a statistical sample of search results to review sets, allowing earlier validation and reduced review volume. Rollout starts February 2026 worldwide and March 2026 for GCC/DoD. No prep needed; feature integrates with existing workflows and is enabled by default."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227079",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-05T00:02:48.89Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-05T00:02:25Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery – Add sample to review set",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
