{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We will introduce <b>new control</b>s that allow users <b>to customize</b> how<b> quick views appear </b>at the top of their chat and channels lists in <i>Microsoft Teams</i>. This update aligns with customer feedback requesting a cleaner and more focused experience. These controls will help users see only the quick views that are relevant to them and manage when those views appear.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=555856#Roadmap\" target=\"_blank\">555856</a>.</p><p><b><b>When this will happen</b></b></p><ul><li><b>Targeted Release</b>: We will begin rolling out in<b> March 2026</b> and expect to complete in<b>&nbsp;March 2026</b>.</li><li><b>General Availability (Worldwide, GCC, GCCH, and DoD)</b>: We will begin rolling out in<b> late March 2026</b> and expect to complete by<b> mid‑April 2026</b>.</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>: All Microsoft Teams users in<i> commercial Microsoft 365 tenants</i>.</p><p><i>What will happen</i>:</p><ul><li>Today, within the Teams chat and Teams apps, users see a set of quick views displayed above the lists of chats and channels. These quick views are always visible for all users, regardless of whether they contain messages.</li><li>With this update,<b> quick views will appear only when they contain messages</b>, and users will have new controls to manage how their quick views behave:<p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/ac2a8537-2aeb-4bdc-90ff-e00023af4651/7034df66d2728d9d810c7bdbe937e44f023b4ec9.png\" style=\"width: 400px;\" alt=\"user settings\"></p></li><li>Quick views such as <i><b>Mentions</b>, <b>Followed threads</b></i>, and <b><i>Tag mentions</i></b> will, by default, appear only when a user has at least one message associated with that view.</li><li>Users will be able to adjust each of these quick views from the context menu, including the ability to show them only when unread messages exist.</li><li>Quick views such as <i><b>Saved</b> </i>will be configurable to show always or be hidden.</li><li>Hidden quick views will be accessible by selecting the<b><i> eye icon </i></b>next to the <i><b>Quick views</b></i> header.</li><li>The <i><b>Quick views</b></i> section will be collapsible, and the header will appear in<b> bold </b>when any quick view contains unread messages.</li><li>This feature<b> will not require admin configuration</b> and will be<b> enabled automatically</b> for users.</li><li><b>Platform availability</b>: This update will be available on Microsoft Teams for<b> Windows, Mac, and web</b>. Support for mobile platforms will follow in a future update.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No admin action will be required to enable this feature.</p><p>You may want to:</p><ul><li>Inform your helpdesk or support staff about the upcoming change.</li><li>Update user training materials or documentation if you maintain them.</li><li>Review Teams support resources once updated documentation for quick views becomes available.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "555856"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce new controls in March-April 2026 allowing users to customize quick views in chat and channel lists, showing them only when messages exist. These controls require no admin action, apply to Windows, Mac, and web, and improve focus by managing visibility and behavior of quick views."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2026-05-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1234574",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-18T18:47:55.63Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-18T18:47:40Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New controls for quick views in the chat list",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
