{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re expanding Microsoft Purview Data Loss Prevention (DLP) controls to provide broader governance for Microsoft 365 Copilot. With this update, DLP policies that prevent Copilot from processing content based on sensitivity labels will now apply to Word, Excel, and PowerPoint files regardless of where they are stored. This enhancement responds to customer feedback requesting more consistent protection coverage across local and cloud-based file locations.</p><p>This feature is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=557255#Roadmap\" target=\"_blank\">557255</a>.</p><p><b><b>When this will happen</b></b></p><ul><li><b>General Availability (Worldwide and GCC)</b>: Rollout will begin in<b> late March 2026</b> and is expected to complete by<b> late April 2026</b>.</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i></p><ul><li>Organizations using Microsoft Purview DLP to restrict Copilot processing of sensitivity-labeled content</li><li>Admins who manage Purview DLP policies</li><li>Users working with Microsoft 365 Copilot in Word, Excel, or PowerPoint</li></ul><p><i>What will happen</i></p><ul><li>DLP policies that restrict Copilot from processing sensitivity‑labeled files will apply to Word, Excel, and PowerPoint files in<b> all storage locations</b>, including:<ul><li>SharePoint</li><li>OneDrive for Business</li><li>Local device storage</li><li>Other storage locations accessible to Office apps</li></ul></li><li>When a DLP policy blocks Copilot processing, Copilot will not process the file’s content in Word, Excel, or PowerPoint.</li><li>Existing DLP policies will continue to function normally; <b>no policy migration or reconfiguration</b> is required.</li><li>The feature will be <b>on by default </b>for tenants with relevant DLP rules configured.</li><li>Users will see <b>consistent DLP enforcement</b> when invoking Copilot in <i>supported Microsoft 365 apps</i>.</li></ul><p><b>Implementation detail</b>:</p><p>This update does<b> not </b>modify Copilot capabilities. Instead, Office clients and AugLoop have been enhanced so AugLoop can read a file’s sensitivity label directly from the client. Today, AugLoop retrieves the label by calling Microsoft Graph using the file’s SharePoint or OneDrive URL, which limits DLP enforcement to files stored in OneDrive and SharePoint. By enabling the client to provide the label, DLP enforcement now applies uniformly across all storage locations, including local files.</p><p><b><b>What you can do to prepare</b></b></p><p>No action is required to enable this feature.</p><p>If your organization uses DLP controls for Copilot, you may optionally:</p><ul><li>Review existing DLP policies that include sensitivity-label-based restrictions</li><li>Update internal documentation or helpdesk guidance if needed</li><li>Communicate this enhancement to relevant security or compliance teams</li></ul><p>Learn about managing DLP policies:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/compliance/dlp-learn-about-dlp\" target=\"_blank\">Learn about data loss prevention | Microsoft Purview | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "557255"
    },
    {
      "Name": "Summary",
      "Value": "DLP policies will block Microsoft 365 Copilot from processing sensitivity-labeled Word, Excel, and PowerPoint files across all storage locations, including local devices. This rollout begins late March 2026, requires no policy changes, and ensures consistent DLP enforcement without altering Copilot capabilities."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2026-05-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1234661",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-19T00:58:04.077Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-19T00:57:46Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "DLP policies will be able to block Copilot processing of sensitivity‑labeled files in all storage locations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
