{
  "ActionRequiredByDateTime": "2026-03-16T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>To streamline our alert catalog and focus investment on our unified Microsoft Defender XDR detection capabilities, we’re retiring the “Suspected identity theft (pass‑the‑ticket)” classic alert (External ID: 2018). This retirement aligns with our move toward consolidated XDR alerting and improved detection fidelity. </p><p>We recommend using the “Pass‑the‑Ticket (PtT) attack” alert (Detector ID: xdr_PassTheTicketAttack), where ongoing development and enhancements will continue.</p><p><b><b>When this will happen</b></b></p><p>We’ll retire the classic alert between <b>March 18, 2026</b> and <b>March 22, 2026</b>.</p><p><b><b>How this affects your organization</b></b></p><p>Who is affected:</p><ul><li>Organizations using Microsoft Defender for Identity within Microsoft Defender XDR services.</li><li>Security operations teams and administrators who rely on classic alerting.</li></ul><p>What will happen:</p><ul><li>The “Suspected identity theft (pass‑the‑ticket)” classic alert (External ID: 2018) will stop generating new alerts after retirement.</li><li>Existing historical alerts will remain accessible in your environment.</li><li>The “Pass‑the‑Ticket (PtT) attack” XDR detector (ID: xdr_PassTheTicketAttack) will continue to operate and should be used going forward.</li><li>No changes will be made to user experiences outside security operations.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No admin action is required for this change, but we recommend the following to ensure continuity in your security workflows:</p><ul><li>Update alert triage processes, workflows, and automation to reference the XDR detector IDs.</li><li>Reconfigure alert exclusions or tuning rules using<b> XDR Alert Tuning</b>.</li><li>Notify security and operations teams of the upcoming retirement.</li><li>Update internal documentation to reference the new alert name and detector ID.</li><li>Review Microsoft documentation for configuring XDR Alert Tuning.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The “Suspected identity theft (pass-the-ticket)” classic alert will retire between March 18-22, 2026, replaced by the “Pass-the-Ticket (PtT) attack” XDR alert. Existing alerts remain accessible. No admin action is required, but update workflows, alert tuning, and documentation accordingly. No compliance issues noted."
    }
  ],
  "EndDateTime": "2026-04-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1234542",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-18T18:21:24.57Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-18T18:20:53Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of “Suspected identity theft (pass-the-ticket)” classic alert",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
