{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>To help organizations gain better operational visibility into Microsoft Fabric workloads while maintaining centralized governance, Microsoft is enabling the tenant setting “Workspace admins can turn on monitoring for their workspaces” by default. This change reflects customer feedback requesting easier access to workspace-level insights without automatically enabling monitoring or changing existing permissions. This update does not turn on monitoring for any workspace.</p>\n\n<p><b><b>When this will happen:</b></b></p>\n<p>Starting March 23, 2026</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p><b>Who is affected:</b></p>\n<ul>\n  <li>Tenants using Microsoft Fabric</li>\n  <li>Tenant admins managing Fabric tenant settings</li>\n  <li>Workspace Admins managing Fabric workspaces</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n  <li>The tenant setting “Workspace admins can turn on monitoring for their workspaces” will be enabled by default.</li>\n  <li>No monitoring is automatically enabled for any existing or new workspace.</li>\n  <li>Workspace Admins can choose whether to enable monitoring for their individual workspaces.</li>\n  <li>If enabled by a Workspace Admin, monitoring provides access to logs, metrics, and operational insights related to Fabric items within that workspace.</li>\n  <li>Existing tenant governance, permissions, and security controls are respected.</li>\n  <li>There is no impact to end users unless Workspace Admins explicitly enable monitoring.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n  <li>No immediate action is required.</li>\n  <li>Review the tenant setting in the Fabric Admin portal to understand or adjust your governance posture.</li>\n  <li>If needed, disable the setting to prevent Workspace Admins from enabling monitoring at the workspace level.</li>\n  <li>Consider communicating internal guidance to Workspace Admins about when and how workspace monitoring should be used.</li>\n  <li>Learn more about&nbsp;<a href=\"https://learn.microsoft.com/en-us/fabric/fundamentals/workspace-monitoring-overview\" target=\"_blank\">Workspace Monitoring</a></li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p>\n\n<table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n  <tbody><tr>\n    <th align=\"left\">Compliance area</th>\n    <th align=\"left\">Explanation</th>\n  </tr>\n  <tr>\n    <td>Does the change alter how admins can monitor, report on, or demonstrate compliance activities?</td>\n    <td>Yes. When enabled by a Workspace Admin, workspace monitoring provides access to logs and metrics for Fabric items, improving operational monitoring, audit readiness, and compliance reporting within that workspace.</td>\n  </tr>\n  <tr>\n    <td>Does the change include an admin control, and can it be controlled through tenant settings?</td>\n    <td>Yes. The capability is governed by a tenant-level setting that admins can enable or disable centrally to control whether Workspace Admins can turn on monitoring.</td>\n  </tr>\n  <tr>\n    <td>Does the change allow a user to enable and disable the feature themselves?</td>\n    <td>Yes. Workspace Admins can choose to enable or disable monitoring for their own workspaces when the tenant setting is enabled.</td>\n  </tr>\n</tbody></table><br>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting March 23, 2026, the tenant setting allowing Workspace Admins to enable monitoring in Microsoft Fabric will be enabled by default. Monitoring is not auto-enabled; Workspace Admins decide to activate it, providing logs and metrics access while maintaining existing governance and security controls."
    }
  ],
  "EndDateTime": "2026-04-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1234653",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-19T00:38:19.207Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-19T00:38:07Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Tenant Default Change – Workspace Admins Will Be Allowed to Enable Monitoring",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
