{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 5, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p><p>\nWe’re updating the feedback experience in Microsoft Planner to align with the broader Microsoft 365 feedback policy model. When the <b>Allow users to include screenshots when they submit feedback</b>&nbsp;policy is set to <b>Not Configured</b>, Planner will treat it the same as <b>Enabled</b>. This ensures consistent behavior across Microsoft 365 and gives users clearer, more predictable feedback options.</p>\n\n<p><b><b>When this will happen:</b></b></p><p>\nGeneral Availability: Rollout will begin in<b>&nbsp;</b>mid-February 2026 (previously early February)&nbsp;and complete by end of February 2026 (previously&nbsp;mid-February).</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p><b style=\"\">Who is affected:</b></p>\n<ul>\n  <li>Organizations using Microsoft Planner with Microsoft 365 in-product feedback not configured.</li>\n  <li>Admins managing feedback policies in the Microsoft 365 Apps Admin Center or via Group Policy.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n  <li>When the feedback policy is <b>Enabled </b>or <b>Not Configured</b>, users will be able to include screenshots and file attachments in their in-product feedback.</li>\n  <li>Explicitly <b>Disabled </b>policies will continue to block attachments.</li>\n  <li>No changes will be made to other feedback functionality.</li>\n  <li>No admin action is required for this update.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n  <li>To configure these policy settings, use the <b>Cloud Policy service for Microsoft 365</b>. For more information, refer to<a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\"> Overview of Cloud Policy service for Microsoft 365</a> and search for <b>feedback </b>or <b>survey </b>within Cloud Policy UI to find the policy settings to configure them.</li><li>No action is required.</li>\n  <li>If you want to prevent screenshot or file uploads, explicitly set the related feedback policy to <b>Disabled</b>.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-feedback-ms-org?view=o365-worldwide\" target=\"_blank\">Manage Microsoft feedback for your organization | Microsoft Learn</a></p><p><b><b>Compliance considerations:</b></b></p>\n\n<table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n  <tbody><tr>\n    <th>Impact Area</th>\n    <th>Details</th>\n  </tr>\n  <tr>\n    <td>Stores new customer data?</td>\n    <td>Users may now attach screenshots and files to feedback if feedback policies are not explicitly configured. These are stored in Microsoft’s customer feedback systems.</td>\n  </tr>\n  <tr>\n    <td>Introduces or modifies AI/ML interactions?</td>\n    <td>If feedback relates to the Project Manager agent, attached files may be used to improve the agent’s capabilities.</td>\n  </tr>\n</tbody></table>\n\n<p>No other compliance considerations identified; review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Planner's feedback experience will align with Microsoft 365 policies starting mid-February 2026. If feedback policies are Not Configured or Enabled, users can include screenshots and attachments; Disabled policies block them. No admin action is required unless blocking uploads is desired. Attachments may be used to improve AI features."
    }
  ],
  "EndDateTime": "2026-03-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1224564",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-05T23:35:38.107Z",
  "Services": [
    "Planner"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-30T00:03:27Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Updated feedback experience for Microsoft Planner",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
