{
  "ActionRequiredByDateTime": "2026-04-05T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re introducing<b>&nbsp;Message Trace support</b>&nbsp;on <i>Microsoft Graph</i> to provide a modern, REST‑based API experience for tracing email across your Exchange Online organization. This update aligns with our ongoing effort to move message trace support from the legacy Reporting Web Service to Microsoft Graph. Public Preview is now available, and General Availability roll-out begins January-end.</p><p><b><b>When this will happen</b></b></p><p><b>Public preview (worldwide): </b>Available now.</p><p><b>General availability (worldwide): </b>Rollout begins in late&nbsp;<b>January 2026</b> and is expected to complete by <b>early</b> <b>February 2026</b>.</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i>: Admins and developers who use automated or programmatic message trace capabilities in <i>Exchange Online</i>. Admins and developers who use Reporting Web Service for message trace.</p><p><i>What will happen</i>:</p><ul><li><b>Message trace and message trace detail functionality</b> is now available through<b>&nbsp;Microsoft Graph API</b>.</li><li>The API provides a modern, RESTful experience for querying message trace data.</li><li>This <b>feature will replace</b> the <b>message trace and message trace detail endpoints </b>in the <i>legacy Reporting Web Service</i>.</li><li>Retirement of the Reporting Web Service message trace endpoints begins<b> April 6, 2026</b>.</li><li>New Exchange Online organizations already do not have access to message trace support via the Reporting Web Service.</li><li>No user impact: this change affects admin and developer tooling only.</li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>Review any scripts, automation, or integrations that use the Reporting Web Service for message trace.</li><li>Plan your migration to the Microsoft Graph message trace API <b>before April 6, 2026</b>, when retirement begins.</li><li>Update internal documentation where message trace automation or reporting is referenced.</li><li>Share this update with your dev/ops teams or helpdesk if they rely on trace automation.</li><li>For API details and migration guidance, refer to <a href=\"https://techcommunity.microsoft.com/blog/exchange/message-trace-support-using-graph-api-is-now-in-public-preview/4488587\" target=\"_blank\">Message Trace support using Graph API is now in Public Preview | Exchange team blog | Exchange | Microsoft Community Hub</a>.</li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Message Trace support on Microsoft Graph API is now in Public Preview, offering a modern REST-based experience for Exchange Online email tracing. It replaces legacy Reporting Web Service endpoints, which will retire starting April 6, 2026. Admins and developers should plan migration before then; no user impact expected."
    }
  ],
  "EndDateTime": "2026-05-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1221939",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-24T00:02:38.01Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-24T00:01:00Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Message Trace support on Graph API is now in Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
