{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Expected with Intune's February (2602) service release, we are introducing two new <a href=\"https://learn.microsoft.com/intune/intune-service/fundamentals/role-based-access-control\" target=\"_blank\">role-based access control (RBAC)</a> permissions for Managed Home Screen to enhance role capabilities and streamline device management workflows. Additionally, these roles will be included in the <b>School Administrator</b>&nbsp;and <b>Help Desk Operator</b> built-in roles:\n</p><ul><li>TemporarilySuspendManagedHomeScreen\n</li><li>RestoreManagedHomeScreen</li></ul><p><b>How this will affect your organization:</b>\n</p><p>Admins assigned to the School Administrator and Help Desk Operator roles will automatically gain access to the two new RBAC permissions. This may expand their ability to manage Android devices using Managed Home Screen, depending on how your organization uses these roles.</p><p><b>What you need to do to prepare:</b>\n</p><p>No admin action is required. However, we recommend reviewing your role assignments and informing admins of the expanded permissions. Update any internal documentation or training materials as needed.\n</p><p>If you want to take advantage of the new permissions to add granularity to your roles, stay tuned to <a href=\"https://aka.ms/IntuneWN\" target=\"_blank\">What’s new in Intune</a> for the release.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Intune's February release adds two new Managed Home Screen RBAC permissions—TemporarilySuspendManagedHomeScreen and RestoreManagedHomeScreen—to the School Administrator and Help Desk Operator roles, enhancing Android device management. No admin action is needed, but reviewing role assignments and updating documentation is recommended."
    }
  ],
  "EndDateTime": "2026-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1213781",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-06T06:00:06.107Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-06T06:00:01Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Plan for Change: New Managed Home Screen RBAC permissions added to School Admin and Help Desk Operator built-in roles",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
