{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Microsoft is updating the Copilot Studio service‑specific terms within the <i>Microsoft Power Platform Product Terms</i>. This update adds new commitments describing how Query Data from Entra ID–authenticated use of Copilot Studio is handled when sent to Bing Search and Bing Custom Search. These updates are additive and no other products or terms are affected.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide)</b>: Early February 2026</p><p><b><b>How this will affect your organization</b></b></p><p><i>Who is affected</i>: All commercial tenants using Copilot Studio with Entra ID authentication.</p><p><i>What will happen</i>:</p><p>The Copilot Studio section of the Power Platform Product Terms will be updated with additional commitments governing Query Data sent to Bing for grounding via Bing Search and Bing Custom Search, including:</p><ul><li>Microsoft has no rights in Query Data other than what is required to provide the service.</li><li>Query Data is <b>not </b>used to improve Bing.</li><li>Query Data is<b> not</b> used to create advertising profiles or track user behavior.</li><li>Query Data is <b>not </b>shared with advertisers and is <b>not </b>shared outside Microsoft and contracted suppliers operating under equivalent protections.</li><li>Query Data is <b>not </b>used to train generative AI foundation models.</li><li>Query Data is treated as customer confidential information and is protected with appropriate technical and organizational controls.</li></ul><p>There is no impact to the user experience in <i>Copilot Studio</i> or <i>Bing</i>. No configuration or admin settings are changing, and no new settings are introduced.</p><p><b><b>What you need to do to prepare</b></b></p><p>No action is required from admins or users.</p><p>If useful for your organization’s internal processes, you may choose to share these updated commitments with privacy, security, or legal stakeholders <b>beginning February 1, 2026</b>.</p><p>You can review the updated resources when available. Both resources are expected to be updated in early February 2026:</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-copilot-studio/data-privacy-security-web-search\" target=\"_blank\">Data, privacy, and security for web search | Microsoft Copilot Studio | Microsoft Learn</a></li><li><a href=\"https://www.microsoft.com/licensing/terms/productoffering/MicrosoftPowerPlatform/#ServiceSpecificTerms\" target=\"_blank\">Product Terms - Microsoft Power Platform</a></li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft updates Copilot Studio terms effective February 2026, adding commitments on Query Data from Entra ID use with Bing Search. Data is not used for Bing improvement, advertising, or AI training, remains confidential, and no user or admin actions are required."
    }
  ],
  "EndDateTime": "2026-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1225193",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-30T22:54:35.25Z",
  "Services": [
    "Microsoft Power Automate in Microsoft 365",
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-30T22:53:58Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Copilot Studio product terms update for Bing query data",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
