{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b><br>\nWe’re retiring the <b>OneView </b>and <b>TrueTime</b> features from <b>Outlook Web App (OWA)</b>. <b>OneView </b>allows users to connect personal email accounts—such as Outlook.com, Gmail, or other IMAP accounts—to their work mailbox in OWA, providing a unified view of multiple inboxes. <b>TrueTime</b> allows users to view personal and work calendars together in OWA for consolidated scheduling. Once these features are retired, users will no longer be able to connect personal accounts or view personal calendar information inside OWA.</p>\n\n<p><b><b>When this will happen:</b></b><br>\nThis retirement will begin in <b>early March 2026</b> and complete by <b>late&nbsp;June 2026</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Users who currently use <b>OneView </b>or <b>TrueTime</b> in OWA.</li>\n<li>Users who have connected work and personal accounts within OWA.</li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li><b>OneView </b>and <b>TrueTime</b> features will be removed from OWA.</li>\n<li>Users will no longer be able to connect or access personal accounts within OWA.</li>\n<li>Existing connected accounts will be automatically disconnected.</li>\n<li>Users must manually schedule corresponding events across calendars if needed.</li>\n<li>No admin configuration changes are required; the retirement occurs automatically.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n<li>No admin action is required.</li>\n<li>Notify your users about this retirement.</li>\n<li>Update internal helpdesk guidance and documentation.</li>\n<li>Direct users who need multi-account support to Outlook for Windows or Mac.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b><br>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneView and TrueTime features in Outlook Web App will retire between March and June 2026, removing personal account connections and combined calendar views. Users must manually manage calendars afterward. No admin action is needed, but users should be informed and directed to Outlook desktop apps for multi-account support."
    }
  ],
  "EndDateTime": "2026-08-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1226749",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-04T06:44:20.237Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-04T06:43:52Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Outlook Web App: OneView and TrueTime features will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
