{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to debug routing issues with the Application Insights dashboard in Dynamics 365 Contact Center. This feature will reach general availability on January 31, 2026.<br><br>\n<b>How does this affect me?</b><br> \nThis feature provides efficient troubleshooting of routing delays and assignment issues via the Application Insights Debug dashboard.<br><br>\n \nKey capabilities of the feature include:\n<ul>\n<li>Conversation trend analysis: Visualize trends over the last 24 hours or a custom time range, with filters by channel and queue.</li>\n<li>Assignment Performance: Assess time-to-assign and analyze assignment events to identify bottlenecks.</li>\n<li>Non-assignment reasons: View top reasons for non-assignment and drill into specific cases.</li>\n<li>Conversation timeline: Inspect the complete lifecycle of a conversation, including assignment events.</li>\n<li>Representative details: Access representative presence, capacity, and skills at the time of assignment for better routing insights.</li>\n<li>Assignment events: View the skills, presence, and capacity required by the work item, and analyze each assignment attempt to a specific representative with their actual presence, skills, and capacity. Identify if the attempt was accepted, rejected, or not responded to, and understand why a particular representative wasn't assigned the work item.</li>\n<li>Self-serve troubleshooting: Resolve issues without leaving the Copilot Service workspace app.</li> \n</ul>\n<b>What action do I need to take?</b><br> \nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-02-01T21:28:21Z",
  "HasAttachments": false,
  "Id": "MC1210743",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-01T21:30:14.81Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-01T21:28:21Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Contact Center - Debug routing issues with Application Insights dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
