{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re adding a new way for Microsoft Purview administrators to <b>export adaptive scope members using PowerShell</b>. Today, admins can review current and historical membership in<i> adaptive scopes through the Purview portal</i>. Based on customer feedback, we are introducing a <b>PowerShell cmdlet</b> that offers more flexibility—enabling automated exports, offline analysis, and the ability to resume exports if an operation is interrupted.</p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide, GCC, GCCH, and DoD): </b>Rollout began and will be completed within<i style=\"\"> </i><b>January 2026.</b></p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected:</i></p><ul><li>Administrators who manage Microsoft Purview Data Lifecycle Management, Microsoft Purview Communication Compliance</li><li>Organizations that export adaptive scope membership lists for compliance, reporting, or operational review</li></ul><p><i>What will happen:</i></p><ul><li>A <b>new PowerShell cmdlet</b> will be available to export adaptive scope members.</li><li>Admins can continue using the Microsoft Purview portal; no existing workflows or UI experiences will change.</li><li>The PowerShell cmdlet offers:<ul><li>Granular control over export parameters</li><li>Ability to automate export scenarios using scripts or scheduled tasks</li><li>Ability to resume an interrupted export operation</li></ul></li><li>The feature will be <b>available by default for</b> all tenants.</li><li>There will be no user impact.</li></ul><p><b><b>What you can do to prepare</b></b>\n</p><p>No action is required to prepare for this change.</p><p>If you plan to use the PowerShell option after it becomes available, you may want to:</p><ul><li>Review or update internal scripts that manage adaptive scopes.</li><li>Inform your compliance or security operations teams about the new export method.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/powershell/module/exchangepowershell/get-adaptivescopemembers?view=exchange-ps\" target=\"_blank\">Get-AdaptiveScopeMembers | policy-and-compliance-retention | Exchange PowerShell | Microsoft Learn</a></p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview will introduce a new PowerShell cmdlet to export adaptive scope members, enabling automated, resumable exports with granular control. Available by January 2026 worldwide, this feature complements the existing portal without affecting current workflows. No preparation is required, but admins may update scripts or inform teams."
    }
  ],
  "EndDateTime": "2026-03-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1221450",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-23T00:53:28.173Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-23T00:52:51Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Export adaptive scope members using PowerShell",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
