{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re enhancing<b> Activity Explorer</b> in the<i> Microsoft Purview compliance portal</i> to provide better visibility into sensitive data detected in <i>Exchange Online</i>. Today, admins can only view email message bodies when investigating Data Loss Prevention (DLP) or Information Protection events. With this update, admins will be able to <b>preview flagged email attachments directly within <i>Activity Explorer</i></b>—without downloading the email—simplifying investigations and reducing risk exposure.</p><p>This message is associated with Microsoft Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=543969\" target=\"_blank\">543969</a>.</p>\n\n<p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide) </b>rollout will begin in <b>early February 2026 </b>and complete by <b>early February 2026</b>.</p>\n\n<p><b><b>How this affects your organization</b></b></p>\n\n<p><i>Who is affected:&nbsp;</i>Admins who use Microsoft Purview Activity Explorer to investigate Data Loss Prevention (DLP) or Information Protection events in<i> Exchange Online</i>.</p>\n\n<p><i>What will happen:</i></p>\n<ul>\n  <li>Admins will be able to preview email attachments flagged for sensitive data directly within <i>Activity Explorer:</i></li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/49a4e19a-5362-4e2b-ad09-b4f268c741d8/45cd1b968f314fd2c8c98d1930ed61d867c6e710.png\" style=\"width: 400px;\" alt=\"user settings\"></p><li>A preview pane will appear for supported file types.</li>\n  <li>Email downloads will no longer be required for most investigations.</li><li>The feature will be <b>enabled by default</b>; no configuration changes will be required.</li><li>Existing DLP and Information Protection policies will remain unchanged.</li>\n</ul>\n\n<p><b><b>What you can do to prepare</b></b></p>\n<ul>\n  <li>No action is required. This update will take effect automatically after rollout.</li>\n  <li>(Optional) Communicate this improvement to your security and compliance teams.</li><li>(Optional) Update internal investigation workflows or documentation.</li>\n</ul>\n\n<p><b><b>Compliance considerations</b></b>\n</p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "543969"
    },
    {
      "Name": "Summary",
      "Value": "Starting early February 2026, Microsoft Purview Activity Explorer will let admins preview flagged email attachments in Exchange Online directly within the portal, without downloading emails. This feature is enabled by default, requires no action, and maintains existing DLP and Information Protection policies."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC1217153",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-13T00:09:59.247Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-13T00:09:22Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Information Protection – Email attachment preview in Activity Explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
