{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We are expanding access to <b>People Skills</b> within <b>Microsoft Teams</b>. With this update, employees will be able to view skills directly on the <b>Microsoft 365 profile card</b> in <b>Teams</b>—making it easier to learn about colleagues, strengthen collaboration, and manage their own skills profile in the flow of work.</p><p>As a reminder, <b>People Skills</b> enables employees to build a skills profile based on a shared taxonomy, helping them showcase expertise and connect with others. Eligible <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-overview#licensing\" target=\"_blank\">Microsoft 365 Copilot, Viva,</a> and <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-manage-skills-library#expand-ai-skill-inferencing-to-microsoft-365-e3-and-e5-licensed-users\" target=\"_blank\">Microsoft 365 E3/E5 users</a> may also benefit from AI‑powered skill inferencing, which uses Microsoft Graph signals to automatically generate a personalized skills profile for each eligible employee and keep it up to date.&nbsp;<b>People Skills</b> data enhances Microsoft 365, Copilot, and Viva experiences by providing richer, contextual insights about people across the organization.</p><p>Learn more:&nbsp;<a href=\"https://adoption.microsoft.com/ai-agents/people-skills/\" target=\"_blank\">People Skills | Microsoft Adoption</a></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=552588#Roadmap\" target=\"_blank\">552588</a>.</p><p><b><b>When this will happen:</b></b></p><ul><li>Targeted Release: We will begin rolling out <b>early March 2026</b> and expect to complete by <b>mid-March 2026</b>.</li><li>General Availability (Worldwide):We will begin rolling out <b>March 2026</b> and expect to complete by<b>&nbsp;April 2026</b></li></ul><p><b><b>How this affects your organization:</b></b></p><p><b>Who is affected:&nbsp;</b></p><ul><li>Users who have access to People Skills and can view the Microsoft 365 profile card in Teams</li></ul><p><b>What will happen:&nbsp;</b></p><p>Once this update is rolled out, all employees<b> in tenants who have already set up People Skills</b>&nbsp;will find a Skills section on the <b>Microsoft 365 profile card</b> in <b>Teams</b>. This makes it easier for users to:</p><ul><li>View colleagues’ skills in the profile card on Teams to better understand and connect with colleagues</li><li>Access and manage their own skills profile from the new Skills component on the profile card in Teams</li></ul><p>There is no change to existing <b>People Skills</b> admin controls, configuration settings, or data access permissions. People skills must be setup before the Skills component</p><p>is visible in M365 Profile Cards.<br></p><p><b><b>What you can do to prepare:</b>\n</b></p><p>&nbsp;If your organization uses People Skills today, no admin action is required. The experience will automatically appear on the<b> profile card</b> in <b>Teams</b>.<br>If you do not have People skills setup, please review your documentation to do so in admin center. <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-setup\" target=\"_blank\">Learn how to set up People Skills.</a></p><p>You may wish to:</p><ul><li>Inform users about this enhanced visibility of skills in <b>Teams</b>.</li><li>Set up <b>People Skills</b> in <b>admin center</b>. <a href=\"https://learn.microsoft.com/copilot/microsoft-365/people-skills-setup\" target=\"_blank\">Learn how to set up People Skills</a>.</li></ul><p><b><b>Compliance considerations:</b></b></p><ul><li>No changes have been made to how existing customer data (including documents, emails, and chats) is processed, stored, or accessed. This update does not introduce new AI/ML capabilities or modify inferencing behavior; it only expands where <b>People Skills</b> data is displayed.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "552588"
    },
    {
      "Name": "Summary",
      "Value": "People Skills will expand to Microsoft Teams, allowing employees to view and manage skills on the Microsoft 365 profile card within Teams. The rollout starts March 2026, enhancing collaboration without changing admin controls or data handling. No admin action is needed if People Skills is already set up."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1226221",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-02T23:46:40.153Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-02T23:46:11Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "People Skills on the profile card expanding to Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
