{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>We’re introducing <b>automatic local backups </b>in <i>OneNote for iOS</i> to improve notebook resilience and provide a self‑service recovery option that aligns with the backup experience already available on Windows and macOS. This update helps users recover notebooks independently while giving organizations control through existing Intune app protection policies.</p><p></p><p><b><b>When this will happen</b></b></p><p><b>General Availability (Worldwide, GCC, GCCH and DoD):</b> Rollout will begin in <b>mid-March 2026</b> and is expected to complete by <b>mid-April 2026</b>.</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i></p><ul><li>All organizations with users who run <b>OneNote for iOS</b>.</li><li>Applies to Commercial, GCC, GCC High, and DoD tenants that receive the standard OneNote for iOS app.</li></ul><p><i>What will happen</i></p><ul><li>OneNote for iOS will automatically create<b> local backups</b> of notebooks.</li><li>Backups will be stored in a <b>user‑accessible location</b> in the <i>Files app on iOS</i>.</li><li>Users will be able to recover notebooks using these backups by transferring the backup file to a Windows PC or Mac (iOS does not support opening notebook files directly).</li><li>The feature will be&nbsp;<b>on by default </b>unless restricted through existing Intune app protection policies.</li><li>The feature <b>will respect your organization’s existing data protection settings</b>. No new policy configuration will be required.</li><li>If the Intune <i>Send org data to other apps</i> setting is not set to<b> All apps</b>, OneNote local backups will be automatically disabled for managed users.</li></ul><p><b><b>What you can do to prepare</b></b></p><p>If you want to manage or restrict this capability:</p><ul><li>Review your existing<b> Intune app protection policies</b>:<ul><li><i>Send org data to other apps</i> (parent policy)</li><li><i>Save copies of org data</i> (child policy)</li><li><i>Allow user to save copies to selected services</i> (child policy), with location validation set to<i> Other</i>.</li></ul></li><li>If <i>Send org data to other apps</i> is set to anything other than <b>All apps</b>, no action is required—backups will remain disabled automatically.</li><li>If your organization has<b> no Intune app protection policies configured</b>, backups will be <b>enabled by default</b>.</li><li>Update internal documentation or helpdesk materials if you describe OneNote backup and recovery behavior.</li><li>Share the following user note internally if needed:<ul><li>“<i>Notebook recovery from iOS requires transferring the backup file to a Windows PC or Mac.</i>\"</li></ul></li></ul><p>Learn more:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/intune/intune-service/apps/app-protection-policies\" target=\"_blank\">Create and deploy app protection policies | Microsoft Intune | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/intune/intune-service/apps/app-protection-policy-settings-ios#data-protection\" target=\"_blank\">Data protection - iOS/iPadOS app protection policy settings | Microsoft Intune | Microsoft Learn</a></li></ul><p><b><b>Compliance considerations</b></b></p><table class=\"table table-bordered\"><tbody><tr><td><b>Question</b></td><td><b>Answer</b></td></tr><tr><td><b>Does the change store new customer data, and if so, where?</b></td><td><b>Yes. </b>The change stores new copies of organizational notebook data as local backup files in user‑accessible device storage on iOS (Files app). These backups are automatically created and retained on the device.</td></tr><tr><td><b>Does the change modify, interrupt, or disable any Purview‑related capabilities such as DLP, sensitivity labels, conditional access, auditing, eDiscovery, or retention?</b></td><td><b>Yes.</b> The feature is governed by Intune app protection policies. If an organization restricts data movement—for example, if “Send org data to other apps” is not set to “All apps”—OneNote local backups on iOS are automatically disabled for managed users.</td></tr><tr><td><b>Does the change modify how users can access, export, delete, or correct their personal data within Microsoft 365 services?</b></td><td><b>Yes. </b>The change provides users with a new method to access and export notebook data from iOS devices by accessing local backup files stored in the Files app. Users can move these files to a Mac or PC to complete notebook recovery.</td></tr><tr><td><b>Does the change include an admin control, and can it be controlled through Entra ID group membership?</b></td><td><b>Yes. </b>Admins can manage this feature through existing Intune app protection policies, which can be scoped using Entra ID groups. This allows organizations to allow or block local backups based on group membership.</td></tr><tr><td><b>Does the change allow a user to enable or disable the feature themselves?</b></td><td><b>Yes. </b>Users can choose whether to access or move their local backup files, but the availability of the feature itself is controlled by the organization’s Intune policies rather than an in‑app user toggle.</td></tr></tbody></table><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneNote for iOS will automatically create local backups of notebooks stored in the iOS Files app, enabling self-service recovery via PC or Mac. This feature, rolling out mid-March to mid-April 2026, respects existing Intune app protection policies and is enabled by default unless restricted by organizational settings."
    }
  ],
  "EndDateTime": "2026-05-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1235123",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-20T00:04:05.72Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-20T00:03:45Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "OneNote for iOS: Introducing automatic local backups",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
