{
  "ActionRequiredByDateTime": "2026-02-27T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As communicated in <a href=\"https://iridias.microsoft.com/messagecenter?id=1125485\" target=\"_blank\">MC1125485 </a>and <a href=\"https://learn.microsoft.com/entra/identity/authentication/howto-mfa-mfasettings#custom-voice-messages\" target=\"_blank\">Configure Microsoft Entra multifactor authentication - Microsoft Entra ID | Microsoft Learn</a>, we will retire the <b>Custom greetings</b> feature in <b>Voice call authentication</b> on <b>February 28, 2026</b>. This feature allowed organizations to customize voice call greetings for multifactor authentication (MFA). After this date, voice call authentication messages will use Microsoft’s default recordings. \n</p><p><b>How this affects your organization \n</b></p><p>Starting <b>February 28, 2026,</b> the custom greeting feature will no longer be available. Voice call authentication will revert to Microsoft’s default voice recordings. If your organization relies on custom greetings for branding or user recognition during MFA, this change may impact the user's experience. \n</p><p><b>What you need to do to prepare \n</b></p><ul><li>This retirement will happen automatically on the specified dates. If your organization is still using the Custom greetings feature, begin preparing users for the transition to Microsoft’s default voice greetings. \n</li><li>Review your multifactor authentication configuration and ensure users are aware of the upcoming change: <a href=\"https://entra.microsoft.com/#view/Microsoft_AAD_IAM/AuthenticationMethodsMenuBlade/~/AdminAuthMethods/fromNav/\" target=\"_blank\">Authentication methods - Microsoft Entra admin center</a> \n</li><li>For guidance on planning and implementing Microsoft Entra multifactor authentication, see: <a href=\"https://learn.microsoft.com/entra/identity/authentication/howto-mfa-getstarted\" target=\"_blank\">Deployment considerations for Microsoft Entra multifactor authentication - Microsoft Entra ID | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Custom greetings in voice call authentication will retire on February 28, 2026. After this date, voice calls for multifactor authentication will use Microsoft’s default recordings. Organizations should prepare users for this change and review their MFA configurations accordingly."
    }
  ],
  "EndDateTime": "2026-03-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1219798",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-21T00:41:02.57Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-21T00:40:31Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Custom greetings in voice call authentication will retire on Feb 28, 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
