{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 6, 2026: We have updated the image below. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p><p>\nMicrosoft is introducing a unified <b>plus (+) menu&nbsp;</b>to make it easier for users to add grounding, tools, and sources when prompting in Microsoft 365 Copilot. Grounding refers to the content users connect to Copilot—such as files, sites, or other organizational data—that helps improve response relevance. This update consolidates related actions into a single menu, improving discoverability and streamlining the workflow for adding entities or updating inputs. This simplified menu will be available for Copilot Chat users (without a Microsoft 365 Copilot license) and Microsoft 365 Copilot users (with a Microsoft 365 Copilot license).</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/5a6868b5-a14a-4940-a1a8-69db2b76621d/2cb3a2a49fc68160203118c32ff513631910fbcb.png\" style=\"width: 400px;\" alt=\"user settings\"></p><p>Note: The <b>Tools menu</b> will be consolidated under the unified <b>plus (+) menu</b>&nbsp;and no longer exist as a separate menu in the prompt box after this change.</p>\n\n<p><b><b>When this will happen:</b></b></p><p>\nGeneral Availability (Worldwide): Rollout begins in<b> late February 2026</b> and is expected to complete by <b>mid‑March 2026</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p>&nbsp;&nbsp;<b>Who is affected:</b></p><p>\n&nbsp;&nbsp;Copilot Chat and Microsoft 365 Copilot users that rely on the unified <b>plus (+) menu</b>.</p>\n\n<p>&nbsp;&nbsp;<b>What will happen:</b></p>\n<ul>\n  <li>Users will see a redesigned and unified <b>plus (+) menu</b>.</li>\n  <li>Grounding options, tools, and data sources will be consolidated in one menu.</li>\n  <li>Users will be able to add entities and update sources from this unified location.</li>\n  <li>The feature will be <b>enabled by default </b>and replaces the current experience; no admin configuration is required.</li>\n  <li>Existing admin policies related to Copilot input sources remain unchanged.</li>\n</ul>\n\n<p><b><b>What you can do to prepare:</b></b></p><p>\nNo action is required for administrators.</p>\n<ul>\n  <li>Inform helpdesk and training teams about the unified <b>plus (+) menu</b>&nbsp;layout.</li>\n  <li>Update internal documentation or screenshots that reference the previous menu.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will introduce a unified plus (+) menu by late February 2026, consolidating grounding, tools, and data sources for easier access. This change replaces the separate Tools menu, is enabled by default, requires no admin action, and aims to streamline user workflow."
    }
  ],
  "EndDateTime": "2026-04-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1227086",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-06T16:26:35.327Z",
  "Services": [
    "Microsoft 365 Copilot Chat"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-05T00:07:41Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft 365 Copilot app: Unified plus (+) menu",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
