{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the ability to leverage Quality Evaluation Agent simulation to test & fine tune evaluation criteria in Dynamics 365 Customer Service. This feature will reach general availability on February 6, 2026.<br><br>\n<b>How does this affect me?</b><br>\nThis feature enables supervisors to validate new or updated evaluation criteria using real customer engagement data and see predicted outcomes before rolling the criteria out broadly. With the following capabilities introduced with this feature, supervisors can simulate evaluation criteria on a controlled sample of real engagements, iterate quickly, then publish.<ul>\n<li>Run simulations directly from Evaluation Criteria to test how your criteria will score real cases without mixing test runs into production evaluation history.</li>\n<li>Choose which records to test using selection controls (e.g., filtering/conditions) so you can target the right scenarios and validate predictions against the interactions that matter most.</li>\n<li>Review Quality Evaluation Agent’s predicted answers and outcomes to confirm the criteria is producing the intended results, then refine questions and instructions and rerun one or more simulations until outcomes match your expectations.</li>\n<li>Support draft and published criteria testing with governance tied to criteria versions, so you can test safely and keep clarity on what was validated before publication.</li>\n<li>Track simulation runs for a criterion (including rerun/retrigger workflows in the experience) so teams can iterate efficiently during tuning and rollout readiness.</li>\n<li>Publish when ready. Once validated, you can confidently publish the updated criteria and use it for quality evaluations at enterprise scale.</li></ul>\n<b>What action do I need to take?</b><br>\nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-02-28T21:48:08Z",
  "HasAttachments": false,
  "Id": "MC1225451",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-31T21:49:55.103Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-31T21:48:08Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Service - Leverage Quality Evaluation Agent simulation to test & fine tune evaluation criteria",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
