{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2026: We have updated the content. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p><p>We’re introducing <b>Viva&nbsp;Engage communities</b> in <i>Microsoft Teams</i> to make it easier for employees to connect, share, and learn across your organization. This new experience brings discoverable, asynchronous conversations and leadership engagement into Teams—helping employees explore ideas and perspectives beyond project-based collaboration.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=513274\" target=\"_blank\">513274</a>.</p><p><b><b>When this will happen</b></b></p><ul><li>General Availability (Worldwide): April 2026 (previously March) to May 2026 (previously April)</li></ul><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected: </i>All Microsoft Teams users with access to Viva Engage.</p><p><i>What will happen:</i></p><ul><li>This feature is available to all Microsoft Teams customers with a standard Microsoft 365 and Teams license and access to Viva Engage. No additional Teams license is required<b>.</b></li><li><b>Communities </b>will appear in <i>Teams navigation</i>:<ul><li><b>Unified view:</b> New section in the <i>Chat app</i>.</li><li><b>Split view:</b> New section in the <i>Chats</i> <i>and Channels app</i>.</li></ul></li><li>Existing Viva Engage community memberships will sync into <i>Teams</i>.</li><li>Favorited communities in Engage will appear in<i> Teams favorites</i>.</li><li>Notifications for announcements and mentions will surface in <i>Teams Activity feed </i>and deep link to the new experience.</li><li>Rich engagement features include:<ul><li>Posting discussions, questions, praise, polls, and announcements (admins only).</li><li>Reactions, delegated posting (requires setup in <i>Viva Engage</i>), and scoped search.</li><li>Event participation: ask questions, upvote, view live or replay.</li></ul></li><li>Admins can manage community settings, membership, and roles directly in<i> Teams</i>.</li><li><b>Default setting:</b> <b>ON for all tenants</b>.</li></ul><p><b><b>What you can do to prepare</b></b></p><ul><li>No immediate action required unless you want to disable this feature.<ul><li>Sign in to the Teams admin center with your admin credentials.\n</li><li>In the left-rail menu, select Settings &amp; policies.\n</li><li>Select either Global (Org-wide default) settings or Custom policies for users &amp; groups.\n</li><li>Scroll to the Messaging section and select Messaging.\n</li><li>On the Messaging settings page, find the Viva Engage section.\n</li><li>To enable the feature, switch on the Viva Engage experiences in Teams toggle.\n</li><li>Choose Save.</li></ul></li><li>Ensure prerequisites:<ul><li>Viva Engage IPs and URLs are not blocked.</li><li>Sign-ins for Viva Engage are enabled in <i>Microsoft Entra ID</i>.</li><li>Users have Microsoft 365 and Teams licenses.</li></ul></li><li>Consider sharing best practices and customization options with users.</li><li>Coordinate with Viva Engage admins for internal change communications.</li></ul><p>Learn more:&nbsp;&nbsp;</p><ul><li><a href=\"https://support.microsoft.com/office/getting-started-with-viva-engage-communities-in-microsoft-teams-b9fa52b8-4d1f-4ed4-b285-03e2537d3dbe\" target=\"_blank\">Getting started with Viva Engage Communities in Microsoft Teams | Microsoft Support</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/teams-viva-experiences\" target=\"_blank\">Manage Viva Engage experiences in Microsoft Teams | Microsoft Teams | Micosoft Learn</a></li></ul><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "513274"
    },
    {
      "Name": "Summary",
      "Value": "Viva Engage communities will be integrated into Microsoft Teams by April-May 2026, enabling asynchronous conversations and leadership engagement. Available to all Teams users with Viva Engage, it features unified navigation, synced memberships, notifications, rich interactions, and admin controls. The feature is ON by default; admins can disable it if desired."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2026-05-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1218423",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-20T17:41:20.81Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-16T00:15:58Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Viva Engage communities in Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
