{
  "ActionRequiredByDateTime": "2026-03-14T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>Microsoft will retire the Microsoft Teams app from the Amazon Appstore to streamline our distribution channels and ensure that customers use the most secure, fully supported Teams experiences. After retirement, we will continue to invest in the Teams Web app and the Teams Android app available through the Google Play Store on supported devices.</p><p><b><b>When this will happen</b></b></p><p>The Microsoft Teams app will be retired from the Amazon Appstore in <b>mid-March 2026</b>.</p><p><b><b>How this affects your organization</b></b></p><p><i>Who is affected</i></p><p>Organizations with users who install or update Microsoft Teams through the Amazon Appstore.</p><p><i>What will happen</i></p><ul><li>Users will no longer be able to download the Microsoft Teams app from the Amazon Appstore.</li><li>Existing installations will stop receiving updates, security fixes, and technical support.</li><li>Installed clients will eventually stop connecting to the Teams service once they fall below the minimum supported version.</li><li>No changes will occur for users accessing Teams through the Teams Web app or through the Teams Android app in the Google Play Store (on supported devices).</li></ul><p><b><b>What you can do to prepare</b></b></p><p>No admin action is required for the retirement to occur. To prepare your organization:</p><ul><li>Update internal help desk documentation to remove references to the Amazon Appstore version of Teams.</li><li>Notify users who currently install Teams via the Amazon Appstore and guide them to transition to a supported platform:<ul><li>Teams Web app</li><li>Teams Android app via the Google Play Store (on supported devices)</li></ul></li></ul><p>If your organization maintains device-specific deployment instructions, update them accordingly.</p><p><b><b>Compliance considerations</b></b></p><p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will retire the Microsoft Teams app from the Amazon Appstore in mid-March 2026. Users can no longer download or update it there, and existing versions will lose support. Organizations should guide users to switch to the Teams Web app or the Android app via Google Play Store."
    }
  ],
  "EndDateTime": "2026-04-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1234560",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-18T18:37:40.39Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-18T18:37:21Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Retirement of the Microsoft Teams app from the Amazon Appstore",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
