{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<b><b>Introduction</b></b>\n<p>New Outlook for Windows will now support the ability to show a customizable oversharing dialog for Data Loss Prevention (DLP). This enhancement allows organizations to tailor the experience for end users when oversharing is detected, improving clarity and compliance.</p>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=498921\" target=\"_blank\">498921</a>.</p>\n\n<b><b>When this will happen</b></b>\n<p><b>General Availability (Worldwide):</b> Rollout begins in <b>early January 2026&nbsp;</b>and is expected to complete by<b> late January 2026</b>.\n</p><p><b>General Availability (GCC):</b> Rollout begins in <b>early February 2026&nbsp;</b>and is expected to complete by<b> late February 2026</b>.</p>\n\n<b><b>How this affects your organization</b></b>\n<ul>\n<li><b>Who is affected:</b> Admins managing DLP policies in New Outlook for Windows.</li>\n<li><b>What will happen:</b>\n<ul>\n<li>New Outlook will display a customizable oversharing dialog when DLP rules are triggered.</li>\n<li>Customization options include:\n<ul>\n<li>Custom titles and body text with multi-language support (up to 10 languages).</li>\n<li>Business justification options (up to 3 predefined + 1 optional free-text).</li>\n<li>Dynamic tokens for matched recipients, sensitivity labels, and attachment filenames.</li>\n<li>Text formatting (Bold, Italic, Underline, Line breaks).</li>\n</ul>\n</li>\n<li>If this feature is already enabled in classic Outlook, it will work in New Outlook without additional action.</li>\n<li>Feature is <b>OFF by default </b>unless configured by admins.</li>\n</ul>\n</li>\n</ul>\n\n<b><b>What you can do to prepare</b></b>\n<ul>\n<li>No action is required unless you want to enable this feature.</li>\n<li>If enabling, configure settings in the Compliance portal under DLP policy tips.</li></ul><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/purview/dlp-ol365-win32-policy-tips\" target=\"_blank\">Data loss prevention policy tip reference for Outlook for Microsoft 365 | Microsoft Purview | Microsoft Learn</a></p><ul>\n</ul>\n\n<b><b>Compliance considerations</b></b>\n<p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "498921"
    },
    {
      "Name": "Summary",
      "Value": "New Outlook for Windows will offer a customizable oversharing dialog for DLP, allowing admins to tailor messages with multi-language support, business justifications, and dynamic tokens. Rolling out globally from January 2026, the feature is off by default and configurable via the Compliance portal."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-03-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1202974",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-12-22T21:43:56.007Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-12-22T21:43:49Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Customizable oversharing dialog for DLP in New Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
