{
  "ActionRequiredByDateTime": "2026-02-15T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p>\n<p>We’re <b>retiring the ability to create alert policies and generate DLP alerts for sensitive data activities on endpoints in the <i>Microsoft Defender portal</i></b>. This change unifies endpoint data loss prevention (DLP) detection and alerting under Microsoft Purview DLP, giving organizations a more consistent experience and access to advanced enforcement and investigation capabilities in Microsoft Defender XDR.</p>\n\n<p><b><b>When this will happen</b></b></p>\n<ul>\n  <li><b>February 16, 2026</b>: Sensitive data activity options will be removed from new alert policy creation in the <i>Microsoft Defender portal</i>.</li>\n  <li><b>March 23, 2026</b>: Existing alert policies using these activities will stop generating alerts.</li>\n</ul>\n\n<p><b><b>How this affects your organization</b></b></p>\n\n<p><i>Who is affected:</i></p>\n<ul>\n  <li>Organizations that use alert policies in <i>Microsoft Defender XDR</i> to monitor sensitive data activities on endpoints.</li>\n  <li>Admins who create or manage alert policies in the <i>Microsoft Defender portal</i>.</li>\n</ul>\n\n<p><i>What will happen:</i></p>\n<ul>\n  <li>The following endpoint-sensitive data activities will be retired and removed from alerting in the <i>Microsoft Defender portal</i>:</li>\n  <ul>\n    <li>Copying sensitive data to removable media, remote shares, or the clipboard</li>\n    <li>Uploading sensitive files to third-party apps or services</li>\n    <li>Accessing sensitive files with unallowed apps</li>\n  </ul>\n  <li>New alert policies cannot use these activities <b>after February 16, 2026</b>.</li>\n  <li>Existing alert policies will stop generating alerts <b>after March 23, 2026</b>.</li><li>These activities <b>will not be re-enabled</b> in the <i>Defender portal</i> after retirement.</li>\n  <li>Organizations can continue to detect and alert on these activities using <b>Microsoft Purview DLP</b>, which supports:</li>\n<li style=\"margin-left: 25px;\">Alerting and incident creation</li><li style=\"margin-left: 25px;\">User notifications through policy tips</li><li style=\"margin-left: 25px;\">Activity blocking and restriction</li><li style=\"margin-left: 25px;\">Unified investigation of DLP and security alerts in<i> Microsoft Defender XDR</i></li><li>Purview DLP alerts for these endpoint activities appear in the <i>Defender XDR experience for triage and investigation</i>.</li></ul><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/1c82c4ca-2af5-4e63-8bd7-339e793e107d/d29092d3f0110de5d67a37944022f1f84d16e257.png\" style=\"width: 400px;\"></p><p><b><b>What you can do to prepare</b></b></p>\n<ul>\n  <li>Review existing Microsoft Defender alert policies to identify any that use the retiring activities.</li>\n  <li>Re-create required alerting using <b>Microsoft Purview DLP </b>policies.</li>\n  <li>Notify security operations and helpdesk teams about the retirement and the shift to Purview DLP.</li><li>Update internal documentation that references these Defender alert policies.</li><li>Review endpoint DLP configuration and policy guidance: <a href=\"https://learn.microsoft.com/purview/endpoint-dlp-getting-started\" target=\"_blank\">Get started with endpoint data loss prevention | Microsoft Purview | Microsoft Learn</a>.</li><li>If none of your Defender alert policies rely on these activities, no action is required.</li>\n</ul>\n\n<p><b><b>Compliance considerations</b></b></p>\n<p>No compliance considerations identified. Review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring endpoint-sensitive data alerting in the Microsoft Defender portal by March 23, 2026. Organizations must switch to Microsoft Purview DLP for alerting, enforcement, and investigation of sensitive data activities on endpoints. Existing Defender alert policies will stop generating alerts after this date."
    }
  ],
  "EndDateTime": "2026-04-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1217649",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-14T02:13:29.15Z",
  "Services": [
    "Microsoft Defender XDR",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-14T02:12:56Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Endpoint DLP-sensitive data alerting retiring in Defender; use Purview DLP",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
