{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>We’re updating Microsoft Purview Endpoint <b>Data Loss Prevention (DLP)</b> to display the <b>currently signed-in user’s email address</b> for Windows devices on the device onboarding page. This change aligns the Windows experience with macOS and responds to admin feedback requesting faster ways to confirm device ownership and troubleshoot onboarding or policy issues. By surfacing the logged-in user alongside existing device insights, admins can more quickly validate device context without additional investigation.</p>\n\n<p><b>When this will happen:</b></p>\n<ul>\n  <li>Public Preview: Rolling out in<b> late February 2026</b> and expected to complete by <b>mid-March 2026</b></li>\n  <li>General Availability (Worldwide): Rolling out in <b>late March 2026</b> and expected to complete by <b>mid-April 2026</b></li>\n</ul>\n\n<p><b>How this affects your organization:</b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n  <li>Microsoft 365 administrators managing <b>Microsoft Purview Endpoint DLP</b></li>\n  <li>Organizations with <b>Windows devices onboarded to Purview</b></li>\n</ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n  <li>Admins will see the <b>email address of the currently signed-in user</b> for Windows devices.</li>\n  <li>The user email appears on the<b> Device details</b> page in <b>Purview </b>→ <b>Settings </b>→<b> Device onboarding</b>.</li>\n  <li>This information is displayed alongside existing device insights.</li>\n  <li>The feature is <b>enabled by default</b>.</li>\n  <li>There is <b>no impact to users</b> and <b>no change to DLP policy behavior or enforcement</b>.</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<p>No action is required.</p><p>Optional steps you may consider:</p><ul><li>Inform helpdesk or security teams that logged-in user information is now visible for Windows devices.</li><li>Update internal documentation or troubleshooting guides that reference Purview device onboarding.</li><li>Review device visibility in Purview to ensure appropriate admin access controls are in place.</li></ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Endpoint DLP will show the currently signed-in user's email on Windows devices in the device onboarding page, aligning with macOS. Rolling out from late February to mid-April 2026, this feature aids admins in device validation without affecting users or DLP policies. No action required."
    }
  ],
  "EndDateTime": "2026-05-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1235743",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-02-20T23:59:13.163Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-20T23:58:16Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention - Logged-in user details on the Purview device onboarding page",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
