{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Introduction</b></p>\n<p>Today, IT administrators can restrict whether an organizer can create a webinar using the <code>AllowWebinars</code> setting under <code>Set-CsTeamsEventsPolicy</code>. Webinars are events that require registration.</p><p>With the new Events scheduling experience launching in the Meet app, we are introducing a new policy,&nbsp;<code>Registration,</code> which will control whether organizers can schedule any event with registration. <code>AllowWebinars</code>&nbsp;will continue to control whether an organizer can create a webinar via the Teams Calendar App.&nbsp;</p><p><code>Registration</code>&nbsp;will default to&nbsp;<b>Enabled</b>.</p><p><b>When this will happen:</b></p>\n\n<ul><li>Targeted Release: We will begin rollout&nbsp;<b>early February 2026</b> and expect to complete by&nbsp;<b>late February 2026.</b></li><li>General Availability (Worldwide, GCC, GCCH, DoD): We will begin rollout <b>mid-March 2026</b>&nbsp;and expect to complete by <b>late March 2026.</b></li></ul>\n\n<p><b>How this affects your organization:</b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Teams administrators managing meeting and events policies</li>\n<li>Users who schedule events or webinars in the Teams Meet app or in the Teams Calendar app</li>\n</ul>\n\n<p><b style=\"\">What will happen:</b></p>\n<ul>\n<li>A new policy setting, <code>Registration</code>, will be added to Teams events policies.</li>\n<li><code>Registration</code>&nbsp;= <b>Enabled </b>(default): Organizers can enable registration for any event.</li>\n<li><code>Registration</code>&nbsp;= <b>Disabled</b>: Organizers cannot enable registration for any event and cannot create webinars.</li>\n<li>If <code>AllowWebinars</code> is <b>Disabled </b>but <code>Registration</code>&nbsp;is <b>Enabled</b>, organizers can schedule events with registration but cannot create webinars on the Teams Calendar app.</li>\n<li>No UI changes occur unless the admin updates policy.</li>\n</ul>\n\n<p><b>What you can do to prepare:</b></p>\n<ul>\n<li>If you want all users to create events with registration, no action is required.</li>\n<li>To disable registration for all events, update the policy using PowerShell:</li>\n</ul>\n\n<pre>Set-CsTeamsEventsPolicy -Identity Global -Registration Disabled\n</pre>\n\n<ul>\n<li>Communicate any changes to organizers or helpdesk staff.</li><li>Update internal documentation as needed.</li>\n<li>Note: if you make changes to&nbsp;<code style=\"\">Registration</code>&nbsp;prior to rollout, it will impact webinars as described above.</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/powershell/module/microsoftteams/set-csteamseventspolicy?view=teams-ps\" target=\"_blank\">Set-CsTeamsEventsPolicy</a>&nbsp;(will be updated before rollout)</p><ul>\n</ul>\n\n<p><b>Compliance considerations:</b></p>\n<p>No compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "A new Teams Events policy setting, Registration (default Enabled), will control if organizers can schedule events with registration. It complements AllowWebinars, which controls webinar creation via the Calendar app. Rollout begins February 2026; admins can disable registration via PowerShell if desired."
    }
  ],
  "EndDateTime": "2026-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1226497",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-03T18:08:37.91Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-02-03T18:08:15Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Teams Events setting to control registration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
