{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b><b>Introduction</b></b></p><p>\nWe are updating the Enforcement plane terminology in <b>Microsoft Purview Data Loss Prevention (DLP)</b> and Collection Policies. The Enforcement plane identifies the application or environment where a DLP policy is evaluated and enforced, indicating where user actions are inspected and where policy outcomes—such as blocking, replacing, or auditing—are applied. Because policy enforcement happens on the application where activity occurs, we are renaming the Enforcement plane from <b>Entra</b> to <b>Application</b>. This update aligns terminology with how policies function and clarifies that enforcement applies across both AI and non‑AI applications.</p>\n\n<p><b><b>When this will happen:</b></b></p><p>\nGeneral Availability (Worldwide): Rollout begins <b>mid-January 2026</b> and is expected to complete by <b>mid-February 2026</b>.</p>\n\n<p><b><b>How this affects your organization:</b></b></p>\n\n<p><b style=\"\">Who is affected:</b></p>\n<ul>\n  <li>Admins who manage <b>Microsoft Purview DLP</b> or Collection Policies</li>\n  <li>Organizations using Purview audit logs or DLP cmdlets</li>\n</ul>\n\n<p><b style=\"\">What will happen:</b></p>\n<ul>\n  <li>The Enforcement plane value will change from <b>Entra</b> to <b>Application</b> across product experiences.</li>\n  <li>New audit logs will show the updated <b>Application</b> value; existing logs will retain the prior <b>Entra</b> value.</li><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/31964ec8-5768-4821-8c0d-649a23b82b90/545c5361de333fcc002b02eddb4beee556234b30.png\" style=\"width: 400px;\" alt=\"user settings\"></p>\n  <li>There are <b>no functional changes</b> to DLP policy behavior.</li>\n  <li>There is <b>no user impact</b>.</li>\n</ul>\n\n\n\n<p><b><b>What you can do to prepare:</b></b></p>\n<ul>\n  <li>No action is required for user experience or policy behavior.</li>\n  <li>If you use cmdlets, update scripts to reference <code>Application </code><b></b>instead of <code>Entra</code><b></b>.</li>\n  <li>Update internal documentation or training materials that reference the previous terminology.</li>\n</ul>\n\n<p><b><b>Compliance considerations:</b></b></p><p>\nNo compliance considerations identified, review as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview DLP is renaming the Enforcement plane from \"Entra\" to \"Application\" starting mid-January 2026, with no functional or user impact. Admins should update scripts and documentation accordingly. New audit logs will reflect \"Application,\" while existing logs keep \"Entra.\" No compliance issues identified."
    }
  ],
  "EndDateTime": "2026-03-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC1218710",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-16T21:50:27.41Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-16T21:50:08Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview Data Loss Prevention | Enforcement plane rename from Entra to Application",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
