{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing Quality Evaluation Agent Evaluation Criteria Extensibility in Dynamics 365 Customer Service. This feature will reach general availability on February 6, 2026.<br><br> \n\n<b>How does this affect me?</b><br> \n\nThis feature enables organizations to enforce a shared foundation of quality and brand values across all customer engagements while empowering individual business units to tailor evaluations to their unique needs. This allows teams to evolve quality standards at scale while maintaining governance, consistency, and clear visibility into evaluation outcomes across the organization.<br><br> \nKey capabilities of this feature include:<ul> \n\n<li><b>Source evaluation criteria:</b> Define a source (base) evaluation criteria that represents core quality standards and brand principles.</li> \n\n<li> <b>Criteria extensibility:</b> Business units extend the base criteria by adding BU‑specific requirements while automatically inheriting the same baseline quality standards. This ensures all extended criteria follow a consistent source of truth.</li> \n\n<li> <b>Automatic propagation of updates:</b> When the source criteria is updated, changes are auto‑published to all extended criteria, keeping standards aligned without manual rework.</li> \n\n<li> <b>Versioning and simulation support:</b> Supervisors can view criteria versions in the Evaluation Criteria Versioning History tab, select any version, and run simulations to validate changes before publishing.</li> \n<li> <b>Evaluation outcome visibility:</b> Evaluation details clearly show outcomes and scores by source criteria and extended criteria, providing transparency into how the baseline and BU‑specific extensions contribute to the final quality results. This helps supervisors understand scoring breakdowns, compare impacts, and maintain confidence in quality measurements.</li></ul> \n\n<b>What action do I need to take?</b><br> \nThis message is for awareness, and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2026-02-28T20:19:29Z",
  "HasAttachments": false,
  "Id": "MC1225438",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2026-01-31T20:35:28.563Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2026-01-31T20:19:29Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Customer Service - Quality Evaluation Agent Evaluation Criteria Extensibility",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
