{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Office Telemetry Dashboard is being removed from Microsoft 365 Apps for enterprise. The first version of Microsoft 365 Apps for enterprise without Office Telemetry Dashboard will be Version 2208, which is expected to be available first in Current Channel in the second half of August 2022.  \n</p><p><b>Note:</b> If you do not use Office Telemetry Dashboard, you can disregard this message.  \n</p><p>Components of the Office Telemetry Dashboard will no longer be available in Version 2208 or later including the Office Telemetry Agent, Office Telemetry Processor, and the dashboard itself.  \n</p><p><b>Note:</b> Office Telemetry Log is not being removed and will still be available on client devices running Windows.</p><p><b>When will this happen:</b><br></p><p>The first version of Microsoft 365 Apps for enterprise without Office Telemetry Dashboard will be Version 2208. That version is expected to be available first in Current Channel in the second half of August 2022. \n</p><p>Version 2208 is expected to be available in Semi-Annual Enterprise Channel in January 2023. \n</p><p><b>Note:</b> Office Telemetry Dashboard is not being removed from existing perpetual versions of Office, such as Office Professional Plus 2019. If you are using a perpetual version of Office, Office Telemetry Dashboard will be supported as long as your version of Office is supported. Here are the end of support dates for perpetual versions of Office that include the Office Telemetry Dashboard: \n</p><ul><li>Microsoft Office 2013 – April 11, 2023 \n</li><li>Microsoft Office 2016 – October 14, 2025 \n</li><li>Microsoft Office 2019 – October 14, 2025 \n</li></ul><p> <b>How this will affect your organization:</b> </p><p>Once a device in your organization updates to Version 2208 or later of Microsoft 365 Apps, Office Telemetry Dashboard components will be either removed or become unsupported.</p><p>To access information about the COM and VSTO add-ins in your environment, you can use the inventory feature available in the Microsoft 365 Apps admin center \n</p><p> <b>What you need to do to prepare:</b></p><p>As the devices update to Version 2208 or later, the Office Telemetry Dashboard and Office Telemetry Agent will be automatically uninstalled from the devices.</p><p>However, the Office Telemetry Processor will need to be manually removed from devices using your standard management tools as there will be no new data for it to process. Similarly, the rest of the infrastructure including the shared folder and the SQL Server for permanent storage of telemetry data will become obsolete and therefore can be removed.  \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "ExternalLink",
      "Value": "https://docs.microsoft.com/DeployOffice/compat/telemetry-dashboard-removal"
    }
  ],
  "EndDateTime": "2025-11-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC262540",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2021-06-16T22:54:13.617Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2021-06-16T22:53:37Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Office Telemetry Dashboard to be removed from Microsoft 365 Apps for enterprise, starting with Version 2208",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
