{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 19, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Non-Native and Hybrid Yammer Networks will be upgraded to Native Mode to allow users, groups, and content to be compatible with and mapped to their counterparts in Azure Active Directory and Microsoft 365. Native Mode also provides other benefits, such as the ability to host Live Events in every Yammer community and simplify file administration through SharePoint. Most critically, Native Mode supports eDiscovery through the Microsoft Purview compliance portal, allowing your organization to collaborate safely and securely within your Yammer network. 90% of Yammer networks are in Native Mode today, including our top 10 largest networks.<br></p><p><b>When this will happen:</b></p><p>We will begin migrating networks on December 01, 2022, and continue the upgrades through late December 2024 (previously January). The process will begin with smaller networks. If you prefer to control the timing of your upgrade, you may initiate the process on your own at any time by visiting the Microsoft 365 Native Mode page within the Network Admin pages of Yammer.\n</p><p><b>How this will affect your organization:</b></p><p>You will lose access to the following features:\n</p><ul><li>Network-level guests \n</li><li>Email blocked lists\n</li><li>Secret groups\n</li></ul><p>If your organization has active guest users, <a href=\"https://docs.microsoft.com/yammer/get-started-with-yammer/azure-ad-b2b-guests-yammer\" target=\"_blank\">Azure Active Directory B2B guest functionality</a> can be used for guests who reside in the same geography as the Yammer network (US guests for US networks; EU guests for EU networks). Guests will need to be reinvited to your network.\n</p><p>If your organization currently uses an email blocked list to manage access to your Yammer network, you can continue to manage access from the Azure Active Directory Portal. Learn more by visiting <a href=\"https://docs.microsoft.com/yammer/manage-yammer-users/turn-off-user-access\" target=\"_blank\">Turn off Yammer access for Office 365 users</a> and <a href=\"https://docs.microsoft.com/yammer/manage-yammer-users/manage-yammer-licenses-in-office-365\" target=\"_blank\">Manage Yammer licenses in Office 365</a>.\n</p><p>These feature equivalents are only available to networks in Native Mode. There is no feature equivalent to secret groups in Microsoft 365; all groups must be public or private.\n</p><p>As part of the migration process, the Yammer administrator account will be added to all groups in the network, and files may be renamed.\n</p><p><b>What you need to do to prepare:</b></p><p><i>If you would like to self-initiate your migration:\n</i></p><ul><li>There is a <a href=\"https://docs.microsoft.com/yammer/configure-your-yammer-network/native-mode-step-by-step-guide\" target=\"_blank\">step-by-step guide to Native Mode migration</a> available. You can run an alignment report that will identify gaps in your current network alignment with Native Mode. It is critical that you back up your network’s data and communicate the migration to your users prior to running the Alignment Tool mentioned in the guide, as some data may be deleted during the process.\n</li></ul><p><i>If you would like Microsoft to initiate your migration:\n</i></p><ul><li>You are not required to take any action. You can run an alignment report that will identify gaps in your current network alignment with Native Mode. It is strongly recommended that you back up your data and communicate the migration to your users prior to your scheduled migration start date. If your alignment report reveals any blockers to migration, you can log an exception with support.\n</li></ul><p><i>If you need to postpone or schedule your migration around blackout dates:\n</i></p><ul><li>Contact Microsoft 365 support to log an exception.&nbsp;&nbsp;</li></ul><p>Please click Additional Information to learn more.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Non-Native and Hybrid Yammer Networks will be upgraded to Native Mode, providing compatibility with Azure Active Directory and Microsoft 365, as well as other benefits. The upgrade will begin on December 01, 2022, and continue through late December 2024. Organizations will lose access to certain features, and guests will need to be reinvited to the network. Organizations can self-initiate the migration or Microsoft can initiate it for them. Contact Microsoft 365 support to log an exception for postponing or scheduling the migration around blackout dates."
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/blogs/blogworkflowpage/blog-id/YammerBlog/article-id/1660"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://docs.microsoft.com/Yammer/configure-your-yammer-network/nonnative-hybrid"
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC424414",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-19T20:53:14.103Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2022-09-01T23:53:05Z",
  "Tags": [
    "Updated message",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Non-Native and Hybrid Yammer Networks are being upgraded",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
