{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated January 24, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">To protect your most sensitive content, users of Microsoft 365 Apps can now use Double Key Encryption (DKE) for files and emails using the built-in labeling client. With DKE, Microsoft stores one key in Microsoft Azure and you hold the other key, ensuring that&nbsp;only you&nbsp;can ever decrypt protected content, under all circumstances. Sensitivity labels configured with DKE in Microsoft Purview Compliance Portal are now available for users in Word, Excel, PowerPoint, and Outlook to publish or consume content protected with DKE.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1&amp;searchterms=127888&amp;filters=&amp;searchterms=124984\" target=\"_blank\">124984</a></p>\n<p><b>When this will happen:</b></p><p>General availability: </p><ul><li>Current channel available mid-August 2023</li><li>Monthly Enterprise channel available mid-September 2023</li><li>Semi Annual Enterprise Channel mid-February 2024 (previously early January)</li></ul><p><b>How this will affect your organization:</b><br></p>\n\n<p>Users who have sensitivity labels configured with DKE will be able to publish and consume DKE-protected content using the built-in labeling client in Word, Excel, PowerPoint, and Outlook. \n</p><p>With this update, organizations that have also enabled \"<a href=\"https://learn.microsoft.com/en-us/microsoft-365/compliance/sensitivity-labels-coauthoring\" target=\"_blank\">co-authoring for files encrypted with sensitivity labels</a>\" can now deploy DKE labels in the same tenant, allowing users to benefit from M365's collaboration tools even if some of your users require DKE content for some of their documents.&nbsp;</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>If you're already using DKE with the Azure Information Protection (AIP) add-in, you can now enable co-authoring for encrypted files and start planning your migration to the built-in labeling client before the add-in is retired in April 2024 (https://aka.ms/AIP2MIP/RetireAddin).\n</p><p>If you've been considering DKE for your organization, now is the time to plan for DKE in your environment using the built-in labeling client instead of attempting to deploy it through the AIP Add-in. (https://aka.ms/AIP2MIP/HowTo/GetStarted)&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "124984"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoft-365/compliance/double-key-encryption"
    }
  ],
  "EndDateTime": "2024-03-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC611732",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-24T20:14:49.94Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-06-27T23:49:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Use double-key encryption to protect your most sensitive files and emails in Microsoft 365 Apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
