{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 27, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are currently working to improve user experience by providing a coherent profile photo experience across Microsoft 365. This primarily impacts those users of SharePoint online (SPO) who neither have an exchange license nor are using Delve for uploading images. This may also impact a small number of SPO admin who upload the user profile image on behalf of the end users.</p><p><b>When this will happen:</b></p><p>We will begin rolling out this change in early October 2023 (previously mid-September) and expect to complete by late June 2024 (previously late March).</p><p><b>How this affects your organization:</b></p><p>Currently, for users who do not have an Exchange License and have uploaded multiple different images across different apps in Microsoft 365, it is likely that SPO displays images uploaded locally in SPO which will be different from User Profile images in other Microsoft 365 apps.\n</p><p>To ensure that the same image is available across all Microsoft 365 experiences, going forward, SPO will display images sourced via MS Graph endpoint from Microsoft People System (MPS). This implies that the image uploaded via other apps in Microsoft 365 will take precedence and get displayed in SPO instead of the locally available image in SharePoint. There is no action required from users at this point.\n</p><p>For users with Exchange licenses there is no functional change.</p><p>To ensure profile coherence, we will disable local uploads from SPO to mysite host and instead enable centralized uploads to Microsoft People System (MPS).<br></p><p><b>What you can do to prepare:</b></p><p>For all users identified above: The profile image will no longer be edited/uploaded through SPO “Edit Profile UI” experience or through “Person Immersive” UI experiences. Instead, all such users would be requested to use the “Universal Me” control available on top right corner of the SharePoint Home page for uploading images. Alternatively, they can also use Delve to upload profile images.\n</p><p>For SPO admins: Admins who upload the user profile image on behalf of the end users will no longer be able to upload images via SPO Admin Centre. Instead, all SPO admins will be requested to upload user profile images via MAC Admin Centre or AAD admin center.\n</p><p>We are providing an early heads-up to ensure our customers have sufficient time to adapt to upcoming changes as we will not be able to grant any extension for this change.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online (SPO) will improve user experience by displaying the same profile image across all Microsoft 365 apps. This will impact users without an Exchange license or using Delve for uploading images. The change will roll out from early October 2023 to late June 2024. Users are not required to take any action. SPO admins will need to upload user profile images via MAC Admin Centre or AAD admin center. Users should use the “Universal Me” control or Delve to upload profile images."
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC653734",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-27T22:28:20.543Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-07-21T23:07:55Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "SharePoint: User experience and Image Coherence in SharePoint Online (SPO)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
