{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 11, 2024: The email sender domain will not start in June 2024 as previously announced. We will send a new notice via message center with 30-days' notice before we start changing the email sender domain later in 2024.\n</p><p>If you took action to change or update your email configuration based on the previous communication, then that should remain largely valid. We encourage you to review changes when any updated notice is received.<br></p><p>As previously communicated in MC561701 (May 2023), a key step in <a href=\"https://techcommunity.microsoft.com/t5/viva-engage-blog/yammer-com-rebranded-to-viva-engage/ba-p/3856807\" target=\"_blank\" style=\"\">our rebranding from Yammer to Viva Engage</a> is changing our web and email domains. These changes happen on different schedules and may impact you differently.<br></p><p>Changes to our web domain are currently not anticipated to impact our APIs. Should there be any changes in the future we will notify you.</p><p>This message is associated with Microsoft Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=180352\" target=\"_blank\">180352</a></p><p>\n</p><p><b>When this will happen:</b><br></p><ul><li>Web domain change: Rollout will begin in late March 2024 and is expected to be complete by mid-April 2024.</li><li>Email domain change: We will communicate a new timeline when we are ready to proceed.</li></ul><p><b>How this will affect your organization:</b><br></p><p>Web Domain</p><ul><li>During rollout, the web domain will change for all tenants from https://web.yammer.com to engage.cloud.microsoft. No admin action is required to initiate the change, and it is not possible to opt-out of this change.<br></li><li>Admins need to prepare for this change because the old URL may be saved in bookmarks, linked from intranet pages, or configured in network devices like proxies. We will indefinitely redirect URLs to the new domain ensuring uninterrupted access in many cases, but you must review any domain usage specific to your environment. It is not possible for us to identify all places within your environment where redirections may not function correctly. Users may initially need to refresh their browsers to receive the redirect if they are using Viva Engage once the change occurs.</li><li>Most attention is required to other usage of the old domain which may be hardcoded in a network proxy or security system. It is not possible for Microsoft to identify instances like these which exist inside your environment. IT, network, or security admins inside your organization may be able to help identify instances and plan changes. Check your configuration for desktop and mobile browsers because they may be different.</li></ul><p>Email Domain</p><ul><li><i>The sender domain used in emails from Viva Engage will start changing from @yammer.com to @engage.mail.microsoft.</i> This phased change to emails will continue until all Viva Engage email notifications and digests use the new sender domain. No admin action is required to initiate the change, and it is not possible to opt-out of this change.</li><li>Preparation for this change will depend on how you use the sender domain. If you have made specific customizations for the old domain in the past, then you may need to replicate the change for the new domain. If the old domain has been configured in transport rules, or an email gateway, then the new domain will need to be added. End users may need to update rules in Outlook. The impact will depend upon how you use the sender domain, so you will need to review your mail configuration and communicate with end users.</li><li>This change may go unnoticed by most users unless they have specific Outlook rules based on the sender domain.&nbsp;<a href=\"https://support.microsoft.com/office/manage-email-messages-by-using-rules-c24f5dea-9465-4df4-ad17-a50704d66c59\" target=\"_blank\">Outlook rules can be updated</a> to use the new domain without admin intervention, but you will need to communicate that the change is coming. <i>Moving to engage.mail.microsoft eliminates the need for yammer.com rules. Customers can delete previous rules or modify them for engage.mail.microsoft. Admins should review their email configuration.</i></li></ul><p>Progressive Web App (PWA)<br></p><p>Users will need to re-install after the domain migration is completed in order to continue using the application this can be done through the browser PWA options: <a href=\"https://support.google.com/chrome/answer/9658361?hl=en-GB&amp;co=GENIE.Platform%3DDesktop#:~:text=Install%20a%20PWA%201%20On%20your%20computer%2C%20open,Follow%20the%20on-screen%20instructions%20to%20install%20the%20PWA.\" target=\"_blank\">Chrome</a>, <a href=\"https://learn.microsoft.com/microsoft-edge/progressive-web-apps-chromium/ux\" target=\"_blank\">Edge</a>&nbsp;and<a href=\"https://developer.mozilla.org/docs/Web/Progressive_web_apps/Guides/Installing\" target=\"_blank\"> Firefox</a>.</p><p>Desktop Notifications<br></p><p>\n</p><p>\n</p><p>Users who have enabled desktop notifications previously, after the domain migration will have to enable them again in the <a href=\"https://support.microsoft.com/office/manage-viva-engage-desktop-notifications-bf60a88f-23cc-4ee3-b81d-5637b073d1de#:~:text=Enable%20desktop%20notifications%20from%20Viva%20Engage%20on%20the,this%20setting%2C%20and%20turn%20off%20Manage%20desktop%20notifications.\" target=\"_blank\"><i>Settings</i> menu.</a></p><p><b>What you need to do to prepare:</b><br></p><p>Review all places where you might have explicitly configured or hardcoded domain names. Share this information on the domain changes with the relevant admins noted above to give them time to make any necessary changes. Use existing changes implemented for the old domain as a guide to what you may need to implement for the new domain. \n</p><p>While changes are not anticipated to impact our APIs, it is possible that the old domain is hardcoded within a custom application, script, or automation – possibly in an unsupported manner. Review your usage of custom applications and contact your developer or partner for updates.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "180352"
    },
    {
      "Name": "Summary",
      "Value": "Yammer is rebranding to Viva Engage and changing its web and email domains. The web domain change will begin in late March 2024 and is expected to be complete by mid-April 2024. The email domain change is on hold and a new timeline will be communicated via Message center. Admins need to prepare for these changes and review all places where domain names are hardcoded. Users may need to refresh their browsers to receive the redirect if they are using Viva Engage once the change occurs. Users who have enabled desktop notifications previously will have to enable them again after the domain migration."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/yammer-blog/yammer-is-evolving-to-viva-engage/ba-p/3738825"
    }
  ],
  "EndDateTime": "2025-08-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC679739",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-13T21:16:02.113Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-07T02:18:01Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Yammer Rebranding to Viva Engage Domain Migration Update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
