{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated July 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Whiteboard previously stored whiteboard files in Azure storage. In 2022, Whiteboard switched to OneDrive as the storage location for most newly created boards. We are making a client-based migration available for your organization soon.&nbsp;<br></p><p style=\"\">This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=117394%2C\" target=\"_blank\">117394</a></p><p style=\"\"><b>When this will happen</b>&nbsp;</p><p style=\"\">The client-based migration experience will begin in December 2024 (previously July). We will provide an additional update as we get closer.</p><p style=\"\"><b>How this will affect your organization</b>&nbsp;</p><p style=\"\">Any user who launches an eligible Whiteboard client (Whiteboard on Windows, Whiteboard in Teams desktop/web) will automatically kick off a non-blocking migration of all their whiteboards. Depending on how many whiteboards they have, on average the process will take between a few seconds to a few minutes.&nbsp;</p><p style=\"\">The migration will provide many benefits for your organization and users on the migrated boards, including:&nbsp;</p><ul><li>Features unique to whiteboards stored in OneDrive, such as Follow, Commenting, and more.&nbsp;</li><li>Improved performance on whiteboards now stored in OneDrive.&nbsp;</li><li>Improved compliance and security associated with whiteboard being stored in OneDrive.&nbsp;</li></ul><p style=\"\">There is no possibility to delay the migration.&nbsp;</p><p style=\"\"><b>What you need to do to prepare</b>&nbsp;</p><p style=\"\">The migration will happen naturally and automatically for most users in your organization with no disruption, but please ensure that users are aware they need to launch Whiteboard in one of the previously mentioned clients in order to keep their content prior to the conclusion of migration (date to be announced)&nbsp;</p><p style=\"\">In the unlikely case that a user’s whiteboards fail to migrate, they will see an error banner. We will attempt to migrate the board again in 30 days. If the board contains important information, we recommend the user copy the content to a new whiteboard.&nbsp;&nbsp;</p><p style=\"\">Users will be able to see which boards have not migrated in a dedicated section on the board picker. Admins will be able to verify what whiteboard content remains in Azure and obtain the userIDs via our PSH cmdlets, if you wish to proactively notify users to get their content.&nbsp;</p><p style=\"\">As we get closer to the release of the client-based migration experience we will provide additional information via Message center.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "117394"
    },
    {
      "Name": "Summary",
      "Value": "The message details the migration of existing Whiteboard files from Azure to OneDrive, with a client-based migration starting in December 2024. Users must launch Whiteboard in specific clients to initiate a non-blocking migration, which will bring benefits like new features, improved performance, and enhanced security. No action is required to prepare for this migration, but users should be aware of the process. There is no option to delay the migration, and further updates will be provided via the Message center."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-03-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC677236",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-18T21:24:41.59Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-09-25T23:31:30Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Whiteboard: existing Azure board migration to ODB storage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
