{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 18, 2025: We have updated the content. Thank you for your patience.</p><p>In 2018, <a href=\"https://techcommunity.microsoft.com/t5/exchange-team-blog/upcoming-changes-to-exchange-web-services-ews-api-for-office-365/ba-p/608055\" target=\"_blank\">we announced</a> that we were no longer making feature updates to Exchange Web Services (EWS) in Exchange Online, and we advised developers to move to Microsoft Graph. </p><p>In September 2023, we announced that on October 1, 2026, we will start blocking EWS requests to Exchange Online. \n</p><p>\n</p><p>We are now less than 18 months from October 1, 2026. We have made progress on closing several parity gaps with more changes in development to be released in the coming quarters. Please refer to <a href=\"https://learn.microsoft.com/exchange/clients-and-mobile-in-exchange-online/deprecation-of-ews-exchange-online\" target=\"_blank\">Deprecation of Exchange Web Services in Exchange Online</a> for up-to-date guidance and roadmap information.&nbsp;&nbsp;</p><p>If you haven't already, start the process of working with your application development organization and your application vendors to migrate active EWS applications on your tenant to the Graph API.&nbsp;</p><p>\n</p><p><b>When this will happen:</b></p><p>October 1, 2026</p><p><b>How this affects your organization:</b></p><p>While the EWS components of the service will continue to receive security updates and certain non-security updates, product design and features will remain unchanged. This change also applies to the EWS SDKs for Java and .NET, as well.\n</p><p>Despite this announcement, EWS is still available and supported for use in production environments. But we strongly suggest migrating to Microsoft Graph to access Exchange Online data and gain access to the latest features and functionality.\n</p><p>Today’s update and the retirement of EWS apply only to Microsoft 365 and Exchange Online (all environments); there are no changes to EWS in Exchange Server. Further, the changes in Exchange Online do not affect Outlook for Windows or Mac, Teams, or any other Microsoft product.</p><p>In our original blog post, we said this change would affect only third-party (non-Microsoft) applications.<b> We have expanded our effort and are now also removing EWS dependencies from Microsoft apps and services, and we’re going to complete that work well before October 2026</b>. We intend to do this as quickly as possible without affecting the quality of service or product.&nbsp;</p><p>There may be applications running on your tenant created by your organization or 3rd parties that use EWS. <b>We recommend <a href=\"https://learn.microsoft.com/microsoft-365/admin/activity-reports/ews-usage?view=o365-worldwide\" target=\"_blank\">reviewing your application portfolio</a> now </b>to get an understanding of which apps need to be updated by your organization and which applications require updates from vendors.</p><p>It is important to get started with this effort as soon as possible as the Graph API patterns are quite different from EWS. Equivalent Graph API operations may exhibit subtle differences that affect your use cases and application designs in unanticipated ways.</p><p>Migrating Applications to Microsoft Graph&nbsp;</p><p>We know there are several feature gaps between EWS and Microsoft Graph, and though the list below is not exhaustive, these are the gaps most frequently reported to us by developers:&nbsp;</p><ul><li>Access to Archive Mailboxes – We are working on delivering access to archive mailboxes via Microsoft Graph and will provide an updated timeline in the coming months.\n</li><li>Folder Associated Information / User Configuration – We are working on these features and will provide an updated timeline in the coming months.\n</li><li>Exchange Online Management – We are investigating solutions for this and will provide an updated timeline in the coming months.</li><li>Access to Public Folders – After evaluating the usage of public folders, we have decided to restrict programmatic access to public folders to supported Outlook clients only, and for bulk import/export purposes. We will not provide APIs for programmatically creating, reading, updating and deleting public folders after October 2026 (also see <a href=\"https://techcommunity.microsoft.com/blog/exchange/security-related-updates-in-exchange-online/4303525\" target=\"_blank\">Security Related Updates in Exchange Online</a>).&nbsp;</li></ul><div><br></div><p>We know there are other gaps not listed above, and we continue to work on closing them, but it’s possible some functionality will not make it to Microsoft Graph. We encourage you to refer to <a href=\"https://learn.microsoft.com/en-us/exchange/clients-and-mobile-in-exchange-online/deprecation-of-ews-exchange-online\" target=\"_blank\">Deprecation of Exchange Web Services in Exchange Online</a> for up-to-date guidance and roadmap information.&nbsp;</p><p><b>Next Steps\n</b></p><p>The retirement of these APIs follows our <a href=\"https://learn.microsoft.com/lifecycle/policies/modern\" target=\"_blank\">Modern Lifecycle Policy</a>. We understand changes like this may cause some inconvenience, but we are confident it will ensure more secure, reliable, and performant experiences.\n</p><p>We will publish regular communications as we progress towards this deadline to aid affected tenants in identifying EWS usage. We encourage all customers to monitor Message Center and the Exchange Blog and <a href=\"https://learn.microsoft.com/exchange/clients-and-mobile-in-exchange-online/deprecation-of-ews-exchange-online\" target=\"_blank\">Deprecation of Exchange Web Services in Exchange Online </a>for related content.&nbsp;</p><p>Thank you in advance for updating and opening your apps to a wider range of useful and intelligent features on Microsoft Graph. We are extremely excited about the growing opportunities that Microsoft Graph offers to developers, and we remain fully committed to our journey to empower developers to access Microsoft 365 data with the most modern features and tools.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Exchange Web Services (EWS) in Exchange Online will be deprecated on October 1, 2026. Developers are advised to migrate to Microsoft Graph, which offers more modern features. EWS will still receive security updates but no new features. The deprecation does not affect Exchange Server or other Microsoft products."
    },
    {
      "Name": "BlogLink",
      "Value": "https://aka.ms/EWSEOLBlog"
    }
  ],
  "EndDateTime": "2026-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC676299",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-18T18:33:52.903Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-09-21T22:24:31Z",
  "Tags": [
    "Updated message",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of Exchange Web Services in Exchange Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
