{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With the introduction of Town halls in Microsoft Teams, Teams Live Events will be retired for commercial customers on September 30, 2024. This provides commercial customers with a 12-month window to prepare for the retirement and transition off Teams Live Events.&nbsp;</p><p><b>When this will happen:</b></p><p>September 30, 2024</p><p><b>How this will affect your organization:</b></p><p>After September 30, 2024, Teams Live Events will no longer be supported, and access will be discontinued. Customers will not be able to schedule, start, or join any events on Teams Live Events after this date. Existing recordings will be available to access until December 31, 2024. If customers want to retain any recordings from prior events, they will need to download the recordings and upload them to a different location before December 31, 2024. Between now and September 2024, customers can continue to use Teams Live Events with no change in their existing experience. However, our recommendation is that customers (both existing and new) transition to and start to use town halls as it becomes generally available on October 5, 2023.</p><p><b>What you need to do to prepare:</b></p><p>To prepare your organization for the transition we advise:\n</p><ul><li>Start to use town hall as it becomes generally available on October 5.</li><li>Learn more about town hall when documentation becomes available on adoption.microsoft.com and learn.microsoft.com on October 5.</li><li>Start planning to download recordings your organization wishes to retain before December 31, 2024.</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-11-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC678003",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-09-28T17:35:52.247Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-09-28T17:35:40Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams Live Event Retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
