{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 28, 2024: To ensure customer confidence in our product line, we are extending the support for Teams Live Events beyond the previously announced deadline of September 30th, 2024. We have concluded  through  customer feedback that this change to our initial deprecation plan, by maintaining support   for Live Events, will empower customers to produce large events as established and provide more time to upgrade to town hall, our new digital streaming event solution for large events, on their own schedule. Town hall will continue to serve as the platform where we will deliver new product value to our customers.</p><p>Teams Live Events will continue to be supported. We want to ensure that customers can upgrade to town hall on their own schedule as we work to bring new features and capabilities to town hall.  Town  hall is already available for commercial customers in public clouds, and we are adding new features regularly.</p><p>If you are using Teams Live Events for your large-scale digital events, you can continue to do so past the previously announced deprecation date of September 30th, 2024. However, we encourage you to try town hall, which offers a more modern and interactive experience for your live events.&nbsp;</p><p>You don't need to do anything at this time to continue using Teams Live Events. If you have directed your organization to not schedule Live Events after September due to the deprecation announcement, you may now schedule Live Events past September 2024.  For more information please refer to our blog post regarding this announcement:&nbsp;<a href=\"https://techcommunity.microsoft.com/t5/microsoft-teams-blog/updates-for-town-hall-in-microsoft-teams-and-teams-live-events/ba-p/4148352\" target=\"_blank\">Updates for Town Hall in Microsoft Teams and Teams Live Events</a>.</p><p>&nbsp;---Original message below for reference---</p><p>With the introduction of Town halls in Microsoft Teams, Teams Live Events will be retired for commercial customers on September 30, 2024. This provides commercial customers with a 12-month window to prepare for the retirement and transition off Teams Live Events.&nbsp;</p><p><b>When this will happen:</b></p><p>September 30, 2024</p><p><b>How this will affect your organization:</b></p><p>After September 30, 2024, Teams Live Events will no longer be supported, and access will be discontinued. Customers will not be able to schedule, start, or join any events on Teams Live Events after this date. Existing recordings will be available to access until December 31, 2024. If customers want to retain any recordings from prior events, they will need to download the recordings and upload them to a different location before December 31, 2024. Between now and September 2024, customers can continue to use Teams Live Events with no change in their existing experience. However, our recommendation is that customers (both existing and new) transition to and start to use town halls as it becomes generally available on October 5, 2023.</p><p><b>What you need to do to prepare:</b></p><p>To prepare your organization for the transition we advise:\n</p><ul><li>Start to use town hall as it becomes generally available on October 5.</li><li>Learn more about town hall when documentation becomes available on adoption.microsoft.com and learn.microsoft.com on October 5.</li><li>Start planning to download recordings your organization wishes to retain before December 31, 2024.</li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The support for Microsoft Teams Live Events has been extended beyond the initial retirement date of September 30th, 2024. Customers can continue using it and upgrade to town hall, the new event solution, at their convenience. Town hall is available and will receive new features, while Teams Live Events will still be supported. For more details, refer to the linked blog post."
    }
  ],
  "EndDateTime": "2026-11-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC678003",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-05-28T15:46:13.783Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-09-28T17:35:40Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams Live Event Retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
