{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 28, 2025: We have updated the timeline. Thank you for your patience.</p><p>As outlined in MC677236 (July 2024), Azure to OneDrive migration of existing Whiteboards has now started and will reach your tenant (if you haven’t received it already) in the coming months, before June 2025. Complete details can be found in this support article: <a href=\"https://support.microsoft.com/office/migration-of-whiteboards-from-azure-to-onedrive-6ddc6df1-540e-4b70-8e6a-541fafdc24f4\" target=\"_blank\">Migration of Whiteboards from Azure to OneDrive - Microsoft Support</a>.\n</p><p><i>Action for admins</i>: The migration affects only Microsoft Azure-based Whiteboards. If your tenant does not have any Azure Whiteboards, this migration does not impact you. Check if your tenant has Azure Whiteboards using this PowerShell cmdlet: <a href=\"https://learn.microsoft.com/powershell/module/whiteboard/get-whiteboardsfortenant?view=whiteboard-ps\" target=\"_blank\">- Get-WhiteboardsForTenant</a>\n</p><p><i>Action item for users:</i> Until the migration completes. When your tenant receives the migration code, users can trigger a migration by starting a Whiteboard session from a web browser by simply going to <a href=\"https://whiteboard.microsoft.com/\" target=\"_blank\">https://whiteboard.microsoft.com/</a> or by using a Whiteboard in their Teams meetings.</p><p>Whiteboard previously stored whiteboard files in Azure storage. In 2022, Whiteboard switched to OneDrive as the storage location for most newly created boards. We made a client-based migration available for your organization, which is currently rolling out gradually.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=117394%2C\" target=\"_blank\">117394</a>.\n</p><p><b>When this will happen</b>\n</p><p>The client-based migration experience started in December 2024 (previously July), and we expect to complete the migration by early August 2025 (previously early June).</p><p><b>How this will affect your organization</b>\n</p><p>Any user who launches an eligible Whiteboard client (Whiteboard on Windows, Whiteboard in Teams desktop/web) will automatically kick off a non-blocking migration of all their whiteboards. Depending on how many whiteboards they have, on average the process will take between a few seconds to a few minutes.\n</p><p>The migration will provide many benefits for your organization and users on the migrated boards, including:\n</p><ul><li>Features unique to whiteboards stored in OneDrive, such as Follow, Commenting, and more.\n</li><li>Improved performance on whiteboards now stored in OneDrive.\n</li><li>Improved compliance and security associated with whiteboard being stored in OneDrive.\n</li></ul><p>There is no possibility to delay the migration.\n</p><p><b>What you need to do to prepare</b>\n</p><p>The migration will happen naturally and automatically for most users in your organization with no disruption, but please ensure that users are aware they need to launch Whiteboard in one of the previously mentioned clients in order to keep their content prior to the conclusion of the migration.\n</p><p>In the unlikely case that a user’s whiteboards fail to migrate, they will see an error banner. We will attempt to migrate the board again in 30 days. If the board contains important information, we recommend the user copy the content to a new whiteboard.\n</p><p>Users will be able to see which boards have not migrated in a dedicated section on the board picker. Admins will be able to verify what whiteboard content remains in Azure and obtain the userIDs via our PowerShell cmdlets, if you wish to proactively notify users to get their content.\n</p><p>Complete details about the migration can be found in <a href=\"https://support.microsoft.com/office/migration-of-whiteboards-from-azure-to-onedrive-6ddc6df1-540e-4b70-8e6a-541fafdc24f4\" target=\"_blank\">Migration of Whiteboards from Azure to OneDrive - Microsoft Support</a>, including how start and completion of migration will be notified, how errors will be communicated, and the new PowerShell cmdlets.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "117394"
    },
    {
      "Name": "Summary",
      "Value": "The migration of existing Whiteboards from Azure to OneDrive storage began in December 2024 and will complete by August 2025. Users must launch Whiteboard clients to trigger migration, which improves features, performance, and security. Admins can monitor migration status via PowerShell. No delays are possible."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-09-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC677236",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-07-28T21:12:45.05Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-09-25T23:31:30Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Whiteboard: existing Azure board migration to ODB storage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
