{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated March 1, 2024: We have updated the content below with additional information.</p><p style=\"\">Microsoft Teams users will soon be able to create custom backgrounds for their Announcement posts with the generative AI power of Microsoft Designer. This release of Custom Backgrounds for Announcement Posts will be rolling out across Microsoft Teams Desktop and Web for Channels 2.0 in English – US markets only. Non-US tenants may have noticed a temporary loss in the ability to upload an image. For tenants who do not have access to Designer, the ability to upload image will be made available again in early March 2024. In parallel, the team is working to release a globally compliant and localized Designer integration in the first half of CY24.</p><p style=\"\">This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=123501\" target=\"_blank\">123501</a></p><p style=\"\"><b>When this will happen:</b></p><p style=\"\">Preview: We will begin rolling out mid-October and expect to complete by late October. - Complete</p><p style=\"\">Targeted Release: We will begin rolling out mid-October and expect to complete by late October. - Complete</p><p style=\"\">Standard Release: We will begin rolling out early November and expect to complete by mid-November. - Complete</p><p style=\"\">GCC/GCC High/DoD: We will begin rolling out in mid-January 2024 and expect to complete by late February 2024.</p><p style=\"\"><b>How this will affect your organization:</b></p><p style=\"\">Before, in Channels 1.0, users struggled to \"find the right picture,\" to \"find images that work correctly with banner sizing, so it takes ages,\" etc. \n</p><p style=\"\">Now, whether users have their own image or an idea in mind, or absolutely nothing at all, they can create rich, engaging backgrounds for their announcement posts through the generative AI power of Microsoft Designer. A few clicks is all it takes--let the imagination run wild!\n</p><p style=\"\"><i>You can find the entry point icon to the Designer integration at the bottom right corner of the announcement. \n</i></p><p style=\"\"><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1c3mf?ver=db28\" alt=\"headline\" style=\"width: 400px;\"><br></p><p><i>The Designer Mini Dialog is where all the magic happens. You can write a description, upload an image, or click one of the examples we have provided for you to start.&nbsp;</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1cRzX?ver=31cc\" style=\"width: 400px;\" alt=\"select image\"><br></p><p><i>Once you have selected a background you like, you’ll see the option to press “Customize” or “Done.” “Done” inserts the background into your Announcement while “Customize” launches the Microsoft Designer App where you can further customize your background.&nbsp;</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1cRA0?ver=995b\" style=\"width: 400px;\" alt=\"create a background\"><br></p><p><i>The Designer App provides flexibility and endless power for you to create exactly what you want</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1c8rW?ver=aafa\" style=\"width: 400px;\" alt=\"designer app\"><br></p><p><b>What you need to do to prepare:</b></p>\n\n<p>You may want to notify your users about this new capability to better express themselves and engage their audience in their Announcements. Additionally, due to the inevitable generative AI learning curve, you may want to provide additional training/documentation as you see fit. You can also lead by example and show your users what’s possible.&nbsp;</p><p>While we work on making a policy setting available to tenants, this feature will be enabled by default (except in EDU). If there are concerns, please contact support.&nbsp;</p><p>&nbsp;We can't wait to see what announcement backgrounds you and your team come up with.&nbsp;<br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "123501"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams users in English-US markets can create custom backgrounds for their Announcement posts with the generative AI power of Microsoft Designer. The release of Custom Backgrounds for Announcement Posts will be rolling out across Microsoft Teams Desktop and Web for Channels 2.0. Non-US tenants may have noticed a temporary loss in the ability to upload an image. For tenants who do not have access to Designer, the ability to upload an image will be made available again in early March 2024. The Designer integration will be released globally compliant and localized in the first half of CY24."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams users in English-US markets can create custom backgrounds for their Announcement posts with the generative AI power of Microsoft Designer. The release of Custom Backgrounds for Announcement Posts will be rolling out across Microsoft Teams Desktop and Web for Channels 2.0. Non-US tenants may have noticed a temporary loss in the ability to upload an image. For tenants who do not have access to Designer, the ability to upload an image will be made available again in early March 2024. The Designer integration will be released globally compliant and localized in the first half of CY24."
    }
  ],
  "EndDateTime": "2024-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC680348",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-02T00:14:28.593Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-10T00:10:40Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Custom Backgrounds for Announcement Posts in Channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
