{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated April 12, 2024: We are excited to announce that Phase 2 of app centric management roll out is scheduled to begin in May 2024. This phase will be available to all tenants and can be initiated at the admin’s discretion.</p><p style=\"\"><i>What is in phase 2?</i></p><ul><li>Migration wizard: a step-by-step guide to help you migrate the permission policies. You will be able to select which polities to migrate and designate users groups or individuals who should have access to the apps.</li><li>Testing and Validation: before finalizing the migration, you will have the opportunity to test and export your staged changes. You can use this to make side-by-side comparison with your current setup, ensuring everything is perfect before you proceed.</li><li>Duration: The migration process is designed to have no downtime for the end users and can take a few hours to complete. During the migration, your existing permission policies will remain in effect until the transition to app centric management completes.</li></ul><p style=\"\">Detailed documentation for the migration process will be available in our online documentation, which currently includes information on managing apps after ACM migration.</p><p style=\"\">App centric management introduces new admin settings to control who in the tenant can install Teams apps. First, admins can set a default value for new apps that are published to the Teams app store. Second, admins can manage apps for users, groups, or everyone in the organization. This feature replaces the existing app permission policies and provides admins with the ability to manage access to the app individually. The app permission policies for existing customers are migrated to maintain existing app availability in the tenant.&nbsp;<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=151829\" target=\"_blank\">151829</a></p>\n<p><b>When this will happen:</b></p><p>This feature will gradually roll out across three major phases. \n</p><p><i>Phase 1</i> (from late November 2023 to mid-March 2024 (previously late February) affects the tenants that use&nbsp;<u>only the Global app permission policy</u> and have no custom app permission policies. The app status from the permission policy and tenant settings will be migrated to preserve the admin intent. The migration will not affect the end users and their ability to use the apps. Admins may see the Manage apps page in a read-only mode for a short time.\n</p><p><i>Phase 2</i><b> </b>(more details coming soon as a follow up MC post) affects the tenants that use both global and custom app permission policies. This phase will let the admin choose to migrate to app centric management by following a migration process that will change the existing app permission policies to app assignments in the new app centric model. The admins will have the choice to modify the apps that are assigned using the custom permission policies to be accessible to groups, if they want.\n</p><p><i>Phase 3</i> (more details coming soon as a follow up MC post) applies to the tenants that skipped the migration in phase 1 or 2. These tenants will be migrated automatically in this phase.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Starting with this release, you can:\n</p><p>1.\tManage Teams apps for selected set of users, groups or all users in the organization. \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1eEle?ver=d0d1\" style=\"width: 400px;\"><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ezbo?ver=7bcc\" style=\"width: 400px;\"></p><p>2.\tSet the default value for new apps published to Teams app store for each of the app types: Microsoft, third-party and custom apps. \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1eBMn?ver=12ca\" style=\"width: 400px;\"><br></p>\n\n<p><b>What you need to do to prepare:</b><br></p>\n<p>No action needed for phase 1 tenants with Global permission policy only. More information will be provided for phase 2 and 3 tenants in a follow-up communication before launch.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "151829"
    },
    {
      "Name": "Summary",
      "Value": "The Teams admin center will introduce app centric management and changes to app permission policies. Admins can control who can install Teams apps and manage access to the app individually. The feature will roll out in three phases, affecting tenants with different permission policies. No action is needed for phase 1 tenants. More information will be provided for phase 2 and 3 tenants in a follow-up communication before launch."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    },
    {
      "Name": "Summary",
      "Value": "The Teams admin center will introduce app centric management and changes to app permission policies. Admins can control who can install Teams apps and manage access to the app individually. The feature will roll out in three phases, affecting tenants with different permission policies. No action is needed for phase 1 tenants. More information will be provided for phase 2 and 3 tenants in a follow-up communication before launch."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/microsoftteams/manage-apps"
    }
  ],
  "EndDateTime": "2024-06-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC688930",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-12T22:47:36.283Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-11T00:00:14Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams admin center: App centric management and changes to app permission policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
