{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated April 18, 2025: We have completed Phase 1. Phase 3 (auto-migration) has begun and is updated to define the rollout timeline and cohorts. Phase 2 (self-migration) is also updated and extended to mid-May for the customers who are not in the first round of auto migration. See below for details.</p><p style=\"\">The migration to app-centric management using the Migration Wizard (Phase 2) started rolling out in late November 2024 and completed rolling out in mid-December 2024. Administrators are now able to start the migration themselves using the wizard. The automatic migration for customers with only a global permission policy (Phase 1) will complete by end-March 2025 and those with multiple permission policies (Phase 3) will begin in April 2025</p><p style=\"\">Detailed documentation for the migration process is available at <a href=\"https://learn.microsoft.com/microsoftteams/app-centric-management\" target=\"_blank\">App centric management to manage user access to Teams apps - Microsoft Teams | Microsoft Learn</a>.</p><p style=\"\">App centric management introduces new admin settings to control who in the tenant can install Teams apps. First, admins can set a default value for new apps that are published to the Teams app store. Second, admins can manage apps for users, groups, or everyone in the organization. This feature replaces the existing app permission policies and provides admins with the ability to manage access to the app individually. The app permission policies for existing customers are migrated to maintain existing app availability in the tenant.&nbsp;</p><p style=\"\">This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?rtc=1%26filters%3D&amp;searchterms=151829\" target=\"_blank\">151829&nbsp;</a> </p><p style=\"\"><b>When this will happen:</b></p><p style=\"\">This feature will gradually roll out across three major phases.</p><p style=\"\">Phase 1 (Complete):  Auto-migration for only single policy customers - This is applicable for customer with only a global permission policy. The roll-out has started and will be complete by end of March 2025.</p><p style=\"\">Phase 2: Self-migration – admins of our customers can do self-migration using the Migration Wizard. This is the preferred way for customers to have tenant admin to be in the loop of migration. The migration Wizard is extended until mid-May (previously end of March 2025) for customers with one or more custom app permission policies with users assigned to them. There will be no further exceptions granted.</p><p style=\"\">Phase 3: Auto-migration for all customers – This is for customers who have not completed self-migration in Phase 2. This has started in mid-April and will complete by mid-May 2025 for customers with custom permission policies, but no users assigned to them. All other customers will be auto-migrated starting in mid-May until end of June 2025 (previously starting April 2025).&nbsp; Auto-migration will maintain the same access defined in app permission policies whenever there is no conflict between a user’s assigned policies. If a user’s policies conflict by allowing and blocking the same app for them, we will auto-migrate their app as allowed. After auto-migration, there will be a security group created for each set of users assigned to each app permission policy. These groups will be assigned to each app they are allowed in their respective policy, maintaining their app access. Groups Administrators can manage these groups like any others to customize the app centric management assignments, such as adding and removing users, or removing the group and replacing it with another.</p><p style=\"\"><b>How this will affect your organization:</b></p><p style=\"\">Starting with this release, you can:</p><p style=\"\">1. Manage Teams apps for selected set of users, groups or all users in the organization.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/74445d01-7834-4a2e-b0da-7a4d9301e933\" style=\"width: 400px;\"><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/45b83156-f350-42ca-8e4c-8de11abc45a1\" style=\"width: 400px;\"></p><p>2. Set the default value for new apps published to Teams app store for each of the app types: Microsoft, third-party and custom apps.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/85fc8113-cda0-4540-8c55-d564a319a66b\" style=\"width: 400px;\"><br></p>\n\n<p><b>What you need to do to prepare:</b><br></p>\n<p>No action needed for phase 1 tenants with Global permission policy only. . Migrate to app centric management manually via the Migration Wizard provided in Phase 2 by mid-May 2025 (previously the end of March 2025) if you do not want to be auto-migrated during Phase 3.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "151829"
    },
    {
      "Name": "Summary",
      "Value": "Teams admin center is updating to app-centric management with three phases: Phase 1 (auto-migration for single policy customers) is complete. Phase 2 (self-migration) is extended to mid-May 2025. Phase 3 (auto-migration for remaining customers) starts mid-April and ends June 2025. Detailed documentation is available [here](https://learn.microsoft.com/microsoftteams/app-centric-management)."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoftteams/app-centric-management"
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC688930",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-18T14:26:26.75Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-11T00:00:14Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams admin center: App centric management and changes to app permission policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
