{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 2, 2024: We have updated the rollout timeline below. Thank you for your patience.&nbsp;</p><p>We’re updating Microsoft Secure Score improvement actions to ensure a more accurate representation of security posture.</p><p>The improvement actions listed below will be added to Microsoft Secure Score. Your score will be updated accordingly.</p><p><b>When this will happen:</b></p><p>This will begin rollout in mid-November 2023 and is expected to be complete by early March 2024 (previously late January).</p><p><b>How this will affect your organization:</b></p><p>The following new Microsoft Defender for Identity recommendations will be added as Microsoft Secure Score improvement actions:\n</p><ul><li>Prevent users to request a certificate valid for arbitrary users based on the certificate template (ESC1)</li><li>Edit overly permissive Certificate Template with privileged EKU (Any purpose EKU or No EKU) (ESC2)</li><li>Edit misconfigured enrollment agent certificate template (ESC3)\n</li><li>Edit misconfigured certificate templates ACL (ESC4)</li><li>Edit misconfigured certificate templates owner (ESC4)<br></li><li>Edit vulnerable Certificate Authority setting (ESC6)\n</li><li>Edit misconfigured Certificate Authority ACL (ESC7)\n</li><li>Enforce encryption for RPC certificate enrollment interface (ESC8)</li></ul><p>These are new security posture reports related to Active Directory Certificate Services (AD CS) that analyze the configurations of different AD CS components and guide remediation, if necessary.</p><p><b>What you need to do to prepare:</b></p><p>There's no action needed to prepare for this change, your score will be updated accordingly. Microsoft recommends reviewing the improvement actions listed in Microsoft Secure Score. We will continue to add suggested security improvement actions on an ongoing basis.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-04-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC685930",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-02T22:12:54.73Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-30T22:18:04Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Secure Score - New Microsoft Defender for Identity recommendations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
