{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated November 12, 2024: The migration to app-centric management using the Migration Wizard (referenced as Phase 2 in this post) is expected to resume by late-November 2024 and complete the roll out by mid-December 2024. At that time, administrators will be able to self-initiate the migration using the wizard. The automatic migration for customers with only a global permission policy (Phase 1) and those with multiple permission policies (Phase 3) will be postponed until early 2025. Further updates, including the details for Phase 3 auto-migration, will be provided in a future MC post update and public documentation.</p><p style=\"\">App centric management (ACM) is on hold    as of August 14, 2024, and will restart in mid-October (previously mid-September). Your experience during this hold will fall under one of the following, with Phases defined in detail below.\n</p><ul><li>If your tenant has already been migrated to ACM, it will remain on ACM. The rest of this MC post is not applicable to your tenant.\n</li><li>If your tenant fell under the Phase 1 criteria of using only the Global app permission policy and no custom app permission policies, it will resume auto migration in mid-September.\n</li><li>If you do not have a draft currently saved, you will not be able to access ACM migration until the roll out restarts.<br></li></ul><p style=\"\">What is in Phase 2?\n</p><ul><li>Migration wizard: a step-by-step guide to help you migrate the permission policies. You will be able to select which polities to migrate and designate users groups or individuals who should have access to the apps.\n</li><li>Testing and Validation: before finalizing the migration, you will have the opportunity to test and export your staged changes. You can use this to make side-by-side comparison with your current setup, ensuring everything is perfect before you proceed.\n</li><li>Duration: The migration process is designed to have no downtime for the end users and can take a few hours to complete. During the migration, your existing permission policies will remain in effect until the transition to app centric management completes.\n</li></ul><p style=\"\">Detailed documentation for the migration process is available at App centric management to manage user access to Teams apps - Microsoft Teams | Microsoft Learn.\n</p><p style=\"\">App centric management introduces new admin settings to control who in the tenant can install Teams apps. First, admins can set a default value for new apps that are published to the Teams app store. Second, admins can manage apps for users, groups, or everyone in the organization. This feature replaces the existing app permission policies and provides admins with the ability to manage access to the app individually. The app permission policies for existing customers are migrated to maintain existing app availability in the tenant. \n</p><p style=\"\">This message is associated with Microsoft 365 Roadmap ID 151829\n</p><p style=\"\"><b>When this will happen:</b>\n</p><p style=\"\">This feature will gradually roll out across three major phases. \n</p><p style=\"\"><i>Phase 1</i> (from late November 2023 to early November 2024 (previously late September) affects the tenants that use only the Global app permission policy and have no custom app permission policies. The app status from the permission policy and tenant settings will be migrated to preserve the admin intent. The migration will not affect the end users and their ability to use the apps. Admins may see the Manage apps page in a read-only mode for a short time. \n</p><p style=\"\"><i>Phase 2</i> (from late May 2024 to mid-December 2024 (previously mid-November)) affects the tenants that use both global and custom app permission policies. This phase will let the admin choose to migrate to app centric management by following a migration process that will change the existing app permission policies to app assignments in the new app centric model. The admins will have the choice to modify the apps that are assigned using the custom permission policies to be accessible to groups, if they want.</p><p style=\"\"><i>Phase 3</i> (early 2025) applies to the tenants that skipped the migration in phase 1 or 2. These tenants will be migrated automatically in this phase. More details to come as a follow up MC post.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Starting with this release, you can:\n</p><p>1.\tManage Teams apps for selected set of users, groups or all users in the organization. \n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/74445d01-7834-4a2e-b0da-7a4d9301e933\" style=\"width: 400px;\"><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/45b83156-f350-42ca-8e4c-8de11abc45a1\" style=\"width: 400px;\"></p><p>2.\tSet the default value for new apps published to Teams app store for each of the app types: Microsoft, third-party and custom apps. \n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/85fc8113-cda0-4540-8c55-d564a319a66b\" style=\"width: 400px;\"><br></p>\n\n<p><b>What you need to do to prepare:</b><br></p>\n<p>No action needed for phase 1 tenants with Global permission policy only. More information will be provided for phase 2 and 3 tenants in a follow-up communication before launch.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "151829"
    },
    {
      "Name": "Summary",
      "Value": "The Teams admin center is transitioning to app-centric management, with a phased rollout resuming late November 2024. Phase 1 auto-migration for global permission policy tenants is delayed to early 2025. Phase 2 allows admins to self-migrate using a wizard, expected to complete by mid-December 2024. Phase 3 details will follow."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoftteams/app-centric-management"
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC688930",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-12T20:28:31.38Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-11T00:00:14Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams admin center: App centric management and changes to app permission policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
