{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated March 29, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Teams Compose is the heart of collaboration, where all Teams messages flow each month. It's also the gateway to a wealth of features, from Copilot to Files, Loops, Video, and Platform Apps.&nbsp;</p><p style=\"\">While Teams' capabilities have grown by leaps and bounds, the compose experience has remained largely unchanged. This update addresses usability, scalability, and information density challenges. We've simplified the compose experience, enhancing usability for various rich authoring scenarios, establishing scalable patterns for all compose actions, and optimizing it for your everyday needs. Get ready to enjoy a more seamless and efficient collaboration experience! This is for the new Teams experience only.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=123486\" target=\"_blank\">123486</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early-December 2023 and expect to complete by mid-December 2023.</p><p>Worldwide: We will begin rolling out early April 2024 (previously mid-March) and expect to complete by late April 2024 (previously late March).\n</p><p>GCC, GCC High and DoD: We will begin rolling out in early May 2024 (previously early April) and expect to complete rollout by late June 2024 (previously late May).</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>All Teams users will still be able to do everything they have previously done in Teams, but now, accessing these features will be easier and clearer.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>No changes are required to prepare for this change.</p>\n\n<p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Teams Compose experience will be updated to address usability, scalability, and information density challenges. The update will enhance usability and optimize it for everyday needs. The rollout will begin early-December 2023 and complete by mid-December 2023 for Targeted Release, early-April 2024 and complete by late-April 2024 for Worldwide, and early-May 2024 and complete by late-June 2024 for GCC, GCC High, and DoD. No changes are required to prepare for this change."
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC686919",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-29T18:45:49.957Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-03T00:50:37Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Simplified Compose Experience for Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
