{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"font-size: larger;\"><span style=\"font-size: 14px;\">Microsoft Purview Data Lifecycle Management and Microsoft Purview Records Management features offer organizations flexibility and a scalable solution to proactively retain or delete content in Microsoft 365.</span><br></p><p>We have a long-term retirement plan for the older features used for records management in SharePoint Online that are not part of the Microsoft Purview Records Management or Purview Data Lifecycle Management. The first set of features that will be retired are:\n</p><ul><li>Record Center site template, used to create a new Record Center site.\n</li><li>Configure systems to   submit files to a site using the Record Center programmable interface   (commonly referred to as “send to” location).\n</li><li>Content Organizer\n</li></ul><p>For more information on the retirement plan that starts with removing support for new configurations of these features,    please see:&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/use-microsoft-purview-risk-and-compliance-solutions\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Use Microsoft Purview risk and compliance solutions instead of the older information management and records management features in SharePoint for Microsoft 365</a></p><p>   \n</p><p>The retirement plan does not apply to features for SharePoint Server (On-Premises).\n</p><p><b>When this will happen:</b><br></p>\n\n<p>Retirement of these features will start to happen at the start of January 2025. \n</p><p>Additional reminders   will be shared leading up to this date.\n</p><p><b>How this will affect your organization:</b><br></p>\n\n<p>This retirement may impact your organization if you are using any of these features or feature behaviors. \n</p><p>Retirement of these Record Center features includes these outcomes:  \n</p><ul><li>Feature may no longer be supported by Microsoft support.\n</li><li>It may no longer be visible in the user interface.\n</li><li>Configurations may not be available through the user interface or programmatically, including enable and disable actions.</li></ul>\n<p><b>What you need to do to prepare:</b><br></p>\n<p>Microsoft won't automatically migrate your older information management and SharePoint records management features in SharePoint Online. If you choose not to migrate to supported features, the older features may no longer be supported.</p><p>Between now and the full retirement date of the feature, you have the flexibility to migrate your scenarios on your own schedule. For more information on migration strategies and modern features to use instead, please see <a href=\"https://learn.microsoft.com/SharePoint/migration-strategies\" target=\"_blank\">Migration strategies for moving to Microsoft Purview risk and compliance solutions from older information</a> management and records management for SharePoint.</p><p> \n</p><p>We recommend communicating this change to the team responsible for Data Lifecycle and Records Management and SharePoint records management at your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/SharePoint/migration-strategies"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC686912",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-11-03T00:38:05.677Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-03T00:35:22Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Purview Data Lifecycle Management: Upcoming retirement of SharePoint Online Record Center site features",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
