{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated July 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Coming soon to public preview, Microsoft Purview Communication Compliance is introducing Insightful Policy Performance, a useful  addition to Communication Compliance. This provides real-time visibility into scanning progress and updates on parent items that meet policy conditions.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=145793\" target=\"_blank\">145793</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Rollout to public preview will begin early December 2023 and complete by late August 2024 (previously late June).</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>The Communication Compliance homepage will provide two columns that offer a quick overview of policy performance: the first column shows the number of scanned parent items in real time, giving visibility into scanning progress; the second column keeps you informed about parent items that meet policy conditions, ensuring you stay updated on potential issues requiring attention and maintaining control over communication compliance.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>Microsoft Purview Communication Compliance provides the tools to help organizations detect business conduct and regulatory compliance violations (e.g. SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to help ensure user-level privacy.</p><p>You can access the Communication Compliance solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.</p><p> \n</p><p>Learn more: \n</p><p><a href=\"https://docs.microsoft.com/microsoft-365/compliance/communication-compliance?view=o365-worldwide\" target=\"_blank\">Learn about Communication Compliance</a>  \n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "145793"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance is introducing Insightful Policy Performance, a new feature that provides real-time visibility into scanning progress and updates on parent items that meet policy conditions. Rollout to public preview will begin early December 2023 and complete by late August 2024. The Communication Compliance homepage will provide two columns that offer a quick overview of policy performance. Access the Communication Compliance solution in the Microsoft Purview compliance portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://docs.microsoft.com/microsoft-365/compliance/communication-compliance?view=o365-worldwide"
    }
  ],
  "EndDateTime": "2024-10-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC694121",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-10T14:06:50.23Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-29T01:24:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Communication Compliance Insightful Policy Performance - Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
