{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Viva Goals will be giving users the ability to share links to goals as rich adaptive cards, including progress and status in Microsoft Outlook. Users get the context they need around goals they're working towards and can also update them in Microsoft Outlook without losing focus or clicking away from the message in Microsoft Outlook.</p><p>Users have already had this ability when they paste Viva Goals links in Microsoft Teams if the Viva Goals app for Microsoft Teams has been installed. With this change, the Microsoft Teams app for Viva Goals will be available on Outlook and Office.com, thus bringing this functionality to Outlook as well.</p><p>This message is associated with Microsoft 365 Roadmap ID:&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=165688\" target=\"_blank\">165688</a></p><p><b>When this will happen:</b></p>\n<p>Standard Release: We will begin rolling out in December 2023 and expect to complete in January 2024.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Users will be able to install Viva Goals from the Outlook app store in addition to the Microsoft Teams app store. When users have the app installed and paste a link to Viva Goals OKRs, a rich adaptive card will be shown with details about the OKR.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>Similar to the Microsoft Teams app for Viva Goals, admins can manage the deployment of the app in Outlook and Office.com from the Microsoft 365 Admin Center. For more information, see <a href=\"https://learn.microsoft.com/en-us/microsoft-365/admin/manage/teams-apps-work-on-outlook-and-m365?view=o365-worldwide#how-to-manage-the-availability-of-an-app-in-your-organization\" target=\"_blank\">How to manage the availability of an app in your organization</a>. Since the app is available both on Outlook and Microsoft Teams, also see <a href=\"https://learn.microsoft.com/en-us/microsoft-365/admin/manage/teams-apps-work-on-outlook-and-m365?view=o365-worldwide#what-happens-to-your-settings-on-teams-and-outlook\" target=\"_blank\">What happens to your settings on Teams and Outlook</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "165688"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "HelpLink",
      "Value": "https://learn.microsoft.com/en-us/viva/goals/ms-teams-integration"
    }
  ],
  "EndDateTime": "2024-03-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC696572",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-12-07T23:31:57.393Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-07T23:31:36Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Access and interact with goal progress directly within Outlook email",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
