{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 13, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We want to let you know that OneNote Feed feature will no longer be available inside OneNote app on Windows.  There are no changes to other OneNote Feed endpoints, such as OneNote on Web or Outlook on Web at this point.  \n</p><p>In place of Feed, we are introducing a new Sticky Notes experience in OneNote app on Windows. Sticky Notes are the most popular note-type used within OneNote Feed and we’re excited to be working on improving and expanding the Sticky Notes scenarios in OneNote app on Windows. We believe this will unlock new note-taking capabilities for users and bring the Sticky Notes experience to the one place for all your notes, OneNote.</p><p><b>When this will happen:</b>\n</p><p>We will begin gradually rolling out these changes starting early February 2024 and expect to complete the rollout by late June 2024 (previously early June).</p><p><b>How this will affect your organization:</b></p><p>Users will no longer be able to access OneNote Feed within their OneNote app on Windows. Instead, from the same location, they will be able to launch a new Sticky Notes experience. The new Sticky notes is a lightweight experience that users can place anywhere on their desktop and capture notes and screenshots quickly as they browse the web or multi-task and be productive. The goal for new Sticky Notes is to be at full feature parity with the classic Sticky Notes of today, with added benefit of enhanced capabilities.  \n</p><p>Additionally, users can continue to access their OneNote Feed data (OneNote pages, Sticky Notes and Samsung Notes) from the remaining endpoints.</p><p><b>What you need to do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The OneNote Feed feature in the OneNote app on Windows is being replaced with a new Sticky Notes experience. The rollout starts in February 2024 and will finish by late June 2024. Users can still access their OneNote Feed data through other endpoints. Organizations should update their training and documentation."
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC696853",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-13T21:52:23.93Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-08T23:01:18Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Retirement"
  ],
  "Title": "Replacement of OneNote Feed feature inside OneNote on Windows app with new Sticky Notes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
