{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to share some upcoming updates to the user app request feature in the Teams Admin Center aimed at enhancing the request administration process. Here are the key changes:<br></p><ol><li>User Requests Tab: A new 'User Requests' tab is now available on the App Details page. It provides detailed information about each request, including the requester’s name, email, job title, and request date, allowing for more informed decisions about app approvals.\n</li><li>Dashboard Widget: A widget on the main Teams Admin Center dashboard now shows the most requested apps, giving a clear view of user preferences and helping you prioritize app management tasks.\n</li><li>Improved App Request Browsing: The 'Browse by app requests' filter has been added to the 'Manage apps' page, making it simpler to view app requests by demand.</li></ol><p><b>When this will happen:</b>\n</p><p>Standard Release: We will begin rolling out early December 2023 and expect to complete by early February 2024.</p><p>\n</p><p><b>How this will affect your organization:</b>\n</p><p>These enhancements are intended to simplify your workflow and are only applicable to the administrative side of the Teams Admin Center. The end-user experience and the feature's On/Off status remain unchanged. If the user app request feature was turned off via PowerShell, it will stay off.</p><p>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-03-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC695496",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-12-04T23:49:12.56Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-04T23:47:20Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Enhanced User Request Management and Navigation in Teams Admin Center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
