{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated May 17, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\"><b>Note: </b>Make sure to enable the enrollUserOverride policy for Voice and Face profile enrollment. Your users can begin enrolling their Recognition profile now which means they can use Voice isolation as soon as it's available.\n</p><p style=\"\">To help with the rollout, here are the following support articles and resources to help address any questions you or your users may have about the feature\n</p><ul><li><a href=\"https://prod.support.services.microsoft.com/office/voice-isolation-in-microsoft-teams-calls-and-meetings-a9756ea9-4cec-44c4-aefb-6f5d17c89427\" target=\"_blank\">Voice isolation in Microsoft Teams calls and meetings - Microsoft Support</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/voice-isolation\" target=\"_blank\">Manage voice isolation for your users' Microsoft Teams calls and meetings</a>\n</li></ul><p style=\"\">With \"Voice isolation\", you can enjoy clear and uninterrupted calls or meetings, no matter where you are. This feature uses AI to filter out all background noise, including other people's voices. By leveraging your voice profile, this advance noise suppression capability ensures only the user’s voice is transmitted. Whether you are in a busy office, a noisy cafe, or a crowded airport, you can communicate with confidence and clarity. \"Voice isolation\" is powered by our advanced deep learning, speech services, and audio processing technology, and it shows our dedication to solving user problems with AI and enhancing audio quality and experience.<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=125387\" target=\"_blank\">125387</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early April 2024 (previously early March) and expect to complete by mid-April 2024 (previously mid-March).</p><p>Worldwide and GCC: We will begin rolling out mid-April 2024 (previously late March) and expect to complete by late May 2024 (previously early May).</p>\n\n<p><b>How this will affect your organization:</b></p><p>The Voice isolation feature will be enabled by default for your organization. End-users will need to enroll their voice profile via the <i>Recognition </i>tab under the Teams Global Device settings to enable the Voice isolation feature to have better audio input quality.</p><p>If you want to disable this feature for your organization, you will need to do so via PowerShell: <a href=\"https://learn.microsoft.com/powershell/module/skype/set-csteamsmeetingpolicy?view=skype-ps\" target=\"_blank\">Set-CsTeamsMeetingPolicy</a></p>\n<p><b>What you need to do to prepare:</b></p><p>You should consider communicating this with your users and update training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "125387"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will roll out \"Voice isolation\" in April 2024, which uses AI to filter out background noise during calls and meetings. The feature will be enabled by default, and users can enroll their voice profile to improve audio input quality. Organizations can disable the feature via PowerShell. Communication with users and updating training and documentation is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC690921",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T21:08:46.207Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-17T23:27:27Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams Voice isolation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
