{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated January 24, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">In parallel to legacy Wiki-based Meeting Notes in channel meetings, Teams across Microsoft are coming together to provide tools that help make meetings more effective. More specifically, we’re improving how you track what you want to discuss (Agenda), what you discussed/decided (Notes) and what you need to follow up on (Follow-up Tasks) in channel meetings. These capabilities are now integrated into the end-to-end meeting experience in Teams, Loop, Planner, To Do, and OneDrive Commercial.</p><p style=\"\">This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=167330\" target=\"_blank\">167330</a></p><p style=\"\"><b>When this will happen:</b></p><p style=\"\">Targeted Release: We will begin rolling out mid-April 2024 (previously early February) and expect to complete by late April 2024 (previously mid-February).</p><p style=\"\">Standard Release: We will begin rolling out late April 2024 (previously mid-February). and expect to complete by early May 2024 (previously early March).</p><p style=\"\"><b>How this will affect your organization:</b> \n</p><p style=\"\">Users within your tenant will see a Notes button during channel meetings that invokes these new capabilities. The meeting notes will be shown on the right pane of the meeting window with the ability to open them in the browser for more room or on a second monitor. Participants can collaborate in real time, create an agenda, take notes and add tasks. When participants are assigned a task in the meeting, they will also receive an email notification and it will be synced with the Planner and To Do apps.</p><p style=\"\">Meeting organizers will also see an ability to add Collaborative notes before meetings, to prepare by adding agendas or other materials in one place.&nbsp;</p><p style=\"\">After the meeting, Collaborative notes will remain accessible for all participants on the Teams calendar meeting details page. The experience is a Loop component, so they can be copied easily out of the meeting and into chats, group chats, emails and other documents. This makes prepping and follow-up even more seamless.</p><p style=\"\"><b>What you need to do to prepare:</b> \n</p><p style=\"\">Nothing is required to prepare. This capability will be enabled by default when it rolls out. \n</p><p style=\"\">Important Notes: \n</p><ul><li>This release removes the previous Wiki-based Meeting Notes solution. Users can still download the previous Meeting Notes in channel meetings by navigating to the SharePoint site of the channel --&gt;<i> Site Contents</i> --&gt; <i>Teams Wiki Data </i>where they can download the Meeting Notes in Word doc format. Those who didn't create the notes, who joined the meeting after the notes were created, or who are using the new Teams client; can retrieve and download the notes of the meeting from the same location. <a href=\"https://support.microsoft.com/en-us/office/access-wiki-meeting-notes-in-microsoft-teams-a15eb03c-9f47-4ec7-a89c-91d9da9ee1e4\" target=\"_blank\">Access wiki meeting notes in Microsoft Teams - Microsoft Support&nbsp;</a></li><li>Collaborative notes in channel meetings will only be available in the new Teams desktop client. \n</li><li>Collaborative notes is not available for EDU but is coming soon. The removal of Wiki-based Meeting Notes in channel meetings will still apply to EDU. \n</li><li>This release does not include GCC, GCCH, and DoD clouds and is also coming soon. Current Wiki-based Meeting Notes in channel meetings will also retire in Jan 2024.</li></ul><p style=\"\">You can manage this feature via SharePoint PowerShell with: \n</p><p style=\"\">Set-SPOTenant -IsCollabMeetingNotesFluidEnabled (boolean) \n</p><p style=\"\">You can read more about admin controls here: <a href=\"https://learn.microsoft.com/en-us/microsoft-365/loop/loop-workspaces-configuration?view=o365-worldwide#settings-management-for-loop-functionality-in-teams\" target=\"_blank\">Manage Loop experiences (Loop app and Loop components) in SharePoint</a>.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "167330"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"167330\":[{\"RoadmapId\":167330,\"Platform\":\"Mac\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0204015Z\",\"LatestRing\":null},{\"RoadmapId\":167330,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0204014Z\",\"LatestRing\":null},{\"RoadmapId\":167330,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0204016Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-06-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC690924",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-24T20:37:11.087Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-17T23:29:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Collaborative Notes in Channel Meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
