{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 12, 2024: This update serves as a reminder regarding the upcoming retirement scheduled for <i>April 2, 2026</i>.</p><p>Since the release of SharePoint Add-Ins in 2013, Microsoft has evolved SharePoint extensibility using <a href=\"https://aka.ms/spfx\" target=\"_blank\">SharePoint Framework</a> (SPFx) enabling you to write applications that can be used in Microsoft SharePoint, Viva Connections and Microsoft Teams. With our continued investment in SharePoint Framework, Microsoft is retiring SharePoint Add-Ins.</p><p><b>Key Points:</b></p><ul><li>Major: Retirement&nbsp;</li><li>Timeline:<ul><li>Starting July 1st, 2024, SharePoint Add-Ins cannot be installed from the public marketplace, also referred to as store by existing tenants. Installation from a private tenant catalog stays possible.</li><li>Starting November 1st, 2024, new tenants will not be able use SharePoint Add-Ins, regardless of their origin (public marketplace, private tenant catalog).</li><li>Starting <i>April 2nd, 2026</i>, Microsoft will remove the ability use SharePoint Add-Ins for existing tenants.</li></ul></li><li>Action: Review and assess impact \n</li></ul><p><b>How this will affect your organization</b> \n</p><p>If your organization still uses SharePoint Add-Ins, they will no longer function after April 2nd, 2026. We recommend customers to port their customizations to SharePoint Framework (SPFx) and ask their solution vendors for updated solutions. \n</p><p><b>What you need to do to prepare</b> \n</p><p>You will want to notify your Add-In users and developers. Update your user training and prepare your help desk. \n</p><p>For admins \n</p><ul><li>Use the <a href=\"https://aka.ms/assessment/addinsacs\" target=\"_blank\">Microsoft 365 Assessment tool</a> to scan your tenants for SharePoint Add-In usage. \n</li><li>Review the guidance for <a href=\"https://aka.ms/retirement/addins/guidance\" target=\"_blank\">migrating from SharePoint Add-Ins to SharePoint Framework</a>. \n</li><li>There will not be an option to extend SharePoint Add-Ins beyond April 2nd 2026.  \n</li></ul><p>Learn more \n</p><ul><li>Support update for the&nbsp;<a href=\"https://aka.ms/retirement/addins/support\" target=\"_blank\">retirement of SharePoint Add-Ins</a>&nbsp;in Microsoft 365.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring SharePoint Add-Ins by April 2, 2026. Installations from the public marketplace will end on July 1, 2024, and new tenants won't be able to use them starting November 1, 2024. Organizations should migrate to SharePoint Framework (SPFx) and prepare for the transition."
    },
    {
      "Name": "HelpLink",
      "Value": "https://aka.ms/retirement/addins/support"
    }
  ],
  "EndDateTime": "2026-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC693865",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-04-12T21:07:12.55Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-27T23:32:02Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "SharePoint Add-In retirement in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
