{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Insider Risk Management will be rolling out general availability of Enhancements to the unusual activity booster detection.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=115493\" target=\"_blank\">115493</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Rollout will begin at the end of November and is expected to be complete by end of December.&nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Today, admins can enable the risk score booster “Activity is above user’s usual activity for that day.” With this update, the model to detect unusual activity will be enhanced to improve the ability to detect when a user’s activity is unusual compared with their historical norms. If an admin has opted-in to the “Activity is above user’s usual activity for that day” risk score booster in settings, the organization might see fewer activities with the risk score booster.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>No action is required for this update.</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.</p><p> \n</p><p><a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators#risk-score-boosters\" target=\"_blank\">Learn more.</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "115493"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators"
    }
  ],
  "EndDateTime": "2024-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC694126",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-11-29T01:30:18.367Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-29T01:29:30Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Purview Insider Risk Management: General availability of Enhancements tothe unusual activity booster detection",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
