{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated February 28, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Coming soon to general availability, Microsoft Purview Communication Compliance will release a feature that empowers users to report policy-violating posts and comments in Viva Engage:</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=144596\" target=\"_blank\">144596</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Rollout will begin in mid-December 2023 and is expected to be complete by late June 2024 (previously February).&nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Microsoft Viva Engage users are empowered to report inappropriate or concerning posts and comments violating customers’ organizational policies within Viva Engage Team conversations. These reported posts are then submitted to a Communication Compliance policy for customers’ designated investigators with the appropriate role-based access control permissions to review and take action if deemed necessary.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>Microsoft Purview Communication Compliance provides the tools to help organizations detect business conduct and regulatory compliance violations (e.g. SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to help ensure user-level privacy.&nbsp;</p><p>To use this feature, please enable Viva Engage conversation reporting. Reported conversations will automatically route to Communication Compliance if a supported license is present in the tenant.\n</p><p>You can access the Communication Compliance solution in the&nbsp; &nbsp;<a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Microsoft Purview compliance portal</a>.<br></p><p> \n</p><p>Learn more: \n</p><ul><li>Learn about <a href=\"https://docs.microsoft.com/microsoft-365/compliance/communication-compliance?view=o365-worldwide\" target=\"_blank\">Communication Compliance</a>.</li><li><a href=\"https://learn.microsoft.com/purview/communication-compliance-policies?view=o365-worldwide#user-reported-messages-policy\" target=\"_blank\">Create and manage communication compliance policies | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/viva/engage/report-conversation-overview\" target=\"_blank\">Report a Viva Engage conversation | Microsoft Learn</a>\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "144596"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance will soon release a feature enabling Viva Engage users to report policy-violating posts and comments. The rollout will begin in mid-December 2023 and is expected to be complete by late June 2024. This feature will allow reported posts to be submitted to a Communication Compliance policy for designated investigators to review and take action if necessary. To use this feature, enable Viva Engage conversation reporting and access the Communication Compliance solution in the Microsoft Purview compliance portal. Learn more by visiting the provided links."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/purview/communication-compliance-policies?view=o365-worldwide"
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC694650",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-29T00:13:26.59Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-01T00:59:08Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Communication Compliance - Empower end users to report inappropriate posts and comments in Viva Engage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
