{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Loop components created in Teams, Outlook, and Word for the web, are discoverable and have eDiscovery workflow support using the Microsoft Purview tool. Currently, these files are stored in the creator’s OneDrive and are available for search and collection and render in review for both eDiscovery (Standard) and eDiscovery (Premium). The HTML offline export format is supported on eDiscovery (Premium). You can also download and re-upload the files to any OneDrive to view them in their native format.<br></p><p style=\"\">NEW: Microsoft now has a third-party graph export API solution for Loop components ready. This supports offline export of Loop components created from Teams and Outlook (stored as .loop/.fluid files) via an API that can be leveraged by our customers. The export is done to an offline viewable HTML format and will include all the content that is in the loop/fluid file. This solution is available to Microsoft 365 E3 and E5 customers who have also purchased Microsoft 365 Copilot.&nbsp;</p><p style=\"\"><i>Loop app\n</i></p><p style=\"\">Loop content (pages and components) created in the Loop app are discoverable and have eDiscovery workflow support using the Microsoft Purview tool. These files are stored in <a href=\"https://devblogs.microsoft.com/microsoft365dev/introducing-syntex-repository-services-microsoft-365-superpowers-for-your-app/\" target=\"_blank\">Syntex repository services</a> and are available for search and collection and render in review for both eDiscovery (Standard) and eDiscovery (Premium). The HTML offline export format is supported on eDiscovery (Premium). You can also download and re-upload the files to any OneDrive to view them in their native format.\n</p><p style=\"\">A graph export API that can access Loop content stored in <a href=\"https://devblogs.microsoft.com/microsoft365dev/introducing-syntex-repository-services-microsoft-365-superpowers-for-your-app/\" target=\"_blank\">Syntex repository services</a> is not yet available.</p><p><b>When this will happen:</b>\n</p><p>This capability has already been rolled out to your enterprise organization. No action is required on your part.</p><p><b>How this will affect your organization:</b>&nbsp;\n</p><p>The eDiscovery review and export flows via Graph API are now available for Microsoft Loop components created in Teams, Outlook, and Word for the web and stored in OneDrive. Previously, these workflows weren't available.&nbsp;</p><p>If you have previously disabled Loop components in your organization, then this doesn't affect your organization.&nbsp;</p><p>Learn more about Loop component's security and compliance offerings here: <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-compliance-summary?view=o365-worldwide\" target=\"_blank\">Summary of compliance capabilities for Loop experiences | Microsoft Learn&nbsp;</a></p><p>Learn more about eDiscovery here: <a href=\"https://learn.microsoft.com/purview/ediscovery-overview\" target=\"_blank\">Overview of the eDiscovery (Premium) solution in Microsoft Purview | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-05-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC690923",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-11-17T23:29:09.703Z",
  "Services": [
    "Microsoft Copilot for Microsoft 365"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-17T23:28:55Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "eDiscovery support for Loop components created from Teams and Outlook via Graph API",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
