{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated May 29, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p style=\"\"><b>What is happening</b>: We have a systems update scheduled between (1 Feb - 2 Feb, 2025). This update is for Export-ContentExplorerData PowerShell Cmdlet</p><p style=\"\"><b>How it impacts you</b>: During the update, any Cmdlet-based scripts running at that time might experience failures for some of the Cmdlet calls. To avoid any disruptions, we recommend running your scripts after 3 Feb 2025, when the updates will be fully in place and operational.</p><p style=\"\"><b>Which Cmdlets were impacted:&nbsp;</b>1.\tExport-ContentExplorerData</p><p style=\"\"><b>What do you need to do?\n</b></p><p style=\"\">•\tAvoid running Cmdlet-based scripts during the (1 Feb - 2 Feb 2025) update.\n</p><p style=\"\">•\tResume running your scripts on 3 Feb 2025 to ensure smooth operation.</p><p style=\"\">We apologize for any inconvenience this may cause and appreciate your understanding and cooperation. If you have any questions or need further assistance, please do not hesitate to reach out to our support team.\n</p><p style=\"\">The current Content Explorer Export feature has a limitation of exporting data only after drilling down to specific location. The new feature coming to General Availability will allow admins to use a new cmdlet within the Security and Compliance PowerShell, Export-ContentExplorerData, to export all rows of data for the content that are scanned and shown on Content Explorer.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=117546\" target=\"_blank\">117546</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Rollout will begin late July 2025 (previously late April) and is expected to be complete by mid-August (previously mid-May 2025).</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>This feature can be accessed through the Security and Compliance PowerShell, Export-ContentExplorerData.</p>\n\n<p><b>What you need to do to prepare:</b><br></p>\n<p>There are no additional settings needed for this feature. You may want to notify your users about this change and update any relevant documentation as appropriate.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "117546"
    },
    {
      "Name": "Summary",
      "Value": "A systems update for the Export-ContentExplorerData PowerShell Cmdlet is scheduled for February 1-2, 2025, potentially causing script failures. Avoid running scripts during this period and resume on February 3, 2025. The new cmdlet will allow exporting all data rows in Content Explorer. Rollout begins late July 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/purview/data-classification-content-explorer"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC698421",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-29T14:07:28.32Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-14T22:55:44Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "New cmdlet for Content Explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
