{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated April 15, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">\"Turn off copying or forwarding of meeting chat\" is a new meeting option that gives the meeting organizer the option to disable copying and sharing features on meeting chat messages for participants to reduce the risk of data leak. Once this restriction is enabled, meeting chat participants will not be able to copy chat messages using menu options or keyboard shortcuts, or forward or share messages to Outlook. There is also a new Meeting Policy setting in Teams admin center for admin to control whether users can see or use this feature in the Meeting Options page. Admins can also set the default value for this meeting option in Meeting Templates that they create. This meeting capability can also be configured within a sensitivity label policy: <a href=\"https://learn.microsoft.com/en-us/microsoftteams/configure-meetings-highly-sensitive-protection\" target=\"_blank\">Configure Teams meetings with protection for highly sensitive data</a>.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=186675\" target=\"_blank\">186675</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Preview: We will begin rolling out mid-December 2023 and expect to complete within a few days.<br></p><p>Targeted Release: We will begin rolling out mid-January 2024 and expect to complete within a few days.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late January 2024 and expect to complete by late April 2024 (previously mid-March).</p>\n\n<p><b>How this will affect your organization:</b>\n</p><p>For users who have a Teams Premium license, \"Turn off copying or forwarding meeting chat\" will show in the Meeting Options page for the meetings they organize. If the organizer turns on the setting or if the meeting is using a sensitivity label or a custom meeting template that turns on this setting, participants will be restricted from copying chat content from the meeting chat. \n</p><p>If an admin does not want certain users to be able to see this option, the admin can go to Teams Admin Center &gt; Meeting Policies and create a policy that disables the feature for these users. Then, these users will not be seeing this setting in the Meeting Options page. However, if the users apply a sensitivity label that enforces copy prevention, it will still take effect even if the policy disables it.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>The Meeting Policy to allow organizers to restrict participants from copying or forwarding meeting chat messages is by default in Teams Admin Center. That means the \"Turn off copying or forwarding of meeting chat\" Meeting Option will automatically be available to users with a Teams Premium license. \n</p><p>Create/Update any custom meeting template that should have this setting as a meeting option. From Team's Admin Center, admins can control if meeting organizers will have access to control this setting in Meeting Options page for a meeting template. That means \"Turn off copying or forwarding of meeting chat\" in meeting templates can be hidden or visible to meeting organizers depending on how tenant admin sets it. They can also give control to meeting organizers to override the setting. \n</p><p>The tenant administrator may want to provide end user education in advance for this feature in case end users don't understand why they cannot copy/paste in certain meeting chats.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "186675"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"186675\":[{\"RoadmapId\":186675,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0209255Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":186675,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0209257Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new meeting option that allows organizers to disable copying and sharing features on meeting chat messages for participants to reduce the risk of data leak. Admins can control whether users can see or use this feature in the Meeting Options page and set the default value for this meeting option in Meeting Templates that they create. The rollout will begin mid-December 2023 and is expected to complete by late April 2024. Users with a Teams Premium license will have access to this feature by default. Admins may want to provide end user education in advance for this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    },
    {
      "Name": "HelpLink",
      "Value": "https://support.microsoft.com/office/meeting-options-in-microsoft-teams-53261366-dbd5-45f9-aae9-a70e6354f88e"
    }
  ],
  "EndDateTime": "2024-06-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC698134",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-15T19:51:15.217Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-14T04:19:26Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Meeting Option and Meeting Policy \"Turn off copying or forwarding of meeting chat\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
