{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated January 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">The new Shared display mode provides users the ability to extend their Teams meeting via a pop-out view-only version of the stage onto the TV screen in BYOD meeting rooms.  This mode ensures the meeting content is always extended to the front of the room for others to see. This gives the host of the room the peace of mind their desktop is for their viewing only, giving them the flexibility to multi-task or work privately on their host desktop.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=184363\" target=\"_blank\">184363</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late January 2024 and expect to complete by late February 2024.\n</p><p>Standard Release: We will begin rolling out late February 2024 and expect to complete by early March 2024.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Once this feature is fully rolled out, Users can go into the Room audio option on the pre-join screen and select the</p><p>Connected device shown. Once that is done, they can join the meeting as they normally would, and the Shared display mode will show up.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ffz4?ver=a28b\" style=\"width: 400px;\"><br></p>\n<p><b>What you need to do to prepare:</b></p>\n<p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-04-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC690920",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-12T23:47:37.273Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-17T23:26:53Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Shared display mode for BYOD meeting rooms",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
