{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 22, 2024: We have updated this message to ensure visibility.</p><p>We will be retiring Delve on December 16th, 2024. Most of the features and value offered by Delve today are already available and improved in other experiences in Microsoft 365. The main one being Profile Cards in Microsoft 365. Here is a list of features offered in Delve and the experiences we recommend using instead:\n</p><ul><li>Delve Home – discover relevant documents recommended on Office.com, in Office apps and  in Profile Cards.\n</li><li>Delve Profile – view profile data in the Profile Cards cross M365, through people in search on Office.com and search in SharePoint.\n</li><li>Edit profile – a new edit profile experience tightly coupled with Profile Cards are being developed and will be released in second half of 2024. It is also possible for users to edit their profile data in the SharePoint profile edit experience (editprofile.aspx). \n</li><li>Organizational view – exists in the Profile Card and as a dedicated experience in Org Explorer\n</li><li>Favorites – favorites on Office.com and OneDrive is not connected to Delve and is a good option for users with similar functionality and improved availability. \n</li><li>Boards – will not be replaced.\n</li></ul><p>\n</p><p><b>When this will happen:</b></p><p>December 16, 2024</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because Delve web is available to most customers in Microsoft 365. The number one feature offered in Delve is the ability for users to update their profile properties, and this will be replaced with a new dedicated profile editing experience in the second half of 2024. Please note that Delve and the new edit profile experience will work side by side until Delve is retired. \n</p><p>Users will no longer be able to create new boards, add documents to existing boards, view boards or search for boards when this change is implemented. Please note that documents themselves will NOT be removed. It is only the association with one or multiple boards that will be removed.\n</p><p>We will soon enable banners in Delve, letting users know that the feature will be retired and link to suggested alternatives.\n</p><p>The new edit profile experience will for now read and write to the same source as Delve does, thus there are no changes in how admins can modify user profile properties.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend updating internal documentation and training related to Delve with the suggested alternatives. When the new edit profile experience is available this will also need to be shared broadly and documentation updated. We will make sure that the new edit profile experience is easy to access and easy to use and that there is public documentation in place before releasing.</p><p>Please click additional information to learn more about existing alternatives.</p><ul><li><a href=\"https://support.microsoft.com/office/profile-cards-in-microsoft-365-e80f931f-5fc4-4a59-ba6e-c1e35a85b501\" target=\"_blank\">Profile cards in Microsoft 365</a></li><li><a href=\"https://techcommunity.microsoft.com/t5/microsoft-onedrive-blog/experience-the-new-onedrive-fast-organized-and-personalized/ba-p/3804985\" target=\"_blank\">“For you” recommendation in OneDrive</a></li><li><a href=\"https://techcommunity.microsoft.com/t5/microsoft-onedrive-blog/feature-deep-dive-favorites-and-shortcuts-in-onedrive/ba-p/3960478\" target=\"_blank\">Favorites in OneDrive</a></li><li><a href=\"https://support.microsoft.com/topic/org-explorer-40c65909-b12d-4ab9-8d6c-a1592789dc8e\" target=\"_blank\">Org Explorer</a> (requires Viva license)</li><li><a href=\"https://techcommunity.microsoft.com/t5/microsoft-search-blog/tips-and-tricks-on-how-to-search-for-organizational-content-more/ba-p/3838452\" target=\"_blank\">Using search efficiently for organizational content</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Delve Web will retire on December 16, 2024. Most features are available in other Microsoft 365 experiences, with Profile Cards being the main alternative. A new edit profile experience will replace the profile update feature in Delve. Users should update internal documentation and prepare for the transition."
    }
  ],
  "EndDateTime": "2025-02-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC698136",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-05-22T18:30:07.293Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-14T04:20:39Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retiring Delve Web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
