{
  "ActionRequiredByDateTime": "2024-03-30T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams is governed by the <a href=\"https://learn.microsoft.com/lifecycle/policies/modern\" target=\"_blank\">Modern Lifecycle Policy</a> and requires users to stay on the most up-to-date version of the client application. Automatic updates ensure that users have the latest capabilities, performance and security enhancements, and service reliability.\n</p><p>Microsoft is constantly investing into innovations and improvements for more effective, reliable, and secure communication infrastructure. The latest improvements for chat messaging scenarios are enhancing the resiliency of message delivery in Microsoft Teams.\n</p><p><b>When will this happen:</b></p><p>By the end of March 2024, Microsoft will stop supporting the legacy services infrastructure for chat messaging.</p><p><b>How this will affect your organization:</b>\n</p><p>Users on Teams clients that are more than three months old may experience delayed chat messages, including one-on-one chats, group chats, or channel posts after March 2024. This change will affect Microsoft Teams Desktop, Teams on Mobile (iOS and Android), and VDI (Virtual Desktop Interface) clients.\n</p><p>This change will not affect Phone Devices, Panels, Meeting rooms, or Surface Hubs. The Web version is also automatically kept current.\n</p><p>Learn more about the Modern Lifecycle Policy under the<a href=\"https://learn.microsoft.com/microsoftteams/teams-client-update#servicing-agreement\" target=\"_blank\"> Servicing agreement for Microsoft Teams</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend communicating to your users about the need of for staying on the most up-to-date latest version of Microsoft Teams.</p><p>Affected Clients\n</p><p><u style=\"\">Teams on Windows PC and MacOS\n</u></p><p>The Desktop client automatically installs new updates, and a new version is usually available once a month. The Teams application could be stuck on an old version if the user has not restarted it for a long time.\n</p><p>Desktop clients can be downloaded and installed by users directly from https://teams.microsoft.com/downloads&nbsp;if they have the appropriate local permissions. Administrator permissions are not required to install the Teams client on Windows PCs but are required on Macs.\n</p><p><i>Update process\n</i></p><ol><li>In Teams, select the ellipsis (...) next to your profile picture, and then click Check for Updates, the banner might show: “We will check and install any updates while you continue to work.”\n</li><li>The link should be shown in a few minutes as this process downloads the latest supported version of Teams.\n</li><li>The banner also lets you know if you are already running the latest version, in which case, no update is necessary.\n</li><li>Click the refresh link in the banner.\n</li></ol><p>If you run into any issues, please check the troubleshooting guide: https://learn.microsoft.com/microsoftteams/new-teams-troubleshooting-installation, for New Teams client, and this troubleshooting guide: https://learn.microsoft.com/microsoftteams/troubleshoot-installation&nbsp;for Classic Teams client.\n</p><p><u>Teams on iOS and Android</u><u style=\"\">\n</u></p><p>Mobile apps are distributed and updated through the respective mobile platform’s app store only. Please open the Google Play app on your Android device or App Store on iOS device to check for updates to the Teams app.\n</p><p><u style=\"\">Teams on VDI\n</u></p><p>Teams clients on Virtual Desktop Infrastructure (VDI) aren't automatically updated the way that non-VDI Teams clients are. You have to update the VM image by installing a new MSI as described in the instructions to <a href=\"https://learn.microsoft.com/microsoftteams/teams-for-vdi\" target=\"_blank\">Install Teams on VDI</a>. You must uninstall the current version to update to a newer version.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC698127",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-12-14T04:15:07.93Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-14T04:14:56Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Update Microsoft Teams client applications to most up-to-date version by March 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
