{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 2, 2025: This update serves as a reminder that Azure ACS in Microsoft 365 will retire and stop working in 10 months from now (April 2, 2026).</p><p>Since the first use of Azure Access Control Services (ACS) by SharePoint in 2013, Microsoft has evolved the authorization and authentication options for SharePoint Online via Microsoft Entra ID (a.k.a. Azure AD). Using <a href=\"https://learn.microsoft.com/en-us/azure/active-directory/develop/\" target=\"_blank\">Microsoft Entra ID</a> as auth platform for your SharePoint Online customizations will provide your applications the most secure, compliant and future proof model. With our continued investment in Microsoft Entra ID, Microsoft is retiring the use of Azure ACS as auth platform for SharePoint Online. \n</p><p><b>Key Points:</b></p><ul><li>Major: Retirement</li><li>Timeline:<ul><li>Starting November 1st, 2024, new tenants will not be able use Azure ACS.</li><li>Starting <i>April 2, 2026</i>, Microsoft will remove the ability use SharePoint ACS for existing tenants.</li></ul></li><li>Action: Review and assess impact</li></ul><p><b>How this will affect your organization</b> \n</p><p>If your organization still uses Azure ACS to grant custom developed or third party applications access to SharePoint Online, they will no longer have access after April 2nd, 2026. We recommend customers to update their customizations to use Microsoft Entra ID and ask their solution vendors to do the same. \n</p><p><b>What you need to do to prepare</b> \n</p><p>You will want to notify your Azure ACS users and developers. Update your user training and prepare your help desk. \n</p><p>For admins \n</p><ul><li>Use the <a href=\"https://aka.ms/assessment/addinsacs\" target=\"_blank\">Microsoft 365 Assessment tool</a> to scan your tenants for Azure ACS usage. \n</li><li>Review the guidance for <a href=\"https://aka.ms/retirement/acs/guidance\" target=\"_blank\">migrating from Azure ACS to Microsoft Entra ID</a>. \n</li><li>There will not be an option to extend Azure ACS usage for SharePoint Online beyond April 2nd 2026.  \n</li></ul><p>Learn more \n</p><ul><li>Support update for the <a href=\"https://aka.ms/retirement/acs/support\" target=\"_blank\">retirement of Azure ACS for SharePoint Online</a> in Microsoft 365.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Azure ACS in Microsoft 365 will retire on April 2, 2026. New tenants cannot use Azure ACS starting November 1, 2024. Organizations should transition to Microsoft Entra ID for SharePoint Online customizations. Admins should notify users, update training, and use provided tools and guidance for migration."
    },
    {
      "Name": "HelpLink",
      "Value": "https://aka.ms/retirement/acs/support"
    }
  ],
  "EndDateTime": "2026-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC693863",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-02T22:23:12.577Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-27T23:28:50Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Azure ACS retirement in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
