{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 3, 2025: This update serves as a reminder that SharePoint Add-Ins will retire and stop working in 6 months from now (April 2, 2026).</p><p>Since the release of SharePoint Add-Ins in 2013, Microsoft has evolved SharePoint extensibility using <a href=\"https://learn.microsoft.com/sharepoint/dev/spfx/sharepoint-framework-overview?WT.mc_id=m365-15744-cxa\" target=\"_blank\">SharePoint Framework</a> (SPFx) enabling you to write applications that can be used in Microsoft SharePoint, Viva Connections and Microsoft Teams. With our continued investment in SharePoint Framework, Microsoft is retiring SharePoint Add-Ins.\n</p><p><b>Key Points:</b></p><ul><li>Major: Retirement \n</li><li>Timeline:\n<ul><li>Starting July 1st, 2024, SharePoint Add-Ins cannot be installed from the public marketplace, also referred to as store by existing tenants. Installation from a private app catalog stays possible.\n</li><li>Starting November 1st, 2024, new tenants will not be able use SharePoint Add-Ins, regardless of their origin (public marketplace, private tenant catalog).\n</li><li>Starting April 2nd, 2026, Microsoft will remove the ability use SharePoint Add-Ins for existing tenants.\n</li></ul></li><li>Action: Review and assess impact\n</li></ul><p><b>How this will affect your organization:</b></p><p>If your organization still uses SharePoint Add-Ins, they will no longer function after April 2nd, 2026. We recommend customers to port their customizations to SharePoint Framework (SPFx) and ask their solution vendors for updated solutions.\n</p><p><b>What you need to do to prepare</b></p><p>You will want to notify your Add-In users and developers. Update your user training and prepare your help desk.\n</p><p>For admins\n</p><ul><li>Use the <a href=\"https://pnp.github.io/pnpassessment/addinsacs/readme.html\" target=\"_blank\">Microsoft 365 Assessment tool</a> to scan your tenants for SharePoint Add-In usage.\n</li><li><a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps\" target=\"_blank\">Disable SharePoint Add-Ins</a> on your tenant using SharePoint Online Management Shell</li><li> Review the guidance for <a href=\"https://learn.microsoft.com/sharepoint/dev/sp-add-ins-modernize/sp-add-in-modernize\" target=\"_blank\">migrating from SharePoint Add-Ins to SharePoint Framework</a>.</li><li>There will not be an option to extend SharePoint Add-Ins beyond April 2nd 2026.\n</li></ul><p><i>New: How to disable SharePoint Add-Ins on your tenant\n</i></p><p>Admins can disable SharePoint Add-Ins with the<a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps\" target=\"_blank\"> Set-SPOTenant SharePoint Management Shell PowerShell command</a>.\n</p><p><code>Connect-SPOService -Url https://&lt;tenant&gt;-admin.sharepoint.com\n</code></p><p><code>Set-SPOTenant -IsSharePointAddInsDisabled $true</code>\n</p><p>After SharePoint Add-Ins are disabled, users will not be able to add SharePoint Add-Ins to their sites, and admins cannot add new SharePoint Add-Ins to the tenant and site collection app catalogs. SharePoint Add-Ins already added to sites will stay available and can still be used by the site's users.\n</p><p><i>New: SharePoint Add-Ins will not be available from the public marketplace\n</i></p><p>After July 1, 2024, users browsing the public marketplace (<a href=\"https://appsource.microsoft.com/\" target=\"_blank\">AppSource</a>) will see SharePoint Add-In, but if they select Get it now, a message will explain that SharePoint Add-Ins are retired and cannot be added. If you still require a specific SharePoint Add-In, contact the Add-In creator to understand the possible options.</p><p>Learn more\n</p><ul><li>Support update for the <a href=\"https://learn.microsoft.com/sharepoint/dev/sp-add-ins/retirement-announcement-for-add-ins\" target=\"_blank\">retirement of SharePoint Add-Ins</a> in Microsoft 365.\n</li></ul><p><br></p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Add-Ins will retire on April 2, 2026, stopping their functionality. From July 1, 2024, they cannot be installed from the public marketplace, and new tenants lose all usage by November 1, 2024. Organizations should migrate to SharePoint Framework (SPFx) and prepare users and admins accordingly."
    },
    {
      "Name": "HelpLink",
      "Value": "https://aka.ms/retirement/addins/support"
    }
  ],
  "EndDateTime": "2026-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC693865",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-03T14:48:28.04Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-27T23:32:02Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "SharePoint Add-In retirement in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
