{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 5, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>With the new sync window, users can choose how many days' worth of emails and attachments they want to download to their iOS or Android device so they can always access them even while offline.</p><p><b>Note: </b>The emails/attachments will be stored internally as a cache since every time a user changes their sync window (decrease) we do a clean-up of all saved data. They cannot choose the location for that matter.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID:&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=189809\" target=\"_blank\">189809</a><br></p>\n\n<p>Preview: We will begin rolling out in late December 2023 and expect to complete by mid-January 2024.<br></p><p>Worldwide: We will begin rolling out late May 2024 (previously mid-May) and expect to complete by early July 2024 (previously late June).</p>\n\n<p><b>How this will affect your organization:</b><br></p>\n\n<p>This change will give users more control over what messages and attachments are being saved to their device. By choosing sync settings that better accommodate their necessities, they can use Outlook Mobile even while they're not connected to their cellular data or Wi-Fi.</p><p><i>iOS:</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1fBaB?ver=720b\" style=\"width: 400px;\"></p><p><i>Android:</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1fGgm?ver=ef17\" style=\"width: 400px;\"><br></p>\n<p><b>What you need to do to prepare:</b><br></p>\n<p>Update training and documentation as appropriate so users can determine how many days they'd prefer to sync to their device; we currently provide a 90-day limit.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "189809"
    },
    {
      "Name": "Summary",
      "Value": "Outlook update allows users to select the number of days to sync emails for offline access on iOS or Android devices. The rollout timeline has been updated, with worldwide now beginning in late May 2024. This change offers users more control and requires updates to training and documentation. Microsoft 365 Roadmap ID: 189809."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2024-08-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC696167",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-05T17:43:19.973Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-07T00:53:19Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Outlook: Choose how many days of emails sync to your iOS or Android device for offline usage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
