{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated May 7, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p style=\"\">Today, users can see Outlook contacts created with their Entra ID (AAD) account in Teams, but contacts created in Teams are not available in Outlook. To provide a consistent experience we are making changes to allow Teams contacts, created with a user's&nbsp;Entra ID (AAD) account, to be visible in Outlook as well.</p><p style=\"\"><b>Upcoming changes to contacts in Teams and Outlook:</b></p><p>Currently, Teams and Outlook maintain separate contact lists for enterprise users. Based on your feedback, we plan to introduce a unified contact experience, ensuring a consistent contacts experience across Outlook and Teams. In future, changes to contacts in users’ organization (Entra ID) account in Teams will reflect in Outlook and vice versa.&nbsp;</p><p>What's Happened so far:&nbsp;</p><ul><li>We have completed one round of migration of all Teams contacts to Outlook in January 2024.&nbsp;</li><li>As a result, users may see more contacts in Outlook, namely those created in Teams and potentially Skype for Business contacts (if enabled).&nbsp;</li><li>Existing Outlook contacts may also be enriched with additional details from corresponding Teams contacts.&nbsp;</li><li>Teams users can see Outlook contacts but cannot edit them inside Teams.&nbsp;</li></ul><p><b>What's Coming:</b>&nbsp;</p><p>Users will gradually upgrade to the new unified experience from December 2024. The new experience will be enabled for each user across all endpoints (Desktop, Mobile, Devices etc.) simultaneously. Once the new experience is enabled for a user, they will see same set of contacts in Outlook and Teams. Any change in Outlook will reflect in Teams and vice versa.&nbsp;</p><p>All Teams contact changes (creations and edits) made since January will be included in the unified store. During creations, a small set of users may see duplicate contacts in the unified store. To help users navigate the transition, category label ‘Teams Conflict’ will be applied to duplicate contacts. This label will help users see any conflicts (duplicates or inconsistencies) that need their attention.&nbsp;</p><p> <b>When this will happen:</b></p><p>This activity is expected to be completed for all active users by June 2025 tentatively (previously April). Once this activity is complete, users will work with a single contact list across Teams and Outlook.&nbsp;</p><p><b>How this will affect your organization</b><br></p><p>Once this change is complete, users will be able to see created contacts across both Outlook and Teams and vice versa.<br></p><p><b>What you need to do to prepare</b></p><p>Action Required: Update your organisation documentation and training materials to reflect the upcoming changes for the new unified contact experience.</p><p>You may consider updating your training and documentation as appropriate. If users wish to retain a snapshot of their existing contacts in Outlook, please encourage users to back-up their existing contacts using the export capability in Outlook.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Contact unification across Outlook and Teams is being updated. By June 2025, users will have a unified contact experience, with changes in Teams reflecting in Outlook and vice versa. Users may see duplicate contacts labeled 'Teams Conflict.' Organizations should update documentation and training materials accordingly."
    }
  ],
  "EndDateTime": "2025-06-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC695487",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-07T16:32:57.01Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-04T23:40:45Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Contact Unification across Outlook and Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
