{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 1, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The evidence panels for mail cluster entities and mailbox configuration entities will have a refreshed user experience. The update is solely visual with no change in content. The change will be seen on the incident evidence and response tab, the investigation evidence and entities tabs as well as in action center when applicable to these entity types.</p><p><b>When this will happen:</b></p><p>This is currently rolling out and expected to complete by late March 2024 (previously late February).</p><p><b>How this will affect your organization:</b></p><p>Admins will see an updated UX for email clusters and mailbox configurations.</p><p><b>What you need to do to prepare:</b></p><p>You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender will update the user experience for evidence panels related to mail cluster and mailbox configuration entities. The update is visual only, with no change in content. The rollout will complete by late March 2024, and admins should notify users and update relevant documentation."
    }
  ],
  "EndDateTime": "2024-04-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC690603",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-01T23:56:48.253Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-17T00:28:49Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender: User experience update to evidence",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
