{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated April 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">For a paused or completed project where owners want to preserve channel content, but no longer want to keep the channel active, they can archive channels now!<br></p><p>Archiving channels will be available for Teams users. You, as a channel owner or administrator can archive a channel you own. By archiving the channel, it will not be available in your and channel members teams and channels list anymore and no more actions will be allowed on the channel like messaging, reacting, commenting, editing etc. In case, you want, you can unarchive the channel as well, by going to manage teams &gt; channels. Team members can hoist the channel in their left rail even after archival.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=123769\" target=\"_blank\">123769</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late February 2024 (previously early February) and expect to complete by mid-March 2024 (previously mid-February).</p><p>Worldwide: We will begin rolling out mid-March 2024 (previously mid-February) and expect to complete by late April 2024 (previously early April).</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Channel owners and administrators can now archive channels to avoid any activity on them and can restore if needed. Channel members will not be able to take actions on the channel like messaging, reacting, commenting, editing etc., but they can still access and read through the channel content.&nbsp;</p>\n<p><b>What you need to do to prepare:</b></p>\n\n<p>Communicate teams and channel owners to utilize archive channel capability to keep the channel in read-only mode.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "123769"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"123769\":[{\"RoadmapId\":123769,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-03-08T05:33:01.28174Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":123769,\"Platform\":\"Web\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-03-08T05:33:01.2817377Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":123769,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-03-08T05:33:01.2817402Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams now allows channel owners and administrators to archive channels for paused or completed projects. Archiving a channel will make it unavailable in the teams and channels list, and no actions will be allowed on it. The rollout is expected to begin in late February 2024 and complete by late April 2024. Channel members can still access and read through the channel content, but cannot take any actions. It is recommended to communicate with teams and channel owners to utilize the archive channel capability to keep the channel in read-only mode."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-06-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC696576",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-12T20:59:00.953Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-07T23:33:15Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Archive channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
