{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated November 7, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Coming soon, Microsoft Purview Insider Risk Management will be rolling out public preview of progressive alert scoring.<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=179883\" target=\"_blank\">179883</a><br></p>\n\n<p><b>When this will happen:</b></p><p>Preview will begin in mid-October 2024 (previously early August) and is expected to be complete by mid-November 2024 (previously late October)&nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>With this new feature, user activities that could potentially result in data security incidents will be assessed more frequently within a 24-hour period compared with the current practice of once every 24 hours. Alert insights will now be updated every few hours with this increased frequency, providing analysts with timely alerts and continuously evolving insights.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>No action is needed for this update.</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>You can access the Insider Risk Management solution in the Microsoft Purview compliance portal.</p><p>https://purview.microsoft.com/compliance</p><p> \n</p><p>Learn more: <a href=\"https://learn.microsoft.com/en-us/purview/insider-risk-management-activities?view=o365-worldwide\" target=\"_blank\">Investigate insider risk management activities</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "179883"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management's public preview of progressive alert scoring will begin mid-October 2024, with completion by mid-November 2024. This feature will provide more frequent assessments and timely alert updates. No action is required for preparation. More information can be found on the Microsoft 365 Roadmap ID 179883."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC707653",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-09T00:04:55.133Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-17T00:29:59Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview Insider Risk Management: Public preview of progressive alert scoring",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
