{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated May 22, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p style=\"\">Microsoft Teams users will soon be able to control how they get notified in meeting chats through RSVP to their meetings. When they decline a meeting, they will not receive notifications or see the chats in chat list; when they accept a meeting, they will receive notification for all new messages. This release of Microsoft Teams Meeting ID will be rolling out across Microsoft Teams Desktop, Mobile and Web and will provide an additional way for users to control their chat list by selecting which meetings they want to receive message updates from.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=161739\" target=\"_blank\">161739</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release will begin rolling out early April 2025 (previously mid-March) and expect to complete by mid-April 2025 (previously late March).&nbsp;</p><p>Worldwide will begin rolling out mid-April 2025 (previously late March) and expect to complete by late April 2025 (previously early April).&nbsp;</p><p>GCC will begin rolling out mid-April 2025 (previously late March) and expect to complete by late April 2025 (previously early April).&nbsp;</p><p>GCC High will begin rolling out early April 2025 (previously mid-March) and expect to complete by late May 2025 (previously mid-April).&nbsp;</p><p>DoD will begin rolling out late April 2025 (previously early April) and expect to complete by early June 2025 (previously early May).</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>You will not receive notifications or see chats from meetings you declined. You will be able to set how you want to be notified for meetings you RSVP with Accept or Tentative from Microsoft Teams settings.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>You might want to notify your users about this new capability to control meeting chat notifications by RSVP to meetings.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow users to control chat notifications based on their meeting RSVP status. Declining a meeting will stop notifications and hide chats, while accepting will enable notifications. This update will roll out from early April to early June 2025, varying by release group. Notify users about this new feature."
    }
  ],
  "EndDateTime": "2025-07-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC704035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-22T17:03:42.273Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-05T04:06:31Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Integrate Chat notification with Meeting RSVP status",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
