{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated August 1, 2024: We have updated the rollout timelines below. Thank you for your patience.</p><p style=\"\">Microsoft Teams users will soon be able to control how they get notified in meeting chats through RSVP to their meetings. When they decline a meeting, they will not receive notifications or see the chats in chat list; when they accept a meeting, they will receive notification for all new messages. This release of Microsoft Teams Meeting ID will be rolling out across Microsoft Teams Desktop, Mobile and Web and will provide an additional way for users to control their chat list by selecting which meetings they want to receive message updates from.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=161739\" target=\"_blank\">161739</a></p>\n<p><b>When this will happen:</b></p><ul><li>Targeted Release will begin rolling out early September 2024 (previously early Augus) and expect to complete by mid-September 2024 (previously mid-August).&nbsp;</li><li>Worldwide will begin rolling out mid-September 2024 (previously mid-August) and expect to complete by late September 2024 (previously late Augus).&nbsp;</li><li>GCC will begin rolling out late September 2024 (previously August) and expect to complete by early October 2024 (previously early September).&nbsp;</li><li>GCC High will begin rolling out early October 2024 (previously early September) and expect to complete by mid-October 2024 (previously mid-September).&nbsp;</li><li>DoD will begin rolling out early October 2024 (previously early September) and expect to complete by mid-October 2024 (previously mid-September).&nbsp;</li></ul>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>You will not receive notifications or see chats from meetings you declined. You will be able to set how you want to be notified for meetings you RSVP with Accept or Tentative from Microsoft Teams settings.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>You might want to notify your users about this new capability to control meeting chat notifications by RSVP to meetings.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams users can now control how they receive notifications in meeting chats through RSVP to their meetings. Declining a meeting will result in no notifications or chats in the chat list, while accepting a meeting will result in notifications for all new messages. The rollout will begin in early September 2024 and will be available on Microsoft Teams Desktop, Mobile, and Web. Users can select which meetings they want to receive message updates from. No action is required to prepare, but users may want to be notified about this new capability."
    }
  ],
  "EndDateTime": "2024-11-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC704035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-01T17:41:22.537Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-05T04:06:31Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Integrate Chat notification with Meeting RSVP status",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
