{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated May 19, 2025: After further review, we were not able to rollout to DoD. Thank you for your patience.\n</p><p style=\"\">The Muting Teams with Windows Taskbar is now available. This feature, available in the new Teams experience on Windows, enables you to mute and unmute your audio by clicking the mic icon in Windows taskbar.</p><p>To control your call mic from the taskbar, do the following:</p><p>Select the mic icon on your taskbar or press <i>Windows logo key + Alt + K</i><b> </b>to mute or unmute your microphone while using a calling app.</p><p>-OR- Click the volume icon in the hardware indicator for volume in Windows taskbar.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/0ac345e6-5599-4c77-bc0a-5fe1a85def2d\" style=\"width: 300px;\"><br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=191528\" target=\"_blank\">191528</a></p>\n<p><b>When this will happen:</b></p><p>Targeted release: We will begin rolling out early June 2024 (previously mid-May) and expect to complete by mid-June 2024 (previously late May).</p><p>Worldwide, GCC, &amp; GCC High: We will begin rolling out mid-June 2024 (previously early June) and expect to complete by complete by late May 2025 (previously late April).</p><p><b>How this will affect your organization:</b></p><p>This enables a feature previously available in older version of Teams on Windows.</p><p><b>What you need to do to prepare:</b></p><p>To prepare, distribute updates on this rollout with your organization if applicable for your users.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "191528"
    },
    {
      "Name": "Summary",
      "Value": "Mute with Windows Taskbar is now available in the new Microsoft Teams on Windows, allowing users to mute/unmute audio via the mic icon in the taskbar. Rollout begins early June 2024 and completes by late May 2025. This feature is not available for DoD."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC709270",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-19T19:57:05.487Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-23T00:44:15Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Mute with Windows Taskbar available in the new Microsoft Teams on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
