{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated April 19, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Now admins can search for Microsoft Forms content specifically within their collections, see the full metadata associated to those items including the Form title, and review both the original Form and responses to the Form as related items within both review and export. Simplification and ease of use for managing Forms content via eDiscovery will help reduce the pain points of the challenging discovery process and improve the confidence of organizations using Forms for critical tasks that may require eDiscovery capabilities.<br></p><p>Note: \n</p><ul><li>Licensing: Because discovery of Forms content within this preview requires eDiscovery premium, you must have appropriate licensing. Please see this article for more information: <a href=\"https://learn.microsoft.com/office365/servicedescriptions/microsoft-365-service-descriptions/microsoft-purview-ediscovery#feature-availability\" target=\"_blank\">Microsoft Purview eDiscovery - Service Descriptions | Microsoft Learn</a>  \n<ul><li>If your tenant does not have appropriate licensing, see <a href=\"http://Free trial of Microsoft Purview compliance solutions | Microsoft Learn\" target=\"_blank\">Free trial of Microsoft Purview compliance solutions | Microsoft Learn</a></li></ul></li><li>Permissions: You must have appropriate permissions to use eDiscovery. See the following article for more information: <a href=\"https://learn.microsoft.com/purview/ediscovery-assign-permissions\" target=\"_blank\">Assign eDiscovery permissions in the Microsoft Purview compliance portal | Microsoft Learn</a></li></ul>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=181617\" target=\"_blank\">181617</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Preview: We will begin rolling out mid-December 2023 and expect to complete by late December 2023.</p><p>Worldwide: We will begin rolling out late April 2024 (previously early April) and expect to complete by late May 2024 (previously late April).&nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Microsoft Forms content could be searched in eDiscovery Premium. Admins can better manage tasks that require eDiscovery capabilities for Forms.&nbsp;</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>No additional action is needed to prepare for this feature.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "181617"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Forms content can now be searched in eDiscovery Premium, allowing admins to better manage tasks that require eDiscovery capabilities. The rollout will begin mid-December 2023 and complete by late December 2023 for preview, and late April 2024 for Worldwide. Appropriate licensing and permissions are required. No additional action is needed to prepare for this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-06-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC700643",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T18:49:29.657Z",
  "Services": [
    "Microsoft Forms"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-21T08:20:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "eDiscovery Premium-Enhancements to eDiscovery experience for Microsoft Forms content",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
