{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Search based plugins for Microsoft Copilot for Microsoft 365 were rolled out in November 2023 to all tenants licensed for Microsoft Copilot for Microsoft 365. However, this feature was only activated after an initial tenant-wide opt-in had been secured. \n</p><p>This feature, currently accessible from within Microsoft Teams, will be moved into public preview in late February 2024. At that time, the opt-in requirements will be removed, and the feature will be available to all licensed Copilot for Microsoft 365 tenants. \n</p><p>The plugin capability will be enabled in all licensed tenants by default. Note, admins can disable this functionality on a user and group basis and control how individual plugins are approved for use, and which plugins are enabled.\n</p><p>Tenants that have set the opt-in flag or made any changes to associated plugin access or usage settings will not be impacted. Existing plugin-specific settings will be unchanged and will remain in force.\n</p><p>In the weeks following this initial update, plugins for Copilot for Microsoft 365 will also be made available within additional hubs including copilot.microsoft.com, Office.com and Bing.</p><p><b>When this will happen:</b>\n</p><ol><li>Default availability of plugins to all tenants licensed for Copilot for Microsoft 365 will begin in late February and expected to be completed before March 1, 2024.\n</li><li>Availability in other hubs such as copilot.microsoft.com, Office.com and Bing will begin within two to three weeks after the public preview has been fully released.  \n</li></ol><p><b>How this will affect your organization:</b>\n</p><p>MAC Admins have tenant-wide control over Copilot extensibility. The tenant-wide controls complement the existing, more granular app and user controls already in place through <i>MAC &gt; Settings &gt; Integrated app management</i>.\n</p><p>A new Copilot setting controls access to Copilot plugins within your organization. It supports Copilot extensibility pilots and phased rollout. The control offers three plugin access options: All users, Specific users or groups, and No users. The \"Specific users or groups\" option limits Copilot extensibility to a select group of users prior to a general rollout to all licensed Copilot seats. \n</p><p>By default, Copilot extensibility is enabled for all users with a Copilot for Microsoft 365 license.\n</p><p>When Copilot extensibility is enabled for your tenant, internally developed Teams apps with manifest version 1.13 or higher and defined as a Search Message Extension will be recognized as a plugin for Copilot for Microsoft 365. Licensed Copilot users who have been granted access to that app will also have access to that app as a plugin. Those users with access still need to install and activate the app for use as a plugin. \n</p><p>These settings will apply to all the hubs (Teams, Office.com and Bing) where plugins have been enabled.\n</p><p><b>What you need to do to prepare:</b></p><p>Only users licensed for Copilot for Microsoft 365 can be affected. Admins control extensibility tenant-wide and users control their own Copilot extensibility and plugin use. Licensed Copilot users can add and use available plugins within Copilot sessions on a session-by-session basis.\n</p><p>Your feedback is valuable to Microsoft. Please contact us through your standard channels or directly to this message.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoft-365/admin/manage/manage-plugins-for-copilot-in-integrated-apps"
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC709653",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-24T00:39:45.673Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-24T00:39:38Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Plugin support in Microsoft Copilot for Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
