{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 26, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The latest Teams meeting experiences will be available for Teams on the web in Safari and Firefox browsers - including performance improvements, refreshed pre-join, updated meeting stage, and the updated meeting toolbar. (for anonymous join only)&nbsp;<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=329253\" target=\"_blank\">329253</a></p><p><b>When this will happen:</b></p><p>Worldwide: We will begin rolling out early September 2024 (previously mid-August) and expect to complete by early October 2024 (previously late August).</p><p>GCC, GCC High and DoD: We will begin rolling out mid-October 2024 (previously mid-September) and expect to complete by early November 2024 (previously mid-October).</p><p><b>How this will affect your organization:</b></p><p>We make constant steps to improve Teams performance irrespective of the platform – this time we are making the experience of Teams meetings on web (in Safari and Firefox browsers) better for anonymous users (guests). That’s crucial because it improves external collaboration. For example, if participants from your tenant would like to have meetings with non-Teams users (who are often joining as guests) it’ll become simpler as guests joining meeting from Safari/Firefox web browsers won’t have to wait significant amount of time for the meeting experience to load.&nbsp;</p><p>You may also notice that currently meeting UI in Chrome and Safari/Firefox is different, but with this update it won’t be a case anymore and you’ll enjoy all the benefits of modern UI (such as meeting toolbar on top of the screen, etc).&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>You may want to update your internal documentation to inform your users about this improvement.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "329253"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is rolling out improved meeting experiences for web users on Safari and Firefox, including performance enhancements and a modern UI, starting early September 2024. The update is aimed at bettering the experience for guests and aligning the UI with Chrome. Organizations are advised to update their documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC705760",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-26T18:06:21.07Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-10T22:58:55Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Teams: Latest meeting experiences with performance improvements on web for Safari and Firefox (for guests)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
