{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated January 24, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Coaching by Copilot is coming to Outlook for Windows. This functionality takes a user-crafted email draft and generates a short summary of feedback based on that draft. It presents feedback on tone, reader sentiment and clarity, and also provides specific suggestions for how you may rewrite parts of your email to improve these aspects. Common use cases are getting feedback on a particularly important email and adjusting your text before sending.&nbsp;&nbsp;<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=190927\" target=\"_blank\">190927</a><br></p>\n\n<p><b>When this will happen:</b><br></p>\n\n<p>This functionality will be available in Current Channel (Build 17231). It will gradually roll out during the month of February, with MEC rolling out in March.</p>\n\n<p><b>How this will affect your organization:</b><br></p>\n\n<p>The option to open Coaching by Copilot will be available in the ribbon when composing a new email or responding to an email. It will show up automatically in Outlook for Windows if users are licensed for Copilot.</p>\n\n<p><b>What you need to do to prepare:</b><br></p>\n<p>Ensure that your users have a license for Copilot and are on the latest Targeted Release build in order to access this new functionality. If you do not wish users to have this function you can manage access by removing Copilot licenses from users as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "190927"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-04-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC709265",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-24T20:51:06.98Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-23T00:41:20Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Coaching by Copilot in Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
