{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated October 17, 2024: We have updated the rollout timelines below. Thank you for your patience.</p><p style=\"\">Microsoft Teams users will soon be able to control how they get notified in meeting chats through RSVP to their meetings. When they decline a meeting, they will not receive notifications or see the chats in chat list; when they accept a meeting, they will receive notification for all new messages. This release of Microsoft Teams Meeting ID will be rolling out across Microsoft Teams Desktop, Mobile and Web and will provide an additional way for users to control their chat list by selecting which meetings they want to receive message updates from.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=161739\" target=\"_blank\">161739</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release will begin rolling out early December 2024 (previously early November) and expect to complete by mid-December 2024 (previously mid-November).&nbsp;</p><p>Worldwide will begin rolling out early January 2025 (previously early December) and expect to complete by mid-January 2025 (previously mid-December).&nbsp;</p><p>GCC will begin rolling out January 2025 (previously early November) and expect to complete by mid-January 2025 (previously mid-November).&nbsp;</p><p>GCC High will begin rolling out mid-January 2025 (previously mid-November) and expect to complete by late January 2025 (previously late November).&nbsp;</p><p>DoD will begin rolling out late January 2025 (previously early October) and expect to complete by early February 2025 (previously mid-October).&nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>You will not receive notifications or see chats from meetings you declined. You will be able to set how you want to be notified for meetings you RSVP with Accept or Tentative from Microsoft Teams settings.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>You might want to notify your users about this new capability to control meeting chat notifications by RSVP to meetings.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will update to allow users to control chat notifications based on their RSVP status. Declining a meeting will stop notifications and hide chats, while accepting will enable them. Rollout timelines have been updated, starting December 2024 for Targeted Release and completing by February 2025 for DoD. Users should be informed about this new feature. Microsoft 365 Roadmap ID 161739 details this update."
    }
  ],
  "EndDateTime": "2025-03-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC704035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-17T16:14:52.757Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-05T04:06:31Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Integrate Chat notification with Meeting RSVP status",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
