{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 5, 2024: We have updated the content below to show as intended. Thank you for your patience.</p><p>In the Microsoft Purview <i>Compliance portal</i>, under <i>Information Protection</i>, we are introducing two new controls in the sensitivity label creation/edit process. These changes are designed to improve the controls around private team discoverability in Teams and to provide additional controls for the shared channels in Teams channels.</p>\n<p>This message is associated with Microsoft 365 Roadmap IDs <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=165698\" target=\"_blank\">165698</a>.</p>\n<p><b>When this will happen:</b></p>\n\n<p>Public Preview: We will begin rolling out in late January 2024 (previously early February) and expect to be complete by early February 2024. - Complete</p><p>Standard Release: We will begin rolling out in late March 2024 (previously late February) and expect to be complete by mid-April 2024 (previously early March).\n</p><p><b>How this will affect your organization:</b><br></p>\n\n<p>The main changes in the new version of label create/edit flow are:\n</p><ul><li>&nbsp;A new section under <i>Groups and Sites</i> called <i>Private team discoverability and shared channel settings.</i></li><li>The new <i>Groups and Sites</i> section has two subsections: a <i>Private teams discoverable control </i>and three <i>Shared channel controls</i>.<ul><li><i>Private teams discoverability control:</i> This control allows private teams to be searchable in the Teams app if this label is applied to it. Currently only public teams are searchable in the Teams app. With this label-based control, the admin can create/edit labels in the Compliance portal that allow discoverability of private teams. The private team owner can then apply that label to their team and enable it to appear in a Teams app search. A user cannot join the private team directly but will have to be approved by the owner, which upholds current membership controls. NOTE: For this label-based control to take effect, the admin must turn on<i> Private team discoverability</i> from the Teams Admin Center for scoped users or all users in the tenant, through Teams policies.</li><li><i>Shared Channel controls:</i> These provide access controls to shared channels in a tenant, based on the label applied to the team.&nbsp;<ul><li><i>Restrict to: Internal Only: </i>Select&nbsp;to restrict sharing with internal teams only of the tenant. If not selected, the channel can be shared with external teams, too.&nbsp;</li><li><i>Restrict to: Same label only</i> (for internal teams): Select to restrict sharing with another team that has the same label applied. If not selected, the channel can be shared with different labelled teams too. External sharing is not impacted by this setting. </li><li><i>Restrict to: Private teams only: </i>Applies to internal as well as external sharing. Select to restrict sharing to other private teams only. If not selected, the channel can be shared with public teams, too.&nbsp;</li></ul></li></ul></li></ul><p><b>What you need to do to prepare:</b></p>\n<p>Learn more at <a href=\"https://learn.microsoft.com/purview/create-sensitivity-labels?view=o365-worldwide\" target=\"_blank\">Create and configure sensitivity labels and their policies | Microsoft Learn</a>.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "165698"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is introducing two new controls in the sensitivity label creation/edit process in the Compliance portal under Information Protection to improve the controls around private team discoverability in Teams and to provide additional controls for the shared channels in Teams channels. The changes will be rolled out in late January 2024 for Public Preview and in late March 2024 for Standard Release. The new version of label create/edit flow includes a new section under Groups and Sites called Private team discoverability and shared channel settings, which has two subsections: a Private teams discoverable control and three Shared channel controls. To prepare, learn more at Create and configure sensitivity labels and their policies | Microsoft Learn."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC709659",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-05T22:55:30.223Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-24T00:44:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Sensitivity labels to discover private teams and protect shared channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
