{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated October 1, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">The Muting Teams with Windows Taskbar is now available. This feature, available in the new Teams experience on Windows, enables you to mute and unmute your audio by clicking the mic icon in Windows taskbar.<br></p><p>To control your call mic from the taskbar, do the following:</p><p>Select the mic icon on your taskbar or press <i>Windows logo key + Alt + K</i><b> </b>to mute or unmute your microphone while using a calling app.</p><p>-OR- Click the volume icon in the hardware indicator for volume in Windows taskbar.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1h608?ver=877a\" style=\"width: 300px;\"><br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=191528\" target=\"_blank\">191528</a></p>\n<p><b>When this will happen:</b></p><p>Targeted release: We will begin rolling out early June 2024 (previously mid-May) and expect to complete by mid-June 2024 (previously late May).</p><p>Worldwide, GCC, GCC High &amp; DoD: We will begin rolling out mid-June 2024 (previously early June) and expect to complete by late October 2024 (previously late September).</p><p><b>How this will affect your organization:</b></p><p>This enables a feature previously available in older version of Teams on Windows.</p><p><b>What you need to do to prepare:</b></p><p>To prepare, distribute updates on this rollout with your organization if applicable for your users.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "191528"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Teams on Windows now allows users to mute and unmute their microphone using the mic icon in the Windows taskbar or a keyboard shortcut. Rollout updates have been provided with specific timelines for different releases. Users should inform their organization about these updates."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-12-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC709270",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-01T19:18:46.537Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-23T00:44:15Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Mute with Windows Taskbar available in the new Microsoft Teams on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
