{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated March 15, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Coming soon, Microsoft Purview Insider Risk Management will be rolling out a public preview of policy wizard enhancements.</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.&nbsp;</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-policies\" target=\"_blank\">Create and manage insider risk management policies | Microsoft Learn</a></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=368825%2C\" target=\"_blank\" style=\"\">368825</a><br></p>\n<p><b>When this will happen:</b></p>\n\n<p>Public Preview: Rollout will begin in late May 2024 (previously early February) and is expected to be complete by early June 2024 (previously early March).&nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>To enhance the user experience for editing and creating policies, we will be making improvements to the Trigger, Trigger threshold, Indicator threshold, and Summary pages of the policy wizard.</p>\n<p><b>What you need to do to prepare:</b></p><p>There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "368825"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will be rolling out a public preview of policy wizard enhancements in late May 2024. The enhancements will improve the user experience for editing and creating policies. No action is needed to prepare for this change."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/purview/insider-risk-management-policies"
    }
  ],
  "EndDateTime": "2024-07-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC700928",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-15T22:48:53.507Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-22T04:29:58Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview Insider Risk Management: Public preview of policy wizard enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
