{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated February 16, 2024: We have updated the content below for clarity.</p><p style=\"\">This feature enables users with personal Microsoft accounts (MSA) using the free version of Microsoft Teams to join and participate in Teams for work (or school) meetings with their signed-in personal account when joining meetings from within the Teams app. This feature also lets these users stay connected with the other meeting participants (retain access to the meeting chat) after the meeting has ended. These users are no longer prompted to join only via a browser and later treated as meeting guests (anonymous).&nbsp;</p><p style=\"\"><b>Note:</b>&nbsp;This feature will only be available for New Teams.</p><p style=\"\">This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=167326%2C\" target=\"_blank\">167326</a></p><p style=\"\"><b>When this will happen:</b>&nbsp;<br></p><p style=\"\">Standard Release: We will begin rolling out late February 2024 (previously early February) and expect to complete by mid-April 2024 (previously mid-March).</p><p style=\"\"><b>How this will affect your organization:</b>&nbsp;<br></p><p style=\"\">Currently Microsoft Teams (Free) users can join Teams for work (or school) meetings only as meeting guests. These users are prompted to use the browser to join the meetings which results in sub-optimal experience for them (participation as meeting guests, being removed from meeting chat after meeting has ended).&nbsp;<br></p><p style=\"\">Once this feature is made available, users of Microsoft Teams (Free) will be able to join Teams for work (or school) meetings in one click, they no longer will be redirected to browser, asked to fill in their name/surname and they will be able to continue collaboration with meeting organiser and other participants via meeting chat after the meeting.&nbsp;<br></p><p style=\"\">Similarly, this feature also enables the tenant users with Microsoft work credentials to be able to join a Microsoft Teams (Free) hosted meetings. Today, they can join such meetings only as guests in the web browser.&nbsp;&nbsp;<br></p><p style=\"\">Any users will still have an option to join as guests (unless it’s limited by tenant admins) if they want to, this process will not be changed.&nbsp;<br></p><p style=\"\">Organizations are always in control and can govern this collaboration capability using the existing setting that we have for chat federation with Microsoft Teams (Free) users (“People in my organisation can communicate with Teams users whose accounts are not managed by an organisation”). Going forward, this policy will be used to control both chats and meetings federation with Microsoft Teams (Free) users.&nbsp;<br></p><p style=\"\">There are 2 settings in admin center that can be used to control chat/meetings federation: </p><ol><li>People in my organization can communicate with Teams user whose accounts are not managed by organization.</li><li>External users with Teams accounts not managed by an organization can contact users in my organization.&nbsp;&nbsp;</li></ol><p style=\"\">Here are 2 examples of how they can be used:&nbsp;&nbsp;</p><p style=\"\"><i>Example #1:&nbsp;</i>&nbsp;</p><p style=\"\">You as tenant admin want to completely block communications with accounts that aren't managed by your organization. In this case you have to disable setting #1. Setting #2 in this case will be automatically disabled as well. Please note – this action will NOT block anonymous (guest) join, there is a separate setting for that.&nbsp;</p><p style=\"\"><i>Example #2:&nbsp;</i>&nbsp;</p><p style=\"\">You as tenant admin want people from your tenant to be able to connect to external (Teams (Free) hosted) meetings, but don't want Teams (Free) users to connect to the meetings organized by your tenant. In this case you have to disable Setting #2, Setting #1 will stay enabled. Note: turning this off will prevent Teams (Free) users from discovering people in your tenant and chatting with them.&nbsp;&nbsp;</p><p style=\"\"><b>Note:</b> Some meetings features may not be available for these users of free version of Teams during Teams for work (or school) meetings.&nbsp;&nbsp;</p><ul><li>Users of free version of Teams won’t be assigned to breakout rooms and won’t be able to view or share PPT Live content and participate in Whiteboarding.&nbsp;&nbsp;</li><li>Recording: Users of free version of Teams won’t be able to start recording (no changes compared to the current behavior) in Teams for work (or school) hosted meetings. In case a user from Teams for work (or school) decides to start recording – user of free version of Teams will be notified accordingly.&nbsp;</li><li>Presenter role: User of free version of Teams can be promoted to presenter role by Teams for work (or school) user, but only during the meeting.&nbsp;</li></ul><p style=\"\"><b>What you need to do to prepare:</b>&nbsp;</p><p style=\"\">Review your settings to regulate the experience that is appropriate for your organization. If your organization has previously turned this setting off, that choice will be honored with the roll out of this new capability. You may consider updating your internal documentation to inform your users that this capability is now available in Microsoft Teams.&nbsp;</p><p style=\"\">Additional details:&nbsp;</p><ul><li>Users with MSA accounts will be able to automatically join Teams for work (or school) meetings with their profile information only if they are joining within the Teams app (e.g. from Teams Calendar or from the link from a Teams chat). In case the user is starting to join a meeting from outside the app (e.g. from 3rd party apps or Outlook calendar) the experience will remain the same as earlier – users can only join in the anonymous mode without access to meeting chat after the meeting.&nbsp;</li><li>As a security control, users of Teams (free) app joining with their personal accounts will not be able to request another Teams for work (or school) user to join a work meeting while in meeting.&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "167326"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"167326\":[{\"RoadmapId\":167326,\"Platform\":\"Mac\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0209323Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":167326,\"Platform\":\"iOS\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0209322Z\",\"LatestRing\":null},{\"RoadmapId\":167326,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0209321Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":167326,\"Platform\":\"Android\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-02-11T01:29:10.020932Z\",\"LatestRing\":null},{\"RoadmapId\":167326,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0209323Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams (Free) users can now join Teams for work (or school) meetings with their personal accounts and stay connected with other participants after the meeting. This feature will be available for New Teams starting late February 2024. Organizations can control this collaboration capability using existing settings for chat/meetings federation. Some meetings features may not be available for free version users. Review settings to regulate the experience appropriate for the organization."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams (Free) users can now join Teams for work (or school) meetings with their personal accounts and stay connected with other participants after the meeting. This feature will be available for New Teams starting late February 2024. Organizations can control this collaboration capability using existing settings for chat/meetings federation. Some meetings features may not be available for free version users. Review settings to regulate the experience appropriate for the organization."
    }
  ],
  "EndDateTime": "2024-05-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC704194",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-16T22:13:01.813Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-05T22:38:29Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Join Teams work meetings from Microsoft Teams (free) and vice versa",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
