{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated April 19, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Users can collaborate in a way that meets compliance standards in meetings on a mobile device by picking sensitivity labels on Teams calendar. Users will see any default label if applied by the admin. When clicking on the Sensitivity label field in the meeting creation form, users will also see the list of specific labels allotted to them by the admin and choose the relevant label. According to the settings of the label, the meeting will become labeled and the content will be considered sensitive accordingly.&nbsp;</p><p>Channel meetings inherit the label that is used in Teams by default and cannot be changed.&nbsp;</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=178013\" target=\"_blank\">178013</a></p>\n<p><b>When this will happen:</b></p><p>Preview: We will begin rolling out mid-February 2024 and expect to complete by late February 2024.</p><p>General Availability (Worldwide, GCC, GCC High and DoD): We will begin rolling out late February 2024 and expect to complete by late April 2024 (previously early April).</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Users will be able to see the labels in the meeting assigned by the admin in an organization.&nbsp;</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "178013"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"178013\":[{\"RoadmapId\":178013,\"Platform\":\"iOS\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-23T03:11:55.4438822Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":178013,\"Platform\":\"Android\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-11T01:29:10.0203226Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":178013,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-23T03:11:55.4438825Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Teams Mobile Meetings now support Sensitivity Labels, allowing users to collaborate in compliance with their organization's standards. Users can select labels from the Teams calendar, with default labels applied by the admin. Channel meetings inherit the default label and cannot be changed. The rollout will begin in mid-February 2024 and complete by late April 2024. No action is required to prepare for this change."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC705762",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T19:00:54.903Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-10T23:00:10Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Sensitivity Labels enabled in Teams Mobile Meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
