{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated March 1, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Admins will now have the functionality to select the domain to use to send emails to their users via Teams Email Service</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=375694\" target=\"_blank\">375694</a></p>\n<p><b>When this will happen:</b></p><p>Standard Release: We will begin rolling out mid-February 2024 and expect to complete by late February 2024.</p><p>GCC: We will begin rolling out early May 2024 and expect to complete by mid-May 2024.</p><p>GCC High and DoD: We will begin rolling out early May 2024 and expect to complete by mid-May 2024.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>All the admins/tenants will now be able to select the domain to use to send emails to their users via Teams Email Service. Users will then receive emails from the selected domain by the admins/tenants.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>The feature will be available by default to all the admins/tenants. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Admins can now select the domain to use for sending emails to users via Teams Email Service. The feature will be rolled out in mid-February 2024 for standard release and early May 2024 for GCC, GCC High, and DoD. No action is required from admins, but they may want to inform users and update documentation."
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC705761",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-02T00:20:27.413Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-10T22:59:31Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Admins can select the domain to use for Teams Email Service",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
