{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This feature enables tenant admins to control whether some users in their organizations can join any externally hosted Microsoft Teams meetings. When these regulated users are signed in on their Teams clients, their ability to join an externally hosted meeting will be limited based on the policy configuration. This capability can be used by the tenant admins to protect potential data exfiltration from specific user groups within their organization.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=187230\" target=\"_blank\">187230</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Standard Release: We will begin rolling out early February 2024 and expect to complete by early March 2024.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Currently, Teams for work (or school) users can join any externally hosted Teams meetings. Whether they join these externally hosted meetings anonymously or with their signed in work (or school) credentials is determined by the external access configuration set by the tenant admins.\n</p><p>After this capability is launched, this configuration will provide an added layer of protection and regulate whether or not the users can join externally hosted meetings while using the Teams desktop app or web client. This new policy – “People can join meetings hosted by” – allows users to be able to join these meetings with the following behavior:</p><ul><li><i>Anyone:</i><b>&nbsp;</b>Users (or groups) can join any externally hosted meetings. Their current experience of joining externally hosted meetings will remain unchanged.\n</li></ul><p>\n</p>\n\n<p style=\"margin-left: 75px;\">Note: This retains all currently available behavior for Teams meetings.<br></p><ul><li><i>People and guests in my org and trusted orgs</i>: Users (or groups) can join meetings hosted by only:</li></ul><p style=\"margin-left: 75px;\">a)\tPeople and guests in their current org\n</p><p style=\"margin-left: 75px;\">b)\tPeople in the orgs that are set for trusted external access\n\n</p><ul><li><i style=\"\">People and guests in my org only:</i> Users (or groups) can join meetings hosted by only:</li></ul><p style=\"margin-left: 75px;\">a)\tPeople and guests in their current org</p><p style=\"margin-left: 50px;\">Note: This disables the ability to join any externally hosted Teams meeting.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>You should prepare to identify the users (or groups) in your organization who may need to be regulated in terms of the external hosted meetings that they should be allowed (or prevented) to join.</p><p>Some key callouts:&nbsp;</p><p>1.\tMeetings hosted in non-trusted orgs: If an external org with whom the external access trust is not configured hosts a Teams meeting, then, today, users are presented only with an anonymous option to join the meeting. If this new policy is set to “People and guests in my org only” or “People and guests in my org, and trusted orgs” then users won’t be allowed to join such a meeting with any option.\n</p><p>2.\tMeetings hosted in trusted orgs: If an external org with whom the external access trust is configured hosts a Teams meeting, then, today, users can join the meeting with their current org’s Teams account. If this new policy is set to “People and guests in my org only” for the specific user then the user won’t be allowed to join the externally hosted meeting using their signed-in Teams client.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "187230"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-04-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC707664",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-17T00:42:35.777Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-17T00:42:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Block users from joining externally hosted Teams meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
