{
  "ActionRequiredByDateTime": "2025-01-31T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are announcing the retirement of the ApplicationImpersonation Role Based Access Control (RBAC) role in Exchange Online.&nbsp;</p><p><b>When this will happen:</b></p><p>We will begin the retirement in May 2024 and in February 2025 will remove this role and its feature set from Exchange Online.</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because this RBAC role is commonly used with Exchange Web Services (EWS) to enable one-to-many mailbox access. We are removing this feature and will begin blocking the assignment of the ApplicationImpersonation (RBAC) role to accounts.</p><p>This will require all apps to have an App Registration, use Application permissions (not Delegated), and use a secure credential for access. Despite this change, if your app is granted the <i>full_access_as_app</i> Application permission, it will provide the same level of mailbox access as the ApplicationImpersonation RBAC role.</p><p><b>What you need to do to prepare:</b></p><p>Review your current configuration and make changes as appropriate to minimize disruption to your service.</p><p>For more information, please see:</p><ul><li><a href=\"https://aka.ms/ApplicationImpersonationDeprecation\" target=\"_blank\">Retirement of RBAC Application Impersonation in Exchange Online</a>.</li><li><a href=\"https://learn.microsoft.com/exchange/client-developer/exchange-web-services/impersonation-and-ews-in-exchange\" target=\"_blank\">Impersonation and EWS in Exchange</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The ApplicationImpersonation Role Based Access Control (RBAC) role in Exchange Online will be retired in May 2024 and removed in February 2025. This will affect organizations using Exchange Web Services (EWS) to enable one-to-many mailbox access. Organizations should review their current configuration and make changes as appropriate to minimize disruption to their service. More information can be found at the provided links."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC718754",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-23T23:09:11.587Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-23T23:08:46Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of RBAC Application Impersonation in Exchange Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
