{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 17, 2024: We have updated the content below with additional information on managing the assigned roles.&nbsp;</p><p>Microsoft SharePoint Embedded, currently in Public Preview, is an API-only solution empowering app developers to leverage the file and document storage in Microsoft 365 to create line-of-business or multitenant applications. Microsoft Loop is an example of a SharePoint Embedded application.<br></p><p>\n</p><p>We are introducing the SharePoint Embedded Administrator role, which will have the capability to manage various aspects of SharePoint Embedded Applications and containers. This role will be available in Microsoft 365 admin center. With the introduction of this new role, Global Administrator can continue to create and manage SharePoint Embedded applications. However, as of mid-March 2024, the SharePoint admin role will lose the ability to execute SharePoint Embedded application and container-specific cmdlets (outlined below) as we roll-out the new role integration. After the rollout, only Global Administrators or SharePoint Embedded Administrators will be authorized to execute such cmdlets. Please track this document for the announcement of availability of the new SharePoint Embedded Administrator role in the Microsoft admin center.&nbsp;</p><p><b>When this will happen:</b><br></p><p>\n</p><p>Public Preview: We will begin rolling out early March 2024 and expect to complete by late March 2024.<br></p><p>General Availability: We will begin rolling out mid-April 2024 and expect to complete by late May 2024 (previously early May).<br></p><p><b>How this will affect your organization:</b></p><p><i>Tenants creating SharePoint Embedded Applications</i><br></p><p>Admins who want to create a new containertype through PowerShell cmdlets should be assigned the Global Administrator or the SharePoint Embedded Administrator to be able to execute all the available SharePoint Embedded developer admin cmdlets such as.\n</p><ul><li>New-SPOContainerType&nbsp;</li><li>Get-SPOContainerType\n</li><li>Set-SPOContainerType&nbsp;</li></ul><p>Admins who want to run the VS code extension to create SharePoint Embedded ContainerTypes should also be assigned the Global Administrator or the SharePoint Embedded Administrator role.\n</p><p><i>Tenants Registering SharePoint Embedded Applications for use</i><br></p><p>Admins who want to manage containers created on their tenants should be assigned the Global Administrator or the SharePoint Embedded Administrator to run the PowerShell execute all SharePoint Embedded consuming tenant admin cmdlets.\n</p><ul><li>Get-SPOApplication\n</li><li>Set-SPOApplication (Future)\n</li><li>Get-SPOContainer\n</li><li>Set -SPOContainer\n</li><li>Remove-SPOContainer\n</li><li>Get-SPODeletedContainer\n</li><li>Restore-SPODeletedContainer\n</li><li>Remove-SPODeletedContainer\n</li></ul><p><b>What you need to do to prepare:</b><br></p><p>The SharePoint Embedded Administrator role is now visible on Entra. Assign this new role to yourself to continue to use the container management cmdlets on PowerShell and access containers on the new UX that will be launched shortly. Please note, that Global administrator will continue to have access to the container management cmdlets as well as the UX for containers.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1k0ZL?ver=52db\" style=\"width: 400px;\"></p><p>Alternatively, the Global administrators can assign the SharePoint Embedded Administrator role using the following PowerShell cmdlet: \n</p><p><code>&gt; Install-Module Microsoft.Graph\n</code></p><p><code>&gt; Connect-MgGraph -Scopes \"RoleManagement.ReadWrite.Directory,User.Read.All\"\n</code></p><p><code>&gt; $userId = \"6bd30fc4-057c-409e-991b-a76fcd4510ab\"\n</code></p><p><code>&gt; $roleId = \"1a7d78b6-429f-476b-b8eb-35fb715fffd4\"\n</code></p><p><code>&gt; $roleDefinition = Get-MgRoleManagementDirectoryRoleDefinition -UnifiedRoleDefinitionId $roleId\n</code></p><p><code>&gt; $roleassignment = New-MgRoleManagementDirectoryRoleAssignment -DirectoryScopeId '/' -RoleDefinitionId $roleDefinition.Id -PrincipalId $userId</code></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint is introducing a new SharePoint Embedded Administrator role to manage SharePoint Embedded Applications and containers. Global Administrators can continue to create and manage SharePoint Embedded applications until mid-March 2024, after which only Global Administrators or SharePoint Embedded Administrators will be authorized to execute cmdlets. The rollout will begin in early March 2024 and complete by late March 2024 for Public Preview and mid-April 2024 to late May 2024 for Standard Release. Admins should assign the existing Global Admin role or the new SharePoint Embedded Admin role to create or manage SharePoint Embedded applications."
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC718551",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T20:32:22.18Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-23T00:34:20Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint: New Embedded Admin role impact",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
