{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The private add-in data on the Microsoft 365 Apps Health dashboard will be discontinued by Microsoft.\n</p><p>The Add-in tab on the <a href=\"https://config.office.com/officeSettings/officeapphealth/overview\" target=\"_blank\">Microsoft 365 Apps health</a> page in the <a href=\"https://config.office.com\" target=\"_blank\">Microsoft 365 Apps admin center</a> shows admins both public and private add-in data in one place. On February 29, 2024, the portal will stop processing and displaying private add-in data.\n</p><p>Other features in Microsoft 365 Apps health, like the performance &amp; reliability metrics for the Microsoft 365 Apps as well as performance &amp; reliability metrics for public add-ins are not affected and will remain available as of today.\n</p><p>The support of running add-ins by the Microsoft 365 Apps remains as-is and is not affected by this retirement note.\n</p><p>Public add-ins are extensions for the Microsoft 365 Apps that come from independent vendors or Microsoft and are generally broadly available, either for free or for a fee. Private add-ins are extensions specific to an organization and have been developed internally or externally for internal use and are not broadly available.\n</p><p><b>Note:</b> You can ignore this message if your organization does not use Microsoft 365 Apps health or the Add-in health tab.\n</p><p><b>When this will happen:</b>\n</p><p>We will roll out this change in late February 2024 and expect to complete by early March 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>The Microsoft 365 Apps health feature and the Add-in tab will continue to be available after this change. But the data shown on the Add-in tab will not include metrics from private add-ins anymore. Those data points will not be shown, searchable or exportable.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You don't have to do anything to get ready for this change. General information about <a href=\"https://learn.microsoft.com/DeployOffice/admincenter/microsoft-365-apps-health\" target=\"_blank\">Microsoft 365 Apps health</a> and the <a href=\"https://learn.microsoft.com/deployoffice/admincenter/overview\" target=\"_blank\">Microsoft 365 Apps admin center</a> are available in our documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/DeployOffice/admincenter/microsoft-365-apps-health"
    }
  ],
  "EndDateTime": "2024-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC711661",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-01T04:17:08.64Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-01T04:16:56Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Private Add-in data in Microsoft 365 Apps health retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
