{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are retiring the Azure Information Protection (AIP) Unified Labeling add-in for Office on April 11th, 2024. </p><p><b>When this will happen:</b></p><p>The AIP Add-in for Office will be permanently disabled in Office after May 1st, 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because your organization owns one or more licenses for Azure Information Protection. To continue using sensitivity labels powered by Microsoft Purview Information Protection in Office applications, you must transition to the built-in labeling experience in Microsoft 365 Apps.</p><p>Important retirement milestones are:</p><ul><li>April 2024: Release of Microsoft Purview Information Protection client version 3.0 with the AIP Add-in for Office removed. To continue using the Information Protection Scanner, Viewer and File Labeler, your organization must upgrade and deploy the new package.</li><li>April 11th, 2024:&nbsp; AIP Unified Labeling add-in is retired and no longer in support. Extensions to continue using the AIP add-in will be granted on a case-to-case basis; please reach out to Microsoft Support or your account team.</li><li>May 1st, 2024: AIP Unified Labeling add-in permanently disabled in Office. AIP Unified Labeling add-in for Office clients will be blocked from using the add-in with version 2.16 or higher. Download of label policy will fail for all clients without extensions to continue using the AIP add-in.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>For detailed migration steps, refer to our playbook: <a href=\"https://aka.ms/AIP2MIP/HowTo/GetStarted\" target=\"_blank\">From bolt-on to built-in – Migrate from Azure Information Protection Add-in</a>.\n</p><p>For the announcement and FAQs of the retirement, refer to our blog: <a href=\"https://aka.ms/AIPRetireBlog\" target=\"_blank\">Retirement notification for the Azure Information Protection Unified Labeling add-in for Office</a>. \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC713037",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-06T00:05:34.75Z",
  "Services": [
    "Microsoft 365 suite",
    "Azure Information Protection"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-06T00:04:24Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Azure Information Protection Add-in for Office is retiring",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
