{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 28, 2024: Setting Custom scripts setting for a site in SharePoint tenant admin center will be fully available by early-April (Previously March).</p><p>PowerShell command (DelayDenyAddAndCustomizePagesEnforcement) to delay the change will be fully available by mid- April (Previously March).</p><p>The enforcement to set NoScriptSite to True for all existing SharePoint sites and OneDrive sites if DelayDenyAddAndCustomizePagesEnforcement is not set to True will start late-April and be completed by early-May (Previously March)</p><p>There are changes happening to Custom script settings between April and May 2024 (Previously March). \n</p><ul><li>The Custom Script setting, which determines if users can execute custom scripts on personal sites and self-service created sites will be removed by early-May (Previously March).<p>This setting is currently located in the SharePoint Admin Center, under Settings -&gt; Classic Settings.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hGgB?ver=38f6\" style=\"width: 400px;\"></p></li><li>A new PowerShell command, \"DelayDenyAddAndCustomizePagesEnforcement\", has been introduced. This command is available in the SharePoint Online Management Shell version 16.0.24524.12000, or above which allows delay of the change to custom script set on the Tenant until mid-November 2024 (previously May).\n<p><b><br></b></p><p><b>Note:</b>&nbsp;that while this cmdlet is available in the latest management shell, running the cmdlet will result in an error (The requested operation is part of an experimental feature that is not supported in the current environment) until Mid-April 2024 (Previously March) when the settings are shipped.</p><p>* False (default) - for site collections where administrators enabled the ability to add custom script, SharePoint will revoke that ability within 24 hours from the last time this setting was changed.\n</p><p>* True - All changes performed by administrators to custom script settings are preserved. When the value is set to true, a banner shows in the active sites list of the SharePoint admin center informing that changes to custom scripts are permanent.\n</p><p>Set-SPOTenant -DelayDenyAddAndCustomizePagesEnforcement $True\n</p><p>Please be aware that the new PowerShell command will only be accessible until mid-November 2024 (previously May). Post that period, on SharePoint sites if administrators wish to continue using features that are only available when unmanaged custom scripts are permitted to run, they will need to re-enable the running of custom scripts every 24 hours. This option does not impact existing custom scripts.\n</p></li><li>The NoScriptSite setting will be configured to True for all existing SharePoint sites and OneDrive sites except for below mentioned sites templates.<p><br></p><p>BLANKINTERNETCONTAINER#0  = Classic Publishing Portal site\n</p><p>CMSPUBLISHING#0  = Publishing Site\n</p><p>BLANKINTERNET#0 = Publishing Site\n</p><p>GROUP#0 = Team site\n</p><p>APPCATALOG#0 = App Catalog\n</p><p>CSPCONTAINER#0 = CSP Container\n</p></li><li>The execution of existing scripts in OneDrive and SharePoint sites will remain unaffected.\n</li><li>There will not be an option to enable custom script on OneDrive sites once the delay set using DelayDenyAddAndCustomizePagesEnforcement ends in mid-November 2024 (previously May).\n</li><li>Customers will retain the ability to permit the execution of custom scripts on specific SharePoint sites using the Set-SPOSite &lt;SiteURL&gt; -DenyAddAndCustomizePages PowerShell command or from the Active sites page in the SharePoint Admin Center.<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hDuH?ver=9606\" style=\"width: 400px;\"></p><p>Any modifications made to a site will be automatically reverted to False status within 24 hours, unless the new PowerShell command “DelayDenyAddAndCustomizePagesEnforcement” is used prior to mid-November 2024 (previously May). After mid-November, the 24 hour reversion will occur regardless of this setting.&nbsp;</p></li></ul><p><b>When this will happen:</b>\n</p><p>The Custom Script setting from SharePoint admin center will be removed early-May (Previously March).</p><p>The new PowerShell command will be available by mid-April (Previously March).</p><p><b>How this will affect your organization:</b>\n</p><p>When this Custom Script setting is removed, you will no longer be able to add, modify or remove scripts within OneDrive and SharePoint sites unless administrators temporarily allow that by turning the setting on specific sites. This will not impact the ability to execute existing scripts in OneDrive and SharePoint sites.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>No extensions will be granted beyond the mentioned period.\n</p><p>It may be beneficial to inform all site owners about this modification and make necessary updates to your training materials and documentation accordingly.\n</p><p>Review the following for additional information: <a href=\"https://learn.microsoft.com/sharepoint/allow-or-prevent-custom-script\" target=\"_blank\">Allow or prevent custom script</a></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Custom Script setting in SharePoint and OneDrive will be removed by early-May 2024. A new PowerShell command, DelayDenyAddAndCustomizePagesEnforcement, will allow administrators to delay the change until mid-November 2024. The NoScriptSite setting will be configured to True for all existing sites except for specific site templates. Existing scripts in OneDrive and SharePoint sites will not be affected. Administrators can still permit the execution of custom scripts on specific sites using the Set-SPOSite command or from the Active sites page in the SharePoint Admin Center."
    }
  ],
  "EndDateTime": "2024-12-23T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC714186",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-28T20:43:50.09Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-09T01:06:26Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Remove Custom Script setting in OneDrive and SharePoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
