{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated May 1, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">We're pleased to announce the upcoming Multi-Tenant Organization (MTO) capabilities in Microsoft Teams. Admins can activate these features by configuring an MTO group in the Microsoft 365 admin center, while users utilize the new Teams desktop client.<br></p><p>Aimed at organizations managing employees across multiple tenants within the same cloud boundary, these features provide a seamless collaboration experience within MTO groups, enabling access to resources across tenants. The capabilities cover search, chat, calling, meetings, and content sharing, eliminating silos and facilitating collaboration across tenant boundaries.</p><p><b>When this will happen:</b></p><p>General Availability (GCC, GCC High, DoD) We will begin rolling out in mid-May 2024 and expect to complete in mid-June 2024.</p><p><b>What you need to do to prepare:</b></p><p>If you are interested in using these capabilities, familiarize yourself with <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/plan-multi-tenant-org-overview?view=o365-worldwide\" target=\"_blank\">Plan for multitenant organizations in Microsoft 365 (Preview)</a> \n</p><p>Client machines running Windows 10 must have KB5027293 installed.\n</p><p>Client machines running Windows 11 must have KB5027303 installed.\n</p><p>The following minimum client versions are required:\n</p><ul><li>Windows Desktop Client: 23231.412.2343.5284 \n</li><li>Mac Desktop Client: 23231.412.2343.5284\n</li><li>Android Client: 1416/1.0.0.2023121301<br></li><li>iOS Client: 2023231301</li></ul><p><b>Note:&nbsp;</b>MTO capabilities will be available on the new Teams Windows, new Teams MacOS, iOS and Android client apps. A version of the Teams web app will also be optimized for these MTO features in the future.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message announces the upcoming Multi-Tenant Organization (MTO) capabilities in Microsoft Teams for GCC, GCC High, and DoD clouds, with a rollout starting mid-May 2024 and completion expected by mid-June 2024. Admins can activate these features, which enable seamless collaboration across tenant boundaries. Users must update their client machines and Teams desktop clients to specific versions to utilize these capabilities."
    },
    {
      "Name": "Summary",
      "Value": "The message announces the upcoming Multi-Tenant Organization (MTO) capabilities in Microsoft Teams for GCC, GCC High, and DoD clouds, with a rollout starting mid-May 2024 and completion expected by mid-June 2024. Admins can activate these features, which enable seamless collaboration across tenant boundaries. Users must update their client machines and Teams desktop clients to specific versions to utilize these capabilities."
    }
  ],
  "EndDateTime": "2024-07-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC711026",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-01T22:15:15.293Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-29T23:56:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams Multitenant Org (MTO) in GCC, GCC High, and DoD clouds",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
