{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated May 8, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">There is now increased information in the alert email notification sent to the Data Loss Prevention (DLP) admins upon a DLP policy match. Previously a DLP alert email only included the user activity and the type of sensitive information matched in the alert. Now, DLP admins will get additional context such as alert ID, policy details, device details, and more. This will help admins quickly assess the priority of an alert and determine the next steps before navigating to the Microsoft Purview DLP alerts page or Microsoft 365 Defender DLP alerts page.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=369645\" target=\"_blank\">369645</a></p>\n<p><b>When this will happen:</b></p>\n\n<p>Public&nbsp;Preview: Available now.</p><p>General Availability: Rollout will begin in mid-April 2024 (previously mid-March) and is expected to complete by late May 2024 (previously late April).</p>\n\n<p><b>How this will affect your organization:</b></p><p>This feature will be available as part of the DLP alerts experience if you follow these steps:</p>\n\n<p>1.\tEnsure the DLP policy has alert notifications turned ON.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hiu3?ver=2bcd\" style=\"width: 400px;\"><br></p>\n\n<p><br></p><p>2.\tWhen DLP policy rule matches occur, the admin will receive alert email notifications in their inbox.</p>\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hiu0?ver=66c6\" style=\"width: 400px;\"><br></p><p><br></p><p>3.\tThe enriched alert email notifications have additional context for alert triage. If further investigation is needed, the admin can navigate to the DLP alert page in the Microsoft 365 Defender portal (E5 customers) or Purview portal (E3 customers) directly from the email. Below is an example of an endpoint alert email notification.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hq7x?ver=1617\" style=\"width: 400px;\"><br></p>\n<p><b>What you need to do to prepare:</b></p>\n<p>This feature will be available as part of the DLP alerts experience if the steps above are followed.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "369645"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is updating the Data Loss Prevention (DLP) alert email notifications for DLP admins. The enriched alert email notifications will now include additional context such as alert ID, policy details, device details, and more. This will help admins quickly assess the priority of an alert and determine the next steps before navigating to the Microsoft Purview DLP alerts page or Microsoft 365 Defender DLP alerts page. The rollout will begin in mid-April 2024 and is expected to complete by late May 2024. To prepare, ensure the DLP policy has alert notifications turned on."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/purview/dlp-policy-reference"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715429",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-08T21:03:57.34Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-13T01:30:45Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Data Loss Prevention - Enriched Data Loss Prevention (DLP) alert email notifications for DLP admins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
