{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 15, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In response to the positive reception and valuable feedback regarding the Microsoft Copilot for Microsoft 365 welcome email introduced in July 2023, we’ve made some changes to the feature. We’re happy to announce that Copilot welcome email will be supported to licenses assigned outside of the Microsoft 365 admin center, such as in PowerShell and Group license assignment through Microsoft Entra admin center.&nbsp;</p><p><b>When this will happen:</b></p><p>Worldwide: We will begin rolling out late March 2024 (previously early March) and expect to complete by late April 2024 (previously early April).</p><p><b>How this will affect your organization:</b></p><p>For tenants that enable direct communications from Microsoft to end users, any end users assigned Copilot for Microsoft 365 licenses through methods outside of the Microsoft 365 admin center will automatically receive a Copilot for Microsoft 365 welcome email. This email, titled <i>Microsoft Copilot - your copilot for work</i>, will be sent from the specific email address Microsoft365Copilot@communication.microsoft.com, and will contain helpful resources to assist users in getting started.</p><p>This automated welcome email feature will be specifically tailored for users and organizations that permit Microsoft to send them direct communications.</p><ul><li>For Organizations: To review or alter these settings, sign in to the <a href=\"https://admin.microsoft.com/\" target=\"_blank\">Microsoft 365 admin center</a> with an admin account. Navigate to Show all &gt; Settings &gt; Org settings &gt; Services &gt; Microsoft‎ communication to users.\n</li><li>For Individual Users: Communication preferences can be adjusted via&nbsp;<a href=\"https://admin.microsoft.com/account/#security\" target=\"_blank\">security and privacy settings</a>.</li></ul><p>Note: Emails will respect the Microsoft communication preferences of organizations and users.</p><p><b>What you need to do to prepare:</b></p><p>Ensure your organization's Microsoft communication preferences are up to date in the <a href=\"https://admin.microsoft.com/\" target=\"_blank\">Microsoft 365 admin center</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "PowerShell and Microsoft Entra admin center now support Copilot welcome emails for licenses assigned outside of the Microsoft 365 admin center. The rollout will begin in late March 2024 and end in late April 2024. End users assigned Copilot for Microsoft 365 licenses through methods outside of the Microsoft 365 admin center will automatically receive a Copilot for Microsoft 365 welcome email if direct communications from Microsoft to end users are enabled. Organizations and individual users can adjust their communication preferences via the Microsoft 365 admin center and security and privacy settings, respectively."
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC711665",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-15T21:44:47.61Z",
  "Services": [
    "Microsoft Copilot for Microsoft 365"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-01T04:29:59Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "PowerShell and Microsoft Entra admin center now support Copilot welcome emails",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
