{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Lists, list owners and collaborators with permission to edit the list will be able to collect information on their lists with these updated Lists forms.</p><p>Lists forms can be created quickly and shared with a link. The recipient can focus on filling out the form without seeing your full list. All submitted responses appear immediately as new list items that list collaborators can see and refine.\n</p><p>Lists forms work well in scenarios such as recruitment tracking, managing orders, tracking customer issues, filing expenses, etc. For example, an event organizer can create and manage multiple forms for the same list to track attendees, feedback, logistics, and more, with each form collecting a part of the full list. \n</p><p>Please note: \n</p><ul><li>When you create a form in a list, you can only share the form as a link that allows anyone in your organization to fill out and submit. You cannot share the form with different permissions at this time.\n</li><li>Forms will not appear on lists or sites that do not allow sharing a link with organization members.\n</li><li><i>+ Add new item</i>&nbsp;will continue to work as before for those that have access to the list.</li></ul>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=124865\" target=\"_blank\">124865</a>.</p>\n<p><b>When this will happen:</b></p>\n\n<p>Targeted release (entire organization): We will begin rolling out late Feb 2024 and expect to complete by mid-March 2024. \n</p><p>Standard release, GCC, GCC High, DoD, USSec, USNat: We will begin rolling out mid-March 2024 and expect to complete by late April 2024.</p>\n\n<p><b>How this will affect your organization:</b><br></p>\n\n<p>For a form creator: \n</p><p>We have a modernized form builder. To create a form or access existing forms, select&nbsp;<i>Forms </i>on the command bar at the top of a list. When you create a new form, the form builder opens and uses the fields from the list schema. As the form creator, you can add fields and show/hide fields. You can change the theme and share the form with a link. You can also stop accepting form responses.\n</p><p>The Forms command&nbsp;is hidden from users who lack permission to edit that list.\n</p><p>For a form responder:\n</p><p>Anyone in your organization can access the form through a link and submit their responses. After logging in, the responder can complete the form on a desktop or mobile browser. The form responder does not gain any extra permissions by submitting the form.</p><p>Below are screenshots of this feature in action: \n</p><p> \n</p><p><b>Manage your forms:<br></b></p><p></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hscl?ver=9cb3\" style=\"width: 400px;\" alt=\"user screens\"><br></p><p><b>Form builder: Add fields and show, hide, or rearrange them:</b></p><p></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hxi6?ver=c525\" style=\"width: 400px;\" alt=\"user screens\"><br></p><p><b>Choose a theme for your form:</b></p><p></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hzMo?ver=d5a6\" style=\"width: 400px;\" alt=\"user screens\"><br></p><p><b>Send the form as a link to anyone in your organization:</b></p><p></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hscm?ver=69c3\" style=\"width: 400px;\" alt=\"user screens\"><br></p><p><b>Form responders can log in, open the form in the browser, and fill in the form:</b></p><p></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hCp9?ver=7bb7\" style=\"width: 400px;\" alt=\"user screens\"><br></p><p><b>Form responses start appearing in the list as items:</b></p><p></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1huNW?ver=30a8\" style=\"width: 400px;\" alt=\"user screens\"><br></p><p>&nbsp;<b>What you need to do to prepare:</b></p>\n<p>You may want to notify your users about these new features and update your training and documentation as appropriate. </p><p>To learn how this feature was originally disclosed at Microsoft Ignite (May 2023):&nbsp;<a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/microsoft-lists-easier-better-faster-stronger/ba-p/3806075\" target=\"_blank\">Microsoft Lists: Easier, Better, Faster, Stronger - Microsoft Community Hub</a>).</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "124865"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-06-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC716006",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-14T23:45:02.007Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-14T23:44:32Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Lists: New forms experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
