{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re adding new controls for admins to manage access to the Microsoft Copilot Dashboard and expanding access to more organizational leaders.&nbsp;</p><p><b>When this will happen:</b></p><p>Worldwide: We will begin rolling out in mid-March 2024 and expect to complete by late April 2024.</p><p><b>How this will affect your organization:</b><br></p><p>The Microsoft Copilot Dashboard (Preview) in Viva Insights helps organizations maximize the value of Copilot for Microsoft 365. If you use Microsoft Entra ID (formerly known as Azure Active Directory) to manage user profile data like organization or manager data, the Copilot dashboard will be automatically enabled for certain licensed users upon launch. As a Microsoft 365 global admin, you can grant or revoke access to the Copilot dashboard to users within your organization using the M365 Admin Center. You can use the new admin controls to turn off the default access. \n</p><p><i>How default access is determined</i></p><p>Users who are senior leaders within large teams as determined by their Microsoft Entra ID (AAD data) manager attribute can automatically view the report. Tenants must meet all of the following criteria to qualify:\n</p><ol><li>The majority of users in the tenant have the Manager ID attribute assigned in Microsoft Entra ID.</li><li>The majority of users in the tenant are part of a single reporting line.</li><li>The tenant has more than 2,500 seats.</li></ol><p>For those qualifying tenants, only users who meet both of the following criteria are enabled by default:\n</p><ul><li>The user is in the top three levels in the organization.</li><li>The user has a significant portion of the organization in their reporting line.</li></ul><p><i>PowerShell cmdlets to disable default access</i></p><p>For more information about the PowerShell&nbsp;cmdlets used to disable the default access, view the <a href=\"https://admin.microsoft.com/adminportal/home?#/viva/insights\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Copilot Dashboard access settings</a>&nbsp;page in the M365 Admin Center.</p><p>What can qualified users see in the Copilot Dashboard? \n</p><ul><li>Insights that combine Copilot usage metrics with collaboration and sentiment data will be available to Viva Insights licensed organizations in the Copilot Dashboard. These additional insights provide more granular views of Copilot adoption, usage patterns, user sentiment, and return on investment across teams, functional roles, and more. \n</li><li>Leaders with a Viva Insights license and access to the dashboard can apply filters and group the Copilot adoption and impact metrics by organizational attributes such as organization, level designation, and job function. \n</li><li>Viva Insights analysts can now create custom reports based on these metrics.</li></ul><p><b>What you need to do to prepare:</b></p><ul><li>Access the <a href=\"https://aka.ms/CopilotDashboard\" target=\"_blank\">Microsoft Copilot Dashboard (Preview)</a>&nbsp;at <a href=\"https://aka.ms/CopilotDashboard\" target=\"_blank\">aka.ms/CopilotDashboard</a></li><li>Learn how to add and remove access to the Copilot dashboard in the <i>Manage user access to the dashboard in Viva Insights</i> section of&nbsp;<a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/copilot-dashboard#manage-user-access-to-the-dashboard-in-viva-insights\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Connect to the Microsoft Copilot Dashboard (Preview) | Microsoft Learn</a></li><li>Learn more about Microsoft Copilot Dashboard (Preview) in Viva Insights, including its metrics and how to interpret the data: <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/copilot-dashboard\" target=\"_blank\">Connect to the Microsoft Copilot Dashboard (Preview) | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights is expanding access to the Copilot Dashboard (Preview) and introducing new admin controls. Admins can manage access to the dashboard, and more organizational leaders will have access. The rollout will start in mid-March 2024 and end in late April 2024. The Copilot Dashboard provides insights on Copilot usage metrics, collaboration, and sentiment data, and Viva Insights analysts can create custom reports based on these metrics. Users who are senior leaders within large teams can automatically view the report, and admins can grant or revoke access to the dashboard using the M365 Admin Center. PowerShell cmdlets can be used to disable default access."
    }
  ],
  "EndDateTime": "2024-06-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC718249",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-21T23:52:43.153Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-21T23:52:31Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights: Expanded access to Microsoft Copilot Dashboard (Preview) and new admin controls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
