{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Note:</b>&nbsp;If your organization does not have users in European Economic Area, you can safely disregard this message.</p><p>To prepare for the Digital Markets Act, Microsoft Edge will roll out changes starting no earlier than February 20, 2024, that will go into effect in the European Economic Area (EEA). This will allow end users in the EEA the option to uninstall the Microsoft Edge browser. In addition, Microsoft Edge will no longer rely on the Windows diagnostic group policies in the areas affected by the Digital Markets Act. It will instead use the Microsoft Edge group policy, DiagnosticData, for diagnostic data collection. Edge version 122 will also introduce a new policy, UrlDiagnosticDataEnabled, to enable more control over optional data collection. This policy provides the ability for your organization to send optional diagnostic data to help with critical product improvements and stability but avoid sharing URLs of pages visited and per-page usage. \n</p><p><b>When will this happen?</b>\n</p><ul><li>No earlier than February 20, 2024 – changes roll out to Microsoft Edge for Business  \n</li><li>March 6, 2024 - Digital Markets Act goes into effect in the EEA\n</li><li>March 6, 2024 – PCs in the EEA running Windows 10, version 22H2 and Windows 11, version 23H2 will be compliant with the Digital Markets Act\n</li></ul><p><b>How this will affect your organization</b>\n</p><ul><li>If you had previously set the Windows diagnostic data policy, data sent from your organization to Microsoft may be impacted. \n</li><li>If the Microsoft Edge group policy for diagnostic data collection is unset, your end users may receive a data consent dialog. \n</li><li>There is no impact to existing default browser settings.\n</li></ul><p><b>What you need to do to prepare</b>\n</p><ul><li>To avoid end users seeing a consent to data collection dialog, set the Microsoft Edge group policy, DiagnosticData, according to your organization’s preference by February 20, 2024. \n</li><li>Review the diagnostic data being collected in Microsoft Edge. Note: Enabling the DiagnosticData policy helps to improve Microsoft Edge and keep it secure, up to date, and working as expected.\n</li><li>Review the UX changes and group policies to assess any impact to your organization. \n</li></ul><p>Additional Resources\n</p><ul><li><a href=\"https://blogs.microsoft.com/eupolicy/2023/11/22/windows-updates-comply-dma-edge/\" target=\"_blank\">Microsoft testing Windows updates to comply with the DMA and beyond</a></li><li><a href=\"https://blogs.windows.com/windows-insider/2023/11/16/previewing-changes-in-windows-to-comply-with-the-digital-markets-act-in-the-european-economic-area/\" target=\"_blank\">Previewing changes in Windows to comply with the Digital Markets Act in the European Economic Area | Windows Insider Blog</a>\n</li><li><a href=\"https://learn.microsoft.com/en-us/deployedge/microsoft-edge-policies#diagnosticdata\" target=\"_blank\">Microsoft Edge Policies - DiagnosticData</a>\n</li><li><a href=\"https://support.microsoft.com/en-us/microsoft-edge/learn-more-about-diagnostic-data-collection-in-microsoft-edge-7fcee15b-39f7-ba02-bc59-9eef622c1a9f\" target=\"_blank\">Learn more about diagnostic data collection in Microsoft Edge - Microsoft Support</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-edge/privacy-whitepaper/#diagnostic-data\" target=\"_blank\">Microsoft Edge Privacy Whitepaper - Microsoft Edge Development | Microsoft Learn</a>\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Edge will introduce changes starting no earlier than February 20, 2024, to comply with the Digital Markets Act in the European Economic Area. End users in the EEA will have the option to uninstall the Microsoft Edge browser, and Microsoft Edge will no longer rely on the Windows diagnostic group policies. Organizations need to review diagnostic data being collected and set the Microsoft Edge group policy, DiagnosticData, by February 20, 2024, to avoid end users seeing a consent to data collection dialog."
    }
  ],
  "EndDateTime": "2024-04-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715685",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-14T01:04:39.297Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-14T01:04:17Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge Data and Consent Changes in European Economic Area",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
