{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"font-size: larger;\"><span style=\"font-size: 14px;\">Updated November 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</span></p><p style=\"font-size: larger;\"><span style=\"font-size: 14px;\">Can't find a workflow template that matches what you need in Microsoft Teams? You will now be able to describe in detail how you want your automation to work and receive a workflow to match your needs. All you need to do is select the <i>Workflow builder </i>button at the bottom of the create dialog in the Workflows app in Microsoft Teams chat and <a href=\"https://learn.microsoft.com/power-platform/release-plan/2023wave2/power-automate/channel-entrypoint-teams-workflows\" target=\"_blank\">channel overflow</a> menu.&nbsp;</span><br></p><p><i>Workflow builder&nbsp;</i>will come to the Workflows app in Microsoft Teams chat and channel overflow menu first. Other entry points to Workflows will get this feature later.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=382659\" target=\"_blank\">382659</a>.</p><p><b>When this will happen:</b>\n</p><p>Worldwide: We will begin rolling out late September 2024 (previously mid-September) and expect to complete by late October 2024 (previously late September).</p><p>GCC Release: We will begin rolling out early October 2024 (previously mid-August) and expect to be complete by late November 2024 (previously late October).</p><p>\n</p>\n<p><b>How this will affect your organization:</b><br></p><p>All users with the ability to create workflows with the Workflows app in Teams will be able to describe the workflow they are trying to build and then receive a suggested flow.&nbsp;</p><p><i>Prerequisites</i></p><p>A work or school Teams account with access to a Power Automate environment in Europe or the United States.\n</p><p><i>Limitations</i><br></p><p>Power Automate supports workflow descriptions written in the English language only. Descriptions written in other languages might work but are not supported.\n</p><p>Cloud flows are the only type of flow that you can create from a written description.\n</p><p>In the version rolling out, the AI might omit some parameters, even if you provide them in the description.\n</p><p><b>What you need to do to prepare:</b><br></p><p>No action is needed to prepare for this rollout. If your tenant uses the Power Automate app within Microsoft Teams, you may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>To learn more: <a href=\"https://learn.microsoft.com/power-automate/create-cloud-flow-from-description\" target=\"_blank\">Create a cloud flow from a description (preview) - Power Automate | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "382659"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a 'Workflow builder' feature, allowing users to describe desired automations and receive matching workflows. The rollout begins late September 2024, completing by late November 2024. This update is associated with Microsoft 365 Roadmap ID 382659. Users need a Teams account with Power Automate access in Europe or the US. Limitations include English-only support and possible parameter omissions. No preparation is needed for this rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-01-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC718250",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-12T18:41:47.907Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-21T23:53:01Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Describe it to design it in Teams Workflows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
