{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated March 11, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">We are excited to announce that users of Copilot in Microsoft Teams chat and channels will soon be able to ask follow-up questions to a Copilot response.  Copilot can now answer your queries in a conversational way, using the context of previous messages. Copilot will have context of the past two questions and responses over a period of 24 hours. You can access this feature on Desktop, Web, and Mobile.</p>\n<p><b>When this will happen:</b></p><p>Worldwide: We will begin rolling out early April 2024 (previously late February) and expect to complete by late April 2024 (previously early March).</p>\n\n<p><b>How this will affect your organization:</b></p><p>Prior to this feature, when you asked Copilot a follow-up question to a response, Copilot would be unable to adequately respond. As a result of the release of this feature, you can now ask Copilot a follow-up question to a response such as “please elaborate on the second point in the summary.”</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1h6mr?ver=661f\" style=\"width: 200px;\"><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1h3Ne?ver=1784\" style=\"width: 200px;\"><br></p>\n<p><b>What you need to do to prepare:</b></p>\n<p>You may want to notify your users about this new capability and update internal documentation as appropriate.&nbsp;</p>\n<p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Copilot in Microsoft Teams chat and channels will soon support multi-turn conversations, allowing users to ask follow-up questions to a Copilot response. This feature will be available on Desktop, Web, and Mobile starting from early April 2024. Users are advised to notify their teams and update internal documentation as needed."
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC711017",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-11T19:39:36.34Z",
  "Services": [
    "Microsoft Copilot for Microsoft 365"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-29T23:51:16Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Multi-Turn Conversations Supported in Copilot in Microsoft Teams chat and channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
