{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be transitioning from the M365 Chat app to the Copilot app in Teams.</p><p><b>When this will happen:</b></p><p>We will start the transition beginning early March 2024 and expect to complete by late April 2024</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because our reporting indicates one or more users in your organization are using this M365 Chat in Teams.</p><p>Copilot licensed users will no longer be able to chat or use the M365 Chat app in Teams, when this change is implemented.</p><p>We'll be rolling out notification to customers in the old M365 Chat app in Teams in early March 2024, and the use of the old app will be discontinued by April 30, 2024.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hWFh?ver=566f\" style=\"width: 400px;\"><br></p><p><b>What you need to do to prepare:</b></p><p>Instead of using M365 Chat app in Teams, we recommend using the Copilot app in Teams. The experience will also be available in the Teams chat list for Copilot licensed users. This relates to the previous MC post ID: MC696854 (December '23).</p><p>Previous chat history from M365 Chat will not be transferred to the Copilot app. Users are encouraged to copy/save any prompts or responses as needed.</p><p>Please refer to the blog for additional information:</p><ul><li><a href=\"https://techcommunity.microsoft.com/t5/copilot-for-microsoft-365/introducing-the-new-microsoft-copilot-experience-in-teams/ba-p/4055040\" target=\"_blank\">Introducing the new Microsoft Copilot experience in Teams</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Chat in Teams will be replaced by Copilot app starting early March 2024, and users are advised to use Copilot instead. Copilot licensed users won't be able to use M365 Chat app in Teams. Previous chat history won't be transferred to Copilot. Refer to the provided link for more information."
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/copilot-for-microsoft-365/introducing-the-new-microsoft-copilot-experience-in-teams/ba-p/4055040"
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC718253",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-21T23:58:20.55Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-21T23:57:59Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Transitioning from Microsoft 365 Chat to Copilot in Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
