{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated April 23, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">This new Microsoft Teams feature for Town Hall empowers organizers, presenters, and even external presenters to engage in private discussions before, during, and after their virtual events. This functionality facilitates real-time collaboration, whether prepping pre-event, coordinating seamlessly during presentations, or debriefing post-event, this feature is your ultimate tool for driving impactful and successful virtual events.<br></p><p>On the Town Hall Scheduling form, the event organizer must define their presenters and external presenters for this exclusive group chat to be created. After the event is created, the organizer can access this chat before/after&nbsp;the event from the Town Hall Scheduling form, the Teams Calendar, or the event's Details page. Presenters (and external presenters from guests and federated tenants) can access this chat before/after&nbsp;the event from the Teams Calendar or the event's Details page. This chat will appear in their chat pane.&nbsp;During&nbsp;the event, organizers, presenters, and external presenters (including anonymous presenters) can access this chat from within the in-meeting chat by selecting the tab for Organizers and Presenters.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=377303\" target=\"_blank\">377303</a></p>\n<p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early July 2024 (previously mid-June) and expect to complete by mid-July 2024 (previously late June).</p><p>Worldwide: We will begin rolling out mid-July7 2024 (previously late June) and expect to complete by late July 2024 (previously early July).</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>This feature will automatically be available in Microsoft Teams when it is released. When a Town Hall is created with presenters and external presenters defined on the Scheduling form, the chat for organizers and presenters will be created and available to use.&nbsp;</p><p><u style=\"\">Image 1</u>: Organizers can automatically send a message to their event's co-organizers and presenters from the Town Hall Scheduling form.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hqL7?ver=abe8\" style=\"width: 25%;\"><br></p><p><u style=\"\">Image 2</u>: Before the Town Hall starts, organizers, co-organizers, and presenters can view this chat on their Chat list and send messages.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hqtj?ver=80e8\" style=\"width: 400px;\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p><p><u style=\"\">Image 3</u>: During the Town Hall, organizers, co-organizers, and presenters can access the Organizers and Presenters tab and send messages.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1htkg?ver=f274\" style=\"width: 25%;\"><br></p><p><b>What you need to do to prepare:</b><br></p>\n<p>This feature will automatically be available in Microsoft Teams when it is released. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "377303"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new feature for Town Hall events that allows organizers, presenters, and external presenters to engage in private discussions before, during, and after their virtual events. This feature will be automatically available in Microsoft Teams when it is released, and the event organizer must define their presenters and external presenters for this exclusive group chat to be created. The rollout is expected to begin in early July 2024 for Targeted Release and mid-July 2024 for Worldwide. No action is required to prepare for this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-09-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715693",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-23T19:17:37.983Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-14T01:08:40Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Chat for organizers and presenters in Town Hall",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
