{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated March 15, 2024: The content below has been significantly updated to provide additional information. Please review and thank you for patience.</p><p style=\"\">Microsoft Purview Information Protection and Insider Risk Management will roll out a public preview of multicloud support.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=376698\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">376698</a>.<br></p>\n\n<p><b>When this will happen:</b><br></p>\n\n<p>Public Preview: Rollout will begin in late March 2024 and is expected to complete by late April 2024.</p>\n\n<p><b>How this will affect your organization:</b><br></p>\n\n<p>Microsoft Purview Information Protection extends its sensitivity labels and protection policies into data contained in Azure SQL, Azure Data Lake Storage, and Amazon S3. Organizations can create label-based protection policies that specify which data sources, databases, or storage buckets are in scope, and which users or groups are allowed to access data with a certain sensitivity label and Purview will automatically enforce the policy and block unauthorized access to sensitive data. \n</p><p>Insider Risk Management extends its detection into multicloud environments by offering ready-to-use risk indicators in Azure, AWS, and SaaS apps including Box, Dropbox, and Google Drive. Organizations can use these new indicators in data theft and data leaks policies.</p><p><b>What you need to do to prepare:</b><br></p>\n<p>Information Protection admins can get started by accessing the Information Protection solution in the <a href=\"https://purview.microsoft.com/informationprotection/purviewmipoverview\" target=\"_blank\">new Microsoft Purview portal</a>, to register, scan and protect sensitive information in their multicloud environments.\n</p><p>Updated string - Insider risk admins with appropriate permissions can opt into these new indicators in the <a href=\"https://purview.microsoft.com/informationprotection/purviewmipoverview\" target=\"_blank\">new Microsoft Purview portal</a> or in the <a href=\"https://compliance.microsoft.com/\" target=\"_blank\">Purview compliance portal</a> at Insider Risk Management settings.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>\n</p>\n<p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.<br></p><p>To learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "376698"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Information Protection and Insider Risk Management will roll out a public preview of multicloud support in late March 2024. This will extend sensitivity labels and protection policies into data contained in Azure SQL, Azure Data Lake Storage, and Amazon S3. Insider Risk Management will offer ready-to-use risk indicators in Azure, AWS, and SaaS apps including Box, Dropbox, and Google Drive. Information Protection admins can get started by accessing the Information Protection solution in the new Microsoft Purview portal. Insider risk admins with appropriate permissions can opt into these new indicators in the new Microsoft Purview portal or in the Purview compliance portal at Insider Risk Management settings."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Information Protection and Insider Risk Management will roll out a public preview of multicloud support in late March 2024. This will extend sensitivity labels and protection policies into data contained in Azure SQL, Azure Data Lake Storage, and Amazon S3. Insider Risk Management will offer ready-to-use risk indicators in Azure, AWS, and SaaS apps including Box, Dropbox, and Google Drive. Information Protection admins can get started by accessing the Information Protection solution in the new Microsoft Purview portal. Insider risk admins with appropriate permissions can opt into these new indicators in the new Microsoft Purview portal or in the Purview compliance portal at Insider Risk Management settings."
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC716005",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-15T21:02:28.923Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-14T23:42:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Public preview of multicloud support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
