{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Defender for Office 365 (MDO), the user submission automatic feedback response enables organizations to automatically respond to end user submissions of phish based on the verdict from the automated investigation and response (AIR) investigation. This feature is configurable and allows organizations to dictate which threat scenarios they would like end users to receive feedback emails about. Once enabled, Microsoft Defender for Office 365 will automatically respond to end user submissions based on the investigation verdict and the configured settings.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=186575\" target=\"_blank\">186575</a></p><p><b>When this will happen:</b></p><p>Worldwide, GCC:&nbsp;Rollout completed in late February 2024.</p><p><b>How this will affect your organization:</b></p><p>Customers will have the ability to automatically respond to end user reports of phish based on the verdict of the AIR investigation.</p><p>The feature may be configured in Settings &gt; Email &amp; collaboration &gt; User reported settings  within the Email notifications &gt; Results email section. On this page, the first step to enabling this feature is to check the box to <i style=\"\">Automatically email users the results of the investigation. Includes results for reported messages from all monitored platforms</i>. Upon making this selection, three additional checkboxes will appear titled <i style=\"\">Phishing or Malware</i>, <i style=\"\"></i>and <i style=\"\">No threats found</i>. These three checkboxes represent the options for the user submission automatic feedback response and allow organizations to dictate which threat scenarios they would like end users to receive feedback emails about. At least one of these options should be selected to enable this feature.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1iGRH?ver=ed15\" style=\"width: 582px;\"><i style=\"\"><br></i></p><ul><li>Phishing or Malware: Selecting this box indicates that the organization would like end users to receive an automatic response email on email submissions of phish when the associated user submission investigation identifies a threat of normal phish, high confidence phish, or malware.\n</li><li>Spam: Selecting this box indicates that the organization would like end users to receive an automatic response email on email submissions of phish when the associated user submission investigation shows the threat of spam.\n</li><li>No threats found: Selecting this box indicates that the organization would like end users to receive an automatic response email on email submissions of phish when the associated user submission investigation finds no threats.\n</li></ul><p>Responses to end users will be sent at the conclusion of the automated investigation based on the verdict, if configured.</p><p><b>What you need to do to prepare:</b>\n</p><p>Customers may further familiarize themselves with the new feature by reviewing the learn document <a href=\"https://learn.microsoft.com/microsoft-365/security/office-365-security/air-user-automatic-feedback-response?view=o365-worldwide\" target=\"_blank\">Automatic user notifications for user reported phishing results in AIR | Microsoft Learn</a> that contains additional details. To learn more about automated investigation and response (AIR) in Microsoft Defender for Office 365 visit <a href=\"https://learn.microsoft.com/microsoft-365/security/office-365-security/air-about?view=o365-worldwide\" target=\"_blank\">Automated investigation and response in Microsoft Defender for Office 365 - Office 365 | Microsoft Learn</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "186575"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 now allows organizations to automatically respond to end user submissions of phish based on the verdict from the automated investigation and response (AIR) investigation. This feature is configurable and allows organizations to dictate which threat scenarios they would like end users to receive feedback emails about. The feature may be configured in Settings > Email & collaboration > User reported settings within the Email notifications > Results email section. This will be rolled out worldwide by late February 2024. Customers may review the learn document for additional details."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 now allows organizations to automatically respond to end user submissions of phish based on the verdict from the automated investigation and response (AIR) investigation. This feature is configurable and allows organizations to dictate which threat scenarios they would like end users to receive feedback emails about. The feature may be configured in Settings > Email & collaboration > User reported settings within the Email notifications > Results email section. This will be rolled out worldwide by late February 2024. Customers may review the learn document for additional details."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoft-365/security/office-365-security/air-user-automatic-feedback-response?view=o365-worldwide"
    }
  ],
  "EndDateTime": "2024-04-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC724832",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-05T23:15:14.14Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-05T23:14:50Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Defender for Office 365: User submission automatic feedback response",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
