{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 4, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are excited to share that users will soon be able to copy an email and attach it to a new email in the new Microsoft Outlook for Windows.</p>\n<p><b>When this will happen:</b></p>\n<p>General Availability (Worldwide): We will begin rolling out mid-April 2024 (previously mid-March) and expect to complete by mid-May 2024 (previously mid-April).</p>\n<p><b>How this will affect your organization:</b></p><p>\n</p><p>With this rollout for new Outlook for Windows, it's easier for users to send longer emails as an attachment, instead of opening an existing email and using copy and paste to capture an entire thread in a new email. This feature is not yet available for emails marked \"not forwardable.\"</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>No action is needed to prepare for this rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook for Windows will soon allow users to copy an email and attach it to a new email. The rollout will begin in mid-April 2024 and is expected to complete by mid-May 2024. Users can now send longer emails as attachments instead of copying and pasting the entire thread. No action is needed to prepare for this rollout, but users should be notified of the change."
    }
  ],
  "EndDateTime": "2024-06-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC726121",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-04T23:31:45.083Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-06T23:51:58Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Copy email as attachment is coming",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
