{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 15, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Viva Connections will now respect dark mode on both Microsoft Teams Desktop and mobile devices.</p><p><b>When this will happen:</b></p><p>Worldwide, GCC, GCC High, and DoD: We will begin rolling out late March 2024 (previously early March) and expect to complete by late April 2024 (previously late March).</p><p><b>How this will affect your organization:</b><br></p><p>The Viva Connections app will support user's preferred setting for dark mode on Microsoft Teams. For now, if your organization has customized Viva Connections app with company branding, we will not surface company branding in favor of the user's preferred setting.</p><p><b>What you need to do to prepare:</b></p><p>You do not need to do anything to prepare for this feature. However, you can learn more about the <a href=\"https://learn.microsoft.com/viva/connections/edit-viva-home#customize-the-look\" target=\"_blank\">requirements and best practices</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Connections will now support dark mode on both Microsoft Teams Desktop and mobile devices. The rollout will begin late March 2024 and is expected to complete by late April 2024. The Viva Connections app will support user's preferred setting for dark mode on Microsoft Teams. No action is required to prepare for this feature."
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC726116",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-15T21:40:34.293Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-06T23:48:30Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Connections: Dark mode support on Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
