{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 5, 2024: We have updated the rollout timeline below. Thank you for patience.</p><p>With this update a tenant root site will start showing only site results when the site is configured to show results from that site only.<br></p><p><b>When this will happen:</b></p><p>We will be rolling out this change in mid-June 2024 (previously mid-May) and expect to complete by mid-July 2024 (previously late June).</p><p><b>How this will affect your organization:</b></p><p>If the tenant root site in SharePoint Online, <a href=\"https://contoso.sharepoint.com\" target=\"_blank\">https://contoso.sharepoint.com</a>,&nbsp;is configured to show results from the current site \"Search this site\", the search results shown are from all sites in that geography in your tenant. This behavior is different compared to site search on e.g. <a href=\"https://contoso.sharepoint.com/sites/project,\" target=\"_blank\">https://contoso.sharepoint.com/sites/project,</a>&nbsp;which only would show results from that one site. This is a long-standing issue due to how we construct the site scope query.</p><p>With this update, a root site configured to show site results, will start showing results from the root site only, and any sub-sites created below it.</p><p><b>What you need to do to prepare:</b><br></p><p>If the root site is set as a hub, set as a Viva Connections home site, or configured to show hub or tenant wide results by default, then this fix will not impact your current search experience.</p><p>If you want to continue to get all results when searching from the root site, you can configure the default search scope at the root site to show tenant wide results. See <a href=\"https://learn.microsoft.com/microsoftsearch/manage-spo-search-box#changing-the-scope-of-search\" target=\"_blank\">Changing the scope of search</a>&nbsp;for how to change the default scope behavior on a site.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting from mid-June 2024, SharePoint Online will only show site results from the tenant root site when in the \"site search\" scope. This update will not affect the search experience if the root site is set as a hub, set as a Viva Connections home site, or configured to show hub or tenant wide results by default. If you want to continue to get all results when searching from the root site, you can configure the default search scope at the root site to show tenant wide results."
    }
  ],
  "EndDateTime": "2024-08-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC724127",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-05T17:13:43.53Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-05T01:02:44Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Update to only show site results at a tenant root site when in the \"site search\" scope",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
