{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring the \"User consent to Apps\" toggle in the Microsoft 365 Admin Center.&nbsp;Instead, we recommend the utilization of the user consent settings in the Entra portal, which is where we will continue to invest our development resources.</p><p><b>When this will happen:</b></p><p>We will be rolling out this change in early April 2024 and expect to complete by early May 2024.</p><p><b>How this will affect your organization:</b></p><p>To control what permissions users can consent to, you can set your tenant-wide user consent policy through the Entra portal. No changes will be done to your settings as a part of this retirement, but admins will no longer be able to edit the policy using the Microsoft 365 admin center.</p><p><b>What you need to do to prepare:</b></p><p>No preparation is needed, but if you are needing to view or edit your tenant-wide consent settings, please use the experience in the Entra portal.</p><p>Please review&nbsp;<a href=\"https://learn.microsoft.com/entra/identity/enterprise-apps/configure-user-consent\" target=\"_blank\">Configure how users consent to applications</a> to learn more.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"User consent to Apps\" setting in the Microsoft 365 Admin Center will be retired in early April 2024, and users are recommended to use the user consent settings in the Entra portal instead. No changes will be made to existing settings, but admins will no longer be able to edit the policy using the Microsoft 365 admin center. Users can set their tenant-wide user consent policy through the Entra portal. No preparation is needed, but users needing to view or edit their tenant-wide consent settings should use the experience in the Entra portal."
    }
  ],
  "EndDateTime": "2024-06-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC727449",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-07T23:34:38.937Z",
  "Services": [
    "Microsoft Entra",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-07T23:33:26Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "\"User consent to apps\" setting in the Microsoft 365 portal to be retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
