{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In April, we will begin the rollout of Restricted SharePoint Search for Microsoft Copilot for Microsoft 365. This feature allows you to disable organization-wide search, and to restrict both Enterprise Search and Copilot experiences to a curated set of SharePoint sites of your choice. Additionally, whether you have Enterprise Search or Restricted SharePoint Search enabled, users in your organization will still be able to interact with their own and previously accessed files and content in Copilot for Microsoft 365.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=385352\" target=\"_blank\">385352</a>.</p>\n<p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2024 and expect to complete by late June 2024.</p>\n<p><b>How this will affect your organization:</b></p>\n<p>Restricted SharePoint Search is off by default. To turn it on, you will need Global/Tenant and SharePoint admin roles. If you decide to enable it Copilot and non-Copilot users in your organization will be able to find and use content from:</p><ul><li>An allowed list of curated SharePoint sites set up by admins (with up to 100 SharePoint sites), honoring sites’ existing permissions.</li><li>Content from their frequently visited SharePoint sites.</li><li>Users’ OneDrive files, chats, emails, calendars they have access to. </li><li>Files that were shared directly with the users. </li><li>Files that the users viewed, edited, or created.</li></ul><p>Additionally, Copilot users in your organization will see this message in their Copilot experiences: \"Your organization's admin has restricted Copilot from accessing certain SharePoint sites. This limits the content Copilot can search and reference when responding to your prompts. <a href=\"https://go.microsoft.com/fwlink/p/?linkid=2260808\" target=\"_blank\">Learn more</a>.”</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>No action is needed from you to prepare for this rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Learn more:</p><p><a href=\"https://aka.ms/RSS/Blog\" target=\"_blank\">Blog: Introducing Restricted SharePoint Search to help you get started with Copilot for Microsoft 365 - Microsoft Community Hub</a></p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "385352"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot for Microsoft 365 is introducing Restricted SharePoint Search, allowing organizations to disable organization-wide search and restrict both Enterprise Search and Copilot experiences to a curated set of SharePoint sites. This feature will be rolled out from early April 2024 to late June 2024. Restricted SharePoint Search is off by default, and admins will need Global/Tenant and SharePoint admin roles to enable it. No action is needed to prepare for this rollout. Users will still be able to interact with their own and previously accessed files and content in Copilot for Microsoft 365."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot for Microsoft 365 is introducing Restricted SharePoint Search, allowing organizations to disable organization-wide search and restrict both Enterprise Search and Copilot experiences to a curated set of SharePoint sites. This feature will be rolled out from early April 2024 to late June 2024. Restricted SharePoint Search is off by default, and admins will need Global/Tenant and SharePoint admin roles to enable it. No action is needed to prepare for this rollout. Users will still be able to interact with their own and previously accessed files and content in Copilot for Microsoft 365."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-09-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC726119",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-06T23:50:39.73Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-06T23:50:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot for Microsoft 365: Announcing Restricted SharePoint Search",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
