{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 1, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Starting late March 2024, admins can customize their organization's branding assets onto Edge for Business through the Microsoft Edge management service. This branding can help users signed in with an Entra ID (formerly known as Azure Active Directory) more easily differentiate between multiple profiles and browser windows through visual cues on the profile pill, profile flyout, and Edge for Business taskbar icon. Only admins can control, preview, and customize how Edge for Business shows the following organization brand assets:</p><p></p><ul><li>Organization name\n</li><li>Accent color\n</li><li>Organization logo\n</li><li>Edge for Business taskbar icon overlay</li></ul><p>Default branding can be enabled by admins through the following policies:<br></p><ul><li>OrganizationalBrandingOnWorkProfileUIEnabled\n</li><li>OrganizationLogoOverlayOnAppIconEnabled</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=383013\" target=\"_blank\">383013</a>&nbsp;</p><p><b>When this will happen:</b>\n</p><p>Preview for this new feature began on March 21, 2024, and is expected to complete within a week.</p><p>Worldwide: We will begin rolling out late April 2024 and expect to complete by late May 2024 (previously early May).</p><p><b>How this will affect your organization:</b>\n</p><p>If enabled, users will see selected organization branding on profiles signed in with an Entra ID. The organization’s details such as name, logo, and brand color can be seen on individual browser components including the profile pill, profile flyout, and Edge for Business taskbar icon.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins will need to navigate to Microsoft Edge management service to customize and configure organization assets.</p><p>Admins can also choose to use and check default organization branding assets already configured in the Microsoft Entra admin center. </p><p>Resources:</p><ul><li><a href=\"https://learn.microsoft.com/entra/fundamentals/how-to-customize-branding\" target=\"_blank\">Configure your company branding</a></li><li><a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-for-business#organization-branding\" target=\"_blank\">Organization branding</a>&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "383013"
    },
    {
      "Name": "Summary",
      "Value": "Late March 2024, admins can customize organizational branding assets onto Edge for Business through the Microsoft Edge management service. This branding can help users differentiate between multiple profiles and browser windows. Admins can control, preview, and customize the organization name, accent color, logo, and Edge for Business taskbar icon overlay. Default branding can be enabled through policies. Preview for this new feature began on March 21, 2024, and is expected to complete within a week. Rolling out worldwide late April 2024 to late May 2024. Admins will need to navigate to Microsoft Edge management service to customize and configure organization assets."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC720776",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-01T18:38:23.407Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-28T23:43:14Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Edge for Business: Customize organizational branding using the Microsoft Edge management service",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
