{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 22, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are beginning the process to standardize all transcript storage to OneDrive, starting with the storage of transcripts for meetings that only have transcription enabled. Previously, meetings with only transcription enabled saved the transcript file to the meeting organizer’s Exchange Online, while meetings with both recording and transcription enabled saved two transcript copies—one that is coupled with the recording saved to OneDrive and another transcript copy saved to the meeting organizer’s Exchange Online.&nbsp;</p><p>Now with this feature, meetings that have only transcription enabled will also save two copies (one in OneDrive and one in Exchange Online), but all meeting transcript entry points in Teams app will point to the OneDrive copy only, no entry points for meeting transcripts will source from the Exchange Online copy. <i>At the same time</i>, meeting transcripts will stop saving in Exchange Online altogether and all transcript storage will be standardized on OneDrive only.&nbsp;</p><p>The rollout of this feature also improves both the experience of meeting organizers to manually delete the transcript, as well as the ability for IT administrators to apply retention policies to the transcripts from meetings that only had transcription enabled.&nbsp;</p><p>A summary of the deletion experience for meeting transcripts is captured in the following table:&nbsp;</p><p>\n</p><table>\n  <tbody><tr>\n    <th>User</th>\n    <th>Type of transcript deletion</th>\n    <th>Previous experience</th>\n<th>New Experience with this feature rollout</th>\n  </tr>\n  <tr>\n    <th>Meeting organizer/co-organizer </th>\n    <td>Manually from Teams app</td>\n    <td>Only deleted Exchange Online transcript file</td>\n<td>Deletes both copies of the transcript file from OneDrive and Exchange Online</td>\n  </tr>\n  <tr>\n    <th>Meeting organizer/co-organizer</th>\n    <td>Manually from Stream</td>\n    <td>Only deletes the transcript file stored in OneDrive</td>\n<td>Only deletes the transcript file stored in OneDrive</td>\n  </tr>\n<tr>\n    <th>IT Administrator</th>\n    <td>Retention policies in Teams Admin Center</td>\n    <td>Only available for copies saved in OneDrive, so only applicable to meetings with recording turned on.</td>\n<td><p>Now the retention policy is also applicable to meetings with only transcription enabled and to the transcript file saved in OneDrive.</p><p> \n \nTo bulk delete transcript files saved in Exchange Online—please refer to <a href=\"https://learn.microsoft.com/microsoftteams/delete-exchange-online-transcripts\" target=\"_blank\">this documentation</a> \n\n</p></td>\n  </tr>\n\n</tbody></table>\n\n<p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=365720\" target=\"_blank\">365720</a></p>\n<p><b>When this will happen:</b> \n</p><p>Targeted release: We will begin rolling out early June 2024 (previously mid-May) and expect to complete by mid-June 2024 (previously late May). \n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-June 2024 (previously late May) and expect to complete by late August 2024 (previously mid-August).\n</p><p>GCC High: We will begin rolling out late August 2024 and expect to complete by mid-September 2024.\n</p><p>DoD: We will begin rolling out late September 2024 and expect to complete by late November 2024 (previously mid-October).</p><p><b>How this will affect your organization:</b> \n</p><p>There is no change to the end user experience for viewing and downloading Teams meeting transcripts. The only change for meeting organizers and co-organizers is for any meetings that are held after this feature rolls out, they can delete all copies of the meeting transcript directly from the Teams app, instead of having to manually delete all copies of the transcript from two places (Teams app and Stream). For IT administrators, they can start applying retention policies for the copy of the transcript saved in OneDrive, including scenarios where a meeting only had transcription enabled. This retention policy won’t affect the copies saved in Exchange Online, to bulk delete transcript files saved in Exchange Online—please refer to this <a href=\"https://learn.microsoft.com/microsoftteams/delete-exchange-online-transcripts\" target=\"_blank\">documentation</a>.</p><p>We will also update the default transcript permissions. After the rollout, when the new policy is not applied, only meeting organizers and co-organizers will have permission to download or delete the transcript file, and meeting participants can only view the transcript in Teams or Microsoft Stream. Regardless of whether the new policy is applied, the meeting organizer will be able to select in Stream the participants who are restricted from downloading, viewing, and editing the transcript in Stream.</p><p> \n</p><p><b>What you need to do to prepare:</b>  \n</p><p>There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p> \n</p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "365720"
    },
    {
      "Name": "Summary",
      "Value": "The message details an update for Microsoft Teams regarding the storage and management of OneDrive transcript files. It outlines the new process for saving transcripts, improved deletion experiences for meeting organizers and IT administrators, and changes to default transcript permissions post-rollout. Rollout timelines and instructions for preparation are also provided."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoftteams/settings-policies-reference"
    }
  ],
  "EndDateTime": "2025-01-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC726122",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-23T23:19:00.79Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-06T23:52:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: View, download, and delete Microsoft OneDrive transcript files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
