{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 6, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Meeting Options are a group of settings that organizers and co-organizers set on a per-meeting basis. We are introducing categories within Meeting Options to provide increased clarity within the information architecture of available options and help organizers and co-organizers configure their meetings according to their needs. The categories are available throughout the meeting lifecycle in Microsoft Teams.</p><p>This message is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=168523\" target=\"_blank\">168523</a></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early April 2024 and expect to complete by late-April 2024.</p><p>Standard Release (Worldwide, GCC, GCC High, and DoD): We will begin rolling out late April 2024 and expect to complete by early July 2024 (previously late-May).</p><p><b>How this will affect your organization:</b></p><p>Default meeting options are still determined by an org's IT admin, but organizers and co-organizers can override them for a specific meeting.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1iQi4?ver=af54\" style=\"width: 400px;\"></p><p><br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1iLjN?ver=1bcb\" style=\"width: 400px;\"><br></p><p>Known limitations:</p><ul><li>The categories are only available in the new Teams client during scheduling and web (excluding Safari).</li><li>The categories are coming to in-meeting Meeting Options later.</li></ul><p><b>What you need to do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "168523"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing categories within Meeting Options to provide increased clarity and help organizers configure their meetings according to their needs. The categories will be available throughout the meeting lifecycle in Microsoft Teams. The rollout will begin in April 2024 and complete by early July 2024. Default meeting options are still determined by an org's IT admin, but organizers and co-organizers can override them for a specific meeting. The categories are only available in the new Teams client during scheduling and web (excluding Safari). The categories are coming to in-meeting Meeting Options later."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC726124",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-06T22:05:35.647Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-06T23:56:44Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Meeting Options categorization",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
