{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Microsoft Teams admin center will support multi-instance app customization and management. This feature update allows IT admins to create multiple customized versions of the same customizable Teams app, catering to the diverse needs of different groups or departments within an organization. Admins can customize app icons, names, descriptions, and so on to meet specific requirements. This enhancement makes it easier to tailor Teams to the unique identities and needs of various organizational segments.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=178355\" target=\"_blank\">178355</a></p><p><b>When this will happen:</b></p><p>Worldwide: We will begin rolling out early April 2024 and expect to complete by early May 2024.</p><p><b>How this will affect your organization:</b></p><p>Admins can set a default customization for organization-wide use while also creating specific customizations for distinct user groups. This flexibility improves the Teams experience for users across different roles, enhancing both utility and user satisfaction.</p><p><b>What you need to do to prepare:</b></p><p>There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "178355"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams admin center will support multi-instance app customization and management, allowing IT admins to create multiple customized versions of the same Teams app for different groups or departments. This feature will roll out from early April 2024 to early May 2024, improving user satisfaction and utility. No action is needed to prepare for this change."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams admin center will support multi-instance app customization and management, allowing IT admins to create multiple customized versions of the same Teams app for different groups or departments. This feature will roll out from early April 2024 to early May 2024, improving user satisfaction and utility. No action is needed to prepare for this change."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC726120",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-06T23:51:39.69Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-06T23:51:27Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Multi-instance app customization support for Teams apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
