{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>At Microsoft, we are dedicated to protecting your data. As part of this commitment, we are migrating recorded custom greetings for Microsoft Teams voicemail to a new storage location. We are pleased to report that we have migrated 99.94% of our customers' custom greetings.</p><p>For the remaining 0.06% of users who have not received any voicemail in over six months, their custom recorded greetings are still stored in the old location. Starting from May 2024, default greetings will be played instead of any custom recorded greetings for these users. Please note that this message only pertains to recorded custom greetings. Custom greetings entered by text are not affected by this migration.\n</p><p>\n</p><p><b>When this will happen:</b><br></p><p>We will begin rolling out default greetings in early May 2024 and expect to complete by early June 2024.</p><p><b>What you need to do to prepare:</b><br></p><p>No action is required on your part. You may want to let your users know that if they are among the 0.06% of users who haven't received any voicemail in over six months and want to make sure that their custom recorded greeting is migrated, they can still do so in March 2024 and April 2024 with these steps:</p><ol><li>Go to Microsoft Teams<br></li><li>Select Settings from the three dots menu in the upper right corner</li><li>Select <i>Calls</i></li><li>Choose <i>Configure Voicemail</i>. </li><li>Select the <i>Record a Greeting </i>button and listen to the available options. Recording a greeting will automatically trigger the migration process.</li></ol><p><i>Learn more</i></p><p><a href=\"https://learn.microsoft.com/microsoftteams/manage-voicemail-settings\" target=\"_blank\">Manage Cloud Voicemail settings - Microsoft Teams | Microsoft Learn</a>\n</p><p>\n</p><p><a href=\"https://learn.microsoft.com/microsoftteams/change-the-default-language-for-greetings-and-emails\" target=\"_blank\">Change the default language for greetings and emails - Microsoft Teams | Microsoft Learn</a><br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1iGPK?ver=ef43\" style=\"width: 400px;\" alt=\"user controls\"></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1iJtg?ver=c90e\" style=\"width: 400px;\" alt=\"user controls\"></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is migrating recorded custom greetings for voicemail to a new storage location. 99.94% of customers' custom greetings have been migrated, but for the remaining 0.06% of users who have not received any voicemail in over six months, default greetings will be played instead of any custom recorded greetings starting from May 2024. No action is required, but users who want to ensure their custom recorded greeting is migrated can do so in March and April 2024. Custom greetings entered by text are not affected by this migration."
    }
  ],
  "EndDateTime": "2024-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC722588",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-02T00:48:47.563Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-02T00:48:35Z",
  "Tags": [
    "New feature",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Voicemail recorded custom greetings | migration update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
