{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Originally announced in MC687573 (November '23) controls to manage Copilot leveraging 'Web content' were implemented at the tenant and user level. Initially, the tenant level control was defaulted \"On\" and the user control was defaulted \"Off\". Moving forward the default will be \"On\" for both settings unless an admin has taken action at the tenant level control.&nbsp;&nbsp;</p><p><b>When will this happen:</b></p><p>Beginning late March, we're changing the default state of the Web Content toggle for users to be \"On\" (enabled), where it was previously \"Off\" (disabled), for Copilot for Microsoft 365 with Graph-grounded chat experience. Users will see a one-time in-app banner notifying them of this change, with a link to where they can change this if they would prefer this to be off.  Users can check the status of the Web Content toggle by opening the plugin menu in the chat box when they use M365 Copilot’s chat feature. The user toggle can be used dynamically per-prompt, turning it on and off based on how they want to scope Copilot’s response to that prompt.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>Enabling web content allows Copilot to enhance responses with information from the internet if web data can improve the quality of the response. Read this <a href=\"https://learn.microsoft.com/microsoft-365-copilot/microsoft-365-copilot-privacy#microsoft-copilot-for-microsoft-365-and-web-content\" target=\"_blank\">article </a>for more details on how web grounding works, and this <a href=\"https://learn.microsoft.com/microsoft-365-copilot/manage-public-web-access\" target=\"_blank\">article </a>on how you can manage web content access.</p><p>If you have already disabled the tenant-level toggle in the Microsoft 365 admin center, this will be respected and thus, there will be no change for end users. However, if the tenant-level toggle is on, this will impact both existing users and new users as they are added.</p><p><b>What you need to do to prepare:</b><br></p><p>When this change takes effect, verify tenant level settings and educate users as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting late March, the default state of the Web Content toggle for users will be \"On\" for Copilot in Microsoft 365 with Graph-grounded chat experience, allowing Copilot to enhance responses with information from the internet. Admins should verify tenant level settings and educate users accordingly."
    }
  ],
  "EndDateTime": "2024-06-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC721846",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-01T03:04:31.26Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-01T03:03:26Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Copilot responses improved with web content",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
