{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"font-size: larger;\"><span style=\"font-size: 14px;\">Updated April 25, 2024: We have updated the rollout timeline below. Thank you for your patience.</span></p><p style=\"font-size: larger;\"><span style=\"font-size: 14px;\">Conditional formatting is a feature in Microsoft Outlook for Windows and Web to make messages that meet defined conditions stand out in the message list by using different font colors. The users can specify conditions that an incoming message should meet, such as a sender’s name or email address.</span></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=167976\" target=\"_blank\">167976</a></p>\n<p><b>When this will happen:</b></p><p>Standard Release: We will begin rolling out mid-March 2024 and expect to complete by early May 2024.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Users have the ability to highlight messages meeting specific conditions in the message list using various font colors. They can define conditions for incoming messages, such as sender's name or email address, similar to rules.</p><p>To create conditional formatting rules, go to Settings &gt; Mail &gt; Conditional Formatting. These settings are configured per account, and they will apply across all folders.</p><p>Conditions supported:</p><ul><li>From</li><li>I'm on the To line</li><li>I'm not on the To line</li><li>I'm on the Cc line</li><li>I'm on the Cc line or To line</li><li>Subject includes</li></ul>\n<p>Users can select from a list of 25 different colors. These colors are all accessible and available for Light and Dark modes.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p>Conditional Formatting will appear in your Settings. There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "167976"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook for Windows and Web will introduce Conditional Formatting, allowing users to highlight messages meeting specific conditions in the message list using various font colors. The feature will roll out worldwide, GCC, GCC High, and DoD from mid-March to early May 2024. Users can create conditional formatting rules in Settings > Mail > Conditional Formatting, with conditions supported including From, To, Cc, and Subject. There are 25 different colors available for Light and Dark modes, and no action is needed to prepare for this change."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-06-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC720021",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-25T22:58:01.087Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-27T19:58:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows and Web: Conditional Formatting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
