{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Copilot in Forms is a new feature that enables users to create forms and customize themes with ease and speed. With this feature, users with licenses for Microsoft Copilot for Microsoft 365 can describe the form they need in natural language, and Copilot will generate a form based on their description. They can then preview the form and refine it as needed. After that, they can get suggested themes to uplift the form to encourage more engagement from the audience<span style=\"font-size: 14px;\">.</span><br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1&amp;searchterms=Copilot%2cin%2cForms&amp;filters=&amp;searchterms=375324\" target=\"_blank\">375324</a></p>\n\n<p><b>When this will happen:</b><br></p>\n\n<p>Worldwide: We will begin rolling this out late February 2024 and expect to complete by early March 2024.<br></p><p><b>How this will affect your organization:</b><br></p>\n\n<p>You can use Copilot in Forms to:<br></p><ul><li>Save time and effort.\n</li><li>Copilot in Forms can reduce the time and effort you spend on creating surveys by generating draft content and suggestions for you. You can focus on refining and customizing your survey according to your needs and preferences.\n</li><li>Improve quality and accuracy.\n</li><li>Copilot in Forms can help you improve the quality and accuracy of your survey by providing objective and transparent feedback. You can avoid common pitfalls and biases in survey design, such as leading questions, double-barreled questions, or ambiguous wording.\n</li><li>Enhance engagement and insights.\n</li><li>Copilot in Forms can help you enhance the engagement and insights of your survey by providing relevant and diverse questions and options. You can capture the attention and interest of your respondents and collect valuable data and feedback.\n</li></ul><p><b>What you need to do to prepare:</b><br></p>\n<p>To use Copilot in Forms, you need to have a Microsoft 365 account and access to Microsoft Forms.&nbsp;<br></p><ol><li>In Forms, select to create a new form from scratch or use an existing template. \n</li><li>Copilot will prompt you to describe what you want to create. You can provide a description in your own words or view prompts to help you get started. \n</li><li>Click Generate to submit your request and Copilot will start analyzing&nbsp;your prompt and suggest draft with title, questions and answers relating to your intent.\n</li><li>You can refine or add more details for Copilot to fine tune the draft. \n</li><li>Once you’ve finished creating the survey content, Copilot will also recommend related themes to polish visual of your survey, then you can easily distribute it using various options, such as a short URL, QR code, Outlook, Teams or embedded link, to collect responses from your audience. \n</li><li>You can then automatically sync your live results with Excel for the web to analyze your latest data with more detail and flexibility.</li></ol>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "375324"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Forms has a new feature called Copilot that allows users to create forms and customize themes quickly and easily. Copilot generates a form based on the user's natural language description, and users can refine it as needed. It can save time and effort, improve quality and accuracy, and enhance engagement and insights. To use Copilot in Forms, users need a Microsoft 365 account and access to Microsoft Forms. The feature will be rolled out from late February 2024 to early March 2024."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Forms has a new feature called Copilot that allows users to create forms and customize themes quickly and easily. Copilot generates a form based on the user's natural language description, and users can refine it as needed. It can save time and effort, improve quality and accuracy, and enhance engagement and insights. To use Copilot in Forms, users need a Microsoft 365 account and access to Microsoft Forms. The feature will be rolled out from late February 2024 to early March 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-04-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC721845",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-01T03:03:08.89Z",
  "Services": [
    "Microsoft Copilot for Microsoft 365"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-01T03:02:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Copilot in Forms",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
