{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 9, 2024: We have updated the rollout timeline for Search in Bing, below. Thank you for your patience.</p><p>If you have multiple content sources set up in Microsoft Search, such as Microsoft Power BI, Microsoft Viva Learning, or third-party sources indexed using Microsoft Graph Connectors, users will soon see content source filters in the All vertical.<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=383953\" target=\"_blank\">383953</a>.</p>\n<p><b>When this will happen:</b></p>\n<p>For Microsoft SharePoint Online (organization level) and Microsoft365.com (Office.com):</p>\n<p>Worldwide: We will begin rolling out early April 2024 (previously mid-March) and expect to complete by mid-May 2024.</p>\n<p>For Microsoft Search in Bing:</p>\n<p> Worldwide: We will begin rolling out by mid-May 2024 and expect to complete by early September (previously late July) 2024.</p>\n<p><b>How this will affect your organization:</b></p>\n<p>If you have multiple content sources set up in Microsoft Search, users will see these content source filter options in the All vertical (based on availability):\n</p>\n<ul><li>SharePoint - OneDrive\n</li><li>Power BI\n</li><li>Viva Learning\n</li><li>Graph Connector content sources</li></ul>\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1iOGO?ver=b068\" style=\"width: 400px;\" alt=\"user controls\"><br></p>\n<p><b>What you need to do to prepare:</b></p>\n<p>No action is needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>\n<p>You can customize how Graph Connector content sources are shown in the filter experience. To customize the name and icon shown to users for a connection in content source filters:</p>\n<ol><li>In Microsoft 365 admin center, go to Search and Intelligence &gt; Data sources &gt; select the connection you want to customize and then select Edit in the side panel.\n</li><li>Set your Connection Display name and icon. Note that certain keywords are reserved and cannot be used in the Display name (such as Microsoft brands and default search vertical names).\n</li></ol>\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1iJtL?ver=e03b\" style=\"width: 400px;\" alt=\"admin controls\"><br></p>\n<p>To group together multiple connections into a single value in the filter, set the same Display name for them.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "383953"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Search will soon have content source filters in the All vertical for users with multiple content sources set up, including Microsoft Power BI, Microsoft Viva Learning, and third-party sources indexed using Microsoft Graph Connectors. The rollout will begin in early April 2024 and is expected to be completed by early September 2024. No action is needed to prepare for this change, but users may want to notify their users and update relevant documentation. Customization of Graph Connector content sources is possible in the Microsoft 365 admin center."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC722584",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-09T18:37:35.833Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-02T00:46:30Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Search: New Content source filters in All vertical",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
