{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new View Another Mailbox feature for the new Exchange admin center (EAC)&nbsp;lets you see and manage all mailboxes that you have permissions for from the new EAC.</p><p><b>When this will happen:</b></p><p>Worldwide and GCC: We began rolling out in late February 2024 expect to complete in late March 2024.</p><p><b>How this will affect your organization:</b></p><p>The new experience is more modern and easier&nbsp;to use, with a new&nbsp;design and faster performance.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hVio?ver=a78a\" style=\"width: 450px;\"></p><p>We urge you to switch to this new EAC experience as soon as you can, as the old EAC experience will be retired mid-2024.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>Admins can access this new experience by clicking the 'View another mailbox' link.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hVic?ver=4932\" style=\"width: 450px;\"></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange Online will release the View Another Mailbox feature in the new Exchange admin center (EAC) in late February 2024, with worldwide rollout expected to complete in late March 2024. The new feature allows users to manage all mailboxes they have permissions for and offers a modern, faster, and easier-to-use experience. Admins can access the new experience by clicking the 'View another mailbox' link, and the old EAC experience will be retired mid-2024."
    }
  ],
  "EndDateTime": "2024-04-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC720777",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-29T20:43:09.603Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-28T23:44:43Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online: Release of View Another Mailbox feature in the new Exchange admin center (EAC)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
