{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview users will soon be able to see the AccessedResources field populated in Purview for Meeting Copilot Interactions. The AccessedResources field references files Copilot used in Microsoft 365 services like OneDrive and SharePoint Online to respond to a user’s request.</p><p>Meeting Copilot uses the meeting transcript to respond to questions about the meeting. Meeting transcripts are created from the meeting recording, which is stored as an MP4 file in One Drive Share Point. The AccessedResources field contains a link to the meeting recording MP4 file.&nbsp;&nbsp;</p>\n<p><b>When this will happen:</b></p>\n\n<p>Standard Release: We will begin rolling out mid-March 2024 and expect to complete by late March 2024.<br></p><p><b>How this will affect your organization:</b><br></p>\n\n<p>Prior to this update, when audit records were generated for Meeting Copilot interactions, the AccessedResources field was empty. As a result of this update, the AccessedResources field will contain a link to the meeting recording MP4 file. To access the transcript through Stream, simply add “?web=1” to the end of the MP4 file link.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hDu9?ver=b3a7\" style=\"width: 400px;\"><br></p><p> \n</p><p>\n</p>\n\n<p>This functionality will be supported when the Recording + Transcript option is selected. Transcript-only scenarios will be supported in the future.&nbsp;&nbsp;<br></p>\n<p><b>What you need to do to prepare:</b><br></p>\n<p>Admins may want to update internal documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview users will soon see the AccessedResources field populated in Purview for Meeting Copilot Interactions, containing a link to the meeting recording MP4 file. This update will be rolled out from mid-March 2024 to late March 2024. Admins may want to update internal documentation as appropriate."
    }
  ],
  "EndDateTime": "2024-04-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC720180",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-28T00:11:10.92Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-28T00:10:48Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "AccessedResources field populated in Purview for Meeting Copilot Interactions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
