{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Today, end users have three options for voicemail OOF greetings activation:</p><ul><li>All the time\n</li><li>When I have an Outlook auto reply\n</li><li>When I have an Out of Office calendar event (to be retired)</li></ul><p style=\"\">The voicemail feature that automatically activates an out-of-office greeting based on an out-of-office event in Outlook calendar will be retired. </p><p style=\"\">This decision is driven by Microsoft commitment to strengthen customer data protection. In addition, retiring this feature will help reduce costs, as it has a significant environmental footprint and relatively low usage.</p><p><b>When will this happen:</b></p><p>We will be rolling out this change beginning in early June 2024 and expect to complete by early August 2024.</p><p>\n</p><p><b>How this will affect your organization:</b></p><p>Going forward, end users can continue to manage their OOF greetings with two available options by navigating to Settings -&gt; Calls -&gt; Configure Voicemail in the Teams client:</p><ul><li>All the time</li><li>When I have an Outlook auto reply</li></ul><p>\n</p><p><b>What you need to do to prepare:</b></p><p>Although only a small number of users have set custom out-of-office greetings in Voicemail, we recommend notifying all users that the automatic activation of OOF greetings based on Outlook calendar events will be retired.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The voicemail feature that automatically activates an out-of-office greeting based on an out-of-office event in Outlook calendar will be retired in early June 2024 to reduce costs and strengthen customer data protection. Going forward, end users can manage their OOF greetings with two available options in the Teams client. It is recommended to notify all users of this change."
    }
  ],
  "EndDateTime": "2024-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC727450",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-07T23:34:47.36Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-07T23:34:28Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Voicemail: Automatic activation of out of office (OOF) greetings based on OOF Calendar events to be retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
