{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of our joint efforts to comply with the Digital Markets Act, we are working with our LinkedIn partners to provide additional controls for LinkedIn profile data appearing in Microsoft 365 profile card experiences.<br></p><p>Beginning in March 2024, LinkedIn members based in the European Economic Area (EEA) or Switzerland will have the ability to choose whether to allow their LinkedIn profile to appear in Microsoft 365 profile card experiences.\n</p><p>Access to LinkedIn member profiles based outside this area is unchanged, even if you, as the viewer, are based in one of the included countries. For example, you will still be able to access a profile based in USA even if your profile is based in Switzerland.\n</p><p><b>When this will happen:</b><br></p><p>The DMA changes will be applied by LinkedIn.com from the beginning of March 2024, and the new visibility setting will be off by default for members in the affected countries.</p><p><b>How this will affect your organization:</b><br></p><p>The ability to view LinkedIn information within the Microsoft profile card in Microsoft 365 experiences will be limited if the LinkedIn member is based in the EEA or Switzerland, until they take the action to change the new privacy setting on LinkedIn.com to allow this access.</p><p><b>What you need to do to prepare:</b><br></p><p>If you or your business relies on sharing or viewing this information, then we recommend that you let your teams know about the LinkedIn visibility setting here:\n</p><p>\n</p><p><a href=\"https://aka.ms/LinkedInDMAVisibility\" target=\"_blank\">https://aka.ms/LinkedInDMAVisibility</a>&nbsp;<br></p><p>\n</p><p>Note: The setting will also not be available until the day the filter is applied in March 2024 and will only be available to LinkedIn members based in the EEU or Switzerland.<br></p><p>For further details, please see:</p><ul><li>LinkedIn help article: <a href=\"https://www.linkedin.com/help/linkedin/answer/a6233054\" target=\"_blank\">LinkedIn profile data in Microsoft profile card services</a>&nbsp;</li><li>Admin consent for LinkedIn account connections: <a href=\"https://learn.microsoft.com/entra/identity/users/linkedin-integration\" target=\"_blank\">Integrate LinkedIn account connections in Microsoft Entra ID</a>&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting from March 2024, LinkedIn members in the European Economic Area (EEA) or Switzerland will have the option to choose whether their LinkedIn profile data appears in Microsoft 365 profile card experiences due to the Digital Markets Act (DMA). The new visibility setting will be off by default, and if the LinkedIn member is based in the EEA or Switzerland, the ability to view their information within the Microsoft profile card in Microsoft 365 experiences will be limited until they take the action to change the new privacy setting on LinkedIn.com to allow this access. For more information, visit the LinkedIn help article and Admin consent for LinkedIn account connections."
    }
  ],
  "EndDateTime": "2024-05-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC720763",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-28T23:39:43.68Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-28T23:39:26Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "European Digital Markets Act (DMA) Impact on LinkedIn in Microsoft 365 profile card experiences",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
