{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 21, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Graph offers a unified API endpoint for accessing data from multiple Microsoft cloud services in a single response. This feature provides a new Audit Log Query API for Microsoft Purview that enables you to create applications that programmatically query and retrieve your organization’s audit activity logs.<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=117587\" target=\"_blank\">117587</a>.<br></p>\n<p><b>When this will happen:</b></p>\n<p>Worldwide: Rollout will begin in late June 2024 (previously late May) and is expected to complete by mid-July 2024 (previously early July).<br></p>\n<p><b>How this will affect your organization:</b><br></p>\n<p>Admins in your organization with access to search the audit log will be able to programmatically access the audit logs through the new Audit Log Query Graph API.</p>\n<p><b>What you need to do to prepare:</b><br></p>\n<p>To access the new Audit Log Query Graph API, register your application with Microsoft Graph and add the relevant Graph permissions.</p><p>\n</p><p>You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Microsoft Purview Audit enables customers to centrally visualize cloud log data generated across their enterprise, thus helping them effectively respond to security events, forensic investigations, internal investigations and compliance obligations. Thousands of user and admin operations performed in dozens of Microsoft 365 services and solutions are captured, recorded, and retained in customers' unified Microsoft Purview audit logs.</p><p><i>Resources</i></p><ul><li>Learn about <a href=\"https://learn.microsoft.com/purview/audit-solutions-overview\" target=\"_blank\">Microsoft Purview Audit</a></li><li><a href=\"https://learn.microsoft.com/purview/audit-standard-setup#step-2-assign-permissions-to-search-the-audit-log\" target=\"_blank\">Access to search the Audit log</a>&nbsp;in <a href=\"https://learn.microsoft.com/purview/audit-get-started\" target=\"_blank\">Get started with auditing solutions | Microsoft Learn</a></li><li>Register your application with Microsoft Graph in <a href=\"https://learn.microsoft.com/graph/use-the-api\" target=\"_blank\">Use the Microsoft Graph API - Microsoft Graph | Microsoft Learn</a></li><li>Learn more about <a href=\"https://learn.microsoft.com/graph/use-the-api\" target=\"_blank\">Use the Microsoft Graph API - Microsoft Graph | Microsoft Learn</a></li></ul><p><br></p>\n<p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "117587"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview will have a new Audit Log Query API available through Microsoft Graph API, allowing admins to programmatically access audit logs. Rollout will begin in late June 2024 and is expected to complete by mid-July 2024. To access the new API, register your application with Microsoft Graph and add relevant permissions. Notify users and update documentation as necessary. Microsoft Purview Audit enables centralized visualization of cloud log data for security events, forensic investigations, internal investigations, and compliance obligations."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-09-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC720778",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-21T20:41:47.333Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-28T23:48:18Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Audit Search with Microsoft Graph API",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
