{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to public preview, Microsoft Purview Communication Compliance will release a feature that will reduce detection-to-investigation time from 24 hours to 1 hour for Microsoft Viva Engage.<br></p><p>\n</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=181828\" target=\"_blank\">181828</a>.<br></p><p>\n</p>\n<p><b>When this will happen:</b><br></p><p>Public Preview: We will begin rolling out mid-March 2024 and expect to complete by early April 2024.<br></p><p><b>How this will affect your organization:</b><br></p><p>This feature will reduce the detection to investigation time to an hour for Viva Engage private messages and community conversations, allowing your organization to respond promptly to policy violations.<br></p><p>Microsoft Purview Communication Compliance provides the tools to help organizations detect business conduct and regulatory compliance violations (e.g. SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to help ensure user-level privacy.&nbsp;<br></p><p><b>What you need to do to prepare:</b><br></p><p>No action is needed from you to prepare for this rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.</p><p>You can access the Communication Compliance solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.<br></p><p>Learn more:<br></p><p><a href=\"https://docs.microsoft.com/microsoft-365/compliance/communication-compliance?view=o365-worldwide\" target=\"_blank\">Learn about Communication Compliance</a></p><p><a href=\"https://learn.microsoft.com/purview/communication-compliance-channels?view=o365-worldwide\" target=\"_blank\">Detect channel signals with communication compliance | Microsoft Learn</a><br><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "181828"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance will release a feature that will reduce detection-to-investigation time from 24 hours to 1 hour for Microsoft Viva Engage private messages and community conversations. The feature will be available in public preview from mid-March 2024 to early April 2024. No action is needed to prepare for this rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC722586",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-02T00:47:51.823Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-02T00:47:34Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview Communication Compliance: Reduce detect-to-investigation time from 24 hours to 1 hour for Viva Engage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
