{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 8, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>With this rollout, Microsoft Viva Connections analytics will be available at a Connections experience level rather than at a tenant level.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=187086\" target=\"_blank\">187086</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General\nAvailability (Worldwide): We will begin rolling out mid-May 2024 (previously early April) and expect to complete by mid-June 2024 (previously mid-April).\n</p><p></p><p><b>How this will affect your organization:</b>\n</p><p>If an organization has two Connections experiences, Contoso and Relecloud, the analytics data for Contoso (through existing entry points) will be calculated and displayed for only the Contoso experience on Viva Connections desktop, Viva Connections Mobile, and the dashboard and Feed web part for Contoso's home site on Microsoft SharePoint Online. Similarly, if the analytics page is accessed through the Relecloud Connections experience on Teams or the Relecloud home site, it will show data for only the Relecloud experience. Analytics for the Feed web part will only be provided if the web part is associated with the home site of the Contoso or the Relecloud experience.\n</p><p>For organizations with only one Viva Connections experience, only the Feed web part change will apply.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may choose to download the current tenant-level reports before the rollout begins.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/connections/viva-connections-analytics\" target=\"_blank\">Viva Connections analytics | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "187086"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Connections analytics will be available at a Connections experience level rather than at a tenant level. The rollout will begin in mid-May 2024 and will affect organizations with multiple Connections experiences. No admin action is required, and the rollout will happen automatically."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC738642",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-08T19:35:10.893Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-14T23:39:43Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Analytics for multiple Connections experiences",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
