{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Microsoft Teams available on Teams Desktop is coming to Microsoft Teams Rooms on Microsoft Windows. With the new Teams app, all Teams Rooms devices can now use the performance gains and optimize available resources for room experience and rendering intelligent audio and video more reliably.</p><p><b>\n</b></p>\n<p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=381157\" target=\"_blank\">381157</a></p><p><b>When this will happen:</b>&nbsp;</p><p>Worldwide, GCC, and GCC High: We will begin rolling out Mid-April 2024 and expect to complete roll-out by late April 2024.\n</p><p><b>How this will affect your organization:</b></p><p>The new Teams app will provide a parity of experiences with existing room experiences as well as the newer experiences. This includes delivering up to two times faster performance while using 50 percent less memory and enabling users to collaborate with people across organizational boundaries by seamlessly using Teams across multiple tenants or accounts.&nbsp;</p><p>Users will not see any difference in the Teams Room UI with the new Teams app. \n</p><p><b>What you need to do to prepare:</b></p><p>There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "381157"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows will have the new Teams app available on Teams Desktop, providing faster performance and using less memory. The rollout will begin in mid-April 2024 and will not require any action from users."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows will have the new Teams app available on Teams Desktop, providing faster performance and using less memory. The rollout will begin in mid-April 2024 and will not require any action from users."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2024-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC738647",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-14T23:44:48.07Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-14T23:44:35Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams | new Teams is now part of Teams Rooms on Microsoft Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
