{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Copilot for Microsoft 365 in Word, Excel, PowerPoint, and OneNote will enable graph grounding and web grounding, similar to what is available in Copilot for Microsoft 365 Chat.<p></p><p><b>When this will happen:</b></p><p>Worldwide: We will begin rolling out in early April 2024, starting with Word on Windows and Online. Rollouts to PowerPoint, Excel, and OneNote across all platforms will follow, and we expect to complete by September 2024</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Enterprise graph grounding will be enabled by default for all requests, and a request will use the file context (document, spreadsheet, page) as well as Enterprise content.  The search will perform the same request that happens in Microsoft 365 Chat and adhere to all of the same policies, such as excluding sites and only presenting results for what the user has access to. Web grounding will also be included in all requests. Limiting Web grounding is controlled by the Connected Services setting.</p><p>Graph search will adhere to your organization's current search policies and only has access to what users have access to. For more information see <a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/ignite-2023-a-look-ahead-for-microsoft-365-admins/ba-p/3975714\" target=\"_blank\">Ignite 2023 – A look ahead for Microsoft 365 admins</a>.&nbsp;<br></p><p>\n</p><p><b>What you need to do to prepare:</b><br></p>\n<p>You must have a valid Copilot license. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot for Microsoft 365 will enable graph grounding and web grounding in Word, Excel, PowerPoint, and OneNote. It will roll out in early April 2024, starting with Word on Windows and Online, followed by PowerPoint, Excel, and OneNote across all platforms, and is expected to complete by September 2024. Enterprise graph grounding will be enabled by default for all requests, and web grounding will also be included in all requests. Your organization's current search policies will be adhered to, and a valid Copilot license will be required."
    }
  ],
  "EndDateTime": "2024-04-12T23:36:08Z",
  "HasAttachments": false,
  "Id": "MC734281",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-12T23:36:35.99Z",
  "Services": [
    "Microsoft Copilot (Microsoft 365)"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-12T23:36:08Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot for Microsoft 365: Enterprise grounding and Web grounding in Word, Excel, PowerPoint, and OneNote",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
