{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "The <b>Public Preview of the Modern Security Role setting URL redirection</b> and the <b>Modern Security Role setting interface</b> are available to users that have access to the security role setting in the Dynamics 365 portal.<br><br>Security roles define how different users access restricted or sensitive data and resources, and what they can do with them. To control access to data and resources, you can create or modify security roles and change the security roles assigned to your users. A user can have multiple security roles and the security role privileges are cumulative. Users are granted the privileges available in each role assigned to them.<br><br><b>How does this affect me?</b><br>The link for the security role setting in Power Platform admin center (PPAC) and Dynamics 365 will lead to the modern UI. However, there will still be a link in PPAC that will lead to the legacy UI page for security role setting during the Public Preview.<br><br>Additionally, there will be a link at the bottom of the page where you can provide feedback on this feature.<br><br><b>What do I need to do to prepare?</b><br>For additional information, please refer to the following documentation: <a href=\"https://aka.ms/6530_SecurityRoles\">Security roles and privileges</a>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-04-11T21:12:49Z",
  "HasAttachments": false,
  "Id": "MC732086",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-11T21:13:45.377Z",
  "Services": [
    "Dynamics 365 Apps",
    "Power Apps",
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-11T21:12:49Z",
  "Tags": [],
  "Title": "Power Platform Admin Center - Public Preview of the Modern Security Role setting URL redirection",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
