{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "To prevent errors and the creation of stub user records during data import workflows, please follow the steps outlined below prior to running any data import workflows.<br><br><b>What steps should I perform prior to running a data import workflow?</b><br><ol><li>Create the user records in Microsoft Entra before starting your data import process.</li><li>Sync the user(s) from Microsoft Entra into the environment(s) where you intend to perform the data import. You can perform this sync using any of the following methods:</li><ul><li><a href=\"https://aka.ms/6377/1\">Adding a security group to the environment</a></li><li><a href=\"https://aka.ms/6377/2\">Adding the user manually in the environment</a></li><li><a href=\"https://aka.ms/6377/3\">Using PowerShell scripts to add the user to the environment</a></li><li><a href=\"https://aka.ms/6377/4\">Leveraging Force sync in Power Automate flows</a></li></ul><li>Once the system syncs the user(s) into the environment, run your data import workflows.</li></ol>Please note, to reassign records from a stub user to another user, you can use the <a href=\"https://aka.ms/6377/5\">Add-BulkRecordsToUsers</a> command.<br><br><b>What action do I need to take?</b><br>This message is for awareness and no action is required.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-04-12T22:39:33Z",
  "HasAttachments": false,
  "Id": "MC734269",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-12T22:43:51.147Z",
  "Services": [
    "Power Apps",
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-12T22:39:33Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Power Platform - Information about preventing errors and stub user records during data import workflows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
