{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Information Protection helps organizations classify and protect their data while ensuring end user productivity.</p><p>To apply a sensitivity label to documents, emails, meetings, groups, and sites manually, the following licenses are required for both the tenant admin and each end user: \n</p>\n<ul><li>Microsoft 365 E5/A5/G5/E3/A3/G3/F1/F3/Business Premium/OneDrive for Business (Plan 2)\n</li><li>Enterprise Mobility + Security E3/E5\n</li><li>Office 365 E5/A5/E3/A3\n</li><li>AIP Plan 1\n</li><li>AIP Plan 2</li></ul><p>For both client and server-side automatic sensitivity labeling, the following licenses are required: \n</p><ul><li>Microsoft 365 E5/A5/G5\n</li><li>E5 Compliance\n</li><li>Microsoft 365 E5/A5/G5 Information Protection and Governance\n</li><li>Office 365 E5/A5/G5\n</li></ul><p>You can find a <a href=\"https://learn.microsoft.com/office365/servicedescriptions/microsoft-365-service-descriptions/microsoft-365-tenantlevel-services-licensing-guidance/microsoft-365-security-compliance-licensing-guidance#microsoft-purview-information-protection-sensitivity-labeling\" target=\"_blank\">list of licenses and details</a> here.</p><p>Please note that this is not a new change. Information Protection sensitivity labels have been a part of the above licenses since they were launched.</p>\n<p><b>When this will happen:</b></p>\n\n<p>Current organizations with Microsoft 365 E1 and below licenses assigned to their admins can create Information Protection sensitivity labels and use some sensitivity labeling functionality. However, starting January 2024, new customers require one of the licenses listed above (or equivalent) to use or continue using Information Protection sensitivity labels. Existing customers using sensitivity labels without the correct licenses will have a grace period where they can continue using the functionality until early April 2024.&nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>You are receiving this message as a reminder to ensure your admins and users who use Information Protection sensitivity labels have the required licenses. If you already have the mentioned licenses, this message is not relevant to you. \n</p><p>For exiting customers, if your admins do not have the required licenses after early April 2024, they will no longer be able to create, edit, delete, or use features related to Information Protection sensitivity labels and policies. In addition, if your end users do not have the required licenses, they will no longer be able to apply labels.</p><p>We recommend you assign the admins and users within the scope of the Information Protection sensitivity labels the appropriate licenses to continue to benefit from this feature set.</p>\n<p><b>What you need to do to prepare:</b></p>\n<p><a href=\"https://learn.microsoft.com/office365/servicedescriptions/microsoft-365-service-descriptions/microsoft-365-tenantlevel-services-licensing-guidance/microsoft-365-security-compliance-licensing-guidance#microsoft-purview-information-protection-sensitivity-labeling\" target=\"_blank\">Determine which licenses include Information Protection sensitivity labeling</a>.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting January 2024, new customers require specific licenses to use or continue using Information Protection sensitivity labels. Existing customers using sensitivity labels without the correct licenses will have a grace period until early April 2024. Admins and users who use Information Protection sensitivity labels need to have the required licenses assigned to them. For more details on the licenses required, please refer to the link provided in the message."
    }
  ],
  "EndDateTime": "2024-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC736438",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-13T21:59:24.44Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-13T21:57:15Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "License enforcement for Microsoft Purview Information Protection for sensitivity labels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
