{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 24, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>With this new feature, end users can change the language of the Microsoft Teams Rooms on the Microsoft Windows app. The language choices offered are the same as those that are offered in the Microsoft Teams desktop app.&nbsp;<p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=380752\" target=\"_blank\">380752</a></p><p><b>When this will happen:</b></p><p>Worldwide, GCC, GCC High: We will begin rolling out mid-April 2024 and\nexpect to complete by late May 2024 (previously late April).<br></p><p><b>How this will affect your organization:</b></p><p>The user must restart after choosing a language from the drop-down menu for it to be applied. Once the language has been changed on the device, the device will continue using that language until a restart occurs. This restart could be triggered by a user or during the device daily maintenance reboot.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>Admins should enable the language change option to show up on the Teams Rooms home page menu through a setting in Skypesettings.xml: &lt;RoomLanguageSwitchEnabled&gt;true&lt;/RoomLanguageSwitchEnabled&gt;</p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "380752"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows will allow end users to change the language of the app, with the same language choices as the desktop app. The feature will roll out globally by late May 2024. Users must restart the device for the language change to take effect, and admins should enable the language change option through a setting in Skypesettings.xml."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC734279",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-24T19:56:43.05Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-12T23:34:10Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Ability to change language in Microsoft Teams Rooms on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
