{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "On February 16, 2023, administrator activity events delivered to Microsoft Purview was released to general availability (GA). This release enables new Power Platform activity events to be delivered to Microsoft 365 Unified Services via a Data Connector through the Microsoft 365 Management API, making them available to Microsoft Purview, Microsoft Defender, and Microsoft Sentinel. These new activity events capture Environment Lifecycle Operations and Property Settings actions performed by administrators of Power Platform across the customer management plane of your environment.<br><br>Please note, administrative activities for Power Platform environments are enabled by default, and activity collection cannot be disabled; however, you will not be charged for the collection of these activities.<br><br><b>How does this affect me?</b><br>We have provided the availability of Administrator Activity events with Microsoft Purview, Microsoft Defender, and Microsoft Sentinel via a Data Connector to the Microsoft 365 Management API to support regularity requirements and forensic investigations, support enterprise compliance, and support threat detection and mitigation before threats disrupt business.<br><br>Users who are assigned an Audit Premium license can view activity events in Microsoft Purview. Visit <a href=\"https://aka.ms/6340/1\">Auditing solutions in Microsoft Purview</a> to learn more about licensing requirements.<br><br><b>What do I need to do to prepare?</b><br>This message is for awareness and no action is required.<br><br>Review the product documentation regarding how to <a href=\"https://aka.ms/6340/2\">view Power Platform administrative logs using auditing solutions in Microsoft Purview</a> for more information.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-04-14T23:19:44Z",
  "HasAttachments": false,
  "Id": "MC738608",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-14T23:21:39.197Z",
  "Services": [
    "Power Apps",
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-14T23:19:44Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Platform - Administrator activity events delivered to Microsoft Purview feature awareness",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
