{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Business-to-business (B2B) guest sharing for Loop workspaces, pages, and components will be available soon, subject to administrator policy. If configured, this will enable Loop workspaces, pages, and components to be shared with people outside of your tenant.\n</p><p>Please note that Loop will respect your OneDrive and SharePoint sharing settings. If your tenant does not allow sharing with guests, then those settings will prevent guest sharing of Loop workspaces, pages, and components as well.\n</p><p><b>When this will happen:</b><br></p>\n<p>For tenants without sensitivity labels configured: General Availability (Worldwide): We will begin rolling out late April 2024 and expect to complete by early June 2024.\n</p><p>Rollout for tenants with sensitivity labels configured will begin after sensitivity labels for Loop workspaces, pages, and components are generally available. Sensitivity labels will begin rolling out in the first half of 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With this change, if allowed by administrator policy, users within your organization will be able to share Loop workspaces, pages, and components with people outside of your tenant via <a href=\"https://learn.microsoft.com/sharepoint/sharepoint-azureb2b-integration\" target=\"_blank\">B2B guest sharing</a>. Pages and components can be shared outside your tenant via Specific People share links. Guest users cannot create Loop workspaces.</p><p><i>Sharing Loop workspaces, pages, and components with guests</i></p>\n<ol><li>In the SharePoint admin center, set the <a href=\"https://learn.microsoft.com/sharepoint/turn-external-sharing-on-or-off#change-the-organization-level-external-sharing-setting\" target=\"_blank\">organization-level external sharing settings</a> for SharePoint to allow content to be shared with <i>new and existing guests</i> or <i>existing guests.</i><br></li><li>Enable the <a href=\"https://learn.microsoft.com/entra/external-id/what-is-b2b\" target=\"_blank\">B2B invitation manager</a> for your tenant.</li></ol>\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1j9IY?ver=6e48\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p>\n<p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/solutions/collaborate-on-documents?view=o365-worldwide\" target=\"_blank\">Collaborate with guests on a document (IT Admins) | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/sharepoint/turn-external-sharing-on-or-off#change-the-organization-level-external-sharing-setting\" target=\"_blank\">Manage sharing settings for SharePoint and OneDrive in Microsoft 365 - SharePoint in Microsoft 365 | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Loop will soon allow business-to-business (B2B) guest sharing for workspaces, pages, and components, subject to administrator policy. Sensitivity labels for Loop workspaces, pages, and components will begin rolling out in the first half of 2024. Users within organizations will be able to share Loop workspaces, pages, and components with people outside of their tenant via B2B guest sharing. The rollout will happen automatically by the specified date with no admin action required."
    }
  ],
  "EndDateTime": "2024-07-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC736437",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-13T21:56:49.96Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-13T21:55:16Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Loop: Guest Sharing",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
