{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Defender Antivirus is rolling out an update to the support plan for the anti-malware scan \"engine update\" (MpEngine.dll). To align with the current Defender Antivirus platform update, only N-2 versions will be supported.</p>\n<p>Reasons:</p>\n<ul><li>New security intelligence update logic is dependent on newer scan engine logic. Many new detections won’t trigger for customers running an older engine version (such as from 6 months to 2+ years ago).</li><li>Newer Defender Antivirus platform updates might crash due to an older engine logic that does not comprehend new functionalities <b>such as newer code in a Defender Antivirus platform update that works in unison with the engine update or newer endpoint data loss prevention (DLP) service, and so on</b>.</li><li>We want to ensure you are not running an older scan engine version with a known vulnerability.&nbsp;</li></ul><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD, USNat, and USSec): The changes will take effect May 1, 2024.</p><p><b>How this will affect your organization:</b></p><p>To be fully supported, keep current with the latest engine updates. Our support structure is dynamic, evolving into two phases depending on the availability of the latest engine version:</p><ul><li>Security and critical updates servicing phase: When running the latest engine version, you're eligible to receive security and critical updates to the anti-malware engine.  \n</li><li>Technical support (only) phase: After a new engine version is released, support for older versions (N-2) reduces to technical support only. Engine versions older than N-2 are no longer supported. Technical support continues to be provided for upgrades from an older engine version to the latest engine version.\n<ul><li>During the technical support (only) phase, commercially reasonable support incidents are handled through Microsoft Customer Service and Support and Microsoft's managed support plans (such as Premier Support). If a support incident requires escalation to development teams for further guidance, requires a non-security update, or requires a security update, customers are asked to upgrade to the latest engine version.</li></ul></li></ul><p><b>What you need to do to prepare:</b></p><p>Please make sure that you have a supported mpengine.dll version installed. Minimum requirements are version 1.1.23110.2, version 1.1.24010.10, or newer.</p><p>To check your engine updates version in your environment:</p><p>1. In Microsoft Defender for Endpoint Plan 2, Microsoft Defender for Endpoint Plan 1, and Microsoft Defender for Business, go to:</p><p)\">Security.microsoft.com &gt; Reports &gt; Endpoints &gt; Device Health &gt; Microsoft Defender Antivirus Health &gt; Antivirus engine version<p></p><p>2. In Microsoft Defender for Endpoint Plan 2 and Microsoft Defender for Business, you can run an <a href=\"https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/master/General%20queries/MD%20AV%20Signature%20and%20Platform%20Version.md\" target=\"_blank\">Advanced Hunting query</a>&nbsp;and review the results of AVEngineVersion.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-defender-antivirus-updates?view=o365-worldwide#microsoft-defender-antivirus-platform-support\" target=\"_blank\">Microsoft Defender Antivirus security intelligence and product updates | Microsoft Learn</a></p></p)\">",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender Antivirus is changing its support plan for the anti-malware scan \"engine update\" (MpEngine.dll) to only support N-2 versions. This is due to new security intelligence update logic being dependent on newer scan engine logic, and to ensure customers are not running an older scan engine version with a known vulnerability. The changes will take effect on May 1, 2024. To be fully supported, keep current with the latest engine updates. Minimum requirements are version 1.1.23110.2, version 1.1.24010.10, or newer."
    }
  ],
  "EndDateTime": "2024-06-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC732103",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-11T22:48:04.2Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-11T22:47:53Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender Antivirus: Changes to \"engine update\" support plans",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
