{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft is expanding its notetaking solution, Microsoft OneNote, to include users who need a simple and quick way to jot down ideas and remember important information while staying focused on the task at hand. We are rolling out a preview of the new Sticky Notes app, built on the foundation of OneNote. New Sticky Notes offers the same experience as existing Sticky Notes, while making it easier to capture screenshots, automatically add source information to the notes, and more. As a first step for this preview, users will access the new Sticky Notes app through OneNote on Windows. Soon, you’ll be able to try new Sticky Notes from the Windows Start menu and by toggling over from the existing Microsoft Sticky Notes app on Windows.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=370039\" target=\"_blank\">370039</a>.</p><p>This message is also associated with Message Center post MC696853:&nbsp;<i>Replacement of OneNote Feed feature inside OneNote on Windows app with new Sticky Notes</i> (December 2023).\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2024 and expect to complete by mid-May 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>As part of this rollout, we are replacing the Feed feature in the OneNote on Windows app with new Sticky Notes. From the same location at the top of the screen, users will be able to launch new Sticky Notes, a lightweight app that users can place anywhere on their desktop to capture notes and screenshots quickly as they browse the web or multitask. The goal for new Sticky Notes is to be at full feature parity with the classic Sticky Notes of today, with added benefit of enhanced capabilities.\n</p><p>There will be no change to OneNote Feed in other endpoints like OneNote for the web, Outlook for the web, and Edge Sidebar.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is needed from you to prepare for this rollout. You may consider updating your training and documentation as appropriate.\n</p><p>Learn more: <a href=\"https://insider.microsoft365.com/blog/introducing-the-new-sticky-notes-app-for-windows\" target=\"_blank\">Introducing the new Sticky Notes app for Windows (microsoft365.com)</a></p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "370039"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is introducing a new Sticky Notes app for Windows, built on the foundation of OneNote, which will make it easier to capture screenshots, add source information to notes, and more. The new app will replace the Feed feature in OneNote on Windows, and users will be able to access it through OneNote initially, with plans to make it available from the Windows Start menu and by toggling over from the existing Microsoft Sticky Notes app. The rollout will begin in mid-March 2024 and is expected to be completed by mid-May 2024. No action is needed from users to prepare for this rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-06-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC734277",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-12T23:32:39.073Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-12T23:32:19Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft OneNote: New Sticky Notes app for Windows, available from OneNote app (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
