{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 20, 2024: We have updated the content below to provide more information regarding the potential impact to your organization. Thank you for your patience.</p><p>The new Microsoft Teams available on Teams Desktop is also coming to Microsoft Teams Rooms on Microsoft Windows. With the new Teams app, all Teams Rooms devices can now use the performance gains and optimize available resources for room experience and rendering intelligent audio and video more reliably.</p><p><b>\n</b></p>\n<p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=381157\" target=\"_blank\">381157</a></p><p><b>When this will happen:</b>&nbsp;</p><p>Worldwide, GCC, and GCC High: We will begin rolling out Mid-April 2024 and expect to complete roll-out by late April 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The new Teams app will automatically replace the existing Teams Rooms application in the next Teams Rooms on Windows update (4.20). This update is at parity for all user features and looks identical to the current Teams Rooms application, so no end user education or notification will be required. The benefits to new Teams on Teams Rooms on Windows is up to two times faster performance while using 50 percent less memory. This next Teams Rooms update will also include several new features which are announced in other message center posts.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>There is no action needed to prepare for this change. If desired, you can control the release of this update leveraging the update rings in the Pro Management Portal following standard Teams Rooms app update processes.\n</p><p><br></p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "381157"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows will receive an update in mid-April 2024 that will automatically replace the existing Teams Rooms application with the new Teams app. The update will provide up to two times faster performance while using 50 percent less memory. No end user education or notification is required. There is no action needed to prepare for this change."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Rooms on Windows will receive an update in mid-April 2024 that will automatically replace the existing Teams Rooms application with the new Teams app. The update will provide up to two times faster performance while using 50 percent less memory. No end user education or notification is required. There is no action needed to prepare for this change."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2024-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC738647",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-20T20:33:47.403Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-14T23:44:35Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams | new Teams is now part of Teams Rooms on Microsoft Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
