{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Microsoft Clipchamp desktop app from app version 3.x for Windows 10 and Windows 11 is introducing support for logins with Azure Active Directory/Entra ID accounts. This means that your users can access Clipchamp's work version through the desktop app in addition to accessing Clipchamp in Microsoft Edge or Chrome. Until this rollout, users could not access Clipchamp through its desktop app for Windows because the desktop app only supported personal Microsoft accounts, not work accounts. With this rollout, the Clipchamp desktop app will support work accounts from app version 3.x, which is currently being rolled out gradually to Microsoft 365 organizations.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=387124\" target=\"_blank\">387124</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): AAD/Entra account support in the Clipchamp desktop app will begin rolling out early May 2024 and we expect to complete by early June 2024.&nbsp;</p><p>Note: between now and the rollout, you might see the new app version&nbsp;3.x in the Microsoft Store, thus enabling managing it in Intune; however, AAD account support in the new app version&nbsp;3.x will only become available in May.</p><p><b>How this will affect your organization:</b>\n</p><p>Your users will not need to access Clipchamp from a web browser. They can use the desktop app to open the correct version of Clipchamp that is either part of your existing Microsoft 365 SKU or that you can assign to them as a standalone license.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To allow your users to access Clipchamp via its desktop app, make sure the app version installed on your managed devices is 3.x. Older app versions (2.9.x) do not support work account logins yet.</p><p>As admins, you can manage the desktop app, its availability for your users, the availability of Clipchamp's personal and/or work versions in the desktop app, and the overall availability of Clipchamp in your organization as described in: <a href=\"https://support.microsoft.com/topic/how-to-enable-or-disable-clipchamp-for-users-in-your-organization-5b74028f-6dd8-423c-a6cb-8e2b8b42c6e7\" target=\"_blank\">How to enable or disable Clipchamp for users in your organization</a>. Managing the desktop app is described in the section called <a href=\"https://support.microsoft.com/topic/how-to-enable-or-disable-clipchamp-for-users-in-your-organization-5b74028f-6dd8-423c-a6cb-8e2b8b42c6e7#bkmk_app_access\" target=\"_blank\">Managing availability of Clipchamp's desktop app for Windows</a>.\n</p><p>\n</p><p><i>Learn more</i></p><p>For users: <a href=\"https://support.microsoft.com/topic/work-account-support-in-the-clipchamp-app-for-windows-9155e5ee-3b01-47d6-8170-be874f71457c\" target=\"_blank\">Work account support in the Clipchamp app for Windows - Microsoft Support</a>\n</p><p>For admins: <a href=\"https://support.microsoft.com/topic/how-to-enable-or-disable-clipchamp-for-users-in-your-organization-5b74028f-6dd8-423c-a6cb-8e2b8b42c6e7#bkmk_app_access\" target=\"_blank\">How to enable or disable Clipchamp for users in your organization - Microsoft Support</a>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "387124"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Clipchamp desktop app is introducing support for logins with Azure Active Directory/Entra ID accounts. This means that work accounts will be supported in the desktop app from version 3.x, which is being rolled out gradually to Microsoft 365 organizations. The rollout will begin early May 2024 and is expected to be completed by early June 2024. Users will not need to access Clipchamp from a web browser and can use the desktop app instead. Admins can manage the desktop app's availability for users and the availability of Clipchamp's personal and/or work versions in the desktop app."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-06-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC744123",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-18T22:54:17.417Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-18T22:53:31Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Clipchamp desktop app: Work account support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
