{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 29, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Purview Insider Risk Management will be rolling out public preview of <i>Global exclusions </i>in the in the Microsoft Purview compliance portal.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=185687\" target=\"_blank\">185687</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early May 2024 and expect to complete by mid-May 2024.\n</p><p>General Availability: We will begin rolling out mid-October 2024 (previously mid-August) and expect to complete by mid-November 2024 (previously late August).</p><p><b>How this will affect your organization:</b>\n</p><p>With this rollout, all exclusion features currently found under intelligent detections will be relocated to a new <i>Global exclusions</i> tab in the insider risk settings. All previously added exclusions in intelligent detections will be migrated to this new tab.</p><p>The functionality of exclusions remains unchanged. Admins with appropriate permissions can now add exclusion with defined detection groups, which contain similar entities like domains or file types. This new tab is designed to enhance usability and provide a convenient way to access and manage exclusions.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jPvv?ver=f762\" style=\"width: 400px;\" alt=\"user control info\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>After rollout: please review the features in <i>Global exclusions</i> that were previously part of intelligent detections.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings\" target=\"_blank\">Learn about insider risk management settings | Microsoft Learn</a><br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "185687"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management's public preview of Global exclusions begins early May 2024, with general availability starting mid-October 2024. Exclusion features will move to a new Global exclusions tab, enhancing usability and management. Admins should review these features post-rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC746324",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-30T23:31:11.24Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-19T22:46:25Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Public preview of Global exclusions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
