{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 27, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Note: If your organization does not support iOS and/or Android mobile devices, you can skip this message.\n</p><p>We are rolling out a new Contact editor for Outlook Mobile, which replaces the use of the device's native contact editor.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=384869\" target=\"_blank\">384869</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-April 2024 and expect to complete by mid-April 2024.\n</p><p>General Availability: We will begin rolling out late April 2024 and expect to complete by late June 2024 (previously mid-June).\n</p><p><b>How this will affect your organization:</b>\n</p><p>With the new Outlook Mobile Contact editor, you can now accurately enforce a number of Intune policies you may have previously selected, such as preventing copy and pasting data in or out of the Contact editor. Some organizations have set up Intune policies to prevent unmanaged apps from accessing data, which has led to users who are not able to save contacts in Outlook Mobile. With this rollout, these organizations can maintain their Intune policies and their users can create contacts in Outlook Mobile instead of the device's own contact editor (a third-party, unmanaged app form), greatly improving your ability to manage and enforce Intune policies related to the contact creation and editing experience.\n</p><p>This feature will not directly impact the Outlook Mobile Contact Sync/Save feature (syncing contacts from Outlook Mobile to the device's native editor). We expect a reduced dependency on the use of Contact Syncing to the native contact editor now that users can create, edit, and manage their contacts in Outlook Mobile.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jPu6?ver=7062\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>It may be beneficial to review your existing Intune policies for contacts and adjust or take action as needed. For example, if your organization has set Intune policies that prevent users from creating contacts in Outlook Mobile, then you may wish to let users know they will soon have the ability to create and manage contacts in Outlook Mobile.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "384869"
    },
    {
      "Name": "Summary",
      "Value": "Outlook Mobile is rolling out a new Contact editor, replacing the device's native editor. This will allow organizations to enforce Intune policies related to contact creation and editing, and reduce the dependency on Contact Syncing. The rollout will happen automatically by late June 2024, with no admin action required. Users may want to update their documentation and review their existing Intune policies."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC746321",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-27T23:31:05.28Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-19T22:40:38Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Outlook Mobile: New in-app Contact editor",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
