{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 24, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We continue to enhance the Microsoft Teams platform with deeply integrated experiences and greater admin controls to enable a seamless collaborative experience for content stored on third-party cloud platforms. Teams admins will soon be able to change the default storage app for file uploads in Teams from Microsoft OneDrive and SharePoint Online to a third-party provider of the admin's choice. This setting will only apply when local files are uploaded using drag-and-drop in Teams chat and channel conversations. \n</p><p>This setting does not apply to Teams mobile and these user actions on Teams Desktop:\n</p><ul><li>Pasted images or media files in Teams chat and channel conversations \n</li><li>Files uploaded using the default attach file icon (paper clip)\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=376219\" target=\"_blank\">376219</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early April 2024 and expect to complete by mid-April 2024.\n</p><p>General Availability (Worldwide GCC, GCC High, and DoD): We will begin rolling out mid-April and expect to complete by late May 2024 (previously early May).\n</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization is not using a third-party storage provider on Teams, this feature may not be relevant. \n</p><p>If your organization is using a third-party storage provider on Teams, admins can use a PowerShell command to set the default content app for local files uploaded using drag-and-drop in Teams chat and channel conversations. We will update this post before the rollout date to provide documentation on using the PowerShell command.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Third-party developers will need to update their apps to support the new admin settings. Admins should refer to third-party storage provider documentation or reach out to third-party storage providers for more information on support for the new settings.</p><p>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to update any relevant documentation as appropriate.</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "376219"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"376219\":[{\"RoadmapId\":376219,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-04-10T05:32:55.4983201Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":376219,\"Platform\":\"Web\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-04-10T05:32:55.4983204Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":376219,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-04-10T05:32:55.4983206Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams admins can soon change the default storage app for file uploads in Teams from Microsoft OneDrive and SharePoint Online to a third-party provider of their choice. This only applies when local files are uploaded using drag-and-drop in Teams chat and channel conversations. This feature will roll out in early April 2024 and is not relevant if your organization is not using a third-party storage provider on Teams. Third-party developers will need to update their apps to support the new admin settings. No admin action is required as the rollout will happen automatically by the specified date."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC746332",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-24T19:53:00.367Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-19T22:56:02Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New Admin control for setting default storage app for file uploads",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
