{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>What is being announced?</b><br></p><ul><li>With MC718748 on Feb 28, 2024<i> (New Teams rollout schedule for Commercial and EDU customers), </i>we informed customers about the new Microsoft Teams rollout schedule with updated timelines.  We encourage you to update users in your organization to new Teams as quickly as you can, because all new feature development will only be available in new Teams. Comprehensive documentation on new Teams rollout and experience: <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability\" target=\"_blank\">End of availability for classic Teams client - Microsoft Teams | Microsoft Learn</a>.</li><li>This communication is a reminder post to reaffirm that after March 31, 2024, any existing values for <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center\" target=\"_blank\">new Teams client policies</a> will no longer be valid for non-VDI (Virtual Desktop Infrastructure) customers (Teams for desktop, for the web, for Mac, and for Education) and after June 30, 2024 for VDI customers.  After March 31, 2024, Microsoft will begin rolling out new Teams for non-VDI customers in stages per the below  <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability\" target=\"_blank\">timeline</a>.&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability\" target=\"_blank\">(VDI timelines)</a>.</li></ul><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jN4g?ver=edd5\" style=\"width: 400px;\" alt=\"Teams rollout timeline\">\n</p><ul><li>The \"New Teams only\" policy is now available in the&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center\" target=\"_blank\">Teams admin center (TAC)</a>. Updating to this policy will update classic Teams users to new Teams as their default client and remove the toggle to return to classic Teams.  After users have transitioned to new Teams, Microsoft will attempt to uninstall classic Teams after 14 days. If this uninstallation is blocked for any reason (for example, by machine configuration, etc.), uninstallation will not be attempted again, and you will have the option to manually&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/msi-deployment#uninstallation\" target=\"_blank\">remove classic Teams</a>. \n</li><li>We have introduced the <a href=\"https://learn.microsoft.com/MicrosoftTeams/new-teams-usage-report\" target=\"_blank\">new Teams usage report in the Teams admin center</a>, which provides an overview of Teams desktop clients in use in your organization. It highlights platforms (Windows or Mac), app version, and user type (preview or production) to help you better understand the current state of your user’s desktop clients. \n</li><li>Starting in late March 2023, users who are still on classic Teams but are&nbsp;eligible to switch to new Teams will begin seeing our informational campaigns to switch to new Teams.\n</li></ul><p><b>How can I prepare for a seamless update to new Teams?\n</b></p><ul><li>To ensure the best transition experience for your organization, we strongly advocate admins gradually roll out&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center\" target=\"_blank\">TAC policies</a>. We recommend you begin with a small group, ensure a healthy deployment, and then gradually roll out to the entire organization.\n</li><li>Minimum operating system for new Teams: Users must have Windows 10 version 10.0.19041 or above or macOS Big Sur (11).  <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center#prerequisites\" target=\"_blank\">Update your OS to ensure healthy functioning of the new Teams client</a>.</li><li>Configs and policies: Ensure users are not blocked from <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-troubleshooting-installation#to-check-this-setting-for-your-computer\" target=\"_blank\">app installation</a> due configuration issues. If users do not have install permissions, plan to leverage deployment options such as <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-bulk-install-client\" target=\"_blank\">bulk deployment</a>.</li><li>The classic Teams for Virtualized Desktop Infrastructure (VDI) will reach end of availability on June 30, 2024.\n</li><li>New Teams does not support Windows Server 2016. The new Teams client will not run on Windows Server 2016. VDI customers should plan to update to Windows Server 2019 (10.0.17763) or Windows Server 2022 (10.0.20348) or higher to get started on their new Teams journey. Learn more about <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-vdi-requirements-deploy#requirements\" target=\"_blank\">VDI system requirements</a>.</li></ul><p>Thank you for being a valued user of Teams!</p><p>References</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability\" target=\"_blank\">End of availability for classic Teams client - Microsoft Teams | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center\" target=\"_blank\">Upgrade to the new Teams client using policies - Microsoft Teams | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/MicrosoftTeams/new-teams-usage-report\" target=\"_blank\">Usage report for new Teams client - Microsoft Teams | Microsoft Learn</a></li></ul><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is rolling out a new update, and all new feature development will only be available in the new Teams. After March 31, 2024, existing values for new Teams client policies will no longer be valid for non-VDI customers, and after June 30, 2024, for VDI customers. The \"New Teams only\" policy is now available in the Teams admin center (TAC), and a new Teams usage report is available in the Teams admin center. To ensure a seamless update to new Teams, admins should gradually roll out TAC policies, ensure users have the minimum operating system requirements, and ensure users are not blocked from app installation due to configuration issues. The classic Teams for Virtualized Desktop Infrastructure (VDI) will reach end of availability on June 30, 2024."
    }
  ],
  "EndDateTime": "2024-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC746660",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-20T01:39:09.6Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-20T01:38:51Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Reminder: Classic to new Teams update, new Teams rollout, and new Teams only availability",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
