{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>There is a feature enhancement for change history reports in the <a href=\"https://learn.microsoft.com/sharepoint/get-started-new-admin-center\" target=\"_blank\">SharePoint admin center</a>. Now, with the newly launched organization setting reports, you can track and review changes made to settings that impact the entire tenant.<br></p><p>Leverage change history reports by creating up to ten instances to track what changed, when it happened, and who initiated the change across site and organization settings. While the site setting reports are generally available, the organization settings reports feature update will be rolled out in preview beginning in March 2024.</p><p>\n</p><p>Additional information is available about how to <a href=\"https://learn.microsoft.com/sharepoint/change-history-report\" target=\"_blank\">create change history reports for SharePoint sites</a>.</p><p><b>When this will happen:</b></p><p>Public Preview (Worldwide, GCC, GCC High, and DoD): We will begin rolling out mid-March 2024 and expect to complete by early May 2024.</p><p><b>How this will affect your organization:</b></p><p>Admins can use this organization settings reports feature update to quickly review changes made to important organization-wide  settings.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>The existing change history flow will have an option to additionally generate organization setting reports. There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online's change history reports now include organization settings reports. Admins can track and review changes made to settings that impact the entire tenant by creating up to ten instances. The feature update will be rolled out in preview beginning in March 2024. No action is needed to prepare for this change."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/sharepoint/change-history-report"
    }
  ],
  "EndDateTime": "2024-06-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC740510",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-15T22:58:50.857Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-15T22:58:44Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "SharePoint Online: Change history reports now include organization settings reports",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
