{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 19, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Teams is now enhancing app setup policies, allowing admins to pre-pin and pre-install meeting apps for users. Earlier, the pre-pinning and pre-installation were limited to personal apps and message extensions. This update extends the functionality to meeting apps. Admins can set up policies to install and pin meeting apps to provide users quick and easy access to their necessary meeting tools within Microsoft Teams.<p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=131169\" target=\"_blank\">131169</a></p><p><b>When this will happen:</b>&nbsp;</p><p>Worldwide: We will begin rolling out late April 2024 (previously early April) and expect to complete by mid-May 2024 (previously mid-April).\n</p><p>GCC, GCC High, DoD: We will begin rolling out mid-May 2024 (previously late April) and expect to complete by mid-June 2024 (previously late May).</p><p><b>How this will affect your organization:</b></p><p>This new feature enhances the customization of Microsoft Teams for users by highlighting the most important meeting apps for them. Admins can choose the meeting apps to pre- pin and pre-install, streamlining the user's experience, especially during meetings. The pinned apps will appear in the meeting app flyout and the meetings tabs next to chat.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1juw4?ver=6193\" style=\"width: 400px;\"><br></p><p> \n</p><p><b>What you need to do to prepare:</b></p><p>This feature update does not affect any existing policies or permissions. No specific actions are required. You can review the existing app setup policies and consider the meeting apps that could be beneficial to pre-pin and pre-install for your users.&nbsp;</p><p>You may want to notify your users about this change and update any relevant documentation as appropriate.</p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "131169"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating app setup policies to allow admins to pre-pin and pre-install meeting apps for users. The rollout will begin late April 2024 and is expected to be completed by mid-June 2024. No action is required, but admins can review and update app setup policies."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating app setup policies to allow admins to pre-pin and pre-install meeting apps for users. The rollout will begin late April 2024 and is expected to be completed by mid-June 2024. No action is required, but admins can review and update app setup policies."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC748380",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T19:24:00.183Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-20T22:25:07Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Pre-pin meeting apps for users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
