{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 23, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Viva Learning is rolling out new language settings so Learning admins and users can personalize Viva Learning with their preferred language.\n</p><p>Available languages<i> setting in the Viva Learning admin page</i>\n</p><p>Knowledge admins / Learning admins can now define a specific set of languages that they support for learning in their tenant in the Available languages setting in Language preferences tab in the <a href=\"https://learning.cloud.microsoft/admin\" target=\"_blank\">Viva Learning admin page</a>. Please refer to <a href=\"https://learn.microsoft.com/en-us/viva/learning/language-preferences#available-languages\" target=\"_blank\">Language preferences in Viva Learning | Microsoft Learn</a> for guidelines on choosing supported languages and to learn about the impacted features. We advise minimizing changes to the Available languages setting for an optimal user learning experience.\n</p><p>User <i>Language option in Settings Menu in Viva Learning</i></p><p>Users will be able to personalize Viva Learning by choosing their preferred language in the Viva Learning app settings. User <i>Language </i>settings will show the language options chosen by admins in the <i>Available languages</i> setting in the Viva Learning admin tab. User language settings will persist across all Viva Learning experiences: changes to user language in the Viva Learning Teams app will reflect in Viva Learning for the web and vice versa.\n</p><p> </p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=162294\" target=\"_blank\">162294</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early April 2024 and expect to complete by mid-April 2024\n</p><p>General Availability: We will begin rolling out early May 2024 (previously mid-April) and expect to complete by late May 2024 (previously late April).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After rollout:\n</p><ul><li>Viva Learning will only reflect the user <i>Language </i>setting in Viva Learning.\n</li><li>The user <i>Language </i>setting will be preselected based on the language the user was using in Viva Learning.\n</li><li>Changing the language in Microsoft Teams for desktop or web (or changing the browser language) will not change the Viva Learning language.</li>\n</ul><p>For example, before rollout, a user selected English (United States) in their Microsoft Teams language setting, so English (United States) setting was also reflected in Viva Learning. After rollout, English (United States) will be automatically selected as the user's language setting. After rollout, the user can only change the language for Viva Learning through the Viva Learning user Language setting. Changes to language in Microsoft Teams or a browser will not affect the language setting for Viva Learning.\n</p><p>If a user is accessing Viva Learning in an unsupported language (not present in the <i>Available languages</i> setting), Viva Learning will reflect the&nbsp;<a href=\"https://learn.microsoft.com/viva/learning/language-preferences#default-language\" target=\"_blank\">Default language</a> in the language settings.\n</p><p><i>Available languages </i>setting in the Viva Learning admin page:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1juxk?ver=b446\" style=\"width: 400px;\" alt=\"user controls\"></p><p>User <i>Language </i>setting in Viva Learning (for users):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jmFX?ver=d883\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learning admins may want to:\n</p><ul><li>Prepare the set of languages that the tenant supports in Viva Learning. Refer to documentation for guidance on how to choose <i>Available languages.</i></li><li>Inform users about the new capability to change Viva Learning language within the application.\n</li><li>Learn more: <a href=\"https://learn.microsoft.com/viva/learning/language-preferences\" target=\"_blank\">Language preferences in Viva Learning | Microsoft Learn&nbsp;</a>\n</li></ul>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "162294"
    },
    {
      "Name": "Summary",
      "Value": "Viva Learning is introducing new language settings for admins and users. Admins can define supported languages in the Available languages setting in the Viva Learning admin page, while users can personalize Viva Learning by choosing their preferred language in the Viva Learning app settings. The rollout will begin in May 2024. After rollout, Viva Learning will only reflect the user Language setting in Viva Learning, and changing the language in Microsoft Teams or a browser will not affect the language setting for Viva Learning. Learning admins should prepare the set of languages that the tenant supports in Viva Learning and inform users about the new capability to change Viva Learning language within the application."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC740505",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-23T18:06:44.39Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-15T22:55:30Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Learning | New language settings for admins and users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
