{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We will be releasing two Out of Box Experience (OOBE) reports for leaders in the Microsoft Viva Insights app in Microsoft Teams with the following themes:</p><ul><li>New hire onboarding and integration</li><li>External focus for leaders</li></ul><p>Note that leaders are defined as users who have been assigned the group manager role in Viva Insights and have a span of control of at least 9 licensed users.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=164211\" target=\"_blank\">164211</a>.</p><p><b>When this will happen:</b></p><p>Worldwide:</p><ul><li>External Focus Report: We will begin rolling out in late March 2024 and expect to complete by mid-April 2024.\n</li><li>New Hire Onboarding Report: We will begin rolling out in late April 2024 and expect to complete by early May 2024.\n</li></ul><p><b>How this will affect your organization:</b><br></p><p>Details regarding the two new reports are as follows:</p><ul><li>New Hire Onboarding and Integration: This report helps leaders understand the onboarding experience of new hires as well as the transition for employees who have started in a new role within the company. The report also identifies opportunities to improve the onboarding and professional development experience.<br><br></li><li>External Focus:<b> </b>This<i style=\"\"> </i>report helps leaders understand how employees are managing external relationships and how different parts of the company may have been impacted by business shifts. Information from this report can help leaders improve their strategies for communicating and collaborating with external groups.</li></ul><p>The left-hand navigation will be updated to highlight this new value.</p><p><b>What you need to do to prepare:</b></p><p>Review and assess the impact for your organization.&nbsp;</p><p><a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/leader-reports\" target=\"_blank\">Learn more details about the Leader reports</a>. </p><p>Additionally, you may want to notify your users about this change and update any relevant documentation as appropriate.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "164211"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights will release two new leader reports focusing on new hire onboarding and external focus. The rollout will begin in late March 2024 and complete by early May 2024. Leaders must review and assess the impact on their organization and update documentation as needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/viva/insights/org-team-insights/leader-reports"
    }
  ],
  "EndDateTime": "2024-06-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC744117",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-12T20:30:30.44Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-18T22:44:02Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Viva Insights leader deep-dive reports focus on customer, business operations, and agility",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
