{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"font-size: larger;\"><span style=\"font-size: 14px;\">Updated April 15, 2024: We have updated the rollout timeline below. Thank you for your patience.</span></p><p style=\"font-size: larger;\"><span style=\"font-size: 14px;\">We're adding a Media node to the left nav of Microsoft OneDrive for web that will allow commercial customers to easily find all the photo and video content stored in their OneDrive in a single view.</span><br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=382105\" target=\"_blank\">382105</a></p>\n<p><b>When this will happen:</b></p><p>General Release (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-April 2024 (previously early April) and expect to complete by early May 2024 (previously late April).</p><p>General Release (USSec, USNat): We will begin rolling out early May 2024 (previously late April) and expect to complete by early June 2024 (previously mid-May).</p>\n\n<p><b>How this will affect your organization:</b></p><p>OneDrive for web end users will see a Media node available in the left nav of their OneDrive below the Meetings pivot.</p><p>When an end user navigates to the Media node, they will see a view of all the photo and video content stored within their OneDrive. This content will be sorted by the date the content was created. The files shown in this view are the same files stored in the user’s OneDrive and the Media node does not create separate copies of the content.&nbsp;</p><p>End users will be able to perform actions on the media content in this view such as Share, Download, or Delete. These actions will behave the same way in the Media node as they do in the My Files node.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kCC9?ver=59f5\" style=\"width: 400px;\"><br></p>\n<p><b>What you need to do to prepare:</b></p>\n<p>You might want to notify OneDrive end users, update your user training, and prepare your help desk.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "382105"
    },
    {
      "Name": "Summary",
      "Value": "OneDrive for web will have a Media node added to the left navigation, allowing commercial customers to view photo and video content stored in their OneDrive in a single view. This will be available worldwide in April 2024, and end-users will be able to perform actions on the media content in this view. No action is required to prepare, but updating user training and notifying end-users may be beneficial."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC748381",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-15T21:54:36.143Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-20T22:26:02Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "OneDrive: Media node in OneDrive for web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
