{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 10, 2024: After further review we have decided not to proceed with this change at this time. We apologize for any inconvenience.</p><p>Coming soon to public preview, Microsoft Purview Insider Risk Management is expanding its detections to Microsoft Fabric, with ready-to-use indicators based on user activities in Power BI.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=388733\" target=\"_blank\">388733</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early April 2024 and expect to complete by early/mid-/late month 2024. We will not be proceeding with this change at this time.</p><p>General availability: We will begin rolling out late September 2024 and expect to complete by late October 2024. We will not be proceeding with this change at this time.\n</p><p><br></p><p><b>How this will affect your organization:</b>\n</p><p>With this update, Insider Risk Management extends its risk detection capabilities to Microsoft Fabric products by offering ready-to-use risk indicators based on activities that may lead to a data security incident in Power BI. Organizations can use these new indicators in data theft and data leaks policies.\n</p><p>Data theft policy: choosing Fabric indicators\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jOoG?ver=eef4\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Insider Risk Management alert with Box and Fabric insights:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jWvc?ver=3cc9\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Insider Risk admins with appropriate permissions can opt into these new indicators in the new <a href=\"https://purview.microsoft.com/\" target=\"_blank\">Microsoft Purview portal</a> or in the <a href=\"https://compliance.microsoft.com/\" target=\"_blank\">Purview compliance portal</a> at Insider Risk Management settings.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388733"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management's update to include new risk indicators for Microsoft Fabric in Power BI is postponed. The public preview and general availability rollout, initially planned for April and September 2024 respectively, will not proceed at this time. Organizations are advised to prepare by opting into new indicators via the Microsoft Purview portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC757607",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-10T23:40:00.813Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-26T23:31:02Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: New Microsoft Fabric risk indicators",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
