{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 21, 2024: We have updated the content pertaining to default sizes as well as updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: When authoring pages in Microsoft SharePoint, authors will be able to choose the heading level for titles in web parts to help define the hierarchy of information on a page. As we're introducing this new capability, we're also using it as an opportunity to align to the default heading font size in the Text web part. This means that all headings for both Text web part and titles in web parts will be as follow. <b>Note:</b>&nbsp;with this change we're not changing the default headings sizes for the Text web part:&nbsp;</p><ul><li>Heading 2 will be 28 \n</li><li>Heading 3 will be 24\n</li><li>Heading 4 will be 20</li></ul><p>\n</p><p>This message is associated with MC670896 <i>Accessibility Improvements to Page Authoring</i> (August 2023) and with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=387500\" target=\"_blank\">387500</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early April 2024 and expect to complete by mid-August 2024. \n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-August 2024 and expect to complete by early September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Authors will now have the ability to set their own heading level. If not set, the default will continue to be Heading 2. New and existing pages and news posts will see the new default heading font sizes.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your SharePoint authors about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "387500"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint Online is introducing new heading level options for web parts, aligning with default heading font sizes. Rollout begins in April 2024, completing by September 2024. Authors can set heading levels, with Heading 2 as the default. No admin action is required for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC752513",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-21T19:35:48.703Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-22T23:41:03Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "SharePoint Online: New heading level options for web parts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
