{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 17, 2024: We have updated the rollout timeline below. Thank you for your feedback.</p><p>We are releasing an update to restrict access to the following information only to admins having the ‘Data Classification Content Viewer’ role -\n</p><ol><li>View source information in Activity Explorer and\n</li><li>View surrounding context for associated SIT types in Activity Explorer</li></ol><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=383745\" target=\"_blank\">383745</a></p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-May 2024 (previously mid-April) and expect to complete by late May 2024 (previously late April).</p><p>General Availability: We will begin rolling out early June 2024 (previously mid-May) and expect to complete by late June 2024 (previously late May).</p><p><b>How this will affect your organization:</b></p><p>Existing admins who do not have the ‘Data Classification Content Viewer’ role assigned to any of their existing Role Groups will no longer have access to view source and SIT surrounding context.</p><p><b>What you need to do to prepare:</b></p><p>Ensure any admins that need to have access to ‘View Source’ and ‘SIT surrounding context’ have the ‘Data Classification Content Viewer’ role assigned to them.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "383745"
    },
    {
      "Name": "Summary",
      "Value": "The update enhances privacy control in Endpoint DLP by limiting access to PII in Activity Explorer to admins with the 'Data Classification Content Viewer' role. It will roll out from mid-May to late June 2024. Admins without this role will lose certain access rights. Microsoft 365 Roadmap ID 383745."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC759457",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T21:30:05.903Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-27T22:57:44Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Endpoint Data Loss Prevention - Enhanced privacy control: Limiting PII data access in Activity Explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
