{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To drive awareness and adoption of Microsoft Teams features, you can now reach users with organizational messages in Microsoft Teams.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out in late March 2024 and expect to complete by mid-April 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>In the Microsoft 365 admin center’s Adoption Score Meetings category, you will see a new action card where you can configure a templatized organizational message. After the organizational message is configured, users who have not used Microsoft Teams interactive features or sent post-meeting chat messages will receive a pop-over message recommending they use these Microsoft Teams features. Note that it may take up to 24 hours from the time the message is configured until users start receiving the messages.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1k4SM?ver=2f09\" style=\"width: 400px;\"><br></p><p><i>The user sees an in-product notification recommending they use interactive features during Teams meetings.</i><br></p><p>For more information, visit <a href=\"https://learn.microsoft.com/microsoft-365/admin/adoption/organizational-messages?view=o365-worldwide\" target=\"_blank\">Adoption Score Organizational Messages</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate. Admins with Global Admin and/or Organizational Message Writer roles will be able to configure the organizational messages inside the Microsoft 365 admin center usage report.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams users can now receive organizational messages to drive adoption of Teams features. The feature will be rolled out from late March 2024 to mid-April 2024. Admins can configure a templatized organizational message in the Adoption Score Meetings category in the Microsoft 365 admin center. The feature will recommend users to use interactive features during Teams meetings. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2024-06-21T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC759458",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-27T22:58:29.653Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-27T22:58:19Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Drive Microsoft Teams adoption with organizational messages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
