{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With Microsoft Viva insights, new delegate access allows leaders to empower other individuals to view insights about their organization. Those with delegated access will be able to easily navigate to the leader's view of organizational insights.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=164209\" target=\"_blank\">164209</a></p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out early April 2024 and expect to complete by late April 2024.&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out mid-April 2024 and expect to complete by mid-May 2024.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>\n</p><p>Leaders can now delegate access to their organization insights to other people in their company. This will allow designated delegates, such as the leader’s Chief of Staff or direct reports, to view organization insights and use them to make data-driven decisions. Designated delegates have the same access to organization insights as the leader but cannot see the leader’s personal insights.</p><p>Assigned delegates will now have a 'View insights for' banner at the top of the Viva Insights app to toggle between their own profile and the leader's profile (see image below).</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jWQy?ver=1d4b\" style=\"width: 400px;\"><br></p><p>Leaders are defined as users who have been assigned the group manager role in Viva Insights and have a span of control of at least 9 licensed users.&nbsp;<br></p><p>Here are a few things to note about this new capability:</p><ul><li>Leaders can only delegate access to people who have a Viva Insights subscription.</li><li>Leaders can delegate access to multiple people.</li><li>Leaders can revoke access to anyone at any time.</li><li>Delegates cannot delegate access to others.</li><li>If a leader is removed as a group manager from Viva Insights, the delegates whom they have assigned will also be removed along with their access.\n</li></ul><p>This feature is optional and requires action from leaders to delegate access to others. For more details, visit <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/org-insights\" target=\"_blank\">Organization insights in Viva Insights</a>.&nbsp;</p><p>\n<b>What you need to do to prepare:</b></p><p>No action is needed to enable this feature. Leaders can use this capability at their discretion. Inform your Viva Insights users that have been assigned the group manager role about this new capability and update any relevant training materials.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "164209"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights now allows leaders to delegate access to their organization insights to other individuals in their company. Delegated access will allow designated delegates to view organization insights and make data-driven decisions. This feature will be available for public preview in early April 2024 and for general availability worldwide in mid-April 2024. No action is needed to enable this feature, and leaders can use this capability at their discretion."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights now allows leaders to delegate access to their organization insights to other individuals in their company. Delegated access will allow designated delegates to view organization insights and make data-driven decisions. This feature will be available for public preview in early April 2024 and for general availability worldwide in mid-April 2024. No action is needed to enable this feature, and leaders can use this capability at their discretion."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-06-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC759451",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-27T22:51:51.533Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-27T22:51:37Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights delegate access for leaders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
