{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 29, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The Microsoft Graph eDiscovery premium API that supports Purge for Teams messages will now expand to support items stored in Microsoft Exchange including emails, calendar invitations, and more. In addition to expanding to support Exchange email items and Microsoft Teams, the limit for each purge action per unique location will expand from 10 items per location to 100 items per location. This limit will now enable administrators who are responding to a data spill or need to remediate data within Teams or Exchange to include more message items per purge action per location targeted for the purge.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=383743\" target=\"_blank\">383743</a></p><p><b>When this will happen:</b></p><p>General\nAvailability (Worldwide): We will begin rolling out mid-April 2024 and expect to complete by early June 2024 (previously mid-May).</p><p><b>How this will affect your organization:</b></p><p>This new feature will improve the consistency and scope of the purge action for scenarios such as data spillage or malicious content remediation.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>The admins responsible for Teams and Exchange purge should review the updated documentation and existing processes, validate the behavior of the eDiscovery premium purge API, and make any related updates to internal organization process and documentation, including stakeholder notification as needed.\n</p><p>Review the related existing documentation here:\n</p><p><a href=\"https://learn.microsoft.com/graph/api/security-ediscoverysearch-purgedata?view=graph-rest-1.0&amp;tabs=http\" target=\"_blank\">ediscoverySearch: purgeData - Microsoft Graph v1.0 | Microsoft Learn</a></p><p>\n</p><p><a href=\"https://learn.microsoft.com/purview/ediscovery-search-and-delete-teams-chat-messages\" target=\"_blank\">Search for and delete chat messages in Teams | Microsoft Learn</a></p><p>\n</p><p><a href=\"https://learn.microsoft.com/purview/ediscovery-data-spillage-search-and-purge\" target=\"_blank\">eDiscovery solution series Data spillage scenario - Search and purge | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "383743"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Graph eDiscovery premium API will expand to support items stored in Microsoft Exchange, including emails and calendar invitations. The limit for each purge action per unique location will expand from 10 to 100 items per location. This feature will improve the consistency and scope of the purge action for scenarios such as data spillage or malicious content remediation. Admins responsible for Teams and Exchange purge should review the updated documentation and existing processes, validate the behavior of the eDiscovery premium purge API, and make any related updates to internal organization process and documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/graph/api/security-ediscoverysearch-purgedata?view=graph-rest-1.0"
    }
  ],
  "EndDateTime": "2024-08-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC750663",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-29T21:58:00.553Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-21T22:56:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "eDiscovery - Graph API for purge enhancements to include Exchange items and expand purge limit from 10 to 100",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
