{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 8, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon, Microsoft Purview Insider Risk Management will be rolling out improvements to “Deleting of SharePoint files/ folders” indicators.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=388734\" target=\"_blank\">388734</a>.</p><p>\n</p><p><b>When this will happen:</b>\n</p><p>Public preview - We will begin rolling out late May 2024 (preview late April) and expect to complete by mid-June 2024 (previously mid-May).</p><p>General availability - We will begin rolling out mid-June 2024 (previously mid-May) and expect to complete by late June 2024 (previously late May).</p><p><b>How this will affect your organization:</b>\n</p><p>Today “Deleting of SharePoint files” and “Deleting of SharePoint folders” indicators include permanent file or folder deletion event operations FileDeleted and FolderDeleted. With this rollout, these indicators will also capture files/folders moved to the recycle bin (FileRecycled and FolderRecycled). So, you soon will see more activities being captured by these indicators.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required for this update. Based on activities volume and alert volume, you may want to consider tweaking the thresholds of respective indicators. \n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p></p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators#create-a-variant-of-a-built-in-indicator\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388734"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will soon update indicators for SharePoint files/folders deletion, including items moved to the recycle bin. Rollout begins late May 2024, with public preview and general availability phases. No action needed, but indicator thresholds may require adjustments. Details are on Microsoft 365 Roadmap ID 388734."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will soon update indicators for SharePoint files/folders deletion, including items moved to the recycle bin. Rollout begins late May 2024, with public preview and general availability phases. No action needed, but indicator thresholds may require adjustments. Details are on Microsoft 365 Roadmap ID 388734."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC750667",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-08T21:34:04.82Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-21T23:00:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Improvements to SharePoint files/folders deletion indicators",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
