{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 25, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>As previously communicated in MC525660 <i>(Updated) SharePoint: New List Templates with Approvals</i> (March 2023), we are expanding <i>Approvals</i> in lists in Microsoft SharePoint Online.\n</p><p>With this rollout, <i>Approvals</i> will soon be available in any list. Today, two list templates allow for approvals integration: content scheduler with approvals and travel requests with approvals. With this rollout, we're expanding the ability to enable or disable approvals on any list.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-May 2024 (previously mid-April) and expect to complete by late May 2024 (previously early May).\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late May 2024 (previously early May) and expect to complete by mid-June 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Users will be able to configure <i>Approvals</i> by going to the <i>Automate</i> dropdown from the command bar in SharePoint Online lists or in the Microsoft Lists app. Approvals will be actioned and available from Microsoft Teams. Note that disabling approvals will only hide the relevant columns and in-progress approvals will still be actionable in Teams. At any time, you can manually add approvals columns back into views.\n</p><p>After <i>Approvals</i> are enabled, a user can create a list item and submit it for approval. By creating an approval request and specifying the approver, the request will appear in the Approvals app in Teams or can be approved directly within the list. Once approved, the list item status is updated.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Inform your users of the new <i>Approvals</i> functionality for lists and include <a href=\"https://support.microsoft.com/office/approvals-in-lists-2bd0954d-5797-4be3-b78a-846f26338e17\" target=\"_blank\">Approvals in Lists - Microsoft Support</a> in your end-user documentation and support process. We will update this message when we have revised Approvals in Lists - Microsoft Support to reflect the rollout.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint is expanding Approvals to any list, allowing users to configure Approvals by going to the Automate dropdown from the command bar in SharePoint Online lists or in the Microsoft Lists app. The rollout will begin in mid-May 2024 for Targeted Release and late May for General Availability, with completion expected by early May and mid-June, respectively. Users can manually add approvals columns back into views at any time. Organizations should inform their users of the new functionality and include the Microsoft Support link in their end-user documentation and support process."
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC757613",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-25T22:56:10.66Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-26T23:36:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint: Add approvals to any SharePoint list",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
