{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to public preview, Microsoft Purview Insider Risk Management will be rolling out a policy deletion enhancement.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=171598\" target=\"_blank\">171598</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-May 2024 and expect to complete by mid-June 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>With this update, admins with appropriate permissions will be able to delete all associated alerts and users in scope when deleting a policy, to help quickly reset and remove inactive policies. Cases will not be impacted.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is needed to enable these features. \n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p></p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-policies\" target=\"_blank\">Create and manage insider risk management policies | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "171598"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will soon have a policy deletion enhancement allowing admins to delete all associated alerts and users in scope when deleting a policy. No action is needed to enable this feature. The update will roll out mid-May 2024 to mid-June 2024 for public preview and mid-July 2024 to late July 2024 for general availability worldwide. The solution can be accessed in the Microsoft Purview compliance portal. Learn more about creating and managing insider risk management policies on Microsoft Learn."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will soon have a policy deletion enhancement allowing admins to delete all associated alerts and users in scope when deleting a policy. No action is needed to enable this feature. The update will roll out mid-May 2024 to mid-June 2024 for public preview and mid-July 2024 to late July 2024 for general availability worldwide. The solution can be accessed in the Microsoft Purview compliance portal. Learn more about creating and managing insider risk management policies on Microsoft Learn."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-09-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC757609",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-03-26T23:32:03.943Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-26T23:31:43Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Public preview of policy deletion enhancement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
