{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Legacy Power BI apps, the versions of apps before the release of apps with audiences, will no longer be supported. We encourage you to upgrade or rebuild your Power BI apps using Power BI apps with audiences.</p><p><b>When this will happen:</b></p><p>May 1, 2024</p><p><b>How this will affect your organization:</b> \n</p><p>The new version of Power BI Apps includes changes on how you manage content, how you select Audience groups and content visibility. You can read about all the changes &amp; improvements <a href=\"https://learn.microsoft.com/power-bi/collaborate-share/service-create-distribute-apps#considerations-and-limitations\" target=\"_blank\">here</a>.&nbsp;</p><p><b>What you need to do to prepare:</b> \n</p><p>Power BI is not disabling or forcing an immediate upgrade of all apps to the new Power BI apps with audiences. However, starting May 1, 2024, technical support for legacy Power BI apps will cease. \n</p><p>We encourage you to embrace this change and upgrade to the new Power BI apps with audiences at your earliest convenience. This transition will ensure you and your app users continue to have access to the latest features and support from our team. You can read more details about the new version of Power BI Apps and how to upgrade <a href=\"https://powerbi.microsoft.com/blog/announcing-the-retirement-of-legacy-power-bi-apps-pre-audiences/\" target=\"_blank\">here</a>.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Legacy Power BI apps (pre-audiences) will no longer be supported after May 1, 2024. Users are encouraged to upgrade or rebuild their apps using Power BI apps with audiences. Technical support for legacy apps will cease after the deadline. Users can read about the changes and improvements in the new version of Power BI apps and how to upgrade in the provided link."
    },
    {
      "Name": "BlogLink",
      "Value": "https://powerbi.microsoft.com/blog/announcing-the-retirement-of-legacy-power-bi-apps-pre-audiences/"
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC752517",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-22T23:44:35.78Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-22T23:44:17Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Announcing the retirement of legacy Power BI Apps (pre-audiences)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
