{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 28, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: Microsoft Teams will be bringing Workflows powered by Microsoft Power Automate to the three-dot menu for files shared in Teams chat or channels.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=381643\" target=\"_blank\">381643</a>.</p><p><b>When this will happen:</b></p><p>Targeted release: We will begin rolling out late October 2024 (previously mid-October) and expect to complete by early November 2024 (previously late October).&nbsp;&nbsp;</p><p>\n</p><p>Worldwide: We will begin rolling out early November 2024 (previously late October) and expect to complete by late November 2024 (previously early November).\n</p><p>GCC: We will begin rolling out early December 2024 (previously late October) and expect to complete by mid-March 2025 (previously mid-February).</p><p><b>How this will affect your organization:</b>\n</p><p>To make sure Microsoft Teams provides the best workflow experience for our users, we are making it easier to configure and run workflows for files. A user will be able to select the three-dot menu on files shared in Teams chat or channels, and then choose <i>Workflows</i>. From <i>Workflows</i>, the user will choose an instant workflow to run on a file. The user must set up the workflows in advance. A user can set up a new workflow for files by selecting <i>See more workflows </i>at the bottom of the three-dot menu. This launches the Workflows task module, where a user can choose a template to start setting up a new workflow. Examples of file workflows include Request approval for selected file, Get notified in Teams when a file is updated, Create a PDF copy of the file, and Add a task for this file.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/094cab73-22b5-4535-8fed-0a7ca2ff9313\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>If the Power Automate app is disabled in the Teams admin center, users will not see this option in the three-dot menu.\n</p><p>This feature will only be available in the New Teams client on the desktop and on the web.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is needed from you to prepare for this rollout. You may want to notify your users about this change so they can find the new entry point for Workflows.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "381643"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"381643\":[{\"RoadmapId\":381643,\"Platform\":\"Web\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2024-10-30T11:11:50.4572276Z\",\"LatestRing\":\"TargetedRelease\"},{\"RoadmapId\":381643,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2025-02-11T10:16:03.9489234Z\",\"LatestRing\":null},{\"RoadmapId\":381643,\"Platform\":\"All\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2025-02-11T10:16:03.948924Z\",\"LatestRing\":\"TargetedRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon add Workflows powered by Microsoft Power Automate to the three-dot menu for files shared in chats or channels. The rollout will begin in late October 2024 and complete by mid-March 2025, depending on the release group. No action is required, but users should be informed."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-04-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC750668",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-28T19:42:27.277Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-21T23:01:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Access Workflows from the three-dot menu on shared file",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
