{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 4, 2024: We have updated the content below for clarification of the experience associated with this change. Thank you for your feedback.</p><p>We're making some changes to how items and files modified by a Power Automate flow or Power App display in SharePoint. In Classic Mode you will see a modified by \"Microsoft Power Platform\" on behalf of the user that caused the flow or app to create or modify an item or file. Additionally, in the columns \"App Created By\" or \"App Modified By\" you will also see \"Microsoft Power Platform\" in both current user interface as well as Classic Mode.</p><p><b>Note: </b>The columns \"Created By\" and \"Modified By\" are not changing as part of this updated experience, you will still see the user that triggered the flow or app process.</p><p><b>When this will happen:</b></p><p>We are targeting this rollout to begin mid-April 2024 to late April 2024.</p><p><b>How this will affect your organization:</b></p><p>User's may notice the new \"Microsoft Power Platform\" display name in their SharePoint files and lists.</p><p><b>What you need to do to prepare:</b></p><p>Inform users and site owners of the change in display.</p><p>Please review for additional information: <a href=\"https://learn.microsoft.com/connectors/sharepointonline/\" target=\"_blank\">Connectors - SharePoint</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Files and items modified by Power Automate or Power Apps in SharePoint will show as \"Microsoft Power Platform\" on behalf of the user. This change, starting mid to late April 2024, does not affect \"Created By\" and \"Modified By\" columns. Organizations should inform users about this update."
    }
  ],
  "EndDateTime": "2024-08-21T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC757614",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-05T00:01:39.41Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Power Automate in Microsoft 365"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-26T23:36:33Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Files and items will display as modified by \"Microsoft Power Platform\" on behalf of the user",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
