{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 19, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Beginning in mid-April, the Microsoft Copilot (formerly Bing Chat Enterprise) user interface (UI) will be updated to simplify the user experience. These UI updates are expected to be completed by early May.&nbsp;&nbsp;<br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jMdN?ver=9fd2\" style=\"width: 400px;\"><br></p><p>Microsoft Copilot UI updates include:<br></p><ul><li><b>Replacing the green “Protected” icon in the UI header with a green shield icon (located next to the user profile image): </b>When a user hovers over the shield (or presses on the icon from within a supported mobile application), they will see a flyout description with a link to more information: “<a href=\"https://learn.microsoft.com/copilot/privacy-and-protections#commercial-data-protection\" target=\"_blank\">Commercial data protection</a> applies to this chat. Use discretion when sharing personal and organizational data.”</li><li><b>Adding a persistent legal and data protection disclaimer, along with links for Terms, Privacy, and FAQs, underneath the chat prompt box (bottom of the UI): </b>“<a href=\"https://learn.microsoft.com/copilot/privacy-and-protections#commercial-data-protection\" target=\"_blank\">Commercial data protection</a> applies to this chat. <a href=\"https://aka.ms/BCETermsOfUse\" target=\"_blank\">Terms</a> | <a href=\"https://aka.ms/Copilot/Privacy\" target=\"_blank\">Privacy</a> | <a href=\"https://bing.com/new\" target=\"_blank\">FAQs</a>”.<ul><li>To simplify the UI, the following duplicative instances of these disclaimers or links will be removed:<ul><li>The green data protection disclaimer above the prompt box (“Your personal and company data are protected”).</li><li>The light-grey data protection disclaimer within the flow of Copilot chat (“Your personal and company data are protected”).</li><li>The legal disclaimer and Terms, Privacy, and FAQs links located underneath the sample prompts.</li></ul></li></ul></li><li><b>Adding a new AI accuracy disclaimer to the bottom of each chat: </b>A shield with a lock icon and disclaimer will be added at the bottom of each chat: “AI-generated content may be incorrect.”</li><li><b>Removing company branding/logo from the UI: </b>Users will no longer see their company's branding or logo as part of the Microsoft Copilot UI.</li><li><b>Replacing the chat style selector with a new Copilot settings toggle: </b>Users will be able to choose their preferred chat style, and if they want Bing Search turned on/off, from a new settings toggle located below the sample prompts. Future user settings in Copilot will be added to the settings toggle once available.</li></ul><p>The UI will update for the following Microsoft Copilot entry points:</p><ul><li>Copilot.microsoft.com</li><li>Copilot in Bing (bing.com/chat)</li><li>Copilot in Edge (sidebar)</li><li>Copilot in Windows</li><li>Mobile applications:<ul><li>Microsoft Copilot</li><li>Microsoft Edge</li><li>Microsoft Bing</li><li>Microsoft Start</li></ul></li></ul><p><b>When this will happen:</b><br></p><p>The Microsoft Copilot UI will begin updating in mid-April 2024 (previously late March). These updates are expected to be completed by early May 2024 (previously mid-April).\n</p><p>\n</p>\n\n<p></p>\n<p></p>\n<p><b>How this will affect your organization:</b><br></p><p>These are UI updates only--they do not impact Microsoft Copilot terms, privacy, or commercial data protection.</p><p><b>What you need to do to prepare:</b>\n</p><p>Some of the previous commercial data protection visuals cues in Microsoft Copilot will change or be removed with this UI update. </p><p>We recommend that you prepare your users by informing them of the UI updates. Users should look for the green shield next to their profile icon, or the persistent disclaimer underneath the prompt box, to recognize when they are using Copilot with commercial data protection.</p><p>Microsoft Copilot (formerly Bing Chat Enterprise) adoption materials are available here: <a href=\"https://aka.ms/Copilot/StarterKit\" target=\"_blank\">Copilot Starter Kit</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "151035"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot (formerly Bing Chat Enterprise) user interface (UI) will be updated to simplify the user experience. The updates include replacing the green “Protected” icon with a green shield icon, adding a persistent legal and data protection disclaimer, adding a new AI accuracy disclaimer, removing company branding/logo, and replacing the chat style selector with a new Copilot settings toggle. The UI updates are expected to be completed by early May 2024 and will not impact Microsoft Copilot terms, privacy, or commercial data protection. Users should look for the green shield next to their profile icon or the persistent disclaimer underneath the prompt box to recognize when they are using Copilot with commercial data protection."
    },
    {
      "Name": "Platforms",
      "Value": "Education, Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://aka.ms/Copilot/Docs"
    },
    {
      "Name": "HelpLink",
      "Value": "https://adoption.microsoft.com/copilot-commercial-data-protection/"
    }
  ],
  "EndDateTime": "2024-06-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC756004",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T16:59:23.09Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-26T01:45:36Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Updates to the Microsoft Copilot (formerly Bing Chat Enterprise) user interface",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
