{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to public preview, Microsoft Purview capabilities in Microsoft Copilot for Security introduces the ability to generate contextual summaries of a Communication Compliance policy match in the context of the conditions that flag the message.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=388752\" target=\"_blank\">388752</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early April 2024 and expect to complete by late April 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early June 2024 and expect to complete by late June 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Microsoft Purview capabilities in Copilot for Security introduces the ability to generate contextual summaries of individual Communication Compliance policy matches in the context of the conditions that flag the message as potentially risky. Investigators can more quickly identify potentially risky content and understand the meaning of the content with just one click. Users can ask additional open prompt questions for deeper insight into the message content.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1k39K?ver=030d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Microsoft Purview Communication Compliance provides the tools to help organizations detect business conduct and regulatory compliance violations (e.g. SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to help ensure user-level privacy.\n</p><p>You must have a Copilot for Security license configured for your tenant and give proper permissions to users who will leverage the Contextual Summary feature. </p><p>Permissions needed to access Copilot for Security:&nbsp;</p><ul><li>You can access the Communication Compliance solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>\n</li><li>You can access Communication Compliance policies to investigate and remediate policy matches.\n</li></ul><p><i>Learn more</i></p><ul><li>Learn about <a href=\"https://docs.microsoft.com/microsoft-365/compliance/communication-compliance?view=o365-worldwide\" target=\"_blank\">Communication Compliance</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/communication-compliance-investigate-remediate?view=o365-worldwide&amp;tabs=purview-portal#summarize-a-message-by-using-copilot-in-purview\" target=\"_blank\">Summarize a message by using Copilot in Purview</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388752"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Communication Compliance will introduce contextual summaries of policy matches in Copilot for Security. This feature will help investigators identify potentially risky content and understand the meaning of the content with just one click. Public preview will begin in early April 2024 and general availability worldwide will begin in early June 2024. Users must have a Copilot for Security license and proper permissions to use this feature. Microsoft Purview Communication Compliance provides tools to detect business conduct and regulatory compliance violations."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Communication Compliance will introduce contextual summaries of policy matches in Copilot for Security. This feature will help investigators identify potentially risky content and understand the meaning of the content with just one click. Public preview will begin in early April 2024 and general availability worldwide will begin in early June 2024. Users must have a Copilot for Security license and proper permissions to use this feature. Microsoft Purview Communication Compliance provides tools to detect business conduct and regulatory compliance violations."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-08-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC764458",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-01T23:39:51.563Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-01T23:39:17Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Communication Compliance: Contextual Summaries with Copilot for Security",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
