{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In February 2023, Microsoft Teams introduced a new robust way to create Webinars for all its users. The new webinar experience now allows for more powerful and controlled registration, additional email capabilities, smooth external presenter capabilities, access control, and so much more! Customers have shown great appreciation for the improvements we've made in the new webinar experience. Given that most of our Teams webinars users are now on this next version of webinars, we have decided to replace our existing feature of ‘Adding registrations to meetings” (for regular Teams meetings) with the new Webinar Experience.\n</p><p><b>When will this happen:</b>\n</p><p>We will be removing the “add registrations to meeting” feature from new meeting dialog box by June 30th, 2024. Users that want to use this feature will be directed to the new webinar ‘create’ experience.\n</p><p>Teams Admins will not be able to assign the “-AllowMeetingRegistration” to any new users.\n</p><p>Teams users that already have this policy will not be able to create any new ‘meetings with registration’ post June 30th, 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Going forward, any user who wants to create a webinar will do so using the new ‘Webinar’ meeting type. This can be found in the ‘New Meeting’ drop down in Teams Calendar.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may consider updating your internal documentation to mention that this feature is being replaced by a new way of creating webinars. You can find detailed documentation here:\n</p><ul><li><a href=\"https://support.microsoft.com/office/schedule-a-webinar-in-microsoft-teams-0719a9bd-07a0-47fd-8415-6c576860f36a\" target=\"_blank\">Schedule a webinar in Microsoft Teams - Microsoft Support</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will replace the 'Add registrations to meetings' feature with the new 'Webinar' meeting type. The change will take effect on June 30th, 2024. Teams Admins will not be able to assign the \"-AllowMeetingRegistration\" to any new users, and Teams users with this policy will not be able to create any new 'meetings with registration' post-June 30th, 2024. Users can create webinars using the new 'Webinar' meeting type, and may update their internal documentation accordingly. Detailed documentation is available on the Microsoft Support website."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://support.microsoft.com/en-us/office/schedule-a-webinar-in-microsoft-teams-0719a9bd-07a0-47fd-8415-6c576860f36a"
    }
  ],
  "EndDateTime": "2024-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC762511",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-03-30T16:25:57.767Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-30T16:25:41Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Upgrading Teams webinar users to new version",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
