{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>You're receiving this notification because you use the Log Analytics Agent to monitor your virtual machines (VMs) or servers.\n</p><p><b>When this will happen:</b>\n</p><p>On February 28, 2024, you received a notification from an Azure comms channel about the Log Analytics Agent retiring on August 31, 2024. No immediate action is expected for Microsoft Defender for Endpoint devices, which will continue to be supported after the Log Analytics Agent retires.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Cybersecurity industry best practices recommend upgrading to the latest available agent when possible. Check <a href=\"https://learn.microsoft.com/microsoft-365/security/defender-endpoint/update-agent-mma-windows?view=o365-worldwide\" target=\"_blank\">Update your agent on devices for Microsoft Defender for Endpoint | Microsoft Learn</a> to ensure your devices are running on the latest available Defender for Endpoint agent. Per our communication MC598631 (Updated) Upgrade to the latest version of the Windows Log Analytics / SCOM agent (MMA) by October 7th, 2023 (October 2023), some versions will cease to function as of 1 October 2024.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No immediate action is required related to the Log Analytics Agent retirement. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/azure/defender-for-cloud/prepare-deprecation-log-analytics-mma-agent\" target=\"_blank\">Prepare for retirement of the Log Analytics agent - Microsoft Defender for Cloud | Microsoft Learn</a> (March 13, 2024)\n</li><li><a href=\"https://learn.microsoft.com/azure/defender-for-cloud/prepare-deprecation-log-analytics-mma-agent\" target=\"_blank\">Log Analytics Installation options - Azure Monitor | Microsoft Learn</a>\n</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Endpoint will continue to be supported after the retirement of Log Analytics Agent on August 31, 2024. No immediate action is required, but it is recommended to upgrade to the latest available agent and versions will cease to function as of October 1, 2024. Notify admins and update documentation as appropriate. Learn more through provided links."
    }
  ],
  "EndDateTime": "2024-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC764457",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-01T23:38:57.563Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-01T23:38:44Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Endpoint: Support continues after Log Analytics Agent retires on August 31, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
