{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 28, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: Microsoft Purview Communication Compliance is introducing enhanced policy conditions that enable empowering precise detection, custom logic, and seamless testing for compliance needs.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=161829\" target=\"_blank\">161829</a>\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late April 2024 and expect to complete by mid-May 2024.\n</p><p>General Availability Worldwide: We will begin rolling out late May 2024 and expect to complete by late July 2024 (previously late June).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, three updates will enhance policy conditions in Communication Compliance:</p><ul><li>Our updated policy conditions enable the detection of messages sent and received to and from external email addresses, allowing you to identify specific instances of information being shared with external contacts.\n</li><li>With new support for the OR operator, you can combine multiple conditions in the same policy. This will help you to create compound conditions with AND, OR, and NOT operators to achieve complex scenarios for your unique compliance requirements.</li><li>To make policy creation and updates a seamless process, we are introducing the ability to test conditions before implementing them. By using sample messages, you can evaluate how your conditions will perform and fine-tune them to align with your compliance goals.\n</li></ul><p>The new condition features are in the same position in the Compliance Portal as before the rollout:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1k0Xd?ver=f3b3\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Microsoft Purview Communication Compliance provides the tools to help organizations detect business conduct and regulatory compliance violations (e.g. SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Communication Compliance solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p><a href=\"https://learn.microsoft.com/en-us/purview/communication-compliance?view=o365-worldwide\" target=\"_blank\">Learn about communication compliance | Microsoft Learn</a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "161829"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance will introduce enhanced policy conditions for precise detection, custom logic, and seamless testing. Public Preview begins late April 2024, with General Availability starting late May 2024. Updates include detection of external email communications, support for the OR operator, and condition testing before implementation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC765808",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-28T21:49:50.717Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-02T23:40:19Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Compliance portal: Enhanced policy conditions for Communication Compliance",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
