{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 1, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Whiteboard will provide the ability to @mention users from within a comment.&nbsp;<br></p><p>This message is associated with Microsoft 365 Roadmap IDs&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=164888\" target=\"_blank\">164888</a>&nbsp;and&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=164889\" target=\"_blank\">164889</a>.</p><p><b>When this will happen:</b></p><p>Worldwide: We will begin rolling out in mid-May 2024 (previously mid-April) and expect to complete by early June 2024 (previously early May).&nbsp;</p><p><b>How this will affect your organization:</b></p><p>When using Microsoft Whiteboard, users will be able to @mention other users within their tenant inside of a comment. The flow will look and feel similar to other Microsoft Office applications such as Word, Excel, and PowerPoint. The user will type an @ symbol followed by the name of the user they would like to @mention in the text of a comment.&nbsp;&nbsp;</p><p>If the @mentioned user is not actively using Whiteboard then they will be sent a notification via email and via the Microsoft Outlook notification bell. Inside of Whiteboard, the @mentioned user will see a blue @mention badge on the comment in which they are mentioned.&nbsp;&nbsp;</p><p>Additional things to note:&nbsp;</p><ul><li>Users will be shown a teaching callout within Whiteboard to inform them of the new @mention feature.&nbsp;&nbsp;</li><li>Similar to the blue @mention badge, users will see a new red badge on comments that will display the number of replies in that comment thread that they have yet to read.&nbsp;&nbsp;</li></ul><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "164888,164889"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Whiteboard will introduce @mentions in comments, allowing users to mention others within their tenant. This feature will start rolling out worldwide in mid-May 2024, with completion expected by early June 2024. Users will receive notifications via email and Outlook and see badges on comments for mentions and unread replies. No admin action is required for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC765810",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-01T21:39:56.1Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-02T23:41:26Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Whiteboard: @mentions in comments",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
