{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting on May 1, 2024, or soon after, we will be updating the Intune admin center’s left navigation menus to include the option to expand and collapse each subsection of the menu and the ability to favorite pages so admins can customize the experience best suited for their individual needs.</p><p><b>How this will affect your organization:</b></p><p>By default, the menu will be expanded to provide the same experience today. Admins will have the ability within <b>Settings </b>&gt; <b>Appearance + startup views</b> to collapse the menu as their default option. Additionally, selecting the star icon next to a page on the left nav will move it into a <b>Favorites</b> section near the top of the menu.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This is a user interface update only. No action is required, only awareness. Stay tuned to <a href=\"https://aka.ms/IntuneWN\" target=\"_blank\">What’s new in Intune</a> for the release.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Intune admin center will soon update to include collapsible navigation menus and a favorites feature. Starting May 1, 2024, admins can customize their experience by collapsing menu sections and favoriting pages. No action is needed, just awareness of the upcoming changes."
    }
  ],
  "EndDateTime": "2024-05-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC765813",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-02T23:43:44.047Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-02T23:43:35Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Coming soon: Collapsible navigation and favorites in the Intune admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
