{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Intune is introducing news ways to help protect organizations, drive productivity and simplify IT and Security operations with Microsoft Copilot.</p><p>Copilot in Intune, an embedded experience in Intune admin center, is available in public preview as of April 1, 2024.</p><p><b>How this will affect your organization:</b><br></p><p>Microsoft Copilot in Intune provides AI powered insights to resolve end user issues faster and ensure policies and settings are configured to optimize business outcomes. Currently, Copilot in Intune can help you with the following scenarios:</p><ul><li>Policy and setting management&nbsp;</li><li>Device details and troubleshooting </li></ul><p><b>What you need to do to prepare:</b><br></p><p>Copilot in Intune is powered by Microsoft Copilot for Security. To learn how to access Copilot capabilities in Microsoft Intune:</p><ul><li>Learn more about <a href=\"https://learn.microsoft.com/security-copilot/\" target=\"_blank\">Microsoft Copilot for Security</a>\n</li><li>Get started with <a href=\"https://learn.microsoft.com/security-copilot/get-started-security-copilot\" target=\"_blank\">Copilot for Security</a>\n</li><li>Learn about <a href=\"https://learn.microsoft.com/mem/intune/copilot/copilot-intune-overview\" target=\"_blank\">Copilot in Intune</a>\n</li></ul><p><b>Note</b>: If you are an Early Access customer for Copilot for Security, your program license will continue through the six-month duration from when you started. Your tenant admin has the option to migrate to the generally available product experience or remain on the early access product experience.\n</p><p>At the end of your six-month Early Access license, your Copilot for Security license will expire, and you will need to purchase Security Compute Units (SCUs) to continue using Copilot for Security.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot in Intune is now in public preview, offering AI insights for quicker issue resolution and optimized policy settings. It assists with policy management and device troubleshooting. Preparation involves learning about Microsoft Copilot for Security and starting with Copilot for Security and Copilot in Intune. Early Access customers must transition after six months."
    }
  ],
  "EndDateTime": "2024-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC767698",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-04T00:18:24.477Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-04T00:18:01Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot in Intune is available in Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
