{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 17, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Teams: Direct Media Connection is a new feature that will determine the media connection mode for meetings and 1:1 calls. We are adding a new admin control for admins to choose whether to involve a relay or media processor between meetings and 1:1 calls.\n</p><p>If Direct Media Connection is off, a relay or media processor will transfer the media between participants in meetings and calls. If Direct Media Connection is on, we will try not to include a relay or media processor between the participants in meetings and calls. (Infrequently, if end points are not compatible with setting up a direct connection, we use a relay or media processor.)\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (all environments): We will begin rolling out early April 2024 and expect to complete by late May 2024 (previously late April).\n</p><p><b>How this will affect your organization:</b>\n</p><p>The Teams client will check the Direct Media Connection setting at the call setup stage. If the setting is False, the Teams client media library will not share the local IP address to the peers, which will force the media connection to be established through a relay server or a media processor server. If the Setting is True, the local IP address will be shared to the peers as a direct connection for better media quality and lower bandwidth usage.</p><p>\n</p><p>Note that as the feature rolls out the default setting for direct media connection as enabled (“on”). The default being \"On\" means all paths will be enabled and customers have the capability to force relay for meetings from admin-controlled config. Although it is not advised as it can impact meeting’s reliability and quality. Direct Media Connection is a user-level policy that admins can set as a tenant default or configure for specific individuals in their tenant. Admins will implement this feature with PowerShell commands. To learn more: <a href=\"https://learn.microsoft.com/powershell/module/teams/get-csteamsmediaconnectivitypolicy?view=teams-ps\" target=\"_blank\">Get-CsTeamsMediaConnectivityPolicy (MicrosoftTeamsPowerShell) | Microsoft Learn</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce a new feature called Direct Media Connection in April 2024. Admins can choose to involve a relay or media processor between meetings and 1:1 calls. Direct Media Connection is a user-level policy that admins can set as a tenant default or configure for specific individuals in their tenant. The rollout will happen automatically, and no admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC761251",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T19:30:25.55Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-03-29T01:08:59Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Direct Media Connection cmdlet",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
