{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Goals: Check-In templates will allow team owners in Viva Goals to specify a template for check-ins in new teams that they manage.\n</p><p>When a goal owner on the team starts a check-in, the template will be applied automatically.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=375201\" target=\"_blank\">375201</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late April 2024 and expect to complete by late April 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Existing teams in a Viva Goals organization will have the feature turned off. Team owners can turn on the feature in <i>Team settings &gt; Check-ins &gt; Check-in note template.</i>\n</p><p>New teams will have the check-in template turned on by default. The template will ask for Highlights, Lowlights, and Learnings on each check-in.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This feature is turned on only for new teams, so communication to existing teams is not necessary unless you want to evangelize the feature.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to update any relevant documentation as appropriate.\n</p><p>To learn more about Microsoft’s own review of this product with its works councils, please consider reading: <a href=\"https://aka.ms/VivaGoalsWC\" target=\"_blank\">Viva Goals Works Council Approval at Microsoft</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "375201"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Goals will soon introduce custom check-in templates for new teams, with automatic application for goal owners. The feature will be available worldwide by late April 2024, and it will be enabled by default for new teams, but not for existing ones."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Goals will soon introduce custom check-in templates for new teams, with automatic application for goal owners. The feature will be available worldwide by late April 2024, and it will be enabled by default for new teams, but not for existing ones."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-06-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC775348",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-11T22:36:07.543Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-11T22:35:50Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Goals: Custom check-In templates for new teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
