{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With our new SharePoint brand center we are introducing the ability to use custom fonts to express your organization’s brand and creative expression in your Viva Connections Desktop experiences. Once the SharePoint brand center has been enabled in your organization, you will unlock the power of custom fonts within SharePoint and Viva Connections.</p><p> \n</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=374866\" target=\"_blank\">374866</a></p><p><b>When will this happen:</b>\n</p><p>Preview: we will begin rolling out in mid-April 2024 and expect to complete by June 2024.</p><p><b>How will this affect your organization</b>\n</p><p>The custom fonts feature for the SharePoint brand center enables the use of custom fonts within SharePoint and Viva Connections Desktop experiences.  Your organization’s designated brand manager will upload, create, and manage your organization’s brand assets, including organization fonts, in the brand center app making them available for use in the Change the Look experience to apply. \n</p><p>Brand managers, who are the site owners of the Brand center site, will upload and manage your organization fonts in the Brand fonts library of the SharePoint brand center app. After uploading and making a brand font visible for use the brand manager will be able to create custom font packages to utilize these fonts within SharePoint and Viva Connections Desktop.</p><p>  \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kIzB?ver=7716\" style=\"width: 400px;\"><br></p><p>A font package is a combination of two font families that will be applied to the experiences uniformly as designated by the brand manager using the font package creation tool. Microsoft provides a set of 8 font packages available for use with no need to configure a font package in the brand center app.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kFWi?ver=5f43\" style=\"width: 400px;\"><br></p><p>Microsoft provided default font packages:\n</p><ul><li>Microsoft default: Segoe UI\n</li><li>Amasis Pro\n</li><li>Aptos-Aptos Serif\n</li><li>Georgia Pro Condensed-Verdana Pro Condensed\n</li><li>Office: Aptos Display-Aptos\n</li><li>Sitka Heading-Sitka Text\n</li><li>Verdana Pro-Georgia Pro\n</li><li>Walbaum-Trade Gothic Next\n</li></ul><p><b>Note:</b> In multi-geo environments custom fonts and the brand center app are configured in the primary geo. Custom fonts will be available in any additional geo where SharePoint Organization Asset Libraries (OAL) are utilized and Public CDN is enabled. If there are no  OAL or public CDN in the geo, the custom fonts feature will not be enabled in the Change the Look experience for sites in that geo location.\n</p><p>Creating a custom font package in the SharePoint brand center app will enable the “From your organization” section of the Change the Look &gt; Font(preview) experience.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kDmR?ver=815c\" style=\"width: 300px;\"><br></p><p>With this initial preview custom fonts will be supported in the following:\n</p><ol><li>Welcome/Greeting text\n</li><li>Section Headings\n</li><li>Dashboard cards Level 1\n</li><li>Resources</li></ol><p>Over the coming months additional components will add support for custom fonts and will be communicated through the Message Center. \n</p><p><b>What you need to do to prepare</b></p><p>You may consider updating your training and documentation as appropriate.</p><p>To learn more about Multi-Geo, review:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/enterprise/multi-geo-capabilities-in-onedrive-and-sharepoint-online-in-microsoft-365?view=o365-worldwide\" target=\"_blank\">Multi-Geo Capabilities in OneDrive and SharePoint</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "374866"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva introduces custom fonts for SharePoint and Viva Connections Desktop, available in preview from mid-April to June 2024. The SharePoint brand center allows brand managers to upload and manage custom fonts, which can be applied across various elements within SharePoint and Viva Connections Desktop. Eight Microsoft-provided font packages are also available. Custom fonts are supported in multi-geo environments with specific configurations."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC778780",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-16T22:47:12.027Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-16T22:46:58Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Introducing custom fonts for SharePoint and Viva Connections Desktop preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
