{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 24, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Introducing two new Data Loss Prevention (DLP) Microsoft Exchange support predicates for DLP Policy tips and Oversharing popups features for Microsoft 365 E5 Compliance users: <i>Message contains</i> and <i>Attachment contains</i>. Unlike the broader <i>Content contains</i> DLP predicate that evaluated the entire email envelope, these new predicates are tailored for client-side evaluation of specific email components only (email body or attachments) and show DLP Policy tips and Oversharing popups accordingly in Microsoft Outlook Win32.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=376999\" target=\"_blank\">376999</a></p><p><b>When this will happen:</b></p><p>Public Preview:&nbsp;We will begin rolling out mid-April 2024 and expect to complete by late May 2024.</p><p>Standard Release: We will begin rolling out mid-September 2024 and expect to complete by late September 2024 (previously January 2025).</p><p><b>How this will affect your organization:</b>\n</p><p>You can now create new DLP Policies or edit existing policies to include Policy tip and Oversharing popup features support for these new focused <i>Message contains</i> and <i>Attachment contains</i> predicates.</p><p>For more information, the following resources are available:</p><ul><li><a href=\"https://learn.microsoft.com/purview/dlp-create-deploy-policy\" target=\"_blank\">Create and deploy a data loss prevention policy | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/dlp-ol365-win32-policy-tips\" target=\"_blank\">Data loss prevention policy tip reference for Outlook for Microsoft 365 | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/dlp-osp-get-started\" target=\"_blank\">Get started with oversharing pop ups | Microsoft Learn</a></li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "376999"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Data Loss Prevention on Outlook Win32 introduces two new predicates: 'Message contains' and 'Attachment contains' for client-side email evaluation. Rollout begins mid-April 2024, with standard release by late September 2024. No admin action needed; users can create or edit DLP Policies accordingly. Roadmap ID 376999."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC779849",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-24T22:34:57.357Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-18T00:29:20Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Oversharing popups enhancements on Microsoft Outlook Win32",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
