{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the Public Preview of solution-aware cloud flow sharing limits for Power Platform Managed Environments. This feature gives users the ability to turn sharing on and off at the managed environment level and provides a sharing rule that can be applied to entire environment groups.<br><br><b>How does this affect me?</b><br>Solution-aware cloud flow sharing limits give admins the ability to specify which user(s) or group(s) are allowed to share data, and which data is allowed to be shared.<br><br>Sharing limits can be set at the managed environment level, meaning these limits would apply to all solution-aware cloud flows within that environment. Sharing limits can also be applied to an entire environment group, allowing admins to easily manage sharing across multiple environments.<br><br><b>What do I need to do to prepare? </b><br>For additional information, please refer to the following documentation:<ul><li><a href=\" https://aka.ms/ADO6946/1\">Limit sharing of solution cloud flows in Managed Environments.</a></li><li>Learn more about <a href=\" https://aka.ms/ADO6946/2\">Managed Environments.</a></li><li>Learn how to <a href=\" https://aka.ms/ADO6946/3\">Enable Managed Environments.</a></li><li>Learn how to <a href=\" https://aka.ms/ADO6946/4\">Streamline governance with environment groups.</a>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-05-17T17:54:27Z",
  "HasAttachments": false,
  "Id": "MC779536",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-17T18:03:04.05Z",
  "Services": [
    "Dynamics 365 Apps",
    "Power Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-17T17:54:27Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Platform - Public Preview of solution-aware cloud flow sharing limits in Managed Environments",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
