{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As announced in MC541158 (April 2023) the Azure Information Protection (AIP) Unified Labeling add-in for Office is retired on April 11th, 2024.\n</p><p><b>When this will happen:</b>\n</p><p>Important retirement milestones are:\n</p><ul><li>April 11th, 2024 - New Client: Release of the Microsoft Purview Information Protection client for preview on the Microsoft Download Center. This client version 3.0 does not include the AIP Add-in for Office. To continue using the Information Protection Scanner, Viewer and File Labeler, your organization must upgrade and deploy the new client package.\n</li><li>April 11th, 2024 - Previous Client: AIP Unified Labeling add-in is retired and no longer in support. Extensions to continue using the AIP add-in are granted on a case-to-case basis; please reach out to Microsoft Support or your account team.\n</li><li>May 2024: AIP Unified Labeling add-in permanently disabled in Office. AIP Unified Labeling add-in for Office clients will be blocked from using the add-in and download of label policy will fail for all clients without extensions.\n</li></ul><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because your organization owns one or more licenses for Azure Information Protection. To continue using sensitivity labels powered by Microsoft Purview Information Protection in Office applications, you must transition to the built-in labeling experience in Microsoft 365 Apps.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>For detailed migration steps, refer to our playbook: <a href=\"https://aka.ms/AIP2MIP/HowTo/GetStarted\" target=\"_blank\">From bolt-on to built-in – Migrate from Azure Information Protection Add-in</a>.\n</p><p>For the announcement and FAQs of the retirement, refer to our blog: <a href=\"https://aka.ms/AIPRetireBlog\" target=\"_blank\">Retirement notification for the Azure Information Protection Unified Labeling add-in for Office</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Azure Information Protection (AIP) Unified Labeling add-in for Office is retiring on April 11th, 2024. Organizations must transition to the Microsoft Purview Information Protection client for continued support. Important dates include the release of a new client and the permanent disabling of the AIP add-in in May 2024. Organizations should refer to the provided playbook and blog for migration steps and details."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/azure/information-protection/rms-client/unifiedlabelingclient-version-release-history"
    }
  ],
  "EndDateTime": "2024-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC775357",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-11T22:40:20.883Z",
  "Services": [
    "Microsoft 365 suite",
    "Azure Information Protection"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-11T22:39:43Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Reminder: Azure Information Protection Add-in for Office is retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
