{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re introducing new branding and management capabilities that you can use to improve consistency across your sites and pages. \n</p><p>Our new SharePoint brand center will create a centralized branding management application that will empower your brand managers or designated users to empower site owners to create and manage the brand assets needed to customize SharePoint and Viva Connections.</p><p> \n</p><p>This change is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=124838\" target=\"_blank\">124838</a></p><p><b>When will this happen:</b>\n</p><p>Preview: we will begin rolling out in mid-April 2024 and expect to complete by June 2024.</p><p><b>How will this affect your organization</b>\n</p><p>The new SharePoint brand center will unlock the ability to manage your organization’s brand assets in a single location. \n</p><p>To enable the new brand center the global administrator will need to perform a set of simple steps in the Microsoft 365 admin center to create/activate the Brand center app. The brand center app requires the use of Public CDN. \n</p><p>The brand center administrative experience will identify the site containing your organization’s current organization asset libraries if utilized and use this site as the basis for your brand center.  If you are not using the organization asset library feature, we will prompt you to create a new site to be identified as your brand center. \n</p><p>Once you enable the enable the SharePoint brand center for your organization, this will enable the custom fonts feature to be utilized within SharePoint and Viva Connections. See more in the Message Center post for Custom Fonts. \n</p><p>To enable the SharePoint brand center the global administrator will need to perform a few simple steps in the Microsoft 365 admin center to create/activate the Brand center app. \n</p><p>The steps required depend on your current tenant configuration. \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kFWj?ver=da18\" style=\"width: 400px;\"><br></p><p><i>Option 1:</i> Your tenant does not currently utilize the SharePoint Organization Assets feature. \n</p><p>For this scenario, the global administrator will need to perform the following steps to create the Brand center app. \n</p><ol><li>In the admin center, go to Settings &gt; Org settings. \n</li><li>Select Brand center (preview).\n</li><li>Choose site name for the Brand Center site – Suggested “Brand Guide”. \n</li><li>Read and give consent to the use of Public CDN in your tenant for the Brand center. \n</li><li>Create the site and configure Public CDN in your tenant. \n</li><li>Add site owners to the Brand center site you created and share the link to the site to those owners to unlock the Brand center app. \n</li></ol><p><i>Option 2:</i> Your tenant uses the SharePoint Organization Assets feature with Private CDN. \n</p><p>For this scenario, the global administrator will need to perform the following steps to create the Brand center app. \n</p><ol><li>In the admin center, go to Settings &gt; Org settings.\n</li><li>Select Brand center (preview).\n</li><li>The Brand center recognizes your existing organization assets site location and will utilize this as the location for the Brand center app. \n</li><li>Read and give consent to the use of Public CDN in your tenant for the Brand center.\n</li><li>Activate Public CDN in your tenant. \n</li><li>Copy and share the link to the Brand center site/app to your site owners to unlock the Brand center app. \n</li></ol><p><i>Option 3:</i> Your tenant uses the SharePoint Organization Assets feature with Public CDN. \n</p><p>For this scenario, the global administrator will need to perform the following steps to create the Brand center app. \n</p><ol><li>In the admin center, go to Settings &gt; Org settings. \n</li><li>Select Brand center (preview). \n</li><li>The Brand center recognizes your existing organization assets site location and will utilize this as the location for the Brand center app. \n</li><li>Activate the Brand center app for your organization. \n</li><li>Copy and share the link to the Brand center site/app to your site owners to unlock the Brand center app. \n</li></ol><p>Once you have completed the setup of your SharePoint brand center, you can manage access to the brand center app by customizing the site permissions of the brand center site.  Site owners will have access to the brand center app. \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kIzF?ver=ba4c\" style=\"width: 400px;\"></p><p>Copy and share the link to the Brand center site/app to your site owners to unlock your brand asset management for your organization. \n</p><p><b>What you need to do to prepare</b>\n</p><p>Take the appropriate steps to ensure the experience is configured for your organization.</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "124838"
    },
    {
      "Name": "Summary",
      "Value": "The new SharePoint Brand Center, rolling out from mid-April to June 2024, offers centralized management of brand assets across sites and pages. Global administrators need to activate the Brand Center app in the Microsoft 365 admin center, which requires Public CDN use. Steps vary based on current tenant configuration."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC778783",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-16T22:48:54.597Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-16T22:48:39Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "SharePoint: Manage your organization’s brand in the new brand center preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
