{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 2, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are reducing the length of Microsoft Teams meeting URLs for easier sharing. This rollout applies to all Microsoft Teams platforms (Teams for iOS, Android, Mac, Teams devices, desktop, and web).&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=381953\" target=\"_blank\">381953</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-February 2025 (previously mid-January) and expect to complete by late February 2025 (previously late January).\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-February 2025 (previously mid-February) and expect to complete by late February 2025 (previously late March).\n</p><p>General Availability (GCC High, DoD): We will begin rolling out early April 2025 (previously early December) and expect to complete by late April 2025 (previously mid-January).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Longer URLs for meetings scheduled before the rollout will continue to work. The new URL syntax is: https://teams.microsoft.com/meet/&lt;meeting_id&gt;?p=&lt;HashedPasscode&gt;\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may want to check if you have any integrations that use parameters from URL. After the rollout, the URL will only contain the meeting ID. Parameters such as tenant ID, organizer ID, conversation ID and message ID will not be in the URL.\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "381953"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams meeting URLs are being shortened for easier sharing across all platforms, with a new URL syntax introduced. Rollout dates have been updated, starting mid-February 2025 for Targeted Release and for General Availability. No admin action is required, but integrations using URL parameters may need adjustments."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC772556",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-03T22:21:31.447Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-08T23:33:52Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Shorter meeting URLs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
