{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon in Microsoft Teams: We are rolling out an enhancement to the annotations feature in Microsoft Teams that will allow screen sharers to interact with underlying content without stopping the existing annotation session.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=127900\" target=\"_blank\">127900</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out in early May 2024 and expect to complete by late May 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, presenters who are annotating during a screen-sharing meeting can interact with their own content and the annotation session will continue. Before the rollout, the annotations session would end if presenters interacted with other content on their screen (other apps and websites) during the session.\nThis message applies to new Teams for the web and Teams for desktop. It does not apply to Teams for iOS or Android.\n</p><p>When a presenter shares their screen in Teams meetings and select <a href=\"https://support.microsoft.com/office/use-annotation-while-sharing-your-screen-in-microsoft-teams-876ba527-7112-437e-b410-5aec7363c473\" target=\"_blank\">Start annotation</a> in the presenter toolbar, they will see a new button called <i>Interacting with background</i> in the annotations toolbar that allows them to interact with other content on their screen (other apps and websites) without stopping the existing annotation session.\n</p><p>Try <i>Interacting with background</i> to interact with content like websites and other apps during an annotations session in a Teams meeting:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kiez?ver=a282\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>While you interact with content like websites and other apps, annotations in the meeting are hidden. Select any annotation tool (like the laser pointer or inking tools) to return to the annotation session:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kieB?ver=be13\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-annotation-while-sharing-your-screen-in-microsoft-teams-876ba527-7112-437e-b410-5aec7363c473\" target=\"_blank\">Use annotation while sharing your screen in Microsoft Teams - Microsoft Support</a> (We will update this comm before rollout with revised documentation)\n</p><p>Watch: <a href=\"https://youtu.be/RpOCxz4woPA\" target=\"_blank\">How to use Collaborative Annotations in a Microsoft Teams meeting</a> (2022)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "127900"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is enhancing the annotations feature to allow interaction with apps and websites during screen-sharing sessions without ending the annotation. Rollout begins early May 2024, with completion by late May. No admin action needed; users should be informed of the update."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is enhancing the annotations feature to allow interaction with apps and websites during screen-sharing sessions without ending the annotation. Rollout begins early May 2024, with completion by late May. No admin action needed; users should be informed of the update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-10-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC772554",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-08T23:32:35.91Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-08T23:32:19Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Access other apps and websites while using annotations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
