{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, collaborative annotations enable meeting participants with the presenter role to enable annotations after sharing their screen. This allows everyone in the meeting to draw, add a note, react, highlight text, and more to share their thoughts right on the content, live with everyone else. Participants sharing their screen will have the ability to save content with collaborative annotations as a Microsoft Whiteboard, enabling all meeting participants to revisit this content and continue collaborating after the meeting.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=109573\" target=\"_blank\">109573</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out in late May 2024 and expect to complete by late June 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Saving meeting content with collaborative annotations as a Whiteboard is available on desktop (Microsoft Windows and Mac). When users who share their screen in Teams meetings and select <i>Start annotation</i> in the presenter toolbar, they will see a new <i>Save </i>button in the Whiteboard toolbar that will allow users to capture all annotations from the meeting in one Whiteboard file.&nbsp;</p><p>Capture your annotations and view them in the Whiteboard:&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kgyD?ver=086d\" style=\"width: 400px;\"></p><p>View all your saved snapshots from the meeting in a Whiteboard:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kdZv?ver=2375\" style=\"width: 400px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.&nbsp;</p><p>Learn more:<a href=\"https://support.microsoft.com/office/use-annotation-while-sharing-your-screen-in-microsoft-teams-876ba527-7112-437e-b410-5aec7363c473\" target=\"_blank\"> Use annotation while sharing your screen in Microsoft Teams - Microsoft Support </a>(We will update this comm before rollout with revised documentation)</p><p>Watch: <a href=\"https://youtu.be/RpOCxz4woPA\" target=\"_blank\">How to use Collaborative Annotations in a Microsoft Teams meeting</a> (2022)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "109573"
    },
    {
      "Name": "Summary",
      "Value": "In Microsoft Teams, presenters can enable annotations during screen sharing, allowing all participants to collaborate live. Meeting content with annotations can be saved as a Microsoft Whiteboard, accessible for continued collaboration post-meeting. Rollout begins late May 2024, with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-12-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC775345",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-11T22:33:19.243Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-11T22:33:03Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Save meeting content with collaborative annotations as a Microsoft Whiteboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
