{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 1, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are rolling out a change to Microsoft Teams meetings recordings, which will be saved by default to the meeting organizer's Microsoft OneDrive account. (Now, meeting recordings are saved to the OneDrive account for the person who initiates the recording.)\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=116251\" target=\"_blank\">116251</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General\nAvailability (Worldwide): We will begin rolling out early June 2024 (previously mid-May) and expect to complete by mid-June 2024 (previously late May).\n</p><p>General Availability (GCC): We will begin rolling out mid-June 2024 and expect to complete by late June 2024.\n</p><p>General Availability (GCC High): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.\n</p><p>General Availability (DoD): We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This rollout will ensure recordings are governed by the organizer's meeting setup and policies, like other meeting artifacts (meeting invitation, transcript, and so on). If the organizer does not have OneDrive provisioned, the OneDrive account is out of capacity, or the recording fails to upload successfully, the recording will be accessible from the recording link in the meeting chat (current behavior for these cases).\n</p><p>This rollout will also be supported by the PowerShell user-level policy <code>TeamsRecordingRollOutPolicy</code> that admins can use for special situations to continue to save recordings in the recoding initiator's OneDrive account. For example, when existing workflows need to be migrated or when Teams accounts have delegate permissions, and so on.\n</p><p>This rollout will not have any significant end user impact. From an IT admin perspective, the rollout will drive better compliance and may need some oversight because the change is desirable.\n</p><p><b>What you need to do to prepare:</b></p><p>To temporarily override this rollout, use the PowerShell policy <code>TeamsRecordingRollOutPolicy</code>. Three months after the rollout, we will stop honoring the override policy, to ensure consistent storage.\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>We will update this comm before rollout with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "116251"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams meeting recordings will now be saved to the organizer's OneDrive by default, with rollout dates varying from early June to late August 2024, depending on the service availability. Admins can use PowerShell policy 'TeamsRecordingRollOutPolicy' for special cases. No significant user impact is expected, but admins may need to update documentation."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams meeting recordings will now be saved to the organizer's OneDrive by default, with rollout dates varying from early June to late August 2024, depending on the service availability. Admins can use PowerShell policy 'TeamsRecordingRollOutPolicy' for special cases. No significant user impact is expected, but admins may need to update documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-10-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC772558",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-01T21:33:55.09Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-08T23:36:14Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Meeting recordings are now saved in organizer's Microsoft OneDrive",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
