{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: Admins can configure whether they want to expire insider risk levels in adaptive protection when a user’s alert is dismissed, or their case is resolved.</p><p>\n\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=388736\" target=\"_blank\">388736</a></p>\n\n\n<p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out in early May 2024 and expect to complete by late June 2024.</p><p>General Availability: We will begin rolling out early July 2024 and expect to complete by late September 2024 (previously late August).</p>\n\n<p><b>How this will affect your organization:</b></p><p>With this new feature, an admin can configure whether they want to expire insider risk levels in adaptive protection when a user's alert is dismissed, or their case is closed. Today, this expiration happens automatically.</p>\n\n<p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.&nbsp;</p>\n\n<p><b>What you need to do to prepare:</b></p>\n\n<p>With this update, admins will see a new option in the Risk levels tab for adaptive protection called <i>Risk level expiration</i> options. This setting is enabled by default, and admins can uncheck this box if they would prefer that risk levels do not expire even when a user's alert is dismissed or their case is closed.&nbsp;</p>\n\n<p>Additional Resources:&nbsp;</p><ul><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-adaptive-protection?tabs=purview-portal\" target=\"_blank\">Help dynamically mitigate risks with adaptive protection (preview) | Microsoft Learn</a>&nbsp;&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388736"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing enhancements to risk level settings, allowing admins to configure the expiration of insider risk levels in adaptive protection. Rollout begins May 2024 for Public Preview and July 2024 for General Availability, with updates completed by September 2024. Roadmap ID: 388736."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC789307",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-11T00:39:17.367Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-30T23:37:51Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Adaptive protection - Enhancements to risk level settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
