{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon in Microsoft Outlook and Microsoft Teams: We are introducing a new meeting response option called <i>Follow</i> that allows people invited to a meeting to let the organizer know they can't attend but would like to stay informed. <i>Follow</i> goes beyond the traditional <i>Accept, Tentative,</i> and <i>Decline</i> responses. <i>Follow</i> is for busy individuals with high meeting loads and conflicting meetings. <i>Follow</i> is the ideal meeting response option when you can't attend a meeting but still want to stay engaged and have access to post-meeting information in Teams. Meeting attendees can respond with <i>Follow</i> in the new Outlook for Windows and Outlook on the Web. Follow is not available on Outlook for Mac or Outlook Mobile at this time. Additional <i>Follow</i> features in Teams for meeting organizers are shown in the screenshots in this message.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=154557\" target=\"_blank\">154557</a>.\n</p><p><b>When this will happen:</b>\n</p><p> </p><p>Targeted Release: We will begin rolling out late April 2024 and expect to complete by late May 2024.\n</p><p>General Availability: We will begin rolling out early June 2024 and expect to complete by early July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Meeting attendees can respond with Follow to any meeting invitation as long as the meeting has more than two attendees and where the organizer has requested a response.\n</p><p><i>Follow</i> responses will:\n</p><ol><li>Inform organizers: <i>Follow</i> will let the meeting organizer know you can't attend but want to stay engaged and have access to post-meeting information.\n</li><li>Free up time: <i>Follow</i> will mark the meeting on your calendar as free so you can better prioritize your time. You will still retain access to the meeting and chat.\n</li><li>Stay informed: <i>Follow</i> will remind meeting organizers to record and take collaborative notes during the meeting. You will receive a notification that the recap is available after the meeting (this feature will be available shortly after the GA rollout).\n</li></ol><p>After rollout, invitation response options will be <i>Yes, No,</i> and <i>Follow. Maybe</i> will be accessible through the three-dot menu.\n</p><p>Meeting invitation email with new <i>Follow</i> option (Outlook for Windows and Outlook for web):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kOWp?ver=70e7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Meeting organizer's view of invitees who respond with <i>Follow</i> (Outlook for Windows and Outlook for web)\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kRjv?ver=06c5\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Reminder to the meeting organizer at the start of the meeting about people following the meeting (Outlook for Windows and Outlook for web):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kOWq?ver=e4ff\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Note: After rollout, <i>Follow</i> responses are only available in new Outlook for Windows and Outlook on the web. If meeting organizers are using either of these Outlook versions, they will see <i>Follow</i> responses. However, if the meeting organizer is using classic Outlook for Windows, Outlook for Mac, or Outlook Mobile, the meeting organizer will see the response as <i>Tentative</i>, with a note that the invitee is following the meeting:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kRjt?ver=395f\" alt=\"user controls\" style=\"width: 400px;\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Support for users: <a href=\"https://support.microsoft.com/office/follow-a-meeting-in-outlook-4dd196ec-b4ae-4fca-9577-cb9c297723be\" target=\"_blank\">Follow a meeting in Outlook - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "154557"
    },
    {
      "Name": "Summary",
      "Value": "Outlook and Teams are introducing a new meeting response called 'Follow' for attendees who can't attend but want to stay informed. It's rolling out from late April 2024 to early July 2024, initially in the new Outlook for Windows and the web, not on Mac or mobile. Organizers will be notified of 'Follow' responses, and users will be marked as free but kept in the loop."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC786325",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-26T00:13:26.667Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T00:13:00Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook and Microsoft Teams: Respond to meetings with Follow",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
