{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: A new policy for IT admis to restrict permissions to download new meeting transcript files (stored in Microsoft OneDrive) for all users in the tenant. Admins can exempt people from the policy who are members of specified security groups such as governance or compliance specialists who require download access to meeting transcripts. This rollout applies to Teams for Mac and Teams for desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=332800\" target=\"_blank\">332800</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-May 2024 and expect to complete by late May 2024.\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late May 2024 and expect to complete by early June 2024.\n</p><p>General Availability (GCC High): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.\n</p><p>General Availability (DoD): We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>We will also update the default transcript permissions. After the rollout, when the new policy is not applied, only transcript owners (recording initiator or meeting organizer) will have permission to download or delete the transcript file, and meeting participants can only view the transcript in Teams or Microsoft Stream. Regardless of whether the new policy is applied, the meeting organizer will be able to select in Stream the participants who are restricted from downloading, viewing, and editing the transcript in Stream.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/MicrosoftTeams/block-download-meeting-recording\" target=\"_blank\">Block the download of Teams meeting recording files from SharePoint or OneDrive - Microsoft Teams | Microsoft Learn</a> (We will update this comm before rollout with revised documentation.)</p>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "332800"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"332800\":[{\"RoadmapId\":332800,\"Platform\":\"Mac\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-04-20T05:33:09.8584795Z\",\"LatestRing\":null},{\"RoadmapId\":332800,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-04-20T05:33:09.8584797Z\",\"LatestRing\":null},{\"RoadmapId\":332800,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-04-20T05:33:09.85848Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a tenant-wide policy to control permissions for downloading meeting transcripts, with IT admins able to exempt certain security group members. The rollout begins mid-May 2024 for Targeted Release and extends to General Availability in various stages through August 2024. Default transcript permissions will also be updated post-rollout."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a tenant-wide policy to control permissions for downloading meeting transcripts, with IT admins able to exempt certain security group members. The rollout begins mid-May 2024 for Targeted Release and extends to General Availability in various stages through August 2024. Default transcript permissions will also be updated post-rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-10-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC781595",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T22:13:12.49Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-19T22:12:58Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Tenant-wide policy for permission to download meeting transcription",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
