{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon in public preview for Microsoft Purview compliance portal | Insider Risk Management: Policy tuning analysis provides admins with a real-time prediction of the number of users in a tenant that could potentially match a given set of policy conditions. With this update, policy tuning analysis will support insider risk policies that are scoped for priority content.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=378409\" target=\"_blank\">378409</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-May 2024 and expect to complete by late May 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With this rollout, admins can use real-time analytics for policies that are scoped for priority content to help predict the number of users that could potentially match a given set of policy conditions. This feature enables admins to quickly adjust the selection of indicators and thresholds of activity occurrence so you can efficiently translate your insider risk strategies into pragmatic controls and avoid too few or too many alerts.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c5ae53b0-c14c-464f-b713-14aaf559f9b8\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To use this feature, admins will need to enable <i>Analytics</i> in Insider risk management &gt; Settings. After <i>Analytics</i> is enabled and insights are populated, admins will be able to see real-time predictions in policies that are scoped to all users/groups and scored only for priority content.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal.</a>\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators?tabs=purview-portal#use-real-time-analytics-recommendations-to-set-thresholds\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "378409"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing a policy tuning analysis for priority content policies in public preview mid-May 2024. This feature predicts the number of users matching policy conditions, aiding admins in adjusting controls to manage insider risks effectively. Rollout will be automatic with no required admin action before the specified date."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC786326",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-06T16:40:22.3Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T00:13:48Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Policy tuning analysis for priority content only policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
