{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 3, 2024: Organizational messages is now generally available to commercial customers worldwide. Please note that your IT admins or others who work with Microsoft Intune must enable all organizational messages policy requirements.</p><p>Learn more about organizational messages general availability here: <a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/announcing-general-availability-of-organizational-messages-in-the-microsoft-365-/4303367?previewMessage=true\" target=\"_blank\">Announcing general availability of organizational messages in the Microsoft 365 admin center | Microsoft Community Hub</a></p><p>Learn more about setup requirements here: <a href=\"https://learn.microsoft.com/microsoft-365/admin/misc/organizational-messages-microsoft-365?view=o365-worldwide#setup-requirements\" target=\"_blank\">Organizational messages in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a></p><p> Coming soon for Microsoft 365 admin center: Organizational messages (preview) that will enable you to create and deliver short-form communications to people in your organization through the Microsoft products they use every day, like Microsoft Windows 11 or Microsoft 365 apps.\n</p><p>Important note about licenses: Organizational messages preview features will not be restricted based on the licenses held by participating tenants, authors, approvers, or message recipients. However, some organizational messages features may be restricted to particular Microsoft licenses in the future.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=392847\" target=\"_blank\">392847</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early May 2024 and expect to complete by late May 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out in mid-November 2024 and expect to complete by mid-December 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Organizational messages will be found in the Microsoft 365 admin center &gt; <i>Reports</i> and will include features for admins like central management of your tenant’s organizational messages, free-form creation of new messages, an approval workflow, message scheduling and configuration, group-based targeting, and message delivery reporting.\n</p><p>Organizational messages management in the Microsoft 365 admin center&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l5As?ver=988c\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>The creation process for organizational messages:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l3bd?ver=9789\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>An example of an organizational message configured for the Windows 11 notifications area:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l3bc?ver=fb98\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To start working with organizational messages, make sure your team satisfies these requirements:\n</p><ul><li>Tenant: Ensure your IT admins or others who work with Microsoft Intune enable all organizational messages policy requirements. Learn more: <a href=\"https://aka.ms/organizational-messages-prereqs\" target=\"_blank\">Prerequisites for organizational messages | Microsoft Learn</a>\n</li><li>Authors: Anyone in your organization who wants to create organizational messages must have one of these admin roles assigned to them in the Microsoft 365 admin center:\n</li><ul><li><a href=\"https://learn.microsoft.com/entra/identity/role-based-access-control/permissions-reference#global-administrator\" target=\"_blank\">Global Administrator</a>\n</li><li><a href=\"https://learn.microsoft.com/entra/identity/role-based-access-control/permissions-reference#organizational-messages-writer\" target=\"_blank\">Organizational Messages Writer</a>\n</li></ul><li>Approvers: Anyone in your organization who will be designated as a responsible party for approving organizational messages must have one of these admin roles assigned to them in the Microsoft 365 admin center:\n<ul><li><a href=\"https://learn.microsoft.com/entra/identity/role-based-access-control/permissions-reference#global-administrator\" target=\"_blank\">Global Administrator</a>\n</li><li><a href=\"https://learn.microsoft.com/entra/identity/role-based-access-control/permissions-reference#organizational-messages-approver\" target=\"_blank\">Organizational Messages Approver</a>\n</li></ul></li><li>Message recipients: Anyone in your organization who will receive organizational messages from your authors must have access to the Microsoft products in which these messages are configured to be delivered. (End users are not required to have any admin roles to receive organizational messages.)\n<ul><li>For example, a message configured to be delivered to a Windows channel, like Windows Spotlight, requires that recipients use Windows 11 Enterprise.\n</li></ul></li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p>Learn more\n</p><ul><li><a href=\"https://aka.ms/org-messages-docs\" target=\"_blank\">Organizational messages in the Microsoft 365 admin center | Microsoft Learn</a>\n</li><li><a href=\"https://aka.ms/org-messages-blog\" target=\"_blank\">Introducing organizational messages (preview) in the Microsoft 365 admin center</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "392847"
    },
    {
      "Name": "Summary",
      "Value": "The message announces the general availability of Organizational messages in the Microsoft 365 admin center for commercial customers worldwide. IT admins must enable policy requirements, and features include central management, message creation, scheduling, targeting, and delivery reporting. The rollout is automatic, with no admin action needed before the specified date."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC789803",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-03T23:15:57.74Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-02T18:26:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: Organizational messages (Preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
