{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Defender for office 365 Services now allows the execution of several response actions simultaneously through the Take action wizard in Threat Explorer/ Realtime detection.</p>\n\n<p>Many Security analyst teams use Threat explorer to execute bulk email remediation actions, and we’re enhancing this capability with an improved Take action feature. This feature facilitates a more streamlined and efficient remediation of threats.</p><p>With the new Take action wizard, you can perform multiple actions such as purging emails, inline submissions, triggering investigations, and Tenant level block actions together with a single wizard up to 100 messages.  Moreover, you can take Tenant level block URL/file actions directly from Threat explorer. </p>\n\n<p>Alternatively, if you want to perform bulk email remediation for more than 100, this new wizard will enable you to do that in an organized manner. </p>\n\n<p>Some of the actions are not available based on the current location of the message, but if there is a conflict, the new experience gives more options and power through toggle. SecOps can use toggle choices to turn them on/off as desired and take proper action.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=393937\" target=\"_blank\">393937</a></p>\n\n<p><b>When this will happen:</b></p>\n\n<p>General Availability (Worldwide): Rollout began in mid-April 2024 and expect to complete by late June 2024.</p><p>General Availability (GCC): We will begin rolling out mid-May 2024 and expect to complete by late June 2024.</p><p><b>How this will affect your organization:</b></p>\n\n<p> If you are part of the Security Operations team and use Microsoft defender for Office 365 email remediation features, the following are the enhancements for the email entity page and email summary panel:</p>\n\n<ul><li>Step 1: Log into the Microsoft 365 Defender portal at <a href=\"https://security.microsoft.com\" target=\"_blank\">https://security.microsoft.com</a>&nbsp;</li><li>Step 2: Navigate to Threat Explorer / Real time detection and select the desired emails.</li><li>Step 3: Click on Take action. Please note that previously, the drop-down menu was called Message actions.</li><li>A new panel will open (e.g. figure1). Some actions may be unavailable based on the message’s latest delivery location.</li><li>Step 4: Click on “I’ve confirmed as threat” to see a new panel and select multiple entities to block. You can also select multiple entities to block. Please note that “Tenant level allow and block” (TABL) actions are under Submissions.&nbsp;</li><li>STEP 5: Select target entities.</li><li>STEP 6: Review and submit your actions.</li></ul>\n\n<p>The available actions in the Take action wizard in Threat Explorer (Defender for Office 365 Plan 2) and Real-time detections (Defender for Office 365 Plan 1) are listed in the following:</p><p><b>Action under Threat explorer</b>&nbsp;</p>\n\n<ul><li>Move to mailbox folder.&nbsp;</li><li>Submit to Microsoft for review.&nbsp;</li><li>Allow or block entries in the Tenant Allow/Block List³&nbsp;</li><li>Initiate automated investigation.&nbsp;</li><li>Propose remediation.&nbsp;</li></ul><p><b>Action under Real-time Detections</b></p>\n\n<ul><li>Submit to Microsoft for review. \n</li><li>Allow or block entries in the Tenant Allow/Block List³&nbsp;</li></ul>\n\n<p>¹ This action requires the Search and Purge role in email &amp; collaboration permissions. By default, this role is assigned only to the Data Investigator and Organization Management role groups. You can add users to those role groups, or you can create a new role group with the Search and Purge role assigned and add the users to the custom role group.</p>\n\n<p><b>What you need to do to prepare:</b></p><p>To perform email purge actions from the email entity page, you are required to have the Search and Purge role, as well as the necessary permissions within the Microsoft 365 Defender portal.</p><p>Additional References:</p>\n\n<ul><li>Learn more here: <a href=\"https://learn.microsoft.com/en-us/defender-office-365/threat-explorer-threat-hunting#remediate-using-take-action\" target=\"_blank\">https://learn.microsoft.com/en-us/defender-office-365/threat-explorer-threat-hunting#remediate-using-take-action.</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "393937"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 has introduced a new feature called Take action wizard in Threat Explorer, allowing execution of multiple response actions simultaneously. This enhancement aids in efficient threat remediation, supporting actions like email purging, inline submissions, and Tenant level block actions for up to 100 messages. Rollout began in mid-April 2024 and will complete by late June 2024. Users need the Search and Purge role to perform email purge actions."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC788953",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-29T23:04:32.21Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-29T23:04:20Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: New added feature called the Take action wizard in Threat Explorer.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
