{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 18, 2024: We have updated the SMTP AUTH Clients Submission Report in the Exchange admin center, adding the Authentication Protocol column to show if Basic auth or OAuth is being used to submit email to Exchange Online. The data will build up over the next 90 days. Thank you for your patience.</p><p>Today, we are announcing that Exchange Online will permanently remove support for Basic authentication with Client Submission (SMTP AUTH) in September 2025. After this time, applications and devices will no longer be able to use Basic auth as an authentication method and must use OAuth when using SMTP AUTH to send email.\n</p><p>Basic auth is a legacy authentication method that sends usernames and passwords in plain text over the network. This makes it vulnerable to credential theft, phishing, and brute force attacks. To improve the protection of our customers and their data, we are retiring Basic auth from Client Submission (SMTP AUTH) and encouraging customers to use modern authentication methods that are more secure.</p><p><b>When this will happen:</b></p><p>We will be making this change in September 2025.</p><p> \n</p><p><b>How this will affect your organization:</b>\n</p><p>In September 2024, we will update the SMTP AUTH Clients Submission Report in the Exchange admin center to show if Basic auth or OAuth is being used to submit email to Exchange Online. In January 2025, we will send a Message Center post to tenants who are using Basic auth with Client Submission (SMTP AUTH) to alert them to the upcoming change. In August 2025, about 30 days before we disable Basic auth we will send another Message Center post to tenants who are still using Basic auth with Client Submission (SMTP AUTH).\n</p><p>During September 2025, we will remove support for Basic auth with the Client Submission (SMTP AUTH) endpoints:\n</p><ul><li>smtp.office365.com \n</li><li>smtp-legacy.office365.com \n</li></ul><p>Once Basic auth is permanently disabled, any clients or apps connecting using Basic auth with Client Submission (SMTP AUTH) will receive this response:\n</p><ul><li>550 5.7.30 Basic authentication is not supported for Client Submission.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>If your client supports OAuth, follow these steps: <a href=\"https://learn.microsoft.com/exchange/client-developer/legacy-protocols/how-to-authenticate-an-imap-pop-smtp-application-by-using-oauth\" target=\"_blank\">Authenticate an IMAP, POP or SMTP connection using OAuth</a></p><p>If your client doesn’t support OAuth and you must use Basic Auth with Client Submission (SMTP AUTH), you will need to switch to one of the following alternatives before September 2025:</p><ul><li>If you are using basic authentication with Client Submission (SMTP AUTH) to send emails to recipients internal to your tenant, you can use Microsoft 365 High Volume Email. Please visit this site to learn more: <a href=\"https://learn.microsoft.com/Exchange/mail-flow-best-practices/high-volume-mails-m365\" target=\"_blank\">Manage high volume emails for Microsoft 365 Public preview</a></li><li>If you are using basic authentication with Client Submission (SMTP AUTH) to send emails to recipients internal and external to your tenant, you can use Azure Communication Services Email. Please visit this site to learn more: <a href=\"https://learn.microsoft.com/azure/communication-services/concepts/email/email-overview\" target=\"_blank\">Overview of Azure Communication Services email</a></li><li> If you have an Exchange Server on-premises in a hybrid configuration, you can use Basic auth to authenticate with the Exchange Server on-premises or configure the Exchange Server on-premises with a Receive connector that allows anonymous relay on Exchange servers. Please visit this site to learn more: <a href=\"https://learn.microsoft.com/exchange/mail-flow/connectors/allow-anonymous-relay?view=exchserver-2019\" target=\"_blank\">Allow anonymous relay on Exchange servers</a></li></ul><p>Regardless of the volume of email, if you must use Basic auth to send email with Exchange Online, then you must use one of the alternatives.</p><p>We understand that this change requires some adjustments, but we believe that this is a necessary step to enhance the security and reliability of our email service and your data.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Exchange Online will retire Basic Auth for SMTP AUTH in September 2025. Users must switch to OAuth or other alternatives. The SMTP AUTH Clients Submission Report in the Exchange admin center will indicate the authentication method used. This change aims to enhance security against vulnerabilities associated with Basic Auth."
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/exchange-team-blog/exchange-online-to-retire-basic-auth-for-client-submission-smtp/ba-p/4114750"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/exchange/clients-and-mobile-in-exchange-online/deprecation-of-basic-authentication-exchange-online"
    }
  ],
  "EndDateTime": "2025-11-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC786329",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-18T16:26:45.83Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T00:16:47Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Exchange Online to retire Basic Auth for Client Submission (SMTP AUTH)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
