{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">Updated November 15, 2024: We have made the decision to not proceed with this change for DoD, GCC, or GCC High organizations at this time. We will communicate via Message center when we are ready to proceed. The External Recipient Rate Limit will only apply to WWMT/Production.</p><p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">Today, we are announcing that, beginning in January 2025, Exchange Online will begin enforcing an external recipient rate limit of 2000 recipients in 24 hours.</p><p>Exchange Online does not support bulk or high-volume transactional email. We have not enforced limiting of bulk email until now, but we plan on doing so with the introduction of an External Recipient Rate (ERR) limit. The ERR limit is being introduced to help reduce unfair usage and abuse of Exchange Online resources.</p><p><b>When this will happen:</b></p><p>The new ERR limit will be introduced in 2 phases:</p><ul><li>Phase 1 - Starting January 1, 2025, the limit will apply to cloud-hosted mailboxes of all newly created tenants.</li><li>Phase 2 - Between July and December 2025, we will start applying the limit to cloud-hosted mailboxes of existing tenants.</li></ul><p><b>How this will affect your organization:</b></p><p>Exchange Online enforces a Recipient Rate limit of 10000 recipients for cloud-hosted mailboxes. The 2000 ERR limit will become a sublimit within this 10000 Recipient Rate limit. There is no change to the Recipient Rate limit, and both of these will be rolling limits for 24-hour windows. You can send to up to 2,000 external recipients in a 24-hour period, and if you max out the external recipient rate limit then you will still be able to send to up to 8,000 internal recipients in that same period. If you don't send to any external recipients in a 24-hour period, you can send to up to 10,000 internal recipients.</p><p>For example:\n</p><ul><li>You use a cloud-hosted mailbox to send to 1,000 external recipients and 2,000 internal recipients at 6:00AM on Day 1, for a total of 3,000 recipients. You then send to another 1,000 external recipients at 8:00AM on Day 1. Because you sent to 2,000 external recipients, you will be blocked from sending to external recipients until 6:00AM on Day 2. During this period, you are able to send to up to 6,000 internal recipients, but for this example, let's assume that you don't.\n</li><li>At 6:00AM on Day 2, the 1,000 external recipients and 2,000 internal recipients sent at 6:00AM on Day 1 will no longer count toward the 24-hour limit calculation. Thus, from 6:00-8:00AM on Day 2, you can send to up to 9,000 total recipients (e.g., 9,000 internal or 8,000 internal plus 1,000 external).\n</li><li>If you don't send to any internal or external recipients during this period, then at 8:00AM on Day 2 you can again send to 10,000 recipients total with up to 2,000 of them being external recipients.</li></ul><p>\n</p><p><b>What you need to do to prepare:</b><br></p><p>If you have a cloud-hosted mailbox that needs to exceed the ERR limit, you can move to <a href=\"https://learn.microsoft.com/azure/communication-services/concepts/email/email-overview\" target=\"_blank\">Azure Communication Services for Email</a>, which is designed specifically for high volume email sent to recipients external to your tenant.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Beginning January 2025, Exchange Online will enforce a new External Recipient Rate limit of 2000 recipients per 24 hours, introduced in two phases for new and existing tenants. This limit is part of the overall 10000 Recipient Rate limit, aiming to prevent abuse of services. Organizations exceeding this limit should consider Azure Communication Services for Email."
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/exchange-team-blog/exchange-online-to-introduce-external-recipient-rate-limit/ba-p/4114733"
    }
  ],
  "EndDateTime": "2026-02-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC787382",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-15T19:06:19.33Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T23:12:20Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Exchange Online to introduce External Recipient Rate Limit",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
