{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We recently rolled out two changes to the Microsoft Copilot Dashboard in Microsoft Viva Insights:\n</p><ul><li>For customers with a Microsoft 365 or Office 365 subscription, the Copilot Dashboard displays tenant-level metrics. With this rollout, we removed the minimum group size requirement for tenant level aggregated metrics. Before this rollout, users could only view tenant-level aggregated metrics with at least 25 active employees.</li><li>Additionally, for customers with a Viva or a Viva Insights subscription, the Adoption and Impact pages on Copilot dashboard display user-level metrics with the ability to drill down further. These metrics are displayed for groups that meet or exceed the <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/privacy-settings#minimum-group-size\" target=\"_blank\">minimum group size set by your Viva Insights administrator</a>. The default value for this threshold is now updated from 25 to 10. In addition, Viva Insights administrator can further configure this threshold with a minimum of 5.\n</li></ul><p><b>When this will happen:</b>\n</p><p>Available now.\n</p><p><b>How this will affect your organization:</b>\n</p><p>End users who have access to the Copilot Dashboard are now able to:\n</p><ul><li>See the aggregated tenant-level insights without minimum group size requirements.\n</li><li>See the aggregated user-level insights based on the updated minimum group size threshold that the Viva Insights admin set. User-level insights in the Copilot Dashboard are only available to customers with a Viva Insights subscription.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Minimum group size helps protect individual privacy. Review and assess the impact for your organization. The Viva Insights administrator can choose to update this threshold in the <a href=\"https://learn.microsoft.com/viva/insights/advanced/introduction-to-advanced-insights\" target=\"_blank\">Viva Insights advanced insights app</a>. This setting will impact the aggregated user-level metrics in the Copilot Dashboard. In addition, this minimum group size setting applies to data visualizations in advanced insights Power BI templates as well as group comparisons in organization insights for leaders and managers in Outlook and Teams.\n</p><p>You might consider updating your training and documentation as appropriate. Learn more about <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/copilot-dashboard-advanced-features#minimum-group-size\" target=\"_blank\">minimum group size</a>, the <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/copilot-dashboard-advanced-features\" target=\"_blank\">Copilot Dashboard</a> and <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/privacy-settings#minimum-group-size\" target=\"_blank\">the minimum group size setting for Insights administrators</a>.\n</p><p>If you have access to the Copilot Dashboard, you can find it in <a href=\"https://insights.cloud.microsoft/#/CopilotDashboard\" target=\"_blank\">Microsoft Teams for desktop or web</a>.\n</p><p>This rollout will happen automatically by the specified date with no administrator action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva's Copilot Dashboard now shows tenant-level metrics without a minimum group size requirement and user-level metrics with a reduced minimum group size threshold, which can be configured by the Viva Insights administrator. These changes are available now and affect data visualization and privacy settings."
    }
  ],
  "EndDateTime": "2024-06-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC788977",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-29T23:08:29.897Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-29T23:08:13Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Minimum group size update for Copilot Dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
