{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon, Microsoft Purview Insider Risk Management will roll out exfiltration of business sensitive data to free public domain emails.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=393334\" target=\"_blank\">393334</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-May 2024 and expect to complete by late May 2024.\n</p><p>General Availability: We will begin rolling out late June 2024 and expect to complete by early July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>In this rollout, we are enhancing the existing email insight alerts to provide additional information when business sensitive data is potentially leaked from a work email account to a free public domain email, potentially leading to a data security incident. The new domain detection group Free public domains will list common domains used for personal email accounts. Admins with appropriate permissions can also choose to select these domains in their email indicator variants.\n</p><p>Any email going to free public domains (including email sent to self) will be automatically highlighted in email insights.\n</p><p>Updated email insight:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kC8s?ver=e6ce\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>Free public domains:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kMNW?ver=3526\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>New column and filters for email activities:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kMNV?ver=8287\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>You may want to update any relevant documentation as appropriate. We will update this comm before rollout with revised documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.&nbsp;<br></p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "393334"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing a feature to detect exfiltration of sensitive data to free public domain emails, with a public preview in mid-May 2024 and general availability in late June 2024. The update enhances email insight alerts and adds new domain detection for better security incident prevention."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing a feature to detect exfiltration of sensitive data to free public domain emails, with a public preview in mid-May 2024 and general availability in late June 2024. The update enhances email insight alerts and adds new domain detection for better security incident prevention."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC781588",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T22:00:30.707Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-19T21:58:46Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Exfiltration of business sensitive data to free public domain emails",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
