{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 8, 2024: We have updated the content below with new instructions for engaging to obtain users.&nbsp;</p><p>In an effort to improve and consolidate our services, we will be retiring the Stream mobile apps on July 1st, 2024.&nbsp;Instead, we recommend the utilization of the OneDrive and Microsoft 365 mobile apps, which is where we will continue to invest our development resources.</p><p><b>When this will happen:</b></p><p>July 1, 2024</p><p><b>How this affects your organization:</b></p><p>When this change goes into effect, users will no longer be able to download videos where block download policy is enabled. These videos will need to be played online. Users will still be able to download and playback videos offline where block download policy is&nbsp;not&nbsp;enabled using the OneDrive mobile app.<br></p><p><b>What you need to do to prepare:</b></p><p>For information about alternative solutions, please visit&nbsp;<a href=\"https://learn.microsoft.com/stream/streamnew/mobile-apps/overview\" target=\"_blank\">Stream mobile app alternative solutions</a>.&nbsp;</p><p>If you would like more information about how many users in your organization are using the Stream mobile apps, please raise a support ticket.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Stream mobile apps will retire on July 1, 2024. Users should switch to the OneDrive and Microsoft 365 mobile apps. Videos with block download policy can only be played online after this date. For preparation and alternatives, visit the provided link. Email for user statistics."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC789607",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-08T19:32:42.49Z",
  "Services": [
    "Microsoft Stream"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-02T04:17:44Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Stream Mobile App Retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
