{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of a planned Intune Company Portal infrastructure update, all users will be required to update to the minimum Company Portal app version listed below by <b>July 10, 2024</b>, or soon after, or they will no longer have access to the app. See below for the minimum version for each platform that will be required:</p><ul><li>Windows Company Portal: version 11.2.58.0</li><li>Android Company Portal: version 5.0.5750.0</li><li>Intune app for Android Enterprise: version 23.5.3</li><li>Intune app for Android Open Source Project: version 21.12.5</li><li>iOS Company Portal: version 5.2311.1</li><li>macOS Company Portal: version 5.2401.2</li></ul><p><b>Note:</b> If you have classic Conditional Access policies, they will need to be migrated. For more details, read the blog <a href=\"https://aka.ms/Intune/migrate-classic-CA\" target=\"_blank\">Support tip: Migrate your classic Conditional Access policies</a>.</p><p><b>How this will affect your organization:</b></p><p><b>User impact:</b> Most users have app updates set to automatic, so they receive the updated Company Portal app without taking any action. If they do not have automatic updates turned on, users will need to manually update to the minimum Company Portal version (listed above) to avoid losing access to resources. \n</p><p><b>Note:</b> For iOS, if you have enabled the ‘<a href=\"https://learn.microsoft.com/mem/intune/configuration/device-restrictions-ios#settings-apply-to-automated-device-enrollment-supervised\" target=\"_blank\">Block installing apps using App Store</a>’ device restriction setting, you may need to manually push an update to devices.</p><p><b>What you need to do to prepare:</b></p><p>Notify your users to update to the latest Company Portal version prior to <b>July 10, 2024</b>. For user guidance, review <a href=\"https://learn.microsoft.com/mem/intune/user-help/install-a-new-version-of-the-company-portal-app\" target=\"_blank\">Update the Company Portal app</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "All users must update to the specified minimum Company Portal app version for their platform by July 10, 2024, to maintain access. Automatic updates will handle this for most users; others must update manually. Classic Conditional Access policies need migration. Users should be notified to prepare."
    }
  ],
  "EndDateTime": "2024-08-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC783213",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-22T21:51:53.687Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-22T21:49:46Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Update to the latest Company Portal for all platforms",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
