{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 9, 2024, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p><b>Note:</b> If you receive an error \"The requested operation is part of an experimental feature that is not supported in the current environment\", this indicates that the feature has not reached your tenant yet.</p><p><i>Version history,</i> a critical part of Microsoft SharePoint’s built-in data protection, tells users how a file has evolved over time. Users can easily revert to an older version if business needs change or if files are damaged by user error or malware. Version storage controls allow you as admins to set an appropriate level of recoverability and auditability for your organization. Based on strong customer feedback, we will release enhanced version storage controls so you can meet your needs efficiently and at scale.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=145802\" target=\"_blank\">145802</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early May 2024 and expect to complete by late June 2024. Admins can opt into the Public Preview by running the SharePoint Online Management PowerShell cmdlet <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps\" target=\"_blank\"><code>Set-SPOTenant -EnableVersionExpirationSetting $true</code></a>. Please make sure that your SharePoint Online Management Shell is updated to version 16.0.24810.12000 or higher so you can run the specified cmdlets. For guidance, refer to <a href=\"https://learn.microsoft.com/powershell/sharepoint/sharepoint-online/connect-sharepoint-online\" target=\"_blank\">Get started with the SharePoint Online Management Shell</a>.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2024 (previously late August) and expect to complete by mid-October 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>What’s New?\n</p><p>We are introducing new version controls that help admins and content owners reduce storage footprint driven by low value file versions. Previously, document library owners could set count-based version limits at the library level. With this rollout, we are introducing new automatic version limits that consider important factors such as age and restore probability to offer more intelligent version deleting&nbsp;options. We’re also adding manual settings for version expiration and count limits.\n</p><p>Here is a summary of the new capabilities introduced with this rollout:\n</p><ul><li><i>New Version history limit</i> options to meet your organization’s recovery objectives and version storage targets. Set version limits to:\n<ul><li><i>Automatically optimize</i> version recovery and storage without estimating limits; or\n</li><li><i>Manually limit</i> versions by count or version age.\n</li></ul></li><li><i>Set default organization Version history limits</i> on new document libraries and Microsoft OneDrive accounts for consistent version storage setting on all new libraries and OneDrive accounts created through the organization.\n</li><li><i>Set Site or Library level Version history limits</i> to meet specific content needs by breaking inheritance from organization defaults.\n</li><li><i>Report on version storage use of a site or library</i> by generating a CSV report to analyze current usage trends or impact analysis.\n</li><li><i>Delete versions from a site or library</i> to reduce existing version storage footprint or align with new limits.\n</li></ul><p>After this rollout completes, you can expect these changes:\n</p><p>1. New <i>Version history limits</i> settings in SharePoint admin center: Admins can set global defaults for all new libraries created in the organization. By default, the organization-level <i>Version history</i> limit will be set to M<i>anually</i> delete versions. Within the Manual limits, the default <i>Number of major versions</i> is set to 500 and the <i>Time</i> period is set to <i>Never expire.</i>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1h5nt?ver=1a35\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>2. New <i>Version time limit</i> setting for Document libraries: In addition to existing <i>Version count limits</i>, users can set <i>Version time limits</i> to delete versions based on age. <i>Version time limits</i> will be on the library's <i>Version settings</i> page. No change will be made to existing version limits applied to the library.\n</p><p>3. New <i>Expiring in</i> column on a file's <i>Version history</i> view: Users will be able to:\n</p><ul><li>View an expiration applied to a file's versions based on the library settings\n</li><li>Set individual file versions to never expire\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Review updated documentation:</p><p>\n</p><ul><li>Admin documentation: <a href=\"https://learn.microsoft.com/sharepoint/document-library-version-history-limits\" target=\"_blank\" style=\"\">Overview of Version History Limits for Document Libraries and OneDrive</a></li><li>End user documentation: <a href=\"https://support.microsoft.com/office/enable-and-configure-versioning-for-a-list-or-library-1555d642-23ee-446a-990a-bcab618c7a37\" target=\"_blank\">Enable and configure versioning for a list or library</a>\n</li></ul><p>To send feedback or questions about this change, select <i>Like</i> or <i>Dislike</i> at the top of this message in the Microsoft 365 message center.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "145802"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint is updating version history controls, adding new automatic and manual version limits to help admins manage version storage efficiently. Public Preview starts in May 2024, with General Availability in September 2024. Admins should prepare by reviewing updated documentation and can opt-in for the preview using SharePoint Online Management PowerShell cmdlet. The message includes links for further guidance and feedback."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-22T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC789209",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-09T19:28:56.023Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-30T16:22:44Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint document libraries: Improved Version history controls | Preview opt-in",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
