{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Chat history will be turned on for Microsoft Copilot users with commercial data protection (formerly Bing Chat Enterprise). Chat history lets users return to a previous chat and view prompts and responses. Users can also continue the chat.\n</p><p>To disable or enable chat history prior to the feature update being rolled out, or to manage it after rollout, a <a href=\"https://download.microsoft.com/download/e/7/3/e739d23f-50c9-4eb0-8ba8-d47cd7b38291/ConfigureCopilotChatHistory.ps1\" target=\"_blank\">PowerShell </a>script is available.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=392873\" target=\"_blank\">392873</a></p><p><b>When this will happen:</b>\n</p><p>General Availability: We will begin rolling out mid-May 2024 and expect to complete by late May 2024.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>If chat history is enabled, user chat data will be saved within your organization’s compliant service boundary. A Copilot user’s chat history is private and is not made available to organizations or to Microsoft for reporting or auditing purposes. Copilot users may be subject to other methods of monitoring available to IT admins in their organization, such as internal logging, device or network logs, and other methods on their company network or devices.</p><p>This chat history feature does not require a user have a Copilot for Microsoft 365 license as this applies to activity while a user is in the web toggle (as opposed to the work toggle in the UX).</p><p> \n</p><p>If chat history is enabled for an organization, users will need to consent to new terms of use presented to them in the Copilot UX to use chat history. Chats will be available to users as part of the Copilot UX for a rolling 30-day period before they are deleted. Users can delete their chats from chat history at any time.\n</p><p>If chat history is turned off, the feature will immediately become unavailable to users. Existing chats will be deleted in accordance with the rolling 30-day period.\n</p><p>Commercial data protection continues to apply. Prompts and responses are not retained by Microsoft.</p><p><b>What you need to do to prepare:</b>\n</p><p>You can use a PowerShell script to manage chat history in Microsoft Copilot. To disable or enable chat history in Copilot with commercial data protection, follow these steps:&nbsp;</p><ol><li>Download the <a href=\"https://download.microsoft.com/download/e/7/3/e739d23f-50c9-4eb0-8ba8-d47cd7b38291/ConfigureCopilotChatHistory.ps1\" target=\"_blank\">PowerShell script</a>.</li><li>Open an instance of the PowerShell in admin mode.</li><li>Run the following command first: Set-ExecutionPolicy unrestricted.</li><li>Run the PowerShell script.</li><li>Follow the instructions prompted by the script.</li><li>The cmdlet prompts you to sign in with your Entra ID account, which must be a Search Admin or Global Admin account.</li><li>Follow these steps:<ol><li>To turn on chat history in Microsoft Copilot, run: .\\ConfigureCopilotChatHistory.ps1 -enable $true</li><li>To turn off chat history in Microsoft Copilot, run: .\\ConfigureCopilotChatHistory.ps1 -enable $false</li></ol></li><li>If you encounter a problem, try running the script again. If the problem persists, contact support.</li></ol><p>For more information on Microsoft Copilot, refer to this documentation: <a href=\"https://aka.ms/Copilot/Docs\" target=\"_blank\">https://aka.ms/Copilot/Docs</a>&nbsp;&nbsp;</p><p>To help drive adoption of Copilot in our organization, an adoption kit is available: <a href=\"https://aka.ms/Copilot/StarterKit\" target=\"_blank\">https://aka.ms/Copilot/StarterKit</a>&nbsp;&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "392873"
    },
    {
      "Name": "Summary",
      "Value": "The rollout of chat history for Microsoft Copilot with commercial data protection is on hold. It allows users to view and continue past chats. A PowerShell script is available to manage this feature, which will be rolled out in mid to late May 2024. Users must consent to new terms to use chat history, which is stored for 30 days."
    }
  ],
  "EndDateTime": "2024-07-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC789319",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-30T23:53:45.193Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-30T23:51:26Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Chat history coming to Microsoft Copilot with commercial data protection (formerly Bing Chat Enterprise) - ON HOLD",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
