{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>For organizations that need to change their Microsoft SharePoint domain name due to rebranding, mergers, acquisitions, or consolidations, Advanced Tenant Rename is now available with SharePoint Advanced Management.<br></p><p>With Advanced Tenant Rename, organizations with up to 100,000 total sites can change their domain name. This also offers greater control with the ability to prioritize up to 4,000 sites for early execution within the rename.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=180383\" target=\"_blank\">180383</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late April 2024 and expect to complete by early May 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>If you choose to use Advanced Tenant Rename, this will result in all SharePoint Online and OneDrive for Business URLs showing the new domain name. Some workloads may need additional actions after a rename. For those not intending to perform a rename, there will be no change.</p><p>For additional information, see <a href=\"https://learn.microsoft.com/sharepoint/change-your-sharepoint-domain-name\" target=\"_blank\">Change your SharePoint domain name</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>If you wish to proceed with Advanced Tenant Rename, ensure you have thoroughly reviewed the public documentation first. Once you have SharePoint Advanced Management active in your organization, you can use SharePoint PowerShell to perform the rename. For those not intending to perform a rename, no action is required.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "180383"
    },
    {
      "Name": "Summary",
      "Value": "The message details the availability of the Advanced Tenant Rename feature in SharePoint Advanced Management, allowing organizations to change their SharePoint domain name. It is applicable for organizations with up to 100,000 sites and offers prioritization for 4,000 sites. The rollout begins late April 2024, with completion by early May 2024. Organizations must review documentation and use SharePoint PowerShell to execute the rename."
    },
    {
      "Name": "Summary",
      "Value": "The message details the availability of the Advanced Tenant Rename feature in SharePoint Advanced Management, allowing organizations to change their SharePoint domain name. It is applicable for organizations with up to 100,000 sites and offers prioritization for 4,000 sites. The rollout begins late April 2024, with completion by early May 2024. Organizations must review documentation and use SharePoint PowerShell to execute the rename."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC789608",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-02T04:19:04.79Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-02T04:18:50Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Syntex: Microsoft SharePoint Advanced Tenant Rename feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
