{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 24, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Teams will enhance its Walkie Talkie feature on iOS by integrating with Apple's Push-to-Talk (PTT) framework, improving communication capabilities.</p><p>Teams Walkie Talkie on iOS will be integrated with Apple's Push-to-Talk framework to enhance communication and convenience of transmitting audio from anywhere on their phone, even when Teams is not in the foreground. It will enable audio transmission directly from the lock screen and comes with background runtime optimization for optimal performance while conserving battery life.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=388486\" target=\"_blank\">388486</a></p><p><b>When this will happen:</b></p>\n\n<p>General Availability (Worldwide, GCC): We will begin rolling out late April 2024 and expect to complete by late May 2024 (previously early May).</p><p><b>How this will affect your organization:</b></p>\n\n<p>The Walkie Talkie application is set to adopt Apple’s Push-to-Talk framework to facilitate call transmission. This new framework brings forth a fresh user interface on both the home and lock screens of iOS devices. It enables users to effortlessly send and receive voice messages, as well as to disconnect from active channels.</p><p>When a Walkie Talkie channel is active via the Push-to-Talk feature, a blue indicator will be displayed on the home screen:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kOZh?ver=b5fc\" style=\"width: 400px;\"></p><p>Clicking on the home screen's Push-to-Talk pill will expand the Push-to-Talk Framework UI:</p>\n\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kRpB?ver=af8e\" style=\"width: 400px;\"></p><p></p><p>Activating the Push-to-Talk pill from the lock screen will expand the Push to Talk framework UI across the entire screen:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kRpE?ver=e64f\" style=\"width: 400px;\"></p><p><b>What you need to do to prepare:</b></p>\n\n<p>Admins and users are not required to take any particular steps, provided that they are using the supported iOS version (iOS/iPadOS) 16 or later.</p><p>Additional Resources:</p><ul><li><a href=\"https://support.microsoft.com/en-us/office/communicate-with-your-team-in-walkie-talkie-e4342550-5516-4451-b9ec-93166b60f8a4?preview=true\" target=\"_blank\">Communicate with your team in Walkie Talkie - Microsoft Support</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388486"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams' Walkie Talkie feature on iOS will integrate with Apple's Push-to-Talk, enabling audio transmission from the lock screen and optimizing performance. Rollout begins late April 2024, requiring iOS 16 or later, with no action needed from admins or users."
    },
    {
      "Name": "Platforms",
      "Value": "iOS"
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC787359",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-24T19:54:41.023Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T23:10:58Z",
  "Tags": [
    "Updated message",
    "New feature"
  ],
  "Title": "Microsoft Teams: Walkie Talkie will be integrated with Apple’s iOS Push-to-Talk feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
