{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>At Microsoft, we are committed to providing a consistent user experience across our products and protecting your data. As part of this commitment, we are integrating Auto Attendant search with the main Address Book search of Microsoft products. After this rollout, Auto Attendant Address Book search results will be aligned with Microsoft Exchange, Microsoft Teams, and other Microsoft product searches, and your tenant Address Book settings in Exchange will start to affect searches performed via Auto Attendant service.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late May 2024 and expect to complete by late June 2024.\n</p><p>General Availability (GCC High): We will begin rolling out early June month 2024 and expect to complete by late July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Here's an example of how your tenant Address Book settings affect searches performed with the Auto Attendant service after the rollout: If users in your Address Book have the property <code>HiddenFromAddressListsEnabled = true</code>, then an Auto Attendant search will not return these users, similar to the Address Book search experience in Exchange, MS Teams, and other Microsoft products.\n</p><p>You can learn more about hiding and unhiding users from the Address Book: <a href=\"https://learn.microsoft.com/exchange/address-books/address-lists/manage-address-lists#hide-recipients-from-address-lists\" target=\"_blank\">Manage address lists in Exchange Online | Microsoft Learn.</a>\n</p><p>You can learn more about Auto Attendant searches: <a href=\"https://learn.microsoft.com/microsoftteams/dial-voice-reference\" target=\"_blank\">Auto attendant and Call queue dialing and voice recognition reference - Microsoft Teams | Microsoft Learn</a></p>\n<p></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Auto Attendant will be integrated with the main Address Book search in Microsoft products, aligning search results and being affected by tenant Address Book settings in Exchange. Rollout begins late May 2024, completing by late June 2024, with no admin action required before the rollout."
    }
  ],
  "EndDateTime": "2024-10-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC785026",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-24T21:54:09.043Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-24T21:53:48Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Auto Attendant will be integrated with main Address Book search",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
