{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><p>\n</p>Microsoft Viva Learning: Microsoft Copilot Academy is adding more learning resources for its users. These resources will automatically be available to the users who have Copilot Academy.Microsoft Copilot Academy will soon be accessible in seven additional languages, in addition to English (United States). These languages include:<ul><li>&nbsp; French (France)\n</li><li>&nbsp; German (Germany)\n</li><li>&nbsp; Italian (Italy)\n</li><li>&nbsp; Japanese (Japan)\n</li><li>&nbsp; Portuguese (Brazil)\n</li><li>&nbsp; Spanish (Spain)\n</li><li>&nbsp; Chinese (Simplified)\n</li></ul>When users access the Copilot Academy in any of these supported languages, the platform will automatically load the appropriate language interface. Instructions for Admins: In order to enable/disable Copilot Academy, use the single toggle available in the Manage Academies page.Viva Learning is bringing new handpicked courses from across the web for you to discover within Viva Learning. These will be available out-of-box under External content provider, enabled by default.Learners can discover the new content under the External content provider carousel on the Home page. Instructions for Admins: In order to disable the External content provider, go to Admin tab in Viva Learning and use the single toggle available under the Manage providers section.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-May 2024 and expect to complete by late May 2024.</p><p><b>How this will affect your organization:</b><ul><li>Tenants will be able to view Copilot Academy in eight languages and also get the new out-of-box content curated within Viva Learning.</li><li>Admins will have the option to disable Microsoft Copilot Academy from the Admin tab in Viva Learning under the Manage academies section. Admins will have the option to disable the External content provider from the Admin tab in Viva Learning under the Manage providers section.</li><li>Users will be able to view new resources in the Microsoft Copilot Academy along with the ability to view Copilot Academy in their preferred language. Users will also be able to discover and consume the new hand-picked content in Viva Learning under the External content provider.</li></ul><b>What you need to do to prepare:</b></p><p>If you do not want your users to have access to Microsoft Copilot Academy or the new the External provider, please follow the instructions above to disable in the Manage Academies page.\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Viva Learning is adding new content and Copilot Academy will be available in seven new languages. Admins can enable/disable these features in the Manage Academies and Manage providers sections. Rollout starts mid-May 2024, with completion by late May 2024. Users can access new resources and language options in Copilot Academy and discover new courses in Viva Learning."
    }
  ],
  "EndDateTime": "2024-07-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC786327",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-26T00:15:14.69Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T00:14:59Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Learning: New content updates in Viva Learning and Copilot Academy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
