{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>New Teams for Web on Firefox is available now on Windows, macOS, and Linux.&nbsp;</p><p>New Teams for Web on Safari is available now on macOS.</p><p>Before this rollout, new Teams for Web was available on Microsoft Edge and Chrome for general audiences on Windows, macOS, and Linux.</p><p><b>When will this happen:</b></p><p>Available now.&nbsp;</p><p>\n</p><p>\n</p>\n<p></p>\n<p><b>How this will affect your organization:</b><br></p><ul><li>Supported versions include the latest three versions of Firefox and the latest two versions of Safari.&nbsp;</li><li>Firefox and Safari users will be updated to new Teams for Web following the same timeline and experiences detailed in <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">End of availability for classic Teams client - Microsoft Teams | Microsoft Learn</a></li><li>Teams for Web users on all browsers will still see the toggle to switch back to classic Teams for Web until mid-May 2024, even for tenants with their Teams update policy set in the Teams admin center to <i>New Teams only</i></li></ul><p><b>What you can do to prepare:</b><br></p><p>Visit the support article <a href=\"https://learn.microsoft.com/MicrosoftTeams/new-teams-web\" target=\"_blank\">New Teams for Web - Overview and prerequisites | Microsoft Learn</a> or<a href=\"https://aka.ms/NewTeams\" target=\"_blank\"> download resources</a> to learn how to get started with the new Teams.</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams for Web is now available for Firefox, Safari, and Linux users. It supports the latest three versions of Firefox and the latest two versions of Safari. Users can switch back to classic Teams for Web until mid-May 2024. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC781587",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-20T01:09:38.587Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-19T21:58:01Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Teams for Web: Now generally available for Firefox, Safari, and Linux",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
