{
  "ActionRequiredByDateTime": "2024-05-20T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Microsoft Power BI setting, <i>Users can use a preview of Copilot and other features powered by Azure OpenAI</i>, will be enabled by default for all tenants.</p><p><b>When this will happen:</b> \n</p><p>Worldwide:&nbsp;We will begin rolling out late May 2024 and expect to complete by mid-June 2024.</p><p><b>How this will affect your organization:</b></p><p>With the default enablement, tenants that have not previously modified the tenant setting for Copilot will now have access to it within PowerBi, allowing users to perform tasks using natural language more efficiently.</p><p>Additionally, the tenant setting will now be automatically delegated to capacity admins, streamlining the management process.\n</p><p>We have also updated the <i style=\"\">Abuse monitoring</i><b> </b>feature, which no longer stores your data to help enforce your privacy and security<b>.\n</b></p><p>For more information about these changes, please visit <a href=\"https://learn.microsoft.com/fabric/get-started/copilot-fabric-overview\" target=\"_blank\">Overview of Copilot in Fabric and Power BI</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p><i>Important: If you prefer to have Copilot within Power BI turned off within your tenant, please follow these steps before May 20th, 2024:\n</i></p><ol><li>Visit the Power BI admin portal.\n</li><li>Locate the setting: “Users can use a preview of Copilot and other features powered by Azure OpenAI”.\n</li><li>Enable the feature and save your changes.\n</li><li>Then, disable the feature and save again.\n</li></ol><p>This process ensures that your tenant will not be automatically affected by the default enablement. Alternatively, you can enable the feature for a security group containing only the admins, maintaining control over its distribution.</p><p><b>\n</b></p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Power BI setting for Copilot features will be enabled by default for all tenants starting late May 2024. Tenants can access Copilot more efficiently and manage settings through capacity admins. The Abuse monitoring feature has been updated for privacy. Visit the provided link for more details. To opt-out, follow the steps in the Power BI admin portal before May 20th, 2024."
    }
  ],
  "EndDateTime": "2024-07-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC785029",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-04-24T21:58:50.607Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-24T21:58:25Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Upcoming changes to tenant settings for Power BI Copilot features",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
