{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We've changed the permissions mechanism to access Email &amp; collaboration schema in Advanced Hunting for Microsoft Defender for Office 365 customers, to align with Threat Explorer.</p><p><b>When this will happen:</b></p><p>We will begin rolling out in early May 2024 and expect to complete by late May 2024.</p><p><b>How this will affect your organization:</b></p><p>Impacted users:</p><p>Security teams that are using Defender XDR Email &amp; collaboration schema in Advanced Hunting (https://security.microsoft.com/v2/advanced-hunting)\n</p><ul><li>Users assigned to Exchange Online Protection role groups View-only Manage alerts, Manage alerts, View-only audit logs, Audit logs, and Organization configuration.  These role groups are configured in the Defender portal, under Permissions / Email &amp; collaboration Roles / Roles, or in the Purview compliance portal under Roles and Scopes/Permissions.\n</li><li>Users assigned the following permissions using Defender XDR Unified RBAC for Microsoft Defender for Office 365:<ul><li>Security operations / Security data basics (read), without Security operations / Raw data / Email &amp; collaboration metadata (read)).</li></ul></li></ul><p>Previously, these roles granted access to Microsoft Defender for Office 365 Alerts and Incidents, as well as Email &amp; collaboration schema in Advanced Hunting.</p><p>\n</p><p><b>What you need to do to prepare:</b><br></p><p>After rolling out this change, these roles will continue to grant access to Microsoft Defender for Office 365 Alerts and Incidents, but not Email &amp; collaboration schema in Advanced Hunting.&nbsp;</p><p>If you are willing to continue and grant your teams access to Email &amp; collaboration schema in Advanced Hunting, please assign them one of the following permissions, same as required to access Threat Explorer:</p><ul><li>If Defender XDR Unified RBAC is active for Email &amp; collaboration: please assign:<br>Security operations / Raw data / Email &amp; collaboration metadata (read) permission.</li><li>If Defender XDR Unified RBAC is not active for Email &amp; collaboration, please assign the following Email &amp; collaboration permissions in the Defender portal: <br>Security Reader, Security Operator, Security Administrator, Exchange Administrator, Global Reader, View-Only Recipients, Organization Management.</li></ul><p>Notes:\n</p><ul><li>This change does not impact access to Threat Explorer</li><li>Global Entra ID roles are not impacted by this change</li></ul><p>Please review the following resources to learn more:</p><ul><li>For additional information on Advanced Hunting permissions, see <a href=\"https://learn.microsoft.com/microsoft-365/security/defender/custom-roles?view=o365-worldwide\" target=\"_blank\">Custom roles for role-based access control | Microsoft Learn</a></li><li>For additional information on Threat Explorer permissions, see <a href=\"https://learn.microsoft.com/microsoft-365/security/office-365-security/threat-explorer-real-time-detections-about?view=o365-worldwide#permissions-and-licensing-for-threat-explorer-and-real-time-detections\" target=\"_blank\">About Threat Explorer and Real-time detections in Microsoft Defender for Office 365 | Microsoft Learn</a>\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The permissions for accessing Email & Collaboration schema in Advanced Hunting for Microsoft Defender for Office 365 are updated to align with Threat Explorer. Changes will roll out in May 2024, affecting security teams with specific roles. Organizations must assign new permissions to maintain access to the schema."
    }
  ],
  "EndDateTime": "2024-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC787370",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-26T23:12:05.137Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T23:11:44Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Advanced Hunting Permissions update for some Microsoft Defender for Office 365 security admins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
