{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams: Efforts are underway to improve the functionality of the&nbsp;<i>Record a greeting</i>&nbsp;button under Voicemail settings. Currently, when users press this button, they are redirected to an IVR menu with multiple options. However, only one of these options is related to greeting recording.</p>\n\n<p>To address this issue, we will be aligning the button's functionality with its intended and official purpose, so that under the <i>Record a greeting</i> button, users will only be able to record their greetings. This change is primarily being made to strengthen data protection, but it will also reduce the number of steps required for end-users to record their greetings.</p><p>To find the <i>Record a greeting</i> button, open MS Teams and navigate to Settings &gt; Calls &gt; Manage Voicemail &gt; <i>Record a greeting</i> button.&nbsp;</p>\n\n<p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early May 2024 and expect to complete by late May 2024.</p><p>General Availability (GCC): We will begin rolling out mid-May 2024 and expect to complete by late June 2024.\n</p>\n\n<p>General Availability (GCC High): We will begin rolling out mid-May 2024 and expect to complete by late June 2024.</span></p><p>General Availability (DoD): We will begin rolling out mid-May 2024 and expect to complete by late June 2024.</p>\n\n\n<p>This change is primarily being made to strengthen data protection, but it will also reduce the number of steps required for end-users to record their greetings.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kZDR?ver=a80d\" style=\"width: 600px;\"></p>\n\n<p><b>What you need to do to prepare:</b></p>\n\n<p>This change will happen automatically, no action is required on tenant's side.</p><p>Additional Resources:</p>You can learn more about managing your Teams call settings (including Voicemail settings) under Microsoft learn: <ul><li><a href=\"https://support.microsoft.com/office/manage-your-call-settings-in-microsoft-teams-456cb611-3477-496f-b31a-6ab752a7595f\" target=\"_blank\">Manage your call settings in Microsoft Teams - Microsoft Support</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating the 'Record a greeting' button under Voicemail settings to only allow greeting recordings, aligning with its intended purpose. This change, starting in early May 2024 and ending by late June 2024, aims to enhance data protection and simplify the recording process. No action is required from users for this update."
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC789610",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-02T04:20:50.567Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-02T04:19:54Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Adjusting the Record a greeting button to reflect Its intended purpose in voicemail settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
