{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Azure Active Directory (Azure AD) Graph has been <a href=\"https://learn.microsoft.com/graph/migrate-azure-ad-graph-overview\" target=\"_blank\">deprecated since mid-2023</a> and is in its retirement phase to allow applications time to migrate to Microsoft Graph. As part of our ongoing efforts to prepare for this, we will be updating the Intune Company Portal infrastructure to move to Microsoft Graph. With this update, by <b>July 10, 2024</b>, admins must <a href=\"https://learn.microsoft.com/entra/identity/conditional-access/policy-migration-mfa\" target=\"_blank\">migrate classic Conditional Access (CA)</a> to the new policies and disable or delete policies for the Company Portal and Intune apps to continue working.</p><p><b>How this will affect your organization:</b></p><p>If you are using classic Conditional Access policies, you will need to migrate these policies.\n</p><p><b>User impact:</b> If you do not migrate your policies, users will not be able to enroll new devices via the Company Portal and they will not be able to make non-compliant devices compliant (if non-compliance is caused by a classic CA policy or a condition within a classic CA policy). This applies to:</p><ul><li>Windows Company Portal </li><li>Intune Company Portal website</li><li>Android Company Portal</li><li>Intune app for Android Enterprise</li><li>Intune app for Android (AOSP)</li><li>iOS Company Portal</li><li>macOS Company Portal</li></ul><p><b>What you need to do to prepare:</b></p><p>Before <b>July 10, 2024</b>, migrate your classic CA policies. For instructions, see <a href=\"https://learn.microsoft.com/entra/identity/conditional-access/policy-migration-mfa\" target=\"_blank\">Migrate from a classic policy - Microsoft Entra ID | Microsoft Learn</a>.\n</p><p>We have published a blog with these details and will provide any additional updates or changes to the timeline there: <a href=\"https://aka.ms/Intune/migrate-classic-CA\" target=\"_blank\">Support tip: Migrate classic Conditional Access policies</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Azure AD Graph is retiring, and admins must migrate classic Conditional Access policies to Microsoft Graph by July 10, 2024. Failure to migrate will prevent new device enrollment and compliance via the Company Portal and Intune apps across various platforms."
    }
  ],
  "EndDateTime": "2024-08-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC781581",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T21:53:04.783Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-19T21:52:28Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Plan for Change: Migrate classic Conditional Access policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
