{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 4, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Purview compliance portal | Audit: The Cloud Policy service will integrate with Microsoft Purview Audit.\n</p><p>This message is associated with Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394280\" target=\"_blank\">394280</a>.\n</p><p><b>When this will happen:</b>\n</p><p>We will begin rolling out early-December (previously mid-June) 2024 and expect to complete by late December 2024 (previously late August).</p><p><b>How this will affect your organization:</b>\n</p><p>The Cloud Policy service allows Microsoft 365 admins to configure policies for Microsoft 365 Apps for enterprise and assign these policies using Microsoft 365 groups or Entra ID groups. After these policies are configured, they are enforced automatically as users sign in and use Microsoft 365 apps.\n</p><p></p>Changes made to policy configurations (create, update, delete) will be stored in Purview Audit, allowing admins to search and review change history. These logs will be available to Purview Audit Standard Users.<p></p><p>In the <a href=\"https://purview.microsoft.com/\" target=\"_blank\">Microsoft Purview compliance portal</a>, use the <i>Audit search</i> feature and filter on the <i>Cloud Policy service</i> workload:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/59532d78-732c-4074-a0af-c48cfc206b9e\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/deployoffice/admincenter/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Deploy Office | Microsoft Learn</a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394280"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview compliance portal will soon integrate with the Cloud Policy service to log policy changes, with the rollout now rescheduled from mid-June to early December 2024, and completion by late December 2024. This update is linked to Roadmap ID 394280."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC789309",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-04T23:17:43.28Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-30T23:39:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal | Audit: New Cloud Policy service audit logs for policy changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
