{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 15, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We will be gradually retiring the \"Cloud Discovery anomaly detection\" policy support from Microsoft Defender for Cloud Apps between June and July 2024.<br></p><p>After careful analysis and consideration, we have decided to retire it due to the high rate of false positives associated with this alert, which we found was not contributing effectively to the overall security of your organization. Our research indicated that this feature was not adding significant value and was not aligned with our strategic focus on delivering high-quality, reliable security solutions. We are committed to continuously improving our services and ensuring that they meet your needs and expectations.</p><p><b>When this will happen:</b>\n</p><p>We will begin rolling this out in late June 2024 (previously early June) and expect to complete by late September 2024 (previously late July).</p><p><b>How this will affect your organization:</b>\n</p><p>SOC administrators and analysts will no longer be able to access, manage and use \"<i>Cloud Discovery anomaly detection policy</i>\" alerts in \"<i>Microsoft Defender for Cloud Apps</i>\", when this change is implemented.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>If this policy type is used in your organization and is needed, we recommend using \"<i>App discovery policy</i>\" and create dedicated policies, under \"<i>Trigger a policy match if all the following occur on the same day</i>\" set the filters accordingly.</p><p>Please use the following resources for additional information:</p><ul><li>&nbsp;<a href=\"https://aka.ms/cloud-discovery-anomaly-doc\" target=\"_blank\">Cloud Discovery anomaly detection policy</a></li></ul><p>\n</p><p>\n</p><p>\n</p><p>\n</p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring the \"Cloud Discovery anomaly detection\" policy from Defender for Cloud Apps due to high false positives. Rollout begins late June 2024 and ends late September 2024. Affected users should switch to \"App discovery policy\" and set filters as needed."
    },
    {
      "Name": "HelpLink",
      "Value": "https://learn.microsoft.com/en-us/defender-cloud-apps/cloud-discovery-anomaly-detection-policy"
    }
  ],
  "EndDateTime": "2024-11-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC783218",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-15T23:40:05.263Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-22T21:54:50Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Cloud Discovery anomaly detection policy to be retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
