{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To align with best practices for Microsoft 365 core workload administration, we are changing the service plan requirements for certain admin roles in Microsoft Viva Engage. After this change rolls out, Global admins and Engage admins (also called the <i>Yammer administrator</i> role in Entra ID) will have the ability to perform Viva Engage administration without being assigned a service plan for Viva Engage. \n</p><p>This message is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=393230\" target=\"_blank\">393230</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2024 and expect to complete by the end of May 2024.\n</p><p><b>How this will affect your organization:</b> \n</p><p>Previously when the commonly used <a href=\"https://learn.microsoft.com/viva/engage/manage-engage-licenses-microsoft-365#block-users-who-dont-have-viva-engage-core-licenses\" target=\"_blank\">Block Office 365 users without Yammer licenses</a> option was selected, you needed to assign Engage Core or Yammer Enterprise service plans to Engage admins and global admins to access the Engage website (<a href=\"https://engage.cloud.microsoft\" target=\"_blank\">https://engage.cloud.microsoft</a>), the Engage admin center, or legacy network admin center. After this rollout, license enforcement will not apply to the Global admin or Engage admin roles.\n</p><p>This rollout does not apply to other roles, including Yammer Network Administrator, Yammer Verified Administrator, Corporate Communicator, Answers Administrator, and Community Administrator. These roles will continue to require a “Viva Engage Core” service plan when the tenant is configured to require a per-user license.\n</p><p>Note: Engage admins and Global admins who wish to access Viva Engage inside the Microsoft Teams application should ensure they have access to the right licensing required to access Teams. Learn more about licensing for Teams: <a href=\"https://www.microsoft.com/microsoft-teams/teams-products\" target=\"_blank\">All Microsoft Teams Product Plans | Microsoft Teams</a>\n</p><p><b>What you need to do to prepare:</b> \n</p><ul><li>You can choose to unassign the “Viva Engage core” and/or the “Yammer enterprise” service plan from Engage admins/ Global admins, since it’s no longer a prerequisite to access Viva Engage, Engage admin center or the legacy network admin center.\n</li><li>You can also choose to unassign the entire Microsoft 365 seat for these roles if it was earlier assigned for the sole purpose of Viva Engage administration.\n</li><li>Consider using the Engage admin role within Entra ID as more Engage experiences integrate with the rest of Microsoft 365. The Verified Administrator role is internal to Engage and not recognized by applications relying on Entra ID. \n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p>We will update this comm before rollout with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "393230"
    },
    {
      "Name": "Summary",
      "Value": "Global and Engage admins can manage Microsoft Viva Engage without a dedicated service plan after a change in May 2024. Other admin roles still require a \"Viva Engage Core\" plan. Admins should adjust licenses accordingly and update documentation. Rollout is automatic."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC781589",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-19T22:02:40.77Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-19T22:01:57Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Managing Microsoft Viva Engage no longer requires the assignment of a Microsoft 365 license seat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
