{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, you will be able to take or upload a photo and let our AI-enabled technology generate your digital avatar.</p>\n\n<p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-May 2024 and expect to complete by&nbsp;mid-June 2024.</p> \n\n<p><b>How this will affect your organization:</b></p><p>This feature is available in Microsoft Teams on Windows PC and Mac. To activate this option and enter immersive spaces on a PC, the system must meet the following minimum requirements:</p><ul><li>A quad-core processor.\n</li><li>At least 4 GB of RAM.</li></ul><p>The availability of this feature extends to a range of licenses, ensuring a broad spectrum of users can benefit from its capabilities. Eligible licenses include:</p>\n\n<ul><li>Microsoft Teams Enterprise</li><li>Microsoft Teams Essentials</li></ul><p>Additionally, this feature is accessible to subscribers of the following Microsoft 365, Office 365, and Business product suites that incorporate Teams:</p><ul><li>Microsoft 365 Business Basic</li><li>Microsoft 365 Business Standard.\n</li><li>Microsoft 365 Business Premium</li><li>Microsoft 365 E3/E5</li><li>Office 365 E1/E3/E5</li></ul>\n\n<p>Set up: In the Avatars for Teams app, users can easily create an avatar from a photo by clicking the ‘+’ sign, then choosing ‘Create from photo’. Each user can have up to three avatars. To make a new one when you have three, simply delete an existing avatar first.</p>\n\n<p>The Start page showcases two options to create your avatar. The first option is to create it from base avatar (the original manual process), and the second option is to create it from photo:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kE1p?ver=5961\" style=\"width: 600px;\"></p>\n\n<p>Current limitations: The Create avatar from photo feature requires Teams 2.1 or newer and is available exclusively on Teams for Windows PC and Mac. It is not supported in Immersive Spaces or the Mesh Standalone app.</p><p><b>What you need to do to prepare:</b></p>\n\n<p>To enable the Create avatar from photo feature in Microsoft Teams, turn on Mesh Avatars via the Teams Admin Center.</p>\n\n<p> </p><p>Additional Resources: </p><p>Learn more about how to manage apps in the Microsoft Teams admin center: </p>\n\n<ul><li><a href=\"https://learn.microsoft.com/en-us/microsoftteams/manage-apps\" target=\"_blank\"> Manage your apps in the Microsoft Teams admin center - Microsoft Teams | Microsoft Learn</a></li></ul>\n\n\n<p>This feature will also be available in Microsoft Teams 2.1 (i.e., new Teams) for Public Preview.&nbsp;&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce a feature to create avatars from photos using AI technology, rolling out in mid-May to mid-June 2024. It requires a quad-core processor, 4 GB RAM, and is available for various Microsoft Teams and Office 365 licenses. Users can create up to three avatars and need Teams 2.1 or newer on Windows PC or Mac. To prepare, enable Mesh Avatars in the Teams Admin Center."
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC789315",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-30T23:48:22.053Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-30T23:46:17Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Create avatars from photo",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
