{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This post provides updates on our end of support and end of availability plans for classic Teams. Classic Teams will reach end of support on July 1, 2024, and end of availability on July 1, 2025. Note: End of availability for classic Teams clients on Win 7, 8, 8.1 and Mac OS 10.12 is Oct 23, 2024. This applies to commercial and EDU. These dates do not apply to our US Government Cloud customers, VDI environments, Microsoft Teams Room devices (MTR) and Surface Hub devices (SHUB), and a separate post will be provided. Reference to our March MC post, MC746660.<br></p><p><b>How this will affect your organization:</b></p><p><i>Classic Teams will reach the end of support starting July 1, 2024\n</i></p><ul><li>Starting April 2024 users will see informational banners and dismissible warning dialog messages informing about the upcoming end of support.\n</li><li>Starting July 1, 2024, classic Teams will become unsupported. Users still running classic Teams will experience in-app dialog messages informing them that the client is no longer supported. These messages are dismissible but will reappear periodically.  \n</li></ul><p><i>Classic Teams end of availability (blocked from using classic Teams)\n</i></p><ul><li>Starting Oct 23, 2024, classic Teams desktop app on Windows 7, 8, 8.1 and Mac OS Sierra (10.12) will reach end of availability. After that date, users will not be able to access the classic Teams desktop clients from these operating systems. Users will experience non-dismissible in-app dialogs informing them about end of availability, with an option to use the new Teams web app on <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-web#prerequisites\" target=\"_blank\">supported browsers</a> as an alternative.\n</li><li>Starting July 1, 2025, classic Teams desktop app will reach end of availability for all users. The new Teams web app will be available on <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-web#prerequisites\" target=\"_blank\">supported browsers</a> as an alternative. \n</li><li>End of availability details can be found here:<a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability#what-happens-if-we-cant-update-users-to-new-teams\" target=\"_blank\"> End of availability for classic Teams client</a>. \n</li></ul><p><b>What you need to do to prepare:</b></p><ul><li>Users running the classic Teams Windows desktop on Windows 10 version that is less than 10.0.19041 or running macOS versions  <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-mac-install-prerequisites#prerequisites\" target=\"_blank\">on Big Sur(11) or lower</a> should work on updating your OS as soon as possible. The prerequisites for new Teams can be found <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center#prerequisites\" target=\"_blank\">here</a>.\n</li><li>For users in your organization with IT policies blocking app <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-troubleshooting-installation#to-check-this-setting-for-your-computer\" target=\"_blank\">installation </a>or who do not have local install permissions, are missing <a href=\"https://developer.microsoft.com/microsoft-edge/webview2/?form=MA13LH#download-section\" target=\"_blank\">WebView2</a>, or have other firewall issues that are preventing app installation, we strongly recommend mitigating these issues or leveraging deployment options such as <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-bulk-install-client\" target=\"_blank\">bulk deployment</a> to prevent any work stoppage for your users. \n</li></ul><p>Thank you for being a valued Teams customer!!</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Classic Teams will end support on July 1, 2024, and availability on July 1, 2025. Users will see informational banners starting April 2024 and experience non-dismissible dialogs post-availability end. Users should update their OS and address installation issues to prepare for the transition."
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC783985",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-04-23T19:45:23.207Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-23T19:44:55Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Classic Teams Timelines for end of support and end of availability",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
