{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 22, 2024: We have updated the content. Thank you for your patience.</p><p>With this feature update, if both the Microsoft 365 app and the standalone apps for Microsoft Word, Microsoft Excel, or Microsoft PowerPoint are installed on a user’s mobile device, the standalone app will be given preference for opening its respective file type over the Microsoft 365 app.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-September 2024 (previously early August) and expect to complete by mid-November 2024 (previously mid-October).</p><p><b>How this will affect your organization:</b>\n</p><p>Currently in Microsoft Outlook for iOS and Android, if users have both the Microsoft 365 app and the standalone apps for Word, Excel, or PowerPoint installed on their device, users will be prompted in Outlook mobile to open the document with the Microsoft 365 app. With this change, the user will instead be prompted to use the standalone app that fits the document type.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Review the app management policies for your organization. If you currently restrict users to only the use of the Microsoft 365 app for document opening and editing, consider allowing the standalone apps for Word, Excel, and PowerPoint for use as well. You also may want to notify your users about this change and update your training and documentation as appropriate.</p><p>Additional Resources:</p><p><a href=\"https://techcommunity.microsoft.com/t5/outlook-blog/changes-to-file-open-behavior-for-word-excel-and-powerpoint/ba-p/4275937\" target=\"_blank\">Changes to file open behavior for Word, Excel, and PowerPoint files on Outlook iOS and Android - Microsoft Community Hub</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The update for Microsoft Outlook on iOS and Android now prioritizes standalone Microsoft Office apps over the Microsoft 365 app for opening document files. Rollout starts mid-September 2024 and ends mid-November 2024. Organizations should adjust app policies and inform users accordingly."
    }
  ],
  "EndDateTime": "2024-12-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC788952",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-23T22:24:05.813Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-29T23:03:45Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Updated handling of Microsoft Office documents in Microsoft Outlook for iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
