{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 27, 2026: Based on customer feedback and visibility into adoption progress, we are refining the Exchange Online SMTP AUTH Basic Authentication Deprecation timeline to provide clearer milestones and additional runway.</p><ul><li>Now to December 2026: SMTP AUTH Basic Authentication behavior remains unchanged.</li><li>End of December 2026: SMTP AUTH Basic Authentication will be disabled by default for existing tenants. Administrators will still be able to enable it if needed.\n</li><li>New tenants created after December 2026: SMTP AUTH Basic Authentication will be unavailable by default. OAuth will be the supported authentication method.\n</li><li>Second half of 2027: Microsoft will announce the final removal date for SMTP AUTH Basic Authentication.\n</li></ul><p>We will provide detailed information in a follow up Message Center Post. \n</p><p>Updated October 18, 2024: We have updated the SMTP AUTH Clients Submission Report in the Exchange admin center, adding the Authentication Protocol column to show if Basic auth or OAuth is being used to submit email to Exchange Online. The data will build up over the next 90 days. Thank you for your patience.</p><p>The SMTP AUTH Basic Authentication Deprecation has been put on hold. In 2027, Microsoft will announce the final removal date for SMTP AUTH Basic Authentication.</p><p>Once Basic Auth is removed from SMTP AUTH, applications and devices will no longer be able to use Basic auth as an authentication method and must use OAuth when using SMTP AUTH to send email.</p><p>Basic auth is a legacy authentication method that sends usernames and passwords in plain text over the network. This makes it vulnerable to credential theft, phishing, and brute force attacks.&nbsp;</p><p><b>When this will happen:</b>\n</p><p>The removal of Basic Auth from SMTP AUTH Client Submission has been put on hold&nbsp;(previously beginning March 1st, 2026, and completing April 30th, 2026).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>The SMTP AUTH Clients Submission Report in the Exchange admin center has been updated to show if Basic auth or OAuth is being used to submit email to Exchange Online.&nbsp;</p><p>The removal of Basic Auth from SMTP AUTH Client Submission has been put on hold&nbsp;(previously beginning March 1st, 2026, and completing April 30th, 2026).</p><p><b>What you need to do to prepare:</b></p><p>\n</p><p>The removal of Basic Auth from SMTP AUTH Client Submission has been put on hold&nbsp;(previously beginning March 1st, 2026, and completing April 30th, 2026)</p><p>If your client supports OAuth, follow these steps: <a href=\"https://learn.microsoft.com/exchange/client-developer/legacy-protocols/how-to-authenticate-an-imap-pop-smtp-application-by-using-oauth\" target=\"_blank\">Authenticate an IMAP, POP or SMTP connection using OAuth</a>\n</p><p>If your client doesn’t support OAuth and you must use Basic Auth with Client Submission (SMTP AUTH), you will need to switch to one of the following alternatives following the timeline that will be announced in 2027 (previously April 2026):</p><p>•\tIf you are using basic authentication with Client Submission (SMTP AUTH) to send emails to recipients internal to your tenant, you can use Microsoft 365 High Volume Email. Please visit this site to learn more: <a href=\"https://learn.microsoft.com/Exchange/mail-flow-best-practices/high-volume-mails-m365\" target=\"_blank\">Manage high volume emails for Microsoft 365 Public preview</a></p><p>•\tIf you have an Exchange Server on-premises in a hybrid configuration, you can use Basic auth to authenticate with the Exchange Server on-premises or configure the Exchange Server on-premises with a Receive connector that allows anonymous relay on Exchange servers. Please visit this site to learn more: <a href=\"https://learn.microsoft.com/exchange/mail-flow/connectors/allow-anonymous-relay?view=exchserver-2019\" target=\"_blank\">Allow anonymous relay on Exchange servers</a>\n</p><p>Regardless of the volume of email, if you must use Basic auth to send email with Exchange Online, then you must use one of the alternatives or a 3P solution.\n</p><p>We understand that this change requires some adjustments, but we believe that this is a necessary step to enhance the security and reliability of our email service and your data.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Exchange Online will retire SMTP AUTH Basic Authentication by default starting December 2026, with OAuth as the supported method. Basic Auth removal is on hold until 2027, when a final date will be announced. Administrators can enable Basic Auth temporarily, but should prepare to switch to OAuth or alternatives."
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/exchange-team-blog/exchange-online-to-retire-basic-auth-for-client-submission-smtp/ba-p/4114750"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/exchange/clients-and-mobile-in-exchange-online/deprecation-of-basic-authentication-exchange-online"
    }
  ],
  "EndDateTime": "2026-03-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC786329",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-01-27T20:11:01.253Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T00:16:47Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Exchange Online to retire Basic Auth for Client Submission (SMTP AUTH)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
