{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting in May 2024, important changes will affect Microsoft Teams for Microsoft Windows. Tenant admins should be aware of these changes. New Teams on Windows will be changing its name from “Microsoft Teams (work or school)” to “Microsoft Teams”.<br></p><p>The Microsoft Teams personal application on Windows 11 will also be renamed to “Microsoft Teams – personal” if installed on users’ devices. These changes are in preparation for the unified Microsoft Teams application update that will allow users to log in to the Microsoft Teams application with any account type – work, school, or personal. Learn more in MC719659 <i>Microsoft Teams: Access work, school, and personal accounts in a single desktop app</i> (February 2024).</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early May 2024 and expect to complete by mid-May 2024.\n</p><p>General Availability: We will begin rolling out mid-May 2024 and expect to complete by early June 2024.</p><p><b>How this will affect your organization:</b>\n</p><ul><li>On Windows, the application ID will remain the same: MSTeams_8wekyb3d8bbwe.\n</li><li>All file names in the installation path will remain unchanged.\n</li><li>The Windows application display names on the Taskbar, Search, and Start menu will change to “Microsoft Teams”.</li></ul><p>Important: This MC Post will be updated with the minimum build number of new Teams that will contain the name change as soon as the number is available.</p><p>You may want to notify your admins and users about this change and update any relevant documentation as appropriate. If you have any questions, contact your customer success manager (CSM) or customer executive (CE) at Microsoft.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting in May 2024, the Microsoft Teams application for Windows will be renamed to \"Microsoft Teams,\" and the personal version on Windows 11 will be called \"Microsoft Teams – personal.\" This is in anticipation of an update allowing access to work, school, or personal accounts from a single app. Rollouts will begin in early May and finish by early June 2024. Tenant admins should inform their users and update documentation accordingly."
    }
  ],
  "EndDateTime": "2024-07-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC786324",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-26T00:12:33.503Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T00:12:00Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams (work or school) application on Windows will be renamed to Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
