{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This Microsoft Syntex feature update will allow SharePoint Online admins to specify sites on which to enable enhanced Microsoft Image Tagger.<br></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-April 2024 and expect to complete by late April 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early May 2024 and expect to complete by late May 2024.</p><p><b>How this will affect your organization:</b></p><p>With this change, users can choose which sites this service should be enabled for.</p><p>To restrict user access to this service, select <i>No sites</i> or <i>Selected sites </i>and follow the instructions to either select the sites or upload a CSV listing a maximum of 100 sites. Be sure to add your content center site if you want it to be included. You can then manage site access permissions for the sites you selected.</p><p>For more information, see <a href=\"https://learn.microsoft.com/microsoft-365/syntex/image-tagging-setup\" target=\"_blank\">Set up and manage enhanced image tagging in Microsoft Syntex</a>.</p><p><b>What you need to do to prepare:</b></p><p>You may want to notify your users about this change and update any relevant documentation or training as appropriate for those with relevant permissions who are familiar with configuring pay-as-you-go services such as Image Tagging.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Syntex will allow SharePoint Online admins to enable enhanced Microsoft Image Tagger on specific sites starting mid-April 2024 for Targeted Release and early May 2024 for General Availability. Admins can manage site access permissions and should update documentation accordingly."
    }
  ],
  "EndDateTime": "2024-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC786331",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-26T00:18:47.37Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-26T00:18:36Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Syntex: configure specific sites to enable enhanced Microsoft Image Tagger",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
