{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the Public Preview of delete stub, unlicensed and removed Microsoft Entra group users from Dataverse environments. Launching May 1, 2024, this feature will provide you with the ability to delete users with a disabled status in your Dataverse environment, offering greater flexibility in adhering to privacy laws and regulatory requirements, and to free up storage space.<br><br><b>What is a stub user?</b><br>Users which were imported from another system are created as a stub user with a disabled status in Dataverse. If a stub user is still active in Microsoft Entra ID and has a Power Platform license, their status can be converted from disabled to active.<br><br><b>How does this affect me?</b><br> \n\nPreviously, stub users, users missing a Power Platform license, and users removed from the Microsoft Entra group could not be deleted from a Dataverse environment. These types of users can no longer login to the environment, but remain in the Dataverse environment, in a disabled status. <br><br>Beginning May 1, 2024, you can <a href=\"https://aka.ms/ADO7077\">delete stub users from an environment</a> and <a href=\"https://aka.ms/ADO7077_1\">delete unlicensed or removed Microsoft Entra group members</a>.<br><br><b>Additional Information:</b><ul><li>Information about this release: <a href=\"https://aka.ms/ADO7077_2\">Delete stub, app, and non-security group users</a>.</li><li>Information about how to <a href=\"https://aka.ms/ADO7077_3\">Delete users from an environment</a>.</li>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-06-01T16:49:06Z",
  "HasAttachments": false,
  "Id": "MC789466",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-01T16:51:40.06Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-01T16:49:06Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Apps – Public Preview of delete stub, unlicensed and removed Microsoft Entra group users from Dataverse",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
