{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon, Microsoft Purview Insider Risk Management will be rolling out public preview of granular trigger throttling limits.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=382130\" target=\"_blank\">382130</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late May 2024 and expect to complete by mid-June 2024.\n</p><p>General Availability: We will begin rolling out late December 2024 and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With this update, we are introducing more granular trigger throttling limits to isolate the impact of a surge in noisy trigger volumes and prevent other policies from being affected. This ensures that organizations can receive critical alerts without being throttled by these limits. By default, these throttling limits will be applied:\n</p><ul><li>All sensitive triggers, including HR signals, Azure AD leavers, and custom triggers, will be limited to 15,000 per day per trigger.\n</li><li>All other triggers will be limited to 5,000 per day per trigger.\n</li></ul><p>Additionally, the policy health warning messages will be enhanced to assist admins with appropriate permissions in effectively identifying and addressing noisy triggers.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is needed from you to prepare for this rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-solution-overview\" target=\"_blank\">Insider risk management | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "382130"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing granular trigger throttling limits in a public preview by late May 2024, with general availability in late December 2024. This update aims to prevent policy interference from high trigger volumes, setting daily limits for sensitive and other triggers, and enhancing policy health warning messages. No preparation is needed from users."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC788980",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-04-29T23:11:25.653Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-04-29T23:10:56Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Granular trigger throttling",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
