{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams: As a part of this change, IT admins would see Teams Meeting Recording audit logs enriched with the consent data. The consent data would flow into audit logs irrespective of the Teams Meeting policy for attendance report. Today, the consent data is visible only in the attendance report. This change improves auditing of consent data for Teams Meetings.</p><p><b>When this will happen:</b></p>\n\n<p>General Availability (Worldwide): We will begin rolling out mid-May 2024 and expect to complete by late May 2024.</p><p><b>How this will affect your organization:</b></p>\n\n<p>If your organization had enabled \"explicit consent for recording\", IT admins would be able to access user consent information in the Teams Meeting audit logs.&nbsp;</p>\n\n<p><b>What you need to do to prepare:</b> </p>This is a non-breaking change. However, if you have not enabled the Teams Meeting consent in your tenant, you can do so as described in: <a href=\"https://learn.microsoft.com/microsoftteams/meeting-recording?tabs=meeting-policy\" target=\"_blank\">Teams meeting recording - Microsoft Teams | Microsoft Learn&nbsp;&nbsp;</a><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting mid-May 2024, IT admins will see enriched Teams Meeting Recording audit logs with consent data, regardless of the attendance report policy. This global update requires no action if \"explicit consent for recording\" is enabled, otherwise, follow the provided Microsoft Learn link to prepare."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/microsoftteams/meeting-recording?tabs=meeting-policy"
    }
  ],
  "EndDateTime": "2024-07-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC791598",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-09T23:55:20.973Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-09T23:55:06Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Explicit consent for recording data in audit logs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
