{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>For Microsoft Outlook on the web and new Outlook for Windows, we will be retiring <a href=\"https://support.microsoft.com/office/connect-apps-to-your-groups-in-outlook-ed0ce547-038f-4902-b9b3-9e518ae6fbab\" target=\"_blank\">Microsoft 365 Groups connectors</a> starting August 5, 2024, and ending September 5, 2024. Microsoft 365 Groups connectors deliver notifications and updates from online apps, tools, and services (such as Asana, Trello, or RSS) to Group email. Instead, we recommend using the <a href=\"https://make.powerautomate.com/\" target=\"_blank\">Microsoft Power Automate app</a> to continue receiving notifications/updates from these apps on Group email.</p><p><b>How this will affect your organization:</b>\n</p><p>After the Microsoft 365 Groups connectors retire, users will not be able to create new connections or update/manage existing configurations, and existing configurations will no longer receive new notifications. </p><p>Before this retirement, users set up these connectors by going to their Microsoft 365 Group's <i>Settings &gt; Connectors. \n</i></p><p><i>Workaround for users</i>\n</p><p>Users who wish to continue receiving notifications/updates from these apps on Group email can configure a connector with the <a href=\"https://make.powerautomate.com/\" target=\"_blank\">Power Automate app</a>.\n</p><ul><li>Users can build workflows to deliver emails to the Groups mailbox.\n<ul><li>Explore this step-by-step example: <a href=\"https://learn.microsoft.com/power-automate/get-started-logic-flow?tabs=classic-designer&amp;source=docs\" target=\"_blank\">Create a cloud flow in Power Automate - Power Automate | Microsoft Learn</a>. Note: In the <i>Specify an action</i> section &gt; Step 2, after selecting <i>Send an email (V2)</i>, users must enter the group's email address in the <i>To </i>field.\n</li></ul></li><li>Users can check the <a href=\"https://powerautomate.microsoft.com/connectors/\" target=\"_blank\">List of supported connectors | Microsoft Power Automate</a>.\n</li><li>Please note that each trigger must be set manually once by the user.\n</li><li><a href=\"https://learn.microsoft.com/power-platform/admin/power-automate-licensing/types\" target=\"_blank\">Premium connectors</a> such as Salesforce, Jira, and HTTP webhook require a <a href=\"https://powerautomate.microsoft.com/pricing/\" target=\"_blank\">Power Automate premium license</a>.\n</li></ul><p>Alternatively, users who are part of a Microsoft Teams channel backed by the same Microsoft 365 Group can choose to receive notifications in the channel as posts by creating a workflow (via the Workflows app that is powered by Power Automate). Learn more: <a href=\"https://support.microsoft.com/office/creating-a-workflow-from-a-channel-in-teams-242eb8f2-f328-45be-b81f-9817b51a5f0e\" target=\"_blank\">Creating a workflow from a channel in Teams - Microsoft Support</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This retirement will happen automatically by the specified date. Please notify your users about this retirement, update relevant documentation as appropriate, and share.</p><p>\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/connect-apps-to-your-groups-in-outlook-ed0ce547-038f-4902-b9b3-9e518ae6fbab\" target=\"_blank\">Connect apps to your groups in Outlook - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Groups connectors in Outlook will retire from August 5 to September 5, 2024. Users won't be able to create or manage connections, and existing ones won't receive updates. Microsoft recommends using Power Automate app as an alternative to receive notifications and updates on Group email. Users should prepare for this change by notifying their organization and updating documentation."
    }
  ],
  "EndDateTime": "2024-10-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC798683",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-06-04T23:20:30.107Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-04T23:19:53Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Outlook: Microsoft 365 Groups connectors retire starting August 5, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
