{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 22, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Purview: We are excited to announce upcoming enhancements to Microsoft Purview Data Loss Prevention (DLP). With the forthcoming update, the capability to scan, classify, and protect sensitive content on Windows endpoint devices will be significantly expanded. The number of supported file types will increase from approximately 40 to over 100, aligning endpoint coverage with other platforms like Exchange, SharePoint, and OneDrive. Additionally, this update will introduce several key enhancements, including:</p>\n\n<ul><li>Detection of labels from protected files (pfiles).\n</li><li>Identification of sensitive content within file metadata.\n</li><li>Recognition of sensitive information in PDF form fields.</li><li>Detection of sensitive information in files embedded inside office files (for example, a .txt file inside .pptx file)</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=171586\" target=\"_blank\">171586</a></p><p>\n</p>\n\n<p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out late June (previously late July) 2024 and expect to complete by late October 2024 (previously early October).</p><p>General Availability Worldwide: We will begin rolling out early November 2024 (previously early October) and expect to complete by late November 2024 (previously late October).\n</p>\n\n<p><b>How this will affect your organization:</b></p><p>The upcoming update will enhance DLP's content scanning on Windows devices. No changes to existing policies are required.</p><p>Summary of enhancements:</p><p>1.\tEnhanced file type coverage\n</p>\n\n<p>The file type coverage to scan, classify, and protect sensitive content on Windows Endpoint devices will increase from 40 file types to over 100. \n</p><p>This means that sensitive content in additional file types like BZ2, EML etc. will also start getting scanned and protected using DLP policies.</p><p>\n</p>\n\n<p>2.\tDetect label in PFILE</p><p>The DLP condition \"content contains sensitivity label\" now has the capability to detect labels from protected files (pfiles). This means that it can now read labels not just from Office and PDF files, but all other files where MIP label with protection can be applied via applications like AIP client, Secude etc. which converts the file into “pfile”.</p><p>Picture 1:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l3RK?ver=e328\" style=\"width: 400px;\"></p><p>A txt file converted to .ptxt (PFile) after applying a label. This label can now be detected with this preview.\n</p>\n\n<p>3.\tScanning metadata\n</p>\n\n<p>Ability to detect sensitive content in file metadata like custom properties in Office and PDF files.</p><p>Picture 2:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l1kz?ver=7fc6\" style=\"width: 400px;\"></p><p>4.\tScanning content embedded in Microsoft 365 office files\n</p>\n\n<p>If a file is embedded inside an office file (Microsoft Word/Excel/PowerPoint), the content of the embedded file is also scanned. For example, if a DOCX file containing credit card numbers is inserted into an XLSX file, the content of both XLSX and the embedded DOCX files will be scanned, and credit card numbers will be detected.\n</p><p>Picture 3:</p>\n\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lbkd?ver=777d\" style=\"width: 400px;\"></p><p>5.\tBetter scanning with PDF files\n</p>\n\n<p>·\tAbility to scan and detect sensitive content in PDF forms.\n</p>\n\n<p>·\tAbility to scan and detect sensitive content in permission protected PDF files. Permission protected PDF files are ones which do not require any password to open the file and read the content but require a password to edit/copy the content.\n</p>\n\n<p>Picture 4:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l3RN?ver=d64f\" style=\"width: 400px;\"></p><p><b>What you need to do to prepare:</b>\n</p>\n\n<p>You do not need do any changes to your existing policies. Your existing policies will seamlessly start scanning additional content as detailed above.</p><p>Additional Resources</p>\n\n<ul><li><a href=\"https://learn.microsoft.com/purview/endpoint-dlp-learn-about?view=o365-worldwide#monitored-files\" target=\"_blank\">Learn about Endpoint data loss prevention | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "171586"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention (DLP) on Windows devices will soon support over 100 file types, detect sensitive content in metadata, PDF form fields, and files within Office files. The update, part of Microsoft 365 Roadmap ID 171586, will roll out from late June to late November 2024. No policy changes are needed for existing users."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/purview/endpoint-dlp-learn-about?view=o365-worldwide"
    }
  ],
  "EndDateTime": "2024-12-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC791881",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-22T21:45:23.563Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-11T01:06:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Purview | Data Loss Prevention: Enhanced content extraction and file type coverage for DLP on Windows devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
