{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Since Microsoft Teams is governed by the <a href=\"https://docs.microsoft.com/lifecycle/policies/modern\" target=\"_blank\">Modern Lifecycle Policy</a>, the Teams desktop client needs to be up to date. Users who are on old versions of classic Teams app will receive in-app notifications to encourage them to update to the latest version of Teams. This is to ensure that users have the latest capabilities, performance enhancements, security features, and service reliability.\n</p><p>This in-app notification will not apply to users on machine wide (non-persistent setup) Virtual Desktop Infrastructure (VDI) deployments. Admins will need to regularly update those users to remain supported on Teams.\n</p><p>Per MC298823 (November '21), a version that is too far out of date will become incompatible with the service until it’s updated.   Also see MC783985 for Classic Teams Timelines regarding end of support and end of availability.\n</p><p><b>When this will happen:</b>\n</p><p>This will be enforced on June 19th, 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Classic Teams- Windows Versions less than 1.6.00.18681\n</p><ul><li>Beginning August 20th, 2024, the Teams desktop client may present a blocking page for users and request them to update to the latest version of Teams from <a href=\"https://www.microsoft.com/microsoft-teams/download-app\" target=\"_blank\">this page</a>.\n</li></ul><p>Classic Teams- Windows Versions less than 1.7.00.3653\n</p><ul><li>Beginning June 19th, 2024, the Teams desktop client may present a banner notifying users that they are on an unsupported version of Teams.\n</li></ul><p>Classic Teams - Mac Versions less than 1.6.00.35956\n</p><ul><li>Beginning August 20th, 2024, the Teams desktop client may present a blocking page for users and request them to update to the latest version of Teams from this page.\n</li></ul><p>Classic Teams - Mac Versions less than 1.7.00.3856\n</p><ul><li>Beginning June 19th, 2024, the Teams desktop client may present a banner notifying users that they are on an unsupported version of Teams.\n</li></ul><p>Note: as the service progresses old Teams version will be missing features and may have significant service degradation, though basic features will likely continue to function.\n</p><p>The risks of not updating to the most recent version are:\n</p><ul><li>Your Teams desktop client may miss important security and quality updates.\n</li><li>The reliability of your Teams desktop client may suffer without recent bug fixes.\n</li><li>Your Teams desktop client may not be compatible with the Modern Lifecycle Policy, resulting in unpredictable behavior and missing functionality.\n</li><li>Client versions with release dates that are more than 90 days older than the <a href=\"https://docs.microsoft.com/officeupdates/teams-app-versioning\" target=\"_blank\">current version's release date</a> may be blocked because the above is incompatible with the service.\n</li></ul><p>Note: Teams desktop clients on GCC High, DoD and 21Vianet currently have an exception to this <a href=\"https://docs.microsoft.com/microsoftteams/teams-client-update#servicing-agreement\" target=\"_blank\">servicing agreement</a> until further notice.\n</p><p><b>What you can do to prepare:</b>\n</p><p>To avoid disruption to end-users, the admins with users on Teams versions older than the supported versions (any versions with release dates that are more than 90 days older than the <a href=\"https://docs.microsoft.com/officeupdates/teams-app-versioning\" target=\"_blank\">current version's release date</a>) should update their users to the most recent version. Admins should plan for a regular update cadence to stay current and within the compatibility window. Please visit <a href=\"https://learn.microsoft.com/microsoftteams/teams-client-update\" target=\"_blank\">this page</a> to learn more.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams desktop client must be updated to comply with the Modern Lifecycle Policy. Unsupported versions will receive notifications or blocking pages starting June 19th, 2024. Admins should ensure regular updates for service reliability and feature compatibility. Non-compliance may lead to service degradation or incompatibility."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC794736",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-21T18:19:31.25Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-21T18:18:53Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Keep your Microsoft Teams desktop client compliant by updating it",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
