{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Viva, we’ve added a new quality report for leaders in Viva Insights, and improved features to help all employees manage their time in meetings.</p>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=393935\" target=\"_blank\">393935</a></p>\n\n\n<p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-May 2024 and expect to complete by late May 2024.</p>\n\n<p>General Availability (Worldwide): We will begin rolling out late May 2024 and expect to complete by early June 2024.</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<ul><li>Leaders will get a new meeting cost and quality report in the Viva Insights Teams app to help them review how much time their team spends in large and long recurring meetings. \n</li><li>Users in the Viva Insights Teams app will get an improved Meeting Review card that displays their large and long meetings, offering deeper insights into meeting quality and more comprehensive options to assess, modify, and track these meetings.</li><li>Users will also get nudges when they are organizing large and long recurring meetings in Outlook with recommendations for incrementally reducing the cost of a meeting.</li><li>The Meeting Categories and Meeting Habits cards in Viva Insights will each be streamlined into a single tab, with additional insights integrated into the new Meeting Review card.</li></ul><p>Leadership quality report, featuring the meeting review card:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l3gN?ver=0e75\" style=\"width:400px;\"></p>\n\n<p><b>What you need to do to prepare:</b></p>\n\n<p>These features are available to users with a Viva Insights premium license. Upon deployment, features will be activated by default for employees who have the Viva Insights premium license. The meeting cost and quality reports will not be distributed automatically, instead, they will be available to enabled employees through the Viva Insights Teams application.</p>\n\n<p>If you prefer to disable these new features for a portion or for the entirety of your organization, a global admin or Insights admin can use <a href=\"https://learn.microsoft.com/en-us/viva/feature-access-management\" target=\"_blank\">Viva Insights Feature Access Management (VFAM)&nbsp;</a>to manage which users have access to these features. When the feature is disabled using VFAM, leaders will not see the meeting cost and quality report, and individual users will not see cards or nudges to help manage their large and long meetings.</p><p>Additional Resources:</p>\n\n<ul><li>For Admins:&nbsp;<a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Microsoft Viva - Feature access management | Microsoft Learn</a></li><li>For End-users: <a href=\"https://support.microsoft.com/topic/meeting-habits-in-viva-insights-f41f7aa9-6d4a-40bb-b00a-36170f9dbbba\" target=\"_blank\">Meeting habits in Viva Insights - Microsoft Support</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "393935"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights is introducing a new meeting cost and quality report and improved features for managing meeting time. These will roll out from mid-May to early June 2024 for users with a Viva Insights premium license. Admins can manage feature access using VFAM."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS, Mac, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2024-07-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC790789",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-06T22:39:19.9Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-06T22:38:09Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Meeting cost and quality insights will be available in Viva Insights",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
