{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 17, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>Coming soon for new Microsoft Outlook for Windows and Outlook for web: Users will be able to add shared folders to their <i>Favorites</i> list in the top left corner of the screen. This message does not apply to Outlook for Mac or Outlook for mobile devices.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=388913\" target=\"_blank\">388913</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early February 2025 (previously early January) and expect to complete by early March 2025 (previously early February).&nbsp;</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early March 2025 (previously early February) and expect to complete by late April 2025 (previously early April).&nbsp;</p><p><b>How this will affect your organization:</b>\n<br></p><p>This new functionality will enable users to add shared folders and individual folders from shared mailboxes to their Favorites. This means that users can easily access important folders from shared resources or individual colleagues, directly from their Favorites. Users can share calendars, or folders that contain mail, contacts, tasks, or notes.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/86c68a9c-31e5-41b9-8062-43cdb3d2dcbb\" style=\"width: 244.006px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/open-and-use-a-shared-mailbox-in-outlook-d94a8e9e-21f1-4240-808b-de9c9c088afd#OfficeVersion=New_Outlook\" target=\"_blank\">Open and use a shared mailbox in Outlook - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388913"
    },
    {
      "Name": "Summary",
      "Value": "Users of the new Microsoft Outlook for Windows and Outlook for web will soon be able to add shared folders to their Favorites. The rollout starts in early February 2025 and completes by late April 2025. No action is required from admins, but user notification is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC799635",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-17T14:15:34.52Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-07T23:25:01Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Add shared folders to Favorites",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
