{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In February 2023, Microsoft Teams introduced a new version of Teams webinar that allows for more powerful and controlled registration, additional email capabilities, smooth external presenter capabilities, access control, and more. This will replace the initial version of Teams webinar by June 30th, 2024. </p><p><b>When will this happen:</b><br></p><p>The Microsoft Graph meeting registration Beta APIs that support the initial version are currently being retired and will stop returning data on September 30th, 2024.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>If you’re using the meeting registration APIs, in the next few months, you’ll need to update your solution to use the new Microsoft Graph webinar APIs and webhooks for your webinar solutions. The new APIs do not extend from the Microsoft Graph online meeting APIs the way that the meeting registration APIs do. Instead, they are part of a new Microsoft Graph webinar resource type.  \n</p><p>To help you update your solution, the following webinar APIs will be available in beta by May 2024: \n</p><ul><li>Get webinar attendee registration by user ID or email  \n</li><li>Cancel webinar registration  \n</li><li>Create webinar registration  \n</li><li>Create, update, and delete webinar presenter  \n</li><li>Get and list webinar presenters  \n</li><li>Create, update, and delete webinar  \n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Follow the links below to get more information:\n</p><ul><li><a href=\"https://devblogs.microsoft.com/microsoft365dev/deprecation-of-the-microsoft-graph-meeting-registration-beta-apis/\" target=\"_blank\">Deprecation of the Microsoft Graph meeting registration beta APIs</a></li><li><a href=\"https://support.microsoft.com/office/schedule-a-webinar-in-microsoft-teams-0719a9bd-07a0-47fd-8415-6c576860f36a\" target=\"_blank\">Schedule a webinar in Microsoft Teams</a>&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Graph meeting registration beta APIs will be retired, and data will stop returning on September 30th, 2024. Organizations using these APIs must update to the new Microsoft Graph webinar APIs and webhooks by May 2024. New webinar APIs will be available in beta to assist with the transition."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793004",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-15T00:14:35.737Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-15T00:13:59Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of the Microsoft Graph meeting registration beta APIs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
