{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 11, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Teams: Currently, the capability to <i>admit attendees from lobby</i> and the capability to <i>present</i> are combined into one meeting role: Presenter. This frequently results in situations where meeting participants, who are not in charge of meeting management, are able to admit people from the lobby to enter the meeting, and the meeting organizer has no way to control it. </p><p>With this feature update, we are addressing this gap by introducing a meeting option for meeting organizers to be in control of who can admit people from the lobby:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lvo7?ver=77e4\" style=\"width: 400px;\"></p><p>The new option <i>Who can admit from lobby&nbsp;</i>will have two choices:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lD6b?ver=1207\" style=\"width: 400px;\"></p><p>1. Only the organizer and co-organizers can admit from the lobby: This is the more secure option to be used for meetings where only organizers and co-organizers should be able to admit participants from the lobby.</p><p>2. The organizer, co-organizers, and presenters can admit from the lobby (default option): This mimics the current system behavior that presenters also get the right to admit participants from the lobby.</p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=392836\" target=\"_blank\">392836</a></p><p><b>When this will happen:</b></p><p>Targeted release: We will begin rolling out late September 2024 and expect to complete by early October 2024.&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out early October 2024 (previously early September) and expect to complete by mid-October 2024 (previously mid-September).\n</p><p>General Availability (GCC): We will begin rolling out mid-October 2024 (previously mid-September) and expect to complete by late October 2024 (previously late September).\n</p><p><b>How this will affect your organization:</b></p><p>Based on the above option, people who have access to admitting participants from the lobby, will also have these capabilities:</p><p>1. Receive notifications related to lobby activity, such as the lobby meeting start notifications or in-meeting lobby alerts</p><p>2. View lobby in the People tab during the meeting</p><p><b>What you need to do to prepare:</b></p><p>No specific action is needed to enable or utilize this capability for meetings in your organization</p><p>All existing meetings will be configured with organizers, co-organizers and presenters with this capability. </p><p>For all new meetings, the organizers will have access to set this option during scheduling time.</p><p>The default for this new meeting option can be configured by the tenant admins using the meeting policy:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lD6e?ver=05f2\" style=\"width: 400px;\"></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "392836"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"392836\":[{\"RoadmapId\":392836,\"Platform\":\"Mac\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-09-05T17:34:32.2989719Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":392836,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-09-05T17:34:32.2989717Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":392836,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-09-05T17:34:32.2989722Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new meeting option allowing organizers to control who can admit participants from the lobby, with a rollout timeline updated for September to October 2024. This update aims to address current issues with meeting management permissions. No specific action is needed to prepare for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-12-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC795085",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-11T22:27:42.333Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-22T22:52:02Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New meeting option to control permissions for admitting participants from lobby",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
