{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to general availability, the integration of Adaptive Protection with Microsoft Purview Data Loss Prevention. This integration enables admins, who are granted access to change, create, update and/or delete policies to configure policies where users are automatically included in the scope of data loss prevention (DLP) policies based on insider risk levels. For example, a DLP policy integrated with insider risk levels will prevent high-risk users from printing sensitive data, while allowing low-risk users to do so. We communicated the preview for this feature in MC512627<i> Microsoft Purview compliance portal: Announcing Adaptive Protection in public preview</i>. (preview) (Feb 2024).&nbsp;</p>\n\n<p>This integration will require a pre-requisite of E5 Compliance or Microsoft 365 E5  to use. Organizations that were using Adaptive Protection in public preview with Microsoft 365 E5 Insider Risk Management (IRM) or Microsoft 365 E5 Information Protection and Governance (IPG) Add-Ons - will need to upgrade to E5 Compliance to continue using Adaptive Protection.&nbsp;</p>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=117352\" target=\"_blank\">117352</a></p><p><b>When this will happen:</b></p>\n\n<p>General Availability Worldwide: We will begin rolling out early June 2024 and expect to complete by early July 2024.&nbsp; &nbsp; &nbsp;</p>\n\n<p><b>How this will affect your organization:</b></p>\n\n<p>Customers that were previously using Adaptive Protection with Microsoft 365 E5 Insider Risk Management (IRM) or Microsoft 365 E5 Information Protection and Governance (IPG) Add-Ons will be granted a 180-day grace period where your organization will continue to have access to Adaptive Protection without E5 Compliance or M365 E5 licenses. After this grace period, if your organization does not acquire E5 Compliance license, Adaptive Protection will be turned off for your organization. Users will no longer be assigned risk levels. Data Loss Prevention policies with the Insider risk level configured will not be deleted, but the policy will no longer be dynamic based on risk levels from Adaptive Protection.</p>\n\n<p><b>What you need to do to prepare:</b></p>\n\n<p>To maintain access to the Adaptive Protection integration with Data Loss Prevention beyond this 180-day grace period, your organization will need to upgrade to an E5 Compliance license    if you do not already have one.</p>\n\n<p>Additional Resources:</p><ul><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-adaptive-protection?tabs=purview-portal\" target=\"_blank\">Help dynamically mitigate risks with adaptive protection | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "117352"
    },
    {
      "Name": "Summary",
      "Value": "The integration of Adaptive Protection with Microsoft Purview Data Loss Prevention will be generally available soon, requiring an E5 Compliance license. Organizations previously using Adaptive Protection with certain add-ons will need to upgrade to maintain access after a 180-day grace period. Rollout begins in June 2024."
    },
    {
      "Name": "Summary",
      "Value": "The integration of Adaptive Protection with Microsoft Purview Data Loss Prevention will be generally available soon, requiring an E5 Compliance license. Organizations previously using Adaptive Protection with certain add-ons will need to upgrade to maintain access after a 180-day grace period. Rollout begins in June 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-08-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC791107",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-08T00:09:09.577Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-08T00:08:17Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Adaptive Protection integration will be generally available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
