{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 17, 2024: We have updated the rollout timelines below. Thank you for your patience.</p><p>Coming soon for Microsoft Teams devices: Teams devices admins will have the option to cancel device operations from the Teams admin center. This rollout applies to Teams Rooms on Android, Teams Phones, Displays, and Panels. This rollout is designed to provide administrators with greater control and flexibility in remotely managing their meeting and calling devices.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=395372\" target=\"_blank\">395372</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early July 2024 (previously late June) and expect to complete by mid-July 2024 (previously mid-July).\n</p><p>General Availability (GCC): We will begin rolling out mid-July 2024 (previously late June) and expect to complete by late July 2024 (previously late July).\n</p><p>General Availability (GCC High): We will begin rolling out early August 2024 (previously late July) and expect to complete by late August 2024 (previously mid-August).\n</p><p>General Availability (DoD): We will begin rolling out early September 2024 (previously late August) and expect to complete by mid-September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout, admins are not able to cancel operations.&nbsp;</p><p>After the rollout, admins will be able to cancel any queued or scheduled device operations that have not yet been initiated.\n</p><p>Operations that admins will be able to cancel:\n</p><ul><li>Device restart</li><li>Software update\n</li><li>Device diagnostics (download logs)\n</li><li>Configuration update\n</li><li>Remote sign-in\n</li><li>Remote sign-out\n</li></ul><p>Admins will be able to cancel operations by selecting the desired operation from the device’s <i>History</i> in the Teams admin center, either from the list page or from the <i>History</i> tab on the <i>Device</i> page. A confirmation prompt will ask if the cancellation is intentional, and after confirmation, the execution for the selected operation will be cancelled.\n</p><p>Administrators can also select multiple operations from the <i>History</i> tab (on the <i>Device detail</i> page) and cancel them in bulk.\n</p><p>Only operations that have not yet started to execute can be cancelled.\n</p><p>There will be no impact on existing operations.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p>We will update this comm before rollout with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395372"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"395372\":[{\"RoadmapId\":395372,\"Platform\":\"Web\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-06-24T17:33:14.9842374Z\",\"LatestRing\":null},{\"RoadmapId\":395372,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-06-24T17:33:14.9842418Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Soon, Microsoft Teams device admins will be able to cancel device operations from the Teams admin center. This feature will be available for Teams Rooms on Android, Teams Phones, Displays, and Panels, providing greater control over devices. Rollout will occur from early July to mid-September 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-21T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC792604",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T21:27:41.74Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-13T22:26:47Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams devices: Cancel device operations through the Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
