{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 7, 2025: We have updated the content and rollout timeline below. Thank you for your patience.\n</p><p>In 2023, we introduced Microsoft Teams apps that are compatible with Microsoft Outlook and the Microsoft 365 App (manifest version v1.13 or higher). Before this rollout, admin changes made in the Integrated apps section of the Microsoft 365 admin center would only affect these Teams apps in Outlook and the Microsoft 365 app. Similarly, changes made in the Teams admin center would exclusively affect Teams. Starting in June 2024, we will roll out Unified App Management to streamline the management of these apps across Teams, Outlook and the Microsoft 365 App, so they are consistently available across all supported clients.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=393931\" target=\"_blank\">393931</a>.\n</p><p><b>When this will happen:</b>\n</p><p>This rollout will happen in two major phases. Unified App Management can apply only to tenants that have migrated to app centric management in Teams admin center, as communicated in MC688930 <i>(Updated) Teams admin center: App centric management and changes to app permission policies</i> (November 2023).\n</p><ul><li>Phase 1 | General Availability (Worldwide): We will begin rolling out late-January 2025 (previously mid-December 2024) is now on hold (previously late March 2025), with further guidance to be provided by late May 2025 (previously late April). This phase applies to tenants with no modified settings in either the Microsoft 365 admin center (Integrated apps) or the Teams admin center for organization-wide defaults, app deployment, app availability, or block/unblock. No merge rules apply to these tenants, but after this phase, any app management setting configured in either admin centers will apply to all relevant hosts. \n</li><li>Phase 2: We will update this post with a timeline and more details in August 2025 (previously May 2025).&nbsp;&nbsp;</li></ul><p>\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, managing Teams apps that work in Outlook and the Microsoft 365 app was fragmented between the <i>Integrated app</i>s page in the Microsoft 365 admin center for Outlook and the Microsoft 365 app, and the Teams admin center for Teams. This sometimes resulted in different settings for the same app in the two admin centers. With Unified App Management, we will be consolidating app catalog management into a single platform. You will be able to manage apps on the <i>Integrated apps</i> page in the Microsoft 365 admin center or in the Teams admin center, and any changes made in either admin center will synchronize.\n</p><p><i>What you can expect</i>\n</p><ol><li>App catalog enhancements: Apps will start showing hosts where they are available: Teams, Outlook, or the Microsoft 365 app. \n</li><li>Organization-wide settings: App availability default settings will now apply to apps used in Teams, Outlook, and Microsoft 365 app.\n</li><li>App installs: Apps deployed from the Integrated apps page in Microsoft 365 admin center will be preinstalled in all applicable hosts for the app. Unlike app preinstallation in the Teams App setup policy, new app installs will provide access to the preinstalled apps, similar to deploying the app for Outlook and the Microsoft 365 App. <b>For more details on app deployment, refer to MC795355&nbsp;<i>Microsoft Teams admin center: App centric management for app installation and changes to app setup policies</i> (May 2024)</b>.</li><li>App availability: Managing app availability will apply to all applicable app hosts. \n</li><li>App block/unblock: Blocking or unblocking apps will apply to all applicable app hosts. \n</li><li>Consolidation of existing app settings: All existing app settings will be unified between Integrated apps (MAC) and Manage apps (TAC) pages. Merge rules can be found in&nbsp;<a href=\"https://learn.microsoft.com/MicrosoftTeams/manage-apps-across-m365\" target=\"_blank\">Manage apps that work across Teams, Outlook, and Microsoft 365 | Microsoft Learn</a>. These changes cannot be rolled back.\n</li><li>Consolidation report: After further review we have decided not to proceed with this change at this time. We apologize for any inconvenience.</li></ol><p><b>What you need to do to prepare:</b>\n</p><p>We recommend that you review app and tenant settings in the Microsoft 365 admin center and the Teams admin center. If these are managed by different departments in your organization, we recommend conducting these reviews collaboratively.\n</p><p>We also recommend that you review the merge rules and consider their potential impact on apps in your organization. Make any necessary adjustments to unify them in advance, if the merge rules in this message do not align with your expectations.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to update any relevant documentation as appropriate.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "393931"
    },
    {
      "Name": "Summary",
      "Value": "Starting June 2024, Microsoft will unify Teams app management across Teams, Outlook, and the Microsoft 365 app, consolidating settings from both the Microsoft 365 and Teams admin centers. The rollout begins in phases from January 2025, streamlining app availability, installation, and blocking with synchronized settings across platforms."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-10-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC796790",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-07T19:59:16.32Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-29T22:15:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Update: Microsoft 365 and Microsoft Teams: Unified management of Teams apps in Teams, Outlook, and the Microsoft 365 app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
