{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 20, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Outlook: When updating meeting attendees, organizers will be prompted to send updates only to added or removed attendees or to send updates to all attendees. This message applies to Outlook for the web and New Outlook for Windows.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394687\" target=\"_blank\">394687</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (GCC): We will begin rolling out late August 2024 (previously late July) and expect to complete by late September 2024 (previously late August).</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout, organizers who updated meeting attendees were not prompted with <i>Send</i> options.\n</p><p>After the rollout, the default state is on and this feature will be available to all users.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394687"
    },
    {
      "Name": "Summary",
      "Value": "Outlook will soon prompt organizers to send meeting updates only to added or removed attendees, affecting Outlook for the web and New Outlook for Windows. This feature, associated with Microsoft 365 Roadmap ID 394687, will roll out from late August to late September 2024. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-11-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC798322",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-20T22:22:53.293Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-03T23:38:06Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Send updates only to added or removed meeting attendees",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
