{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With this new feature, end users can delete non-empty document library folders containing many files on a site managed by a Retention policy. Additionally, folders covered under a Retention policy that have been deleted don’t reappear for users who sync a document library offline using Microsoft OneDrive for Business.<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394689\" target=\"_blank\">394689</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early May 2024 and expect to complete by mid-May 2024.</p><p><b>How this will affect your organization:</b><br></p><p>This new feature ensures that folders can be deleted as intended and folders remain deleted post-synchronization with OneDrive for Business. This feature is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>Get started with Data Lifecycle Management in the <a href=\"https://microsoft-onmicrosoft-com.access.mcas.ms/aad_login\" target=\"_blank\">Microsoft Purview compliance portal</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394689"
    },
    {
      "Name": "Summary",
      "Value": "The new feature allows users to delete non-empty folders under a Retention policy in SharePoint and OneDrive, ensuring they remain deleted after syncing with OneDrive for Business. It will roll out in early May 2024 and is associated with Microsoft 365 Roadmap ID 394689. Preparation involves getting started with Data Lifecycle Management in the Microsoft Purview compliance portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC791878",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-11T01:03:51.9Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-11T01:02:37Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Data Lifecycle Management | Enable deletion of non-empty folders under Retention policy in SharePoint and OneDrive",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
