{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Purview, Information Protection will introduce a new feature called Protection Policy to create new protection policies for label-based protection. This enhanced protection can be applied to the following services:</p><p><b>\n</b></p><p>\n</p><ul><li>Azure SQL: Databases hosted on Microsoft’s cloud platform.</li><li>Azure Data Lake Gen 2: Large-scale data storage and analytics service.\n</li><li>Azure Blob Storage: A service for storing large amounts of unstructured data.\n</li><li>Amazon S3: Amazon’s cloud storage service.\n</li></ul><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=394282\" target=\"_blank\">394282</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability: We will begin rolling out early November 2024 and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b></p><p>During the public preview phase, you can use these label-based protections without any extra cost. However, once this period ends, a pay-as-you-go pricing model will be implemented for continued use of these features.<br></p><p>To create your initial protection policy, go to the Microsoft Purview Portal and navigate to the Information Protection application.</p><p>This image shows a protection policy created for data sources within Azure:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kR1Q?ver=2625\" style=\"width: 600px;\"></p>\n<p><b>What you need to do to prepare:</b></p><p>Visit the Information Protection app in Microsoft Purview Portal and try to create your first protection policy. Learn more here:</p><ul><li><a href=\"http://Authoring and publishing protection policies (preview)\" target=\"_blank\">Authoring and publishing protection policies (preview) | Microsoft Learn</a></li></ul>\n<p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394282"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Information Protection introduces a new feature, Protection Policy, for label-based protection on Azure SQL, Data Lake Gen 2, Blob Storage, and Amazon S3. General availability starts early November 2024, with a public preview phase free of cost, followed by pay-as-you-go pricing. Prepare by creating a policy in the Purview Portal. Roadmap ID: 394282."
    }
  ],
  "EndDateTime": "2025-02-27T16:29:00Z",
  "HasAttachments": false,
  "Id": "MC790716",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-06T16:32:39.173Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-06T16:29:47Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection - Sensitivity label protection policy for Azure SQL, Storage, and Amazon S3",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
