{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 20, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon in Microsoft Teams: An enhanced content consumption experience in Teams chats and channels. We are about to release a series of features that will help you to identify, consume, and act on content such as files, lists, and SharePoint pages/posts. In this first release in the series, we will roll out file image previews in chats and channels, to help users better identify a file in the conversation stream. When a file (such as a JPG or PNG image file, a Microsoft PowerPoint file, or a PDF) is attached to a message in chat or a channel, users will see a small image of the file without opening the file.</p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=395936\" target=\"_blank\">395936&nbsp;</a></p><p>\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early June 2024 and expect to complete by early June 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early October 2024 (previously mid-June) and expect to complete by mid-November 2024 (previously late June).\n</p><p>General Availability (GCC): We will begin rolling out mid-November 2024 (previously late June) and expect to complete by late November 2024 (previously early July).\n</p><p>General Availability (GCC High): We will begin rolling out early December 2024 (previously early July) and expect to complete by late December 2024 (previously late July).\n</p><p>General Availability (DoD): We will begin rolling out early January 2025 (previously late July) and expect to complete by late January 2025 (previously late July early August).\n</p><p><b>How this will affect your organization:</b>\n</p><p><i>Image preview benefits</i>\n</p><ul><li>Quickly scan for and find the file you need\n</li><li>Preview part of the file content before opening it\n</li><li>Save time and bandwidth by avoiding unnecessary file downloads and file opens\n</li></ul><p>To use the new file image previews, users will upload or share a file in a chat or a channel, and then see an image preview of the file content (and its metadata) in the message. Users can also select the image preview to open the file.\n</p><p>When a message has multiple images attached, users will be able to select one image, and then click the right arrow to page between the other attached images.\n</p><p>If the recipient does not have the access to the file or if the file is marked <i>Confidential,</i> image previews will not be shown.\n</p><p>Teams message with image previews for three attached files:</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/77dadd0c-9a6c-47bf-abd3-a7311cc3254f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>We will update this comm before rollout with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon introduce file image previews in chats and channels, enhancing content interaction. This feature allows users to see a small preview of attached files like images, PowerPoint, or PDFs. Rollouts begin in June 2024, with different completion dates for various user groups. No admin action is needed before the rollout."
    }
  ],
  "EndDateTime": "2025-02-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC790792",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-20T22:30:29.353Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-06T22:40:35Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: New file image previews in messages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
