{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 6, 2024: We have updated the content with additional information. Thank you for your patience.</p><p>We're simplifying our OneDrive for Business web URLs to make it easier for customers to navigate to and around OneDrive. When you visit OneDrive web, you will see that the current URL has the format “tenant-my.sharepoint.com/personal/alias/_layouts/15/onedrive.aspx?view=1” and the <i>new</i> URL will have the format “tenant-my.sharepoint.com”.</p><p>We will also replace the name of the pivot in the URL when the user browses to a pivot, e.g. “tenant-my.sharepoint.com/my”, “tenant-my.sharepoint.com/favorites”.&nbsp;</p><p><b>When this will happen:</b></p><p>\n</p><p>General Availability (Worldwide, GCC, GCCHigh, DoD): We will begin rolling out mid-June 2024 and expect to complete by mid-July 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>This change will gradually be rolling out to everyone from mid-June to mid-July. End users will see the <i>new</i> URL when they navigate to OneDrive web and when they browse to a pivot (e.g. Home, My Files, Favorite, etc.). The end user will no longer see the “personal/alias/_layouts/15/onedrive.aspx” information in the URL when they open a folder within OneDrive or navigate to a Team or Site in the Quick Access list.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lXDr?ver=69d1\" style=\"width: 400px;\"><br></p><p> </p><p>There will be no change to the URL when they open a file.</p><p> No existing scenarios will be impacted by this change. Attempts to access the previous URL (tenant-my.sharepoint.com/personal/alias/_layouts/15/onedrive.aspx?view=1) will be redirected to the new URL. All sharing links, bookmarks, and custom redirectors (e.g., typing tenant.onedrive.com to go to OneDrive Web) will remain functional. Browsing content within another user's OneDrive will also continue to work and will display the old URL format. There will be no changes to SharePoint Web URLs.\"</p><p><b>What you need to do to prepare:</b></p><p>You don’t need to do anything to prepare. However, you may want to update your user training to reflect the <i>new</i> OneDrive URL.</p><p>Although end users will see a simplified URL, the underlying URL to a user's OneDrive is unchanged. Any scripts or automation will be unimpacted by this change. If you need to reference an end user's OneDrive via its unique URL, you can access it using the methods described here: https://learn.microsoft.com/en-us/sharepoint/list-onedrive-urls&nbsp;</p><p>For your awareness, we plan to make future improvements to (1) simplify the OneDrive URL for files, folders and sites and (2) update the tenant-my.sharepoint.com domain to onedrive.cloud.microsoft. However, we don’t have a timeline to announce for either of these changes.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneDrive for Business is simplifying web URLs for easier navigation, rolling out mid-June to mid-July 2024. The new format will be \"tenant-my.sharepoint.com\" with no impact on existing scenarios. Redirects from old URLs will function, and no preparation is needed from users, though user training may be updated. Automation and scripts remain unaffected. Future improvements are planned without a specified timeline."
    }
  ],
  "EndDateTime": "2024-09-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC796476",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-06T23:26:41.21Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-28T22:47:42Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "OneDrive for Business: Shortened URLs in OneDrive web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
