{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce an improved version of the Custom Trainable Classifier creation.</p>\n\n<p>Today, you can create custom trainable classifiers to use as content conditions in Purview auto-labeling, DLP, or retention policies, where Microsoft’s out-of-the box classifiers do not suit your needs. This is done by training a custom trainable classifier from your own proprietary documents. Once created, they can also be visible in Content Explorer as part of our data at rest scanning. Documentation for the existing feature: <a href=\"https://learn.microsoft.com/purview/trainable-classifiers-get-started-with\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Get started with trainable classifiers | Microsoft Learn</a>.</p>\n\n<p>Files supported:</p><ul><li>English language only.</li><li>Supported file types.\n</li></ul><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out early May 2024 and expect to complete by mid-May 2024.</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2024 and expect to complete by late June 2024.</p><p><b>How this will affect your organization:</b></p>\n\n<p>Our improved version will replace the existing instance of this feature, the benefits are:</p><ul><li>Faster training time, with no need for a background model to be created prior to the custom classifier creation.</li><li>Simpler sample document gathering – only a positive sample set, and negative sample set is required at the beginning of training.\n</li><li>Automatic testing - No longer is a test set of both positive and negative samples required at the testing stage. Now this is automatic.\n</li><li>More clarity around the trainable classifier creation flow and results.</li></ul><p>New results screen:&nbsp;&nbsp;</p>\n\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l9Qg?ver=93a1\" style=\"width: 600px;\"></p><p>Please note that existing custom trainable classifiers that were created prior to this feature and currently unpublished will no longer be available.</p>\n\n\n<p><b>What you need to do to prepare:</b></p><p>If you have unpublished custom classifiers today, that you would like to keep, then please publish them.</p>\n\n<p>Additional Resources</p><ul><li>Admins: <a href=\"https://learn.microsoft.com/purview/trainable-classifiers-learn-about\" target=\"_blank\">Learn about trainable classifiers | Microsoft Learn</a></li><li>End-users: <a href=\"https://learn.microsoft.com/en-us/purview/trainable-classifiers-learn-about\" target=\"_blank\">Learn about custom classifiers | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's improved Custom Trainable Classifier is now in Public Preview, offering faster training, simpler sample gathering, automatic testing, and clearer creation flow. It supports English files and will replace the existing feature, with full rollout by late June 2024. Unpublished classifiers will be unavailable; users should publish them to retain."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://review.learn.microsoft.com/en-us/purview/trainable-classifiers-learn-about?branch=pr-en-us-2003"
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC791100",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-08T00:03:24.353Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-08T00:01:36Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Improved Custom Trainable Classifier now in Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
