{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To solve for discoverability and ease of usage of @Mentions in activity, The ‘@Mention’ filter along with ‘Unread’ will be displayed upfront to the users as selectable pills while the other filters will be retired.</p><p>Instead, we recommend the utilization of upfront mentions pill, which address the bullseye of filtering needs in Activity feed and is where we will continue to invest our development resources.</p><p><b>When this will happen:</b></p><p>Targeted Release:&nbsp; beginning early May 2024, and the roll out will be completed by mid-May 2024.</p><p>General Availability:&nbsp; beginning late May 2024 and expect to complete by mid-June 2024.</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because your organization may be using 'more' filters option including filters for missed calls, replies, reactions, apps in Activity Feed.</p><p>Users will no longer be able to go to 'more' filters to choose filters for missed calls, replies, reactions and apps in Activity feed while mentions filter will be brought upfront as an upfront filter pill, when this change is implemented.</p><p><b>What you need to do to prepare:</b><br></p><p>Instead of using 'More' filters, we recommend using the upfront filter pills or type search.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The '@Mention' and 'Unread' filters will be made more accessible in the Activity Feed, while other filters will be retired. Users should use the upfront filter pills or type search instead. The rollout for Targeted Release begins early May 2024, with General Availability starting late May 2024."
    }
  ],
  "EndDateTime": "2024-07-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793967",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T22:14:41.9Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-17T22:14:31Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Bringing mentions filter upfront and retirement of other filters in Activity Feed",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
