{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft 365 is upgrading its search functionality by phasing out certain aspects of Natural Language (NL)-Based Search support. However, the standard keyword-based search functionality will remain unchanged and will continue to be the primary method for accessing information within Microsoft 365 products.</p><p><b>When this will happen:</b></p><p>We will begin rolling this out in early July 2024 and expect to complete by late July 2024.</p><p><b>How this affects your organization:</b></p><p><i>How will these changes impact the way I search in Microsoft 365? \n</i></p><p style=\"margin-left: 25px;\">Moving forward, you will need to use specific keywords to search for information. For instance, NL queries like \"emails from John about planning\" will no longer work as expected. Instead, this type of query will retrieve any email containing the words 'John' and 'planning'.\n</p><p style=\"margin-left: 25px;\">\n</p><p style=\"margin-left: 25px;\">\n</p><p style=\"margin-left: 25px;\">\n</p><p style=\"margin-left: 25px;\">\n</p><p style=\"margin-left: 25px;\">Keyword searches, search filters, and selected natural language queries for emails, files, calendar items, and acronyms will continue to be supported.</p><p><i>Which Microsoft 365 products are affected by these changes?\n</i></p><p>\n</p><p>\n</p><p style=\"margin-left: 25px;\">The affected products include Outlook Desktop (OD), Outlook Mobile (OM), Outlook Web Access (OWA), Teams Desktop (TD), Teams Mobile (TM), SharePoint (SPO), OneDrive for Business (ODB), Microsoft Search on Bing (MSB), and Microsoft Search on office.com (MSO).&nbsp;<br></p><p><b>What you can do to prepare:</b></p><p><i>Are there any tools available to help me transition from NL-based to keyword-based searches?\n</i></p><p>\n</p><p style=\"margin-left: 25px;\">Yes, you can utilize search filters provided within each Microsoft 365 product to refine search results. For example, within Outlook applications, using the 'From' filter will automatically populate the search bar with the phrase \"from:\" followed by a person's name (which can also be manually entered). This action, such as entering \"from:John Carter,\" will refine the search to display only emails received from that specific person (e.g., “John Carter”).<br></p><p>For further details, please refer to the&nbsp;<a href=\"https://support.microsoft.com/en-us/office/updates-to-natural-language-based-search-in-microsoft-365-0c819cb0-980c-47c3-8e67-5c4fec6b6b87?preview=true\" target=\"_blank\">Updates to natural language-based search in Microsoft 365</a><a href=\"https://support.microsoft.com/office/updates-to-natural-language-based-search-in-microsoft-365-0c819cb0-980c-47c3-8e67-5c4fec6b6b87?preview=true\" target=\"_blank\"></a> documentation.<br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is reducing support for Natural Language-Based Search in favor of keyword-based searches, starting early July 2024. Affected products include Outlook, Teams, SharePoint, OneDrive, and Microsoft Search on Bing and office.com. Users can use search filters to aid the transition."
    }
  ],
  "EndDateTime": "2024-09-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793654",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-16T23:07:27.167Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-16T23:06:32Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Updates to natural language-based search in Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
