{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Viva: We’re excited to announce that Viva Connections is enhancing its spotlight capabilities, providing operators with more control over the content displayed in the spotlight section. </p><p>Spotlight currently features a total of 11 slots for content display, with the enhanced update allowing for a greater variety of content to be shared in the section between 'pinned items' and SharePoint news posts. Pinned items will always be displayed first and shown to every user in the Connections experience, giving operators the ability to highlight the most important content. The remaining slots will dynamically populate with news content from the SharePoint News Source(s) selected by the operator and will continue to follow boosted news priority and audience targeting settings. This enhancement will be specifically for the desktop experience of Viva Connections, ensuring a seamless blend of prioritized content and dynamic news updates, providing users with a rich and engaging experience.</p>\n\n<p>Figure 1:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lclw?ver=d959\" style=\"width: 400px;\"></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=392098\" target=\"_blank\">392098</a></p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-May 2024 and expect to complete by mid-May 2024.</p><p>General Availability (Worldwide, GCC, GCCHigh, DoD): We will begin rolling out late May 2024 and expect to complete by late May 2024.\n</p><p><b>How this will affect your organization:</b></p><p>Upon completion of the rollout, a new Settings button will be introduced in the spotlight. Operators will see this button when they initially select the Edit button in the spotlight. This feature facilitates the customization of the spotlight component, allowing for the pinning of content, reordering of pinned items, and selection of SharePoint sites as news sources.</p>\n\n<p>Figure 2:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lclt?ver=08ed\" style=\"width: 300px;\"></p><p>For tenants that have not generated any content on their home site or in the Connections experience, Viva Connections will display out-of-the-box cards in the spotlight to help users orient themselves in Connections until the section is configured by the operator. These cards will vanish one by one as operators add content to the spotlight, either from the news source(s) selected by the operator or by pinning items directly onto the spotlight. Once two or more items are added to the spotlight section, the Discover more news in your feed card will remain as the last card in the spotlight section, similar to its function in the component today.</p><p>Figure 3:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lclz?ver=6851\" style=\"width: 300px;\"></p>\n\n<p><b>What you need to do to prepare:</b></p><p>If you have a home site paired with your Viva Connections instance and don’t currently have news, begin generating news on the Connections instance and add it as a content source for the spotlight. Additionally, you can select various content sources for the spotlight if you wish to diversify the news you receive.</p><p>Additional Resources:</p><ul><li><a href=\"https://learn.microsoft.com/viva/connections/edit-viva-home\" target=\"_blank\">Customize and edit the Viva Connections home experience | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "392098"
    },
    {
      "Name": "Summary",
      "Value": "Viva Connections is enhancing spotlight capabilities, providing more control over content display with 11 slots. Pinned items will be shown first, followed by dynamic SharePoint news. The desktop experience will blend prioritized content with news updates. Rollouts begin mid-May 2024, with new customization settings introduced. Preparation involves generating news and selecting content sources for spotlight."
    },
    {
      "Name": "Summary",
      "Value": "Viva Connections is enhancing spotlight capabilities, providing more control over content display with 11 slots. Pinned items will be shown first, followed by dynamic SharePoint news. The desktop experience will blend prioritized content with news updates. Rollouts begin mid-May 2024, with new customization settings introduced. Preparation involves generating news and selecting content sources for spotlight."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/viva/connections/edit-viva-home"
    }
  ],
  "EndDateTime": "2024-07-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC791602",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-09T23:57:32.233Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-09T23:57:13Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva: Enhanced capabilities for spotlight in Viva Connections!",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
