{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 4, 2025: We have updated the timeline. Thank you for your patience.&nbsp;</p><p>Coming soon for Microsoft Teams: App centric management for admin app installation introduces new admin settings to control who in the tenant has specific Teams apps preinstalled. Similar to app centric management for app availability, as communicated in MC688930 <i>(Updated) Teams admin center: App centric management and changes to app permission policies</i> (November 2023), admins will be able to install apps for users, groups, or everyone in the organization.</p><p>After rollout, app-centric management will let admins install apps individually. Existing Installed apps in app setup policies will remain intact; however, no new additions will be permitted, and only deletions will be allowed. Instead, you can install Teams apps for selected users, groups, or all users directly from the respective app. Other settings in app setup policies, including Pinned apps, will remain unchanged.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394274\" target=\"_blank\">394274</a>&nbsp;and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=500637\" target=\"_blank\">500637</a>.</p><p><b>When this will happen:</b>\n</p><p>App centric management will roll out in following General Availability phases.\n</p><ul><li>Phase 1 | We will begin rolling this feature mid-October 2025 and complete rollout by end of February 2026 (previously end of November 2025). Phase 1 applies to tenants who meet both conditions: 1) tenants with no Installed apps&nbsp;in the Global app setup policy and&nbsp;2) tenants with no custom app setup policies created in the Teams admin center.\n</li><li>Phase 2 | We will begin rolling this feature end of October 2025 and complete rollout by end of February 2026 (previously mid-December 2025) for all remaining tenants.</li></ul><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: If you install an app to a user, the user cannot actually use an admin preinstalled app if you did not take the additional step to allow the user to use it. After the rollout, if you install an app through app centric management, the user will immediately be able to use the app.\n</p><p>After the rollout, you can install any number of Teams apps for selected sets of users, groups, or all users in the organization from the respective apps.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/install-teams-apps\">Preinstall Teams apps for your org users - Microsoft Teams | Microsoft Learn</a> </p><p><b>What you need to do to prepare:</b>\n</p><p>No action needed for Phase 1 tenants. We will update this message with more information before the rollouts for Phases 2 tenants.\n</p><p>You may want to update any relevant documentation as appropriate.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394274,500637"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"394274\":[{\"RoadmapId\":394274,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-07-18T17:33:19.3011059Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":394274,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-07-18T17:33:19.3011064Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce app-centric management for admin app installation, allowing admins to install apps directly for users, groups, or everyone. Existing app setup policies remain but only allow deletions. Rollout starts mid-October 2025 through February 2026 in two phases, with no action needed for Phase 1 tenants."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-02-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC795355",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-12-04T18:21:03.823Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-23T22:35:04Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: App centric management for app installation and changes to app setup policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
