{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 6, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In Microsoft Teams, users will be able to add their own custom emojis and reactions by uploading an image or GIF file, and their emojis and reactions will be accessible to all users in the tenant alongside the standard Teams emojis and reactions. Up to 5,000 custom emojis can be added per tenant.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=80659\" target=\"_blank\" style=\"\">80659</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early July 2024 (previously late June) and expect to complete by mid-July 2024 (previously early July).</p><p>Worldwide: We will begin rolling out early August 2024 (previously mid-July) and expect to complete by early September 2024 (previously late July).</p><p>GCC: We will begin rolling out late September 2024 (previously mid-July) and expect to complete by early October 2024 (previously late July).</p><p>GCC High: We will begin rolling out early October 2024 (previously early August) and expect to complete by mid-October 2024 (previously late August).</p><p> DoD: We will begin rolling out mid-October 2024 (previously early August) and expect to complete by late January 2025 (previously late October).</p><p><b>How this will affect your organization:</b></p><p>This new custom emojis and reactions feature will be turned on by default. Users in the tenant will be able to upload emojis that are visible to the whole tenant. You can pre-emptively turn this feature off or restrict users who can create new emojis via the Teams Admin Center controls described below.</p><p><i>How do I use this feature?</i></p><p>Custom emojis and reactions will be found in the emoji and reaction menus in the Custom category. Users with upload abilities can add new content through the plus (+) button. Users with delete abilities can right-click any custom emoji to delete. Please note that deleted emojis may take up to 24 hours to reflect for all users in the tenant. Deleted emojis may take up to 24 hours to reflect for other users.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kzUG?ver=4bba\" style=\"width: 500px;\"><br></p><p><i>How do I manage this feature?</i></p><p>This feature can be managed through the Teams Admin Center. Admins will have access to the following controls:</p><ul><li>Turn the feature on/off for the whole tenant via the Messaging Settings page (on by default).</li><li>Set which users can create new emojis via the Messaging Policy groups (on for all users by default).</li><li>Set which users can delete emojis via the Messaging Policy groups (off for all users except admins by default).</li></ul><p>The Teams Admin Center controls will be made available in early June. We recommend adjusting your settings as needed prior to the Targeted and Worldwide Releases&nbsp;in late June 2024 to ensure that they are in place when the feature rolls out.</p><p><b>What you need to do to prepare:</b></p><p>This feature is on by default. If you would like to turn the feature off, please use the provided setting in the Messaging Settings page:</p><p><i>Messaging Settings</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kHHN?ver=20f7\" style=\"width: 500px;\"><br></p><p><br></p><p>This feature allows all users to create new emojis by default&nbsp;and only allows admins to delete emojis by default.&nbsp;If you would like to adjust emoji creation and deletion permissions, please make the appropriate changes through the Messaging Policy groups:</p><p><i>Emoji Creation Setting (enabled for all users by default)</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kCxt?ver=4309\" style=\"width: 500px;\"><br></p><p><i>Emoji Deletion Setting (only enabled for admins by default)</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kHHS?ver=fa4b\" style=\"width: 500px;\"></p><p>Additional feature capabilities:<br></p><p><i>View custom emojis in the emoji menu</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kF7Z?ver=f35d\" style=\"width: 500px;\"></p><p><i>Press the plus (+) menu to select an image to upload</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kF8I?ver=0aa2\" style=\"width: 500px;\"></p><p><i>Set a name for your emoji</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kzUS?ver=1f70\" style=\"width: 500px;\"><i><br></i></p><p><i>Right-click on an emoji to delete or to see the creator</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kCxT?ver=6b13\" style=\"width: 500px;\"></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating to allow users to add up to 5,000 custom emojis and reactions per tenant. The rollout timeline has been updated, with various release dates for different user groups starting from early July 2024. This feature will be on by default but can be managed in the Teams Admin Center. Roadmap ID: 80659."
    }
  ],
  "EndDateTime": "2025-03-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC795750",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-08T00:45:37.73Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-24T22:09:22Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Custom emojis and reactions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
