{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 25, 2024: We have updated the content. Thank you for your patience.</p><p>Video files tend to be very large and consume lots of space against your Microsoft OneDrive and Microsoft SharePoint storage quotas. Currently, when you make metadata changes such as title, description, transcripts, chapters, interactivity, thumbnails, media settings, etc. to files in Microsoft Stream, each of those changes cause new versions to be created. Each of these versions in Microsoft OneDrive and Microsoft SharePoint count the full file size towards consumed storage quota. Thus, for large video and audio files, these versions cause your storage consumption to quickly increase.<br></p><p>To prevent this, we are changing how Microsoft Stream handles versioning. Any changes made specifically to chapters and transcripts of files from Stream will stop making versions, thus preventing storage from increasing as rapidly as it has in the past.&nbsp;&nbsp;</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=395380\" target=\"_blank\" style=\"\">395380</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-July 2024 and expect to complete by late August 2024.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Changes to video and audio files from Stream will no longer take version snapshots. This means that any metadata changes in chapters and/or transcripts made through Stream cannot be reverted to previous versions.&nbsp;&nbsp;</p><p>The following actions will no longer create a version in the file’s version history:</p><ul><li>Adding or editing chapters, and transcripts</li><li>Toggling transcript media settings&nbsp;&nbsp;</li></ul><p>The following actions will still create a version in the file's version history:</p><ul><li>Editing title or description from within Stream</li><li>Adding audio tracks.</li><li>Editing column metadata in SharePoint document library for a video file. </li><li>Editing title or description from outside of Stream. </li><li>Replacing the file with a new different version of the file. </li><li>Other operations outside of the Stream app. </li><li>Toggling media settings (show/hide about video, chapters, interactivity, comments, analytics, etc.).&nbsp; This change will happen by default, and there will not be a way to revert to the previous behavior where everything changed in Stream created versions.</li></ul><p>This change will happen by default, and there will not be a way to revert to the previous behavior where chapters and transcripts changed in Stream created versions. </p><p>This change will only stop new versions from being taken from Stream. To clean up existing versions of files or versions taken outside of Stream, the SharePoint team has a separate capability and new settings coming that will help clean up low value versions (see Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=145802\" target=\"_blank\">145802</a>). Admins must complete this action for each site, and it will take approximately 30 days before the new version of the site is in effect.&nbsp;</p><p>For more information, visit <a href=\"https://prod.support.services.microsoft.com/office/versioning-in-stream-e9f68891-56b3-4fb1-a45b-da29822ca3a9?preview=true\" target=\"_blank\">Versioning in Stream - Microsoft Support</a>.</p><p> </p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. This change will happen by default, and there are no settings to control it. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395380"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Stream is modifying versioning to reduce storage space usage. Changes to chapters and transcripts will no longer create new versions, thus not increasing storage consumption. This update is part of Microsoft 365 Roadmap ID 395380 and will be implemented worldwide from mid-July to late August 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC797116",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-25T18:49:51.503Z",
  "Services": [
    "Microsoft Stream"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-30T23:05:00Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Stream: Less storage space consumed for Stream videos in Microsoft 365 Suite",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
