{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 23, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In Microsoft Graph Connector, Connection statistics is an essential tool for admins to gain precise insights into crawled and indexed items. This enhancement will help admins in comprehending the total number of items discovered, successfully indexed, or failed across all crawls. It will provide a cumulative perspective on the sync between the data source and Microsoft graph connector index. With this enhancement, admins can swiftly identify discrepancies and ensure that their connection is up to date.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late June 2024 and expect to complete by early July 2024.</p><p>General Availability (Worldwide): We will begin rolling out late June 2024 and expect to complete by late July 2024 (previously early July).</p><p><b>How this will affect your organization:</b>\n</p><p>Admins will be able to have a snapshot of the status of index in their connection making it easier to proceed with the connection publishing process:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lN1T?ver=0295\" style=\"width: 600px;\"></p><p><b>What you need to do to prepare:</b>\n</p><p>There is no change required for this feature update. This will start showing up after the recent full crawl with the latest data.</p><p>Additional Resources:</p><p><a href=\"https://learn.microsoft.com/microsoftsearch/connector-details-errors#view-connection-statistics\" target=\"_blank\">Microsoft Graph connectors view details and errors | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message discusses the introduction of Connection statistics for admins in Microsoft Graph Connector, providing insights into crawled and indexed items. It will be available in Public Preview and General Availability from late June to late July 2024. No preparation is needed for this update."
    }
  ],
  "EndDateTime": "2024-08-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC799278",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-23T18:43:25.077Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-06T23:48:42Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Graph Connector: Connection statistics for Admins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
