{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 14, 2024: We have updated the content below with additional information about controls. Thank you for your patience.</p><p>A new sync window feature will be available in Microsoft Outlook. This feature allows you to choose how many days' worth of emails and attachments you want to download to your device. This way, you can always access your emails and attachments, even when you're offline.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=189809\" target=\"_blank\">189809</a></p><p><b>When this will happen:</b>\n</p><p>We will start rolling out in early June 2024 and expect to complete the rollout by late June 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>With this feature, users will have access to the following new settings:\n</p><ul><li>Days of Mail to Sync: Users can select how many days of emails they want to sync to their devices, with options ranging from 1 to 30 days.\n</li><li>Include Attachments: There is a toggle option to auto-download all attachments received within the selected sync window. For example, if a user sets their sync window to 14 days and turns this toggle on, all attachments received in the past 14 days will be automatically downloaded to their devices.\n</li></ul><p>Microsoft Intune controls available:\n</p><ul><li>Admins can specify a default sync window.\n</li><li>Admins can allow or disallow changes to the default sync window.\n</li></ul><p>The keys for these settings are:\n</p><ul><li><code>com.microsoft.outlook.Settings.DaysToSync\n</code></li><li><code>com.microsoft.outlook.Settings.DaysToSync.UserChangeAllowed</code>\n</li></ul><p>It is the admin's responsibility to set a valid value (from 1 to 90).\n</p><p>This is the first version of the sync settings we'll be releasing. To maintain the best performance of the app, we are initially releasing a limit of a 90-day sync window. We plan to expand this limit as soon as we can confirm that the app performs well in production. Depending on the size of the mailbox, you may encounter some limits when downloading messages and/or attachments, but rest assured, we're continuously working on improving this feature. Your feedback is greatly appreciated!</p><p>This feature is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>To enable and use the sync window feature, follow these steps:</p><ol><li>Go to <i>Settings</i>.</li><li>Under the <i>General </i>section, select <i>Accounts. </i>If you have multiple accounts, choose the one that you want to configure.</li><li>Look for <i>Sync Settings</i> under <i>Data Storage</i>.</li></ol><p>This will allow you to customize your sync preferences and ensure you have the emails and attachments you need, even without an internet connection.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "189809"
    },
    {
      "Name": "Summary",
      "Value": "Outlook will introduce a sync window feature, allowing users to select the number of days' emails to sync for offline access, with options from 1 to 30 days, including attachments. This feature is associated with Microsoft 365 Roadmap ID 189809 and will roll out in June 2024. Admins can set default sync settings, and users can customize their preferences. Initially, there's a 30-day sync limit and a 2,000 message download limit."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2024-08-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC798682",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-14T17:54:45.403Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-04T23:18:52Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Emails sync to your device for offline use",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
