{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To simplify Microsoft Teams IT administration, we are introducing a Unified settings and policies management experience in the Microsoft Teams admin center. Now, you'll find the <i>search</i>, <i>locate</i>, and <i>manage settings</i> <i>and policies</i> in one place, which means you won’t have to search under multiple locations in TAC to manage Teams for your users, groups, and organization.</p><p>Unified settings &amp; policies page in Teams admin center:&nbsp;<br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lbXi?ver=3da9\" style=\"width: 400px;\"></p>\n\n<p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early June 2024 and expect to complete by early July 2024.</p>\n\n<p>General Availability (GCC): We will begin rolling out early September 2024 and expect to complete by late September 2024.</p><p>General Availability (GCC High): We will begin rolling out early September 2024 and expect to complete by late September 2024.</p><p>General Availability (DoD): We will begin rolling out early September 2024 and expect to complete by late September 2024.</p>\n\n<p><b>How this will affect your organization:</b></p><p>You will see this new Settings and policies option in TAC starting June 2024 and should be available to all tenants by end of July 2024.</p><p>Tenants will see this new Settings and policies option in TAC in all Microsoft Teams commercial licenses and will be available in all regions.</p>\n\n<p><b>How this will affect your organization:</b></p><ul><li>The new unified settings and policy experience in Teams admin center will replace the existing separate settings and policy pages for each feature area. \n</li><li>The new experience will not change the functionality or behavior of the settings and policies themselves, nor will it affect the end-user experience of Teams. It will only change how you access and manage the settings and policies in Teams admin center.\n</li><li>As an IT Admin, you will see a more consistent and simplified way to configure and customize Microsoft Teams features for your organization and streamlined policies management.</li><li>To further assist with managing settings and policies, the UI now includes additional information and guidance, such as descriptions, tooltips, documentation links, and coach marks for better clarity and support.\n</li><li>You will be able to see the details of each setting and policy, such as the value, the last updated date and user, and the assigned users and groups.</li></ul>\n\n<p><b>What you need to do to prepare:</b></p>\n\n<ul><li>Once the change reaches your tenant, you can opt-in or opt-out until you become familiar with this change.  \n</li><li>Watch for additional message center communication regarding the mandatory default change; at which time, the option to opt-out will no longer be available. (expected by end of September 2024).</li><li>If you choose the new experience, the current separate tabs for <i>policies and settings</i> in Teams admin center will disappear, and the new tab <i>Settings &amp; policies</i> will show up as the only tab to manage all your settings and policies.</li><li>You do not need to make any changes to your existing settings and policies, as they will be automatically migrated to the new experience.</li><li>However, you may want to review and update your settings and policies to ensure that they are aligned with your organization's needs and preferences, and that they are applied to the appropriate users and groups.</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams admin center is introducing a unified settings and policies management experience, consolidating them in one place for easier administration. Rollout begins in June 2024, with options to opt-in or opt-out until mandatory adoption by the end of September 2024. No changes to existing settings and policies are required."
    }
  ],
  "EndDateTime": "2024-11-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC791599",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-09T23:55:53.423Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-09T23:55:34Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Unified settings and policies management in Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
