{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>A new feature gives audience engagement metrics on interactive Microsoft Stream videos. Users with edit access to a Stream video that contains links, polls, or callouts will be able to see the number of unique viewers and the percentage of those who viewed or clicked on interactive elements in the video, as well as the average number of interactions and average attention time.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=396732\" target=\"_blank\" style=\"\">396732</a></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out in mid-May 2024 and expect to complete by mid-June 2024.\n</p><p>General Availability: We will begin rolling out in mid-June 2024 and expect to complete by mid-July 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>These audience engagement metrics help video owners understand what content is most engaging. This new feature will be available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "396732"
    },
    {
      "Name": "Summary",
      "Value": "A new feature in Microsoft Stream will provide engagement metrics for interactive videos, showing unique viewer counts, interaction percentages, and average attention time. Rollout begins mid-May 2024 for Targeted Release and mid-June 2024 for General Availability, with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC795748",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-24T22:07:59.38Z",
  "Services": [
    "Microsoft Stream"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-24T22:07:40Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Stream: Interactivity analytics",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
