{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This Message center post outlines some of the reasons why users may remain on classic Teams and what steps the administrators need to take to transition users to new Teams or address existing problems. This applies to Commercial, EDU, Government cloud customers as well as VDI environment users. Reference to our last MC post regarding End of Support and End of availability (MC783985 April '24) \n</p><p><b>How this will affect your organization</b>\n</p><p>As we transition users to new Teams, there may be a small number of users in your organization that may remain on classic Teams. These users do not yet meet the necessary requirements for the update and need deliberate action from you to transition them. There could be one or multiple of these issues preventing them from receiving new Teams. Please review the list below and suggested mitigations to avoid any work stoppage for your users. (More details are available in our new Teams <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deployment-checklist\" target=\"_blank\">checklist</a>)   \n</p><ul><li><i>Operating system:</i> The following operating systems do not meet requirements for installing new Teams: Windows 10 version 10.0.19041 or lower, Windows 10 LTSC or Mac OS lower than macOS Monterey (12).</li><li><i>Policies blocking app installations:</i> Organizational <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/teams-administration/fix-new-teams-installation-issues#policy-settings-prevent-download-and-installation\" target=\"_blank\">Policies</a> blocking app installation (MSIX) and the Teams Meeting add-in (MSI).</li><li><i>Other software blocks:</i> Any management software including firewalls, <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/teams-administration/include-exclude-teams-from-antivirus-dlp\" target=\"_blank\">Antivirus</a> or <a href=\"https://learn.microsoft.com/microsoftteams/applocker-in-teams\" target=\"_blank\">AppLocker</a> that references classic Teams or prevents app installations. For third-party products, please refer to the manufacturer's documentation.\n</li><li><i>Missing WebView 2:</i> Users without the latest version of <a href=\"https://learn.microsoft.com/microsoft-edge/webview2/concepts/enterprise\" target=\"_blank\">WebView 2</a> deployed.\n</li><li><i>Users on old version of classic Teams client:</i> If users are using classic Teams application versions lower than 1.6.00.27573 (windows), 1.6.00.35956 (Mac).\n</li></ul><p><b>What you need to do to prepare:</b></p><ul><li><i>Update operating system:</i> Users running classic Teams Windows desktop on Windows 10 version that is less than 10.0.19041 or running macOS versions <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-mac-install-prerequisites#prerequisites\" target=\"_blank\">on Big Sur(11) or lower</a>&nbsp;should work on updating your OS as soon as possible. Microsoft recommends updating Windows 11 and macOS Sonoma (version 14). The prerequisites for new Teams can be found <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center#prerequisites\" target=\"_blank\">here</a>.</li><li>VDI Customers should plan to update to Windows Server 2019 (10.0.17763) or Windows Server 2022 (10.0.20348) or higher to get started on their new Teams journey. For details on VDI system requirements, visit this <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-vdi-requirements-deploy#requirements\" target=\"_blank\">page</a>.</li><li><i>Resolve device policy restrictions:</i> <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/teams-administration/fix-new-teams-installation-issues#policy-settings-prevent-download-and-installation\" target=\"_blank\">Policies</a> must not block new Teams installation (MSIX) and the Teams Meeting add-in (MSI) or the <a href=\"https://learn.microsoft.com/microsoft-edge/webview2/concepts/enterprise\" target=\"_blank\">Webview2 updater</a>. We strongly recommend mitigating by either updating to Evergreen Webview2 installer or leveraging deployment options such as <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-bulk-install-client\" target=\"_blank\">bulk deployment</a></li><li><i>Fix other software blocks:</i> For any other firewalls, <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/teams-administration/include-exclude-teams-from-antivirus-dlp\" target=\"_blank\">Antivirus</a> or <a href=\"https://learn.microsoft.com/microsoftteams/applocker-in-teams\" target=\"_blank\">AppLocker</a> issues that are preventing app installation, we strongly recommend mitigating these issues or leveraging deployment options such as <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-bulk-install-client\" target=\"_blank\">bulk deployment</a> to get new Teams for users.</li><li><i>Update Teams client version: </i>Users on Teams versions that are older than the supported versions (any versions released over 90 days prior to the <a href=\"https://docs.microsoft.com/officeupdates/teams-app-versioning\" target=\"_blank\">current version's release date</a>) must update their desktop client to the latest version. Administrators should plan for a regular update cadence to remain current and within the compatibility window. Please visit <a href=\"https://learn.microsoft.com/microsoftteams/teams-client-update\" target=\"_blank\">this page</a> to learn more.</li><li><i>Note:</i> Please refer to our checklist for more information on new Teams requirements: <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deployment-checklist\" target=\"_blank\">Deployment checklist for new Teams client - Microsoft Teams | Microsoft Learn</a>;</li><li>Classic Teams end of availability details can be found here: <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability#what-happens-if-we-cant-update-users-to-new-teams\" target=\"_blank\">End of availability for classic Teams client</a>.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message outlines steps for administrators to transition users from classic Teams to new Teams, including updating operating systems, resolving policy restrictions, addressing software blocks, and updating Teams client versions. It applies to various customer types and includes a checklist and resources for assistance."
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793321",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-15T21:50:57.503Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-15T21:50:41Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Resolving issues for users remaining on classic Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
