{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are introducing a new converged experience that enables you to access preview features for Microsoft Defender XDR products in the new <a href=\"https://aka.ms/preview-controls\" target=\"_blank\">preview features settings</a> page in the Defender XDR portal.\n</p><p><b>When this will happen:</b>\n</p><p>As part of the converged experience, tenants in the <i>Microsoft Defender XDR and Microsoft Defender for Identity</i> public preview will be added automatically to the <i>Microsoft Defender for Cloud Apps</i> public preview starting July 7, 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>If you don’t want to be added to the Defender for Cloud Apps public preview, update your Microsoft Defender for Cloud App <a href=\"https://aka.ms/preview-controls\" target=\"_blank\">preview features settings</a> in the Defender XDR portal by July 1, 2024. If you'd like to keep your MDA settings as they are, follow these steps: undo the current setting for MDA, save it, and then redo it and save your changes again. At each step, verify that you see a success message.\n</p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/preview\" target=\"_blank\" style=\"\">Preview features in Microsoft Defender XDR - Microsoft Defender XDR | Microsoft Learn</a></p><p></p><p><b>What you need to do to prepare:</b>\n</p><p><i>If you don’t take action by July 1, 2024, your consent is implied, and any relevant changes will appear in your portal starting July 7, 2024.</i>\n</p><br>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender XDR is introducing a new experience for accessing preview features. Users will be automatically added to the Microsoft Defender for Cloud Apps public preview on July 7, 2024, unless they update their preview features settings by July 1, 2024. Failure to act implies consent to the changes."
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC797122",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-30T23:09:10.58Z",
  "Services": [
    "Microsoft Defender XDR",
    "Microsoft Defender for Cloud Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-30T23:08:39Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender XDR: Please take action regarding your preview features status",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
