{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With this Microsoft Teams feature, there is a new way to use the People app on Teams Phones devices, which will provide a faster and simplified experience. The People app will let users switch between different contact lists with a faster interface. Users can also add people from the directory or create contact groups.&nbsp;&nbsp;</p><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=396773\" target=\"_blank\">396773</a>.</p><p><b>When this will happen:</b>&nbsp;</p><p>General Availability (Worldwide, GCC): We will begin rolling out in mid-July 2024 and expect to complete by late July 2024.</p><p>General Availability (GCCHigh): We will begin rolling out in late July 2024 and expect to complete by late August 2024.</p><p><b>How this will affect your organization:</b></p><p>Once a user updates the People feature app to the latest version on a Teams Phone device, they will see a faster and simplified experience.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lwjM?ver=9ab9\" style=\"width: 300px;\"><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lE7r?ver=d311\" style=\"width: 250px;\"><br></p><p><b>What you need to do to prepare:</b></p><p>Please ensure that your Teams Phone devices are updated with the latest People app to get access to this new feature. This feature will only be available with the latest app update.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "396773"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Teams feature enhances the People app on Teams Phone devices, offering a quicker, more streamlined experience. Users can switch between contact lists rapidly, add people, or create groups. The rollout begins in mid-July 2024, with updates necessary to access the new feature. Microsoft 365 Roadmap ID 396773 details this update."
    },
    {
      "Name": "Platforms",
      "Value": "Android"
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC799282",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-06T23:55:16.557Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-06T23:54:12Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: People app on Teams phone devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
