{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Defender for Cloud Apps experience in Defender XDR is now generally available. Auto-redirection is enabled by default for all customers, and starting June 16th, 2024, there will be no opt-out option available.</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Rollout began in November 2023 and we expect to complete by early June 2024.</p><p>General Availability (GCC, GCCHigh, DoD): We will begin rolling out early June 2024 and we expect to complete by early June 2024.</p><p><b>How this will affect your organization:</b></p><p>Beginning on June 16th, 2024, the redirection toggle will no longer be available for all customers. All users accessing Microsoft Defender for Cloud Apps will be automatically rerouted to the Microsoft Defender XDR portal with no option to opt-out.</p><p><b>What you need to do to prepare:</b></p><p>To prepare, ensure to move your Microsoft Defender for Cloud Apps operations to the Microsoft Defender XDR portal.</p><p>\n</p><ul><li>Learn more by reviewing our documentation: <a href=\"https://aka.ms/MDA-in-XDR\" target=\"_blank\">Microsoft Defender for Cloud Apps in Microsoft 365 Defender | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Defender for Cloud Apps experience is now generally available in Defender XDR, with auto-redirection enabled by default. Starting June 16th, 2024, there will be no opt-out option. Rollouts began in November 2023 and will complete by early June 2024. Organizations should prepare by moving operations to the Defender XDR portal."
    }
  ],
  "EndDateTime": "2024-07-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793323",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-15T21:56:14.09Z",
  "Services": [
    "Microsoft Defender for Cloud Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-15T21:54:42Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Cloud Apps experience in Defender XDR",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
