{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 27, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Purview: The feature to configure  HR resignation date as a condition for risk level in Adaptive Protection will be rolling out to General Availability. We communicated the preview for this feature in MC681240<b> </b><i>Adaptive Protection in Microsoft Purview: Public preview of HR resignation date as a condition for risk level (November 2023).</i></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=124972%2C\" target=\"_blank\">124972</a>&nbsp;and&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=171748\" target=\"_blank\">171748</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability: We will begin rolling out late June 2024 and expect to complete by mid-December 2024 (previously late mid-November).</p><p><b>How this will affect your organization:</b></p><p>When the HR connector has been configured, admins with appropriate permissions can now select the HR resignation date as a condition to assign a minor, moderate, or elevated risk level. For example, an admin can configure the elevated risk level to be assigned when an HR resignation date is sent via the HR connector.</p><p><b>What you need to do to prepare:</b></p><p>No action is required for this update. To configure user’s risk level for Adaptive Protection, admins can visit Insider Risk Management &gt; Adaptive Protection (preview) &gt; risk levels for Adaptive Protection.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>Additional Resources:</p><p>You can access the Insider Risk Management solution in the Microsoft Purview compliance portal.</p><ul><li><a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Home - Microsoft Purview&nbsp;</a></li></ul><p>\n</p><p>Learn more about adaptive risk mitigation:</p><ul><li> <a href=\"https://learn.microsoft.com/purview/insider-risk-management-adaptive-protection#risk-levels\" target=\"_blank\">Help dynamically mitigate risks with Adaptive Protection (preview) | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "124972,171748"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Adaptive Protection feature, which allows HR resignation date to be used as a risk level condition, is rolling out to General Availability. The rollout is expected to complete by mid-December 2024. No action is required for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC795079",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-28T00:46:20.123Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-22T22:45:38Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management - Adaptive Protection - HR resignation date as a condition for risk level",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
