{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As of May 16, 2024, Microsoft requires add-in developers to prompt users for camera, microphone, and geolocation permission in these Microsoft Office applications:\n</p><ul><li>Web versions of Microsoft Word, Excel, PowerPoint, and Outlook on Chromium-based browsers (such as Microsoft Edge or Google Chrome).\n</li><li><a href=\"https://support.microsoft.com/office/656bb8d9-5a60-49b2-a98b-ba7822bc7627\" target=\"_blank\">New Outlook for Windows</a>\n</li></ul><p>Add-ins that run on Office on Windows, Mac, or Safari already have prompts in place.\n</p><p>To allow add-in developers to prompt their users, we are releasing a <a href=\"https://aka.ms/DevicePermissionAPI\" target=\"_blank\">Device Permission API</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): This API will be available on May 16, 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>For developers: If your organization is building add-ins for these affected Office applications and your add-in requires permission for microphone, camera, or geolocation, your developers must implement the new API to add the new prompt for the add-in to work. If your Outlook add-in uses event-based activation, browser permissions aren't inherited and prompting for permission isn't supported or recommended.\n</p><p>For users: Users may see extra prompts if they are using certain add-ins that run on these affected Office applications. To learn more, see <a href=\"https://support.microsoft.com/office/16278816-1948-4028-91e5-76dca5380f8d\" target=\"_blank\">View, manage, and install add-ins for Excel, PowerPoint, and Word</a>.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your developers and users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting May 16, 2024, Microsoft will require add-in developers to prompt users for device permissions on Edge and Chrome for the web versions of Word, Excel, PowerPoint, and Outlook. A Device Permission API will be available to facilitate this change. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-08-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC792499",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-16T19:14:15.183Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-13T17:40:11Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 for the web: Add-in device permission prompt for camera, microphone, and geolocation on Edge and Chrome",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
