{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Introducing a new draggable version of the Presenter Toolbar in Microsoft Teams that gives presenters more control over the shared screen space. Presenters can customize the location of the Presenter Toolbar based on the layout of the content being shared.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394270\" target=\"_blank\" style=\"\">394270</a></p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early June 2024 and expect to complete by mid-June 2024.<br></p><p>General Availability&nbsp;(Worldwide): We will begin rolling out mid-June 2024 and expect to complete by late June 2024.</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>When sharing content during a meeting, presenters can reposition the Presenter Toolbar from its default location at the top of the screen to any other area of the shared screen by moving it to the preferred position. The Presenter Toolbar can be dragged from any non-interactive area as well as from a new drag handle.<br></p><p>Also, the Presenter Toolbar will use minimum space by collapsing when not in use after a timeout of 4 seconds. When collapsed, a red badge showing the sharing status will still be visible to clearly indicate the ongoing sharing session.</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394270"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"394270\":[{\"RoadmapId\":394270,\"Platform\":\"Desktop\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2024-05-29T17:34:03.8199117Z\",\"LatestRing\":\"TargetedRelease\"},{\"RoadmapId\":394270,\"Platform\":\"Mac\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2024-05-29T17:34:03.8199114Z\",\"LatestRing\":\"TargetedRelease\"},{\"RoadmapId\":394270,\"Platform\":\"All\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2024-05-29T17:34:03.8199119Z\",\"LatestRing\":\"TargetedRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new draggable Presenter Toolbar for screensharing, offering presenters more control and customization. It will roll out in stages from early June to late July 2024, with no preparatory action required for organizations. Presenters can reposition the toolbar and it will collapse when not in use."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-09-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC791109",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-08T00:10:26.143Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-08T00:09:55Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Draggable Presenter Toolbar when screensharing",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
