{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "Updated on June 21, 2024: We will not be able to fully roll out this change in June 2024. We have updated the rollout timeline below to reflect the change. We apologize for the delayed communication. <br><br>\nWe are announcing that the tenant setting \"disableShareWithEveryone\" that was previously set to \"off\" by default, will now be set to \"on\" by default. This means that makers will not be able to share their canvas apps with the “Everyone” group without changing this setting. We’re doing this to align with Microsoft's recent security recommendations of being “Secure by Default”. Preventing sharing with this group aligns with this security posture due to the overexposure of data that comes with sharing an app with “Everyone” when it is not required.<br><br><b>How does this affect me?</b><br>If you have explicitly set the tenant setting \"disableShareWithEveryone\" to $false (i.e. enabling sharing canvas apps with \"Everyone\"), changes made to your tenant will be delayed. We will communicate via a new Message center post when we can change it for you. <br><Br>If you haven't explicitly set \"disableShareWithEveryone\" to $false, you can expect the change to take place by July 12, 2024.  <br><br>No action is required on your part. We will start rolling out this change in the coming weeks.<br><ul><li>Canvas apps that are currently shared with “Everyone” will not break or be affected by this default change. This setting will only prevent future attempts to share canvas apps with “Everyone”. It does not affect any connections that were made before the setting was turned on.</li><li>If you want to opt out of this default change, please reference the first link under “What do I need to prepare?” to turn the setting off.</li><li>We recommend that you un-share your canvas apps with the “Everyone” group. If you need to share with a large group of people, consider sharing with one or multiple security groups instead.</li></ul><b>What do I need to do to prepare?</b><br><ol><li>For instructions enable sharing with “Everyone”: <a href=\"https://aka.ms/7276_1\">Secure the default environment - Power Platform</a>.</li><li>To learn more about who \"Everyone\" is: <a href=\"https://aka.ms/7276_2\">Special Identities</a>.</li><ol>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-07-19T21:35:00Z",
  "HasAttachments": false,
  "Id": "MC795337",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-21T16:54:08.22Z",
  "Services": [
    "Power Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-23T21:35:29Z",
  "Tags": [
    "Updated message",
    "Feature update"
  ],
  "Title": "Microsoft 365 Power Apps - Canvas App default tenant settings changing",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
