{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>After careful consideration and extensive review of usage data and feedback Microsoft has decided to retire the domain isolated web parts feature in the SharePoint Framework (SPFx).</p><p> \n</p><p><b>When will this happen:</b></p><ul><li>Starting April 2, 2025, domain isolated web parts will be turned off for any newly created tenants.\n</li><li>Starting April 2, 2026, Microsoft will remove the ability to use domain isolated web parts for existing tenants.</li></ul><p><b>How this will affect your organization:</b></p><p>If your organization still uses domain isolated web parts, after the change has rolled out these will render an error message and stop functioning. We recommend customers to update the impacted web parts as regular web parts and redeploy them.</p><p><b>What you need to do to prepare:</b></p><p>To understand whether you have installed domain isolated web parts and granted permissions you can verify if the <a href=\"https://learn.microsoft.com/sharepoint/api-access\" target=\"_blank\">SharePoint admin center API access page</a> contains permissions listed under the <i style=\"\">Isolated </i>grouping. If you see permissions listed under <i>Isolated </i>then you can use the instructions described on the <a href=\"https://aka.ms/retirement/domainisolatedwebparts/support\" target=\"_blank\">domain isolated web part retirement page</a> to discover the solutions, their domain isolated web parts and where those web parts are used. This resource will also contain the needed steps to update the web parts to not use domain isolation.</p><p><b>Note:</b> There will not be an option to extend domain isolated web parts beyond April 2, 2026.</p><p><i>Learn more:</i></p><ul><li><a href=\"https://aka.ms/retirement/domainisolatedwebparts/support\" target=\"_blank\">Domain isolated web part retirement page</a>\n</li><li><a href=\"https://aka.ms/Retirement/domainisolatedwebparts/update\" target=\"_blank\">Retirement announcement blog post</a>\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is retiring SharePoint Framework domain isolated web parts. Starting April 2, 2025, new tenants won't have this feature, and it will be removed for existing tenants on April 2, 2026. Organizations should update and redeploy affected web parts as regular web parts."
    }
  ],
  "EndDateTime": "2026-05-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC792601",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-05-13T22:22:55.36Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-13T22:22:37Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "SharePoint Framework domain isolated web parts retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
