{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: For muted chats, users will continue to receive notifications for personal mentions in their Activity feed, but we will suppress notifications for @Everyone mentions and reactions. Before the rollout, users received notifications from muted chats for personal mentions, @Everyone mentions, and reactions in their Activity feed. This message applies to Teams for Desktop, web, Mac, and mobile.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early June 2024 and expect to complete by late June 2024.\n</p><p>General Availability (GCC): We will begin rolling out early July 2024 and expect to complete by early July 2024.\n</p><p>General Availability (GCC High): We will begin rolling out mid-July 2024 and expect to complete by mid-July 2024.\n</p><p>General Availability (DoD): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The feature will be available for all users by default. Admins will not be able to turn it off.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/hide-unhide-mute-pin-or-mark-a-chat-as-unread-in-microsoft-teams-9aee02ef-713d-495b-8a73-9762d8e4b066\" target=\"_blank\">Hide, unhide, mute, pin, or mark a chat as unread in Microsoft Teams - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating to suppress notifications for @Everyone mentions and reactions in muted chats, while still notifying for personal mentions. This change will roll out from early June to late July 2024, depending on the service availability, and requires no admin action."
    }
  ],
  "EndDateTime": "2024-09-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793965",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T22:13:31.45Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-17T22:13:24Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Suppressing notifications from muted chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
