{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft is updating the default Windows email and calendar applications, transitioning from Mail &amp; Calendar to the new Outlook for Windows.</p><p>These include:</p><p>1. Changes to the Mail app Windows Taskbar, Start menu pins and Desktop shortcuts: </p><p>Mail   app pins on the Windows Taskbar and Start menu, as well as the Mail app Desktop shortcut will be replaced with new Outlook for Windows, if the new Outlook app is freshly installed on a Windows 10 or Windows 11 device.&nbsp;There will be no change to the Calendar app pins. This will not impact Mail app pins or shortcuts on devices that have new Outlook already installed. There will be no change if the new Outlook app is not installed on the device.</p><p>2. Changes to the new Outlook for Windows toggle: </p><p>The toggle in new Oulook that end users access to go  back to the Mail &amp; Calendar app will be moved from the Ribbon, where it is currently located, to the About Outlook page in Settings.</p><p><b>When this will happen</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out early June 2024 and expect to complete by mid-June 2024.</p><p><b>How this will affect your organization</b></p><p>1. Windows  10 and Windows 11 users in your organization who have the Mail app pinned to the Taskbar and/or Start menu will see the pins replaced with new Outlook, if they get new Outlook freshly installed on their device. Mail app shortcuts on the Desktop will also be replaced with the new Outlook app in this scenario.</p><p>2. Users who are migrated into new Outlook from the Mail &amp; Calendar applications will still have the ability to go back to those applications, like they can today. They will need to click the button in Settings &gt; General &gt; About Outlook, rather than clicking on the toggle in the Ribbon.</p><ul><li>Note: Users  who have toggled into new Outlook from classic Outlook for Windows will not see any change to the toggle’s position in the ribbon. Users can also select the “Go to classic Outlook” button in the Help tab of the ribbon. More toggle troubleshooting information can be found here: <a href=\"https://support.microsoft.com/office/toggling-out-of-the-new-outlook-for-windows-preview-ec102b39-5727-418e-ae1f-a1805434640c\" target=\"_blank\">Toggling out of the new Outlook for Windows preview - Microsoft Support</a>.</li></ul><p><b>What you need to do to prepare</b></p><p><b>1. Changes to the Mail app Windows Taskbar and Start menu pins and Desktop shortcuts: </b></p><p>No action is required to prepare for the rollout. When users receive this rollout, if the new Outlook is newly installed on a user’s device, their Mail app Taskbar and Start menu pins and Desktop shortcuts on Windows 10 and Windows 11 will be replaced with new Outlook. If you would like to avoid this, you can leverage the following options:</p><p>a. Unpin Mail from user’s Windows Taskbar, Start Menu and Desktop </p><ul><li>Manage user’s Taskbar – <a href=\"https://learn.microsoft.com/windows/configuration/taskbar\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Configure the Windows taskbar - Configure Windows | Microsoft Learn</a></li><li>Manage user’s Start menu – <a href=\"https://learn.microsoft.com/windows/configuration/start/\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Configure the Start menu - Configure Windows | Microsoft Learn</a></li></ul><p>b. Prevent new Outlook from being installed on user’s devices - <a href=\"https://learn.microsoft.com/deployoffice/outlook/get-started/deployment-new-outlook#control-release-of-the-new-outlook\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Deployment overview for the new Outlook for Windows - Deploy Office | Microsoft Learn</a></p><p>c. Uninstall   Mail app from user’s devices – <a href=\"https://learn.microsoft.com/mem/configmgr/apps/deploy-use/uninstall-applications\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Uninstall applications - Configuration Manager | Microsoft Learn</a></p><p><b>&nbsp;2. Changes to the new Outlook for Windows toggle: No action is required to prepare for the rollout.</b></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is transitioning the default Windows Mail and Calendar apps to the new Outlook for Windows. Changes include updating Taskbar and Start menu pins, Desktop shortcuts, and relocating the toggle to switch back to Mail & Calendar within the new Outlook settings. Rollout begins early June 2024. No action is required to prepare for these updates."
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793964",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-17T22:12:52.143Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-17T22:12:34Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft 365 apps: Changes for updating the Windows Mail and Calendar apps to the new Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
