{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 13, 2024: We have updated the additional resources below to provide additional information. Thank you for your patience.</p><p>We will be retiring the Identity Client Runtime Library (IDCRL) feature from SharePoint Online. <br><br>Office Client applications, since 2013, default to modern authentication and have a seamless experience for the end user. SharePoint Designer however requires some additional steps to support modern authentication. We recommend that all users of SharePoint Designer follow the steps in the Microsoft Community Support Article to ensure SharePoint Designer will continue to work after the final cutoff date.<br></p><p><b>When this will happen:</b></p><p>June 15, 2024</p><p><b>How this affects your organization:</b></p><p>Users of SharePoint Designer will no longer be able to authenticate using IDCRL protocol when this change is implemented.\n</p><p><b>What you need to do to prepare:</b></p><p>To enable your users to continue to use SharePoint Designer the steps outlined&nbsp;in the Microsoft Community Support blog need to be followed, see:</p><ul><li><a href=\"https://learn.microsoft.com/sharepoint/troubleshoot/administration/authentication-issues-in-sharepoint-designer-2013\" target=\"_blank\">Authentication issues in SharePoint Designer 2013</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message informs that the IDCRL authentication for SharePoint Designer will be retired on June 15, 2024. Users must follow steps in a Microsoft Community Support Article to enable modern authentication for continued use of SharePoint Designer."
    }
  ],
  "EndDateTime": "2024-07-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793968",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-06-13T22:00:10.86Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-17T22:14:56Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Disabling IDCRL library based authentication for SharePoint Designer Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
