{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Originally announced in MC283874 (September '21), the classic Exchange admin center has been retired. As we make the final steps to fully retire the classic Exchange admin center, we want to ensure you are aware that the View Another Mailbox feature is available in the modern Exchange admin center (EAC).</p><p>Admins can access this new experience by clicking the 'View another mailbox' link from the modern EAC portal.</p><p><b>When this will happen:</b></p><p>The classic Exchange admin center will be fully retired in mid-June 2024.</p><p><b>How this affects your organization:</b>\n</p><p>All components of the classic Exchange admin center will be retired in mid-June. Once this change is implemented, admins will not be able to use the classic Exchange admin center.</p><p><b>What you need to do to prepare:</b></p><p>Moving forward utilize the modern Exchange admin center. You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The classic Exchange admin center is retired, and the \"View Another Mailbox\" feature is now in the modern EAC, which admins can access. Full retirement will be in mid-June 2024, and organizations should update training and documentation accordingly."
    },
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/exchange-team-blog/final-deprecation-of-classic-exchange-admin-center-eac-in/ba-p/3842424"
    }
  ],
  "EndDateTime": "2024-07-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC795354",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-23T22:34:39.007Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-23T22:33:52Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Reminder: Retirement of the classic Exchange admin center and availability of \"View another mailbox\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
