{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With the Explicit Consent recording meeting policy, if enabled by their admin, users will see a notification pop-up on Microsoft Teams phone devices when someone initiates recording or transcription before or during a meeting. This pop-up will ask for the consent of the participants.<br></p><p><br></p><p> \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=396777\" target=\"_blank\">396777</a>.</p><p><b>When will this happen</b> \n</p><p>General Availability (Worldwide, GCC): We will begin rolling out in mid-July 2024 and expect to complete by late July 2024.</p><p> General Availability (GCCHigh): We will begin rolling out in late July 2024 and expect to complete by late August 2024.</p><p><b>How this will affect your organization:</b></p><p>This feature will be supported on all personal user phones and conference room phones including touch and non-touch devices.<br></p><p><br></p><p>The feature will be disabled by default. Admins will have the option to turn on this policy for users in their tenant by clicking on the highlighted switch on <i>Require participant agreement for recording and transcription</i>.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lwjV?ver=2178\" style=\"width: 400px;\"><br></p><p><br></p><p>For more details, visit&nbsp;<a href=\"https://learn.microsoft.com/microsoftteams/meeting-recording?tabs=meeting-policy#require-participant-agreement-for-recording\" target=\"_blank\">Teams meeting recording - Microsoft Teams | Microsoft Learn</a></p><p> <b>What you need to do to prepare:</b></p><p>For end users in your tenant to use this feature, you will need to enable this policy on Teams Admin Center.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "396777"
    },
    {
      "Name": "Summary",
      "Value": "The message details a new Explicit Consent recording meeting policy for Microsoft Teams phone devices, requiring participant consent for recordings or transcriptions. It will roll out in mid-July 2024, with the feature being disabled by default and admins having the option to enable it."
    },
    {
      "Name": "Platforms",
      "Value": "Android"
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC799280",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-06T23:52:44.197Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-06T23:51:07Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams phone devices: Explicit Consent meeting recording policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
