{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Note:</b>&nbsp;If your organization does not use macOS devices, you can safely disregard this message.</p><p>We would like to inform you of an upcoming change to OneDrive Sync settings on macOS devices; the setting for end-users to Save screenshots to OneDrive will be discontinued. We'd like to encourage the adoption of Known Folder Move (KFM) as our path forward to sync screenshots and other content. Our development efforts will be focused on KFM, by ensuring a seamless backup of the user’s Desktop folder, which includes all screenshot files. This change is in line with our efforts to streamline our features, as the current screenshot setting overlaps with the capabilities provided by KFM.</p><p><b>When this will happen:</b></p><p>We will begin rolling out in mid-June 2024 and expect to complete by late July 2024.</p><p><b>How this will affect your organization:</b><br></p><p>For those with Known Folder Move (KFM) already enabled and syncing the Desktop folder, rest assured there will be no impact on your users due to the removal of the screenshot sync setting. Your users’ screenshots will continue to be backed up automatically.</p><p>For organizations without KFM enabled, it’s possible that some users are utilizing the soon-to-be-removed setting. We recommend reviewing our KFM guidance to ensure comprehensive syncing of the Desktop folder, thus maintaining continuity for your users’ screenshot backups.</p><p>Users will no longer be able to continue saving screenshots to OneDrive without KFM enabled, when this change is implemented.</p><p><b>What you need to do to prepare:</b></p><p>We recommend implementing <a href=\"https://learn.microsoft.com/sharepoint/redirect-known-folders\" target=\"_blank\">Known Folder Move (KFM)</a> settings to automatically back up the Desktop folder, which is the native storage location for screenshots.</p><p>By proactively configuring KFM, you can safeguard against any disruption in service and maintain consistent backup practices for your users’ important files.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneDrive Sync on macOS will discontinue the 'Save screenshots to OneDrive' feature in favor of Known Folder Move (KFM), which backs up the Desktop folder including screenshots. This rollout starts mid-June 2024 and ends late July 2024. Organizations should enable KFM to prevent service disruption."
    }
  ],
  "EndDateTime": "2024-09-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793012",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-05-17T22:01:58.467Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-15T00:21:59Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "[macOS only] The removal of Screenshot saving to OneDrive, in favor of Known Folder Move",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
