{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>In Microsoft Teams, you will be able to enhance hybrid meeting experiences with Teams Rooms and Copilot. We are extending the support of intelligent speaker to all certified microphones to enable Teams rooms to use the advanced technology called speaker recognition to analyze the distinct vocal characteristics of each speaker, such as pitch, tone, and speaking style, to create a voiceprint for each participant, akin to a fingerprint for their voice.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=394668\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">394668</a></p><p></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out by mid-June 2024 and expect to complete by late June 2024.</p><p></p><p><b>How this will affect your organization:</b></p><p>\n</p><p>With speaker recognition, Teams Rooms on Windows can identify speakers during live transcription in shared meeting rooms, ensuring clear and precise voice capture for every participant. This allows you to effortlessly track who said what during the meeting through intelligent meeting recap and Copilot.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lhmk?ver=6632\" style=\"width: 400px;\"></p><p><b>What you need to do to prepare:</b>\n</p><p>While this functionality is still off by default, if you have already turned it on, be aware that it will enable this feature even for hardware that did not previously support it.\n</p><p>To take advantage of this exciting new capability, please refer to the documentation below for setup and instructions:\n</p><ul><li><a href=\"https://learn.microsoft.com/MicrosoftTeams/rooms/voice-recognition?branch=pr-en-us-14676\" target=\"_blank\">Tenant Administration control for voice recognition (voice profile) in Teams Rooms - Microsoft Teams | Microsoft Learn</a></li></ul><p></p><p>Participants can set up a voice profile in minutes using the Teams Desktop application. Each person gets a unique voice signature, stored securely in your organization's tenant in the Microsoft Cloud to assure that every contribution is accurately captured in every meeting – and helping you have a more productive meeting experience!\n</p><p>\n</p><p></p><p>To enable face and voice enrollment for your organization, please find more information here:</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/rooms/voice-and-face-recognition\" target=\"_blank\">Overview of voice and face enrollment - Microsoft Teams | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394668"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"394668\":[{\"RoadmapId\":394668,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-05-29T05:34:17.4648105Z\",\"LatestRing\":null},{\"RoadmapId\":394668,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-05-29T05:34:17.4648108Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is enhancing hybrid meetings with speaker recognition technology for all Teams Rooms, using voiceprints to identify participants. This feature will roll out worldwide by late June 2024, and organizations can prepare by setting up voice profiles and enabling the feature for supported hardware."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC795749",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-24T22:09:05.85Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-24T22:08:17Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Speaker recognition and attribution for all Teams Rooms",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
