{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Sway authors will not be able to <a href=\"https://support.microsoft.com/office/add-video-and-audio-files-into-sway-d2f14842-e103-49c0-9da2-0fbcfcad381f\" target=\"_blank\">upload new video and audio files</a> into Sway. Authors are requested to embed video and audio files using the existing feature for <a href=\"https://support.microsoft.com/office/embed-content-in-your-sway-1e1ab12a-f961-4a26-8afc-77a15f892b1d\" target=\"_blank\">embedding content in a Sway</a>.\n</p><p>Previously uploaded Video and audio files that have been linked inside a Sway will continue to operate.</p><p><b>When this will happen:</b></p><p>We will begin rolling out this change in early June 2024 and expect to complete by mid-June 2024.</p><p>\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because Sway authors in your organization may have uploaded video and audio files in the past OR may be interested in uploading new video or audio files into Sway. \n</p><ul><li>Starting in early June, Sway authors will not be able to upload video and audio files into Sway.</li><li>Previously uploaded video and audio files will continue to operate in the Sways where they are present.</li><li>If you have new content that you want to use in a Sway, then please embed the content using the embedding feature. Instructions are available at <a href=\"https://support.microsoft.com/office/embed-content-in-your-sway-1e1ab12a-f961-4a26-8afc-77a15f892b1d\" target=\"_blank\">Embed content in your Sway - Microsoft Support</a></li><li>If you duplicate a Sway, then previously uploaded video and audio files will not be copied to the new Sway. You will have to embed the content using the embedding feature. Instructions are available at <a href=\"https://support.microsoft.com/office/embed-content-in-your-sway-1e1ab12a-f961-4a26-8afc-77a15f892b1d\" target=\"_blank\">Embed content in your Sway - Microsoft Support</a></li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Please spread awareness of the embedding feature among the Sway authors in your organization. \n</p><ul><li>If an author has new content that he/she wants to use in a Sway, then please embed the content using the embedding feature. Instructions are available at <a href=\"https://support.microsoft.com/office/embed-content-in-your-sway-1e1ab12a-f961-4a26-8afc-77a15f892b1d\" target=\"_blank\">Embed content in your Sway - Microsoft Support</a>\n</li><li>If an author duplicates a Sway, then previously uploaded video and audio files will not be copied to the new Sway. You will have to embed the content using the embedding feature. Instructions are available at <a href=\"https://support.microsoft.com/office/embed-content-in-your-sway-1e1ab12a-f961-4a26-8afc-77a15f892b1d\" target=\"_blank\">Embed content in your Sway - Microsoft Support</a>\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early June 2024, Sway authors can no longer upload new video and audio files but must embed them instead. Previously uploaded media will still work. Users should familiarize themselves with the embedding feature to prepare for this change."
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC791453",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-05-09T16:22:50.017Z",
  "Services": [
    "Sway"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-09T16:22:31Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Sway: Changes in Video/Audio upload for new content.",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
