{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Microsoft Teams meeting organizers of recurring meetings will be prompted in the chat to create a Microsoft Loop workspace after their meetings end. The Loop workspace helps gather shared meeting content into a central, durable Loop workspace to enable ongoing collaboration over time. As a recurring meeting series continues, additional content shared in the meeting chat will be added automatically to the initial Loop workspace.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-May&nbsp;2024 and expect to complete by mid-May 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-May 2024 and complete by early June 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After rollout, it will be easy for meeting organizers to create Loop workspaces for their meeting members and pull in shared content in the chat such as meeting recordings, Microsoft 365 content (Word, Excel, PowerPoint, Whiteboards, and so on), Loop meeting notes, Loop pages, and other shared content. We will support additional content types over time.\n</p><p>After the meeting ends, organizers will be shown a prompt to create a Loop workspace, will be able to review and confirm workspace members as well as the shared content. After confirmation, a Loop workspace will be created, invites will be sent to the meeting members, and the shared content will be linked in a Loop workspace. As the group shares more content in a meeting series Teams chat over weeks or months, the new content will be added automatically to the workspace. Workspace members can also add other content to the workspace and can reconfigure the order of content in the left navigation pane of the Loop app.\n</p><p>For this initial rollout, this feature will be enabled for meeting series with 3-50 invitees. Later, we will release support for greater than 50 invitees and for Modern Groups.\n</p><p>After a meeting, the meeting organizer can select the prompt in the meeting chat&nbsp;to create a Microsoft Loop workspace:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kuGv?ver=11d6\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Naming and sharing the Loop workspace:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kigk?ver=4e14\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The meeting organizer can review a list of files shared in the meeting series and add the desired files to the workspace:&nbsp;&nbsp;<br></p><p>&nbsp;<img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1kfz8?ver=8d18\" alt=\"user controls\" style=\"width: 400px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>We will update this comm before rollout with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon prompt meeting organizers of recurring meetings to create a Microsoft Loop workspace for sharing and collaborating on meeting content. This feature will start rolling out in mid-May 2024 and will initially support meetings with 3-50 invitees. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC792605",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-13T22:28:00.093Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-13T22:27:32Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Auto-create Microsoft Loop workspaces to share meeting content",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
