{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Symmetric keys authentication relies on a shared key being sent by the client in its request to security token service. In the event the key is intercepted, it is permanently compromised.<br></p><p>To improve security posture of Microsoft first-party Applications and better protect customer data, client applications will no longer be able to use Symmetric Keys on Service Principals for First-Party Applications and must move to Asymmetric keys.\n</p><p><b>When this will happen:</b></p><p>June 15, 2024</p><p><b>How this affects your organization:</b></p><p>After this change is implemented, any client requests that use Symmetric Keys on their Microsoft first-party Application Service Principals will fail.\n</p><p><b>What you can do to prepare:</b></p><p>Customers currently using Symmetric keys for authenticating Microsoft first-party application's Service Principals in their tenant will need to replace these with Asymmetric keys, as described in the link <a href=\"https://learn.microsoft.com/powershell/module/microsoft.graph.applications/add-mgserviceprincipalkey?view=graph-powershell-1.0#examples\" target=\"_blank\">Add-MgServicePrincipalKey</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Symmetric keys for Microsoft Entra first-party applications' Service Principals will be disabled to enhance security. Organizations must switch to Asymmetric keys by June 15, 2024, to avoid authentication failures. Preparation involves replacing Symmetric with Asymmetric keys as detailed in the provided link."
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC792991",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-05-15T00:03:53.443Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-15T00:03:29Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Disablement of Symmetric keys for Microsoft Entra first-party applications Service Principals",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
