{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 1, 2025: We have updated the content documentation link. Thank you for your patience.&nbsp;</p><p>&nbsp;   \n<b>What it is</b></p><p>Microsoft is rolling out a new feature to streamline how app and agent availability is managed across Teams, Outlook, and Microsoft 365 Copilot. Until now, IT admins configured availability settings separately in both the Microsoft 365 Admin Center (MAC) and the Teams Admin Center (TAC), which led to mismatches. With this update, you’ll be able to unify availability policies for apps and agents across both portals, making app management more consistent and efficient<b>.</b></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=393931\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">393931</a>&nbsp;and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=503105\" target=\"_blank\">503105</a>.</p><p><b>When this will happen:\n</b></p><p>We will begin rolling out this feature late September 2025 and expect to complete by mid-November 2025.</p><p>1. <b>Phase 1 – Default Tenant Unification</b></p><p>We will begin rolling out this feature at the end of September 2025. This initial phase targets tenants that have never modified their organization-wide defaults, app availability, or block/unblock in either the Microsoft 365 admin center or the Teams admin center.  At the end of this phase, agent and app manageability will be unified across both Microsoft 365 admin center and Teams admin center ensuring agent and Microsoft 365 <b>apps availability</b> policies are in alignment for all future administrative changes. This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=393931\" target=\"_blank\">393931.</a></p><p>2.\t<b>Phase 2 – Modified Tenants Unification</b></p><p>We will begin rolling out this feature at the end of October 2025. This phase targets tenants that have previously modified their organization-wide defaults, app availability, or block/unblock settings in either admin center. These tenants will be transitioned to a unified management experience across both Microsoft 365 and Teams admin centers.</p><ul><li><b>For tenants with agent or app availability differences across both admin centers</b>, a <b>wizard</b> in the Teams admin center will help identify affected agents and apps and guide through resolving discrepancies.</li><li><b>For tenants with no agent or app availability differences across both admin centers, guidance </b>will be provided to help maintain unified availability policy for all future changes. </li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=503105\" target=\"_blank\">503105</a>.</p><p>3.\t<b>Phase 3 – Automatic Unification\n</b></p><p>Tenants that haven’t transitioned as part of Phase 1 &amp; Phase 2, will be automatically moved to unified app agent management. We will update this post with a timeline and more details later.</p><p><b>How this will affect your organization</b></p><p>Before this rollout, managing Teams apps that work in Outlook and the Microsoft 365 app was fragmented between the Integrated apps page in the Microsoft 365 admin center for Outlook and the Microsoft 365 app, and the Teams admin center for Teams. This sometimes resulted in different settings for the same app in the two admin centers. With Unified agent app management, you will be able to manage apps on the Integrated apps page in the Microsoft 365 admin center or in the Teams admin center, and any changes made in either admin center will synchronize.</p><div>What you can expect:\n</div><ul><li>You’ll gain a consolidated view of agent and Microsoft 365 app availability across both Microsoft 365 and Teams admin centers.\n</li><li>Changes made in either admin center to the agent and app availability will automatically apply across all supported hosts.\n</li><li>Organization-wide defaults for both admin centers will be in sync and govern app availability across Teams, Outlook, and the Microsoft 365 copilot app.</li></ul><p><b>&nbsp;What you need to do to prepare</b></p><p>To ensure a smooth transition, review your tenant-level and individual agent/app settings (app allow/block &amp; user availability) in both the Microsoft 365 Admin Center and the Teams Admin Center. If different departments within your organization manage these settings, we suggest coordinating efforts to complete the review collaboratively.\n</p><p>This update will be rolled out automatically by the stated date, and no immediate action is required. However, it's a good time to update any internal documentation related to agent and app management policies.&nbsp;</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/uam-tac-mac\" target=\"_blank\">Unified agent and app availability management across Microsoft 365 and Teams Admin Centers - Microsoft Teams | Microsoft Learn&nbsp;</a></p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "393931"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is unifying app and agent availability management across Teams, Outlook, and Microsoft 365 admin centers to ensure consistent policies. The rollout starts late September 2025 in three phases, synchronizing settings and providing tools to resolve discrepancies. No immediate action is required, but reviewing current settings is recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-12-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC796790",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-10-01T16:02:10.143Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-29T22:15:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Update: Microsoft 365 and Microsoft Teams: Unified management of Teams apps in Teams, Outlook, and the Microsoft 365 app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
