{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>A new Private Line feature is specially made for users that might have a delegate line managed by assistants, admins, and so on. It lets these users get a second, private phone number for their Teams device apart from their main number for incoming calls.&nbsp;</p><p>Private line calls will also have distinct ringtones and tagging in call history, ensuring clear differentiation from regular calls. </p><p>This message is associated with Microsoft Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=396769\" target=\"_blank\">396769</a>.</p><p><b>When is this rolling out</b> \n</p><p>General Availability (Worldwide, GCC): We will begin rolling out in mid-July 2024 and expect to complete by late July 2024.</p><p> \n</p><p>General Availability (GCCHigh): We will begin rolling out in late July 2024 and expect to complete by late August 2024.</p><p><b>How this will affect your organization:</b></p><p>This Private Line feature aims to give an extra level of privacy for important calls, making sure that crucial conversations stay private by getting incoming calls directly without going through delegates, admins, or assistants.</p><p>Private Line calls will also have distinct ringtones and tagging in call history, ensuring clear differentiation from regular calls.&nbsp;</p><p>To learn more, visit <a href=\"https://learn.microsoft.com/microsoftteams/private-line\" target=\"_blank\">Configure private lines in Microsoft Teams - Microsoft Teams | Microsoft Learn</a>.</p><p> <b>What you need to do to prepare:</b></p><p>For this feature to work, you will have to set up a PSTN or VoIP contact as a private line number. Currently, private lines can only be configured with PowerShell. You must have Teams PowerShell Module version 5.4.0 or higher to use the updated CsPhoneNumberAssignment cmdlets. Use the following illustrative command to set-up a private line number using PowerShell:</p><ul><li>Set-CsUser -Identity \"sip:joe@contoso.com\" -PrivateLine “Tel:+14255551212”&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "396769"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a Private Line feature for Teams phone devices, allowing users with delegate lines to have a second, private number. This feature includes distinct ringtones and call history tagging for differentiation. It will roll out worldwide starting mid-July 2024. Users must configure private lines via PowerShell."
    },
    {
      "Name": "Platforms",
      "Value": "Android"
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC799281",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-06T23:53:56.273Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-06T23:52:59Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Private Line feature on Teams phone devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
