{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, when a Workflow card is received in chats or channels, users can now easily identify the workflow template that was used.</p>\n<p></p>\n\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=393923\" target=\"_blank\">393923</a></p><p><b>When this will happen:</b></p>\n\n<p>General Availability (Worldwide): We will begin rolling out early June 2024 and expect to complete by mid-July 2024.</p><p>General Availability (GCC): We will begin rolling out late September 2024 and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b></p><p>Templates used for posting Teams cards via a workflow will now feature a footer link. This allows users to directly access and utilize the corresponding workflow template, streamlining the creation of their own Teams Workflows and enhancing efficiency in performing routine tasks.&nbsp;</p><p>This capability is designed for Teams Workflows templates that post cards via the Workflows bot in chat and channels using the Post card in a chat or a channel&nbsp;Teams connector action.</p><p>Templates that will not include the footer are the following:&nbsp;</p>\n\n\n\n<ul><li>Custom flows that did not originate from a Workflows template.</li><li>Templates that do not use the Teams connector.</li><li>Workflows Message Extension default actions.</li><li>Power Automate templates that post cards outside of Teams.</li><li>Workflows using \"Post your own adaptive card as the Flow bot to a user\" or \"Post your own adaptive card as the Flow bot to a channel\" actions.&nbsp;</li><li>Cards that include an existing Power Automate footer.&nbsp;</li></ul><p>This image shows a footer link:</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f2303557-71f8-472e-a8c6-f80254e9dbf2\" style=\"width: 400px;\"></p><p><b>What you need to do to prepare:</b></p>\n\n<p>Consider bringing awareness to your users about this change if your tenant uses Workflows to automate routine tasks.</p>\n\n<p>If Admins have disabled the Workflows Teams app, this capability will also be disabled.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "393923"
    },
    {
      "Name": "Summary",
      "Value": "In Microsoft Teams, Workflow cards in chats or channels will now show the template used, with a rollout starting in June 2024 and completing in November 2024. A footer link will be added for direct template access, except for certain custom or non-Teams connector workflows."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-01-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC791450",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-09T16:21:20.837Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-09T16:21:02Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Easier discoverability of Workflows templates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
