{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 31, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Teams: With the launch of this new feature, <i>notification suppression for hidden channels</i>, users will now only receive notifications for personal and tag mentions from these hidden channels. This enhancement is designed to improve the user experience by allowing them to stay on top of their most relevant conversations.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-June 2024 (previously early June) and expect to complete by early July 2024 (previously late June).</p><p>General Availability (GCC): We will begin rolling out early July 2024 and expect to complete by early July 2024.\n</p><p>General Availability (GCC High): We will begin rolling out mid-July 2024 and expect to complete by mid-July 2024.\n</p><p>General Availability (DoD): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.</p><p><b>How this will affect your organization:</b></p><p>Currently, users receive team and channel mentions, reactions, replies, and app notifications in hidden channels. However, with this new feature, all these notifications will be suppressed. Users will now only be informed about personal, and tag mentions from hidden channels.</p><p>Hide a channel is already existing in Teams app:&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lmmk?ver=7811\" style=\"width: 600px;\"></p><p>There will be no impact on the tenants or admins.&nbsp;&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>This feature will be available for all the users by default for existing and subsequent hidden channels.</p><p>There is no action required by the tenants or admins.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is launching a new feature in June-July 2024 that suppresses notifications for hidden channels, except for personal and tag mentions. This change aims to streamline user notifications and requires no action from tenants or admins."
    }
  ],
  "EndDateTime": "2024-09-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC793969",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-31T19:04:44.81Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-17T22:15:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Notification suppression for hidden channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
