{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Currently, in Microsoft Defender for Office 365, when a notification message is reported by an end user and arrives at the <a href=\"https://learn.microsoft.com/defender-office-365/submissions-user-reported-messages-custom-mailbox?\" target=\"_blank\">reporting mailbox</a>, the subject lines begin with:</p>\n\n<ul><li>\"1|\" to denote email messages reported as junk.</li><li>\"2|\" to denote email messages reported as not junk.</li><li>\"3|\" to denote email messages reported as phishing.</li></ul><p>Moving forward, the subject lines of notification messages reported by end users will start with</p><ul><li>\"Junk:\" to denote email messages reported as junk.</li><li>\"Not junk:\" to denote email messages reported as not junk.</li><li>\"Phishing:\" to denote email messages reported as phishing.</li></ul>\n\n<p>This change is being made to ensure readability and enable you to <a href=\"https://support.microsoft.com/office/set-up-rules-in-outlook-75ab719a-2ce8-49a7-a214-6d62b67cbd41\" target=\"_blank\">create better rules</a> inside your reporting mailbox.</p>\n\n<p>The subject line for the team's end-user reported notification messages will remain the same, continuing to start with \"Security risk:\"</p>\n\n<p><b>When will this happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late May 2024 and expect to complete mid-June 2024.</p><p><b>How this will affect your organization:</b></p><p>After the rollout is complete, notification messages reported by end users will be affected. However, notification messages reported by end users prior to the rollout will remain unchanged.</p>\n\n<p><b>What you need to do to prepare:</b></p><p>No action is required on your part. There won't be any change to your existing <a href=\"https://security.microsoft.com/securitysettings/userSubmission\" target=\"_blank\">user reported settings</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 is changing the subject line format for end-user reported notification messages to improve readability and rule creation. The rollout starts late May 2024 and ends mid-June 2024. No action is required from users as existing settings remain unaffected."
    }
  ],
  "EndDateTime": "2024-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC790242",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-04T04:06:53.343Z",
  "Services": [
    "Exchange Online",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-04T04:07:10Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Reported mailbox notifications messages subject change",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
