{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Today, you can use the role-based access control (RBAC)&nbsp;<a href=\"https://learn.microsoft.com/mem/intune/fundamentals/role-based-access-control#built-in-roles\" target=\"_blank\">built-in role</a> ‘Endpoint Security Manager’ to manage policies and features within the Endpoint security node or, you can limit admin actions by using the <a href=\"https://learn.microsoft.com/mem/intune/fundamentals/create-custom-role\" target=\"_blank\">custom role</a> with the ‘Security baselines’ permission.</p><p>In an upcoming release, we will be adding new permissions for each endpoint security workload to allow for additional granularity. The ‘Security baselines’ permission previously included all security policies and now, it will only include security  workloads that do not have their own permission.</p><p>Stay tuned to <a href=\"https://aka.ms/IntuneWN\" target=\"_blank\">What’s new in Intune</a> for the release!</p><p><b>How this will affect your organization:</b></p><p>There is no change in functionality for the built-in role ‘Endpoint Security Manager’, you will see the additional new permissions listed in 'Properties'.</p><p>If you are using custom roles with the ‘Security baselines’ permission, the new permissions will automatically be assigned to ensure your admins continue to have the same permissions they have today. As an example, if an admin has been assigned a custom role with ‘Security baselines/Read’ permission, that role would include the new  permissions, such as Attack surface reduction/Read’. The ‘Security baselines/Read’ would still be applicable for viewing Security baselines, Firewall, Antivirus, and other security policies that do not have a designated permission. <b>Note:</b> All security workloads  are expected to eventually have their own permission.</p><p><b>What you need to do to prepare:</b></p><p>No action is required as Intune will make a service-side update to assign the new permissions for admins with a ‘Security baselines’ permission as they become available. If you use these permissions and have documented guides on role-based access, you will want to make a note of these changes and update your administrative guidelines.  \n</p><p>If you want to take advantage of the new permissions to add granularity to your roles, stay tuned to <a href=\"https://aka.ms/IntuneWN\" target=\"_blank\">What’s new in Intune</a> for the release.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New RBAC permissions for endpoint security policies are being introduced, allowing more granularity. The 'Security baselines' permission will be updated to include only specific workloads, with others getting their own permissions. No immediate action is required as Intune will update permissions automatically. Stay tuned for release details."
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC794811",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-21T23:46:13.547Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-21T23:45:55Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Plan for Change: New RBAC permissions for endpoint security policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
