{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams will now support an Explicit Consent policy for processing all types of user generated content, such as audio and video, as part of the Explicit Recording policy. When the Explicit Consent policy is applied, the Teams meeting window will request explicit consent from all participants to have Teams use their audio and video for transcription, recording, or Microsoft Copilot for Microsoft 365. Before a user gives consent, the user cannot unmute, turn on their camera, or share content. This is the same as the current experience in Explicit Recording consent, but the Explicit Recording policy will now support transcription and Copilot for Microsoft 365.&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-June 2024 and expect to complete by late June 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization uses Consent for Recording and Transcription, that functionality will now apply to the&nbsp;Copilot without Transcription&nbsp;setting as well.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>To require your organization to use the Explicit Consent policy, follow the same procedure as you would for Consent for&nbsp;Recording and Transcription through Teams Admin Center, by navigating to <i style=\"\">Recording and Transcription</i>&nbsp;and turning on the toggle to <i style=\"\">Require participant agreement for recording, transcription, and Copilot</i>.</p><p>For more information, see <a href=\"https://learn.microsoft.com/microsoftteams/meeting-recording?tabs=meeting-policy#require-participant-agreement-for-recording\" target=\"_blank\">Require participant agreement for recording</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams introduces an Explicit Consent policy for user content in meetings, requiring participant agreement for audio and video use in transcription, recording, or Microsoft Copilot. Organizations can enable this policy through the Teams Admin Center. Rollout starts mid-June 2024, with completion by late June 2024."
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC794819",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-21T23:53:13.967Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-21T23:52:24Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Explicit Consent policy for Microsoft Copilot for Microsoft 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
