{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 11, 2024: Microsoft Purview AI Hub is released to general availability. Along with this release, the name has been rebranded to Microsoft Purview Data Security Posture Management for AI (DSPM for AI) and capabilities have been added that include supporting admin units, displaying AI policies that were created in Purview solutions, and supporting additional AI apps. A version of DSPM for AI is also available to additional licensing, specifically Microsoft 365 E3 and Microsoft 365 Copilot licenses.&nbsp;</p><p>Microsoft Purview: Generative AI (GAI) is being adopted at an unprecedented rate. AI fuels innovation and productivity but also poses risks – organizations are concerned about the risky AI use and sensitive data loss through AI apps. The AI hub is a central location in Microsoft Purview that helps organizations secure data in AI, including Microsoft AI applications such as Copilot for Microsoft 365 and non-Microsoft AI applications. With this set of capabilities, organizations can safely adopt AI without having to choose between productivity and protection.</p><p>Use Cases&nbsp;</p>\n\n<ul><li>Viewing insights and analytics into AI activity in your organization.</li><li>Using policies to protect data and prevent data loss in AI prompts.</li><li>Implementing compliance controls to apply optimal data handling and storing policies.</li></ul><p>&nbsp;This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=188510\" target=\"_blank\">188510</a></p>\n\n<p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out early May 2024 and expect to complete by early May 2024.</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late November 2024.</p>\n\n<p><b>How this will affect your organization:</b>\n</p><p>Microsoft Purview AI hub will be visible within the Microsoft Purview portal and the Microsoft Purview compliance portal and will consist of three tabs (analytics, policies, and activity explorer).</p><p>Analytics will display getting started steps, recommendations, and insights into AI usage: \n</p><p>Figure 1</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l11Y?ver=5c23\" style=\"width: 400px;\"></p>\n\n<p>Figure 2</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1laZi?ver=e77a\" style=\"width: 400px;\"></p>\n\n<p>Figure 3</p><p>Policies will display recommendations and policies that have been created by Microsoft Purview AI hub:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l3y8?ver=0134\" style=\"width: 400px;\"></p><p>Activity explorer will display events related to AI:</p><p>Figure 4</p>\n\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1l121?ver=9b2c\" style=\"width: 400px;\"></p><p><b>What you need to do to prepare:</b>\n</p>\n\n<p>Get ready for this change by reviewing the admin documentation - <a href=\"https://go.microsoft.com/fwlink/?linkid=2249294\" target=\"_blank\">Considerations for Microsoft Purview AI Hub</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "188510"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview AI Hub, now known as Microsoft Purview Data Security Posture Management for AI (DSPM for AI), is generally available. It includes new capabilities and supports Microsoft 365 E3 and Copilot licenses, helping organizations secure data in AI applications. The hub features insights, data protection policies, and compliance controls. It will be visible in the Microsoft Purview portals with analytics, policies, and activity explorer tabs. Preparation involves reviewing the admin documentation. Rollout is scheduled for May and November 2024. Roadmap ID: 188510."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://go.microsoft.com/fwlink/?linkid=2249294"
    }
  ],
  "EndDateTime": "2025-01-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC790798",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-11T21:43:20.94Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-06T22:46:21Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Generative AI: Hub in public preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
