{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>&nbsp;Updated October 28, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Through Microsoft Purview | Information Protection, and for greater consistency and reliability, Microsoft Word, Excel, and PowerPoint for Windows will soon display the same Data Loss Prevention policy tips that admins have set in their tenants for files on Microsoft SharePoint Online and Microsoft OneDrive sites.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=383018\" target=\"_blank\">383018</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early June 2024 and expect to complete by mid-June 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-July and expect to complete by mid-December (previously late October).</p><p><b>How this will affect your organization:</b>\n</p><p>DLP policy tips will no longer be shown when a user is offline.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to update any relevant documentation as appropriate\n</p><p>We will update this comm before rollout with revised documentation.\n</p><p>You can access the Information Protection solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "383018"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview | Information Protection will update to show consistent Data Loss Prevention policy tips across Word, Excel, PowerPoint for Windows, SharePoint Online, and OneDrive. Rollout starts early June 2024, with general availability by mid-December 2024. No admin action required before rollout. Documentation will be updated accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-01-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC790795",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-28T21:58:53.993Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-06T22:43:42Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "(Update) Microsoft Purview | Information Protection: Improved Data Loss Prevention policy tips",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
