{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 13, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Coming soon for Microsoft Teams: App centric management for admin app installation introduces new admin settings to control who in the tenant has specific Teams apps preinstalled. Similar to app centric management for app availability, as communicated in MC688930 <i>(Updated) Teams admin center: App centric management and changes to app permission policies</i> (November 2023), admins will be able to install apps for users, groups, or everyone in the organization.</p><p>After rollout, app centric management will replace<i> Installed apps</i> in the Teams admin center and give admins the ability to install apps individually. The <i>Installed apps</i> in your app setup policies will be migrated to app centric management based on your current user and group assignments for each policy. The rest of your settings in app setup policies will remain unchanged and will continue to work based on app setup policies, including <i>Pinned apps</i>. After this rollout, you can install Teams apps for selected sets of users, groups, or all users in the organization, and <i style=\"\">Installed apps</i> in app setup policies will no longer be available.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394274\" target=\"_blank\">394274</a>.\n</p><p><b>When this will happen:</b>\n</p><p>App centric management will roll out in four General Availability phases.\n</p><ul><li>Phase 1 | General Availability (Worldwide): We will begin rolling out&nbsp;late July&nbsp;2024 (previously mid-July) and expect to complete late June 2025 (previously late May) phase applies to tenants who meet both conditions: 1) tenants with no <i>Installed apps</i> in the Global app setup policy and 2) tenants with no custom app setup policies created in the Teams admin center. After rollout, these tenants will have app centric management enabled for their app installs. Admins may see the <i>Manage apps</i> page in read-only mode for a short time.\n</li><li>Phase 2 | More details coming soon as a follow up MC post. This phase applies to all remaining tenants. This phase will migrate apps installed for users and groups through Installed apps in app setup policies to app centric management.</li></ul><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: If you install an app to a user, the user cannot actually use an admin preinstalled app if you did not take the additional step to allow the user to use it. After the rollout, if you install an app through app centric management, the user will immediately be able to use the app.\n</p><p>\n</p><p>Before the roll out, a user will only have apps installed from a single app setup policy, following the <a href=\"https://learn.microsoft.com/microsoftteams/assign-policies-users-and-groups#precedence-rules\" target=\"_blank\">policy resolution precedence rules</a>. After the rollout, if you have multiple custom app setup policies assigned to users or groups, apps from every policy will be installed to&nbsp;the user or group assigned to&nbsp;that policy, regardless of the policy resolution precedence rules.\n</p><p>&nbsp;<b>What you need to do to prepare:</b>\n</p><p>No action needed for Phase 1 tenants. We will update this message with more information before the rollouts for Phases 2 tenants.\n</p><p>You may want to update any relevant documentation as appropriate.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394274"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce app centric management for admin app installation, replacing \"Installed apps\" in app setup policies. Rollout begins late July 2024 in phases, enabling admins to install apps for users, groups, or all users with immediate access. Multiple app setup policies will install apps cumulatively post-rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2026-10-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC795355",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-08-13T15:46:27.767Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-23T22:35:04Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: App centric management for app installation and changes to app setup policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
