{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Purview | Information Protection:&nbsp;After assigning a mail-enabled security group to a shared mailbox, members of the security group will be able to use Microsoft Outlook for Windows to view and respond to newly generated encrypted mail. Direct user assignment with automapping enabled is no longer required to open encrypted mail in the application\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=385345\" target=\"_blank\">385345</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late June 2024 and expect to complete by late July 2024.\n</p><p>General Availability: We will begin rolling out in early September and expect to complete by late October.\n</p><p><b>How this will affect your organization:</b>\n</p><p>For encrypted mail sent to a shared mailbox using <i>Do Not Forward</i> protection or <i>Encrypt-only</i> protection, members of the assigned mail-enabled security group will be able to use Outlook for Windows to view and reply to the encrypted mail. Only mail that is generated after the rollout is completed will be accessible in Outlook for Windows.\n</p><p>Your users must be using Outlook for Windows Version 2402 or higher. There is no change required to your existing user and group assignments to your shared mailbox.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>See <a href=\"https://aka.ms/omefaq\" target=\"_blank\">Message encryption FAQs | Microsoft Learn</a> for details on the latest shared mailbox support.\nBefore rollout, we will update this post with revised FAQs.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "385345"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview | Information Protection will soon allow members of a mail-enabled security group to view and respond to encrypted mail in a shared mailbox using Outlook for Windows. Rollout begins late June 2024, with general availability expected by late October 2024. Users need Outlook for Windows Version 2402 or higher. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC794814",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-05-21T23:49:32.42Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-05-21T23:49:06Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Encryption support for shared mailbox with security group in Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
