{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 22, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In the new Microsoft Outlook for Windows and web, we are updating the Scheduling Assistant view to help users have better readability. This feature update provides improved grid lines, an Availability view, and a combined Availability bar. We are also updating the time zone behavior when scheduling across multiple time zones, and we are adding the ability to send an event from the Scheduling Assistant view.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=397769\" target=\"_blank\">397769</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late August 2024 (early August) and expect to complete by mid-September 2024 (late August).</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late August 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b></p><p>This feature update aims to improve the Scheduling Assistant view readability while scheduling new events.&nbsp;</p><p>Under the attendee names, availability is denoted as text for the times that users have selected.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m6ue?ver=ca25\" style=\"width: 400px;\"><br></p><p><br></p><p>On the grid, we have updated how free/busy information is displayed for each user.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1lZj3?ver=7dc3\" style=\"width: 400px;\"><br></p><p><br></p><p>Combined Availability view is a bar within Scheduling Assistant that shows the combined availability of all participants at a given time.</p><p>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m1rj?ver=d19c\" style=\"width: 400px;\"><br></p><p><br></p><p>We are also updating the color of the horizontal bar that denotes the selected time to blue. Previously, it was green or red based on participant availability. The bar also has a hover state that will communicate the time and availability information.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m4az?ver=00db\" style=\"width: 400px;\"><br></p><p><br></p><p>Previously, we showed time zone information for all the users. Going forward, we will only show time zone information for users who are in a different time zone than the organizer's time zone.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m4an?ver=5a67\" style=\"width: 400px;\"><br></p><p><br></p><p>Previously, there was no Send button in Scheduling Assistant. Users had to go back to the Event form to send an invite. Now, we are adding the Send button.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m4as?ver=388f\" style=\"width: 400px;\"><br></p><p><br></p><p><b>What you need to do to prepare:</b></p><p> </p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Scheduling Assistant in Microsoft Outlook is being updated for better readability, with improved grid lines, an Availability view, a combined Availability bar, updated time zone behavior, and the addition of a Send button. Rollout begins late August 2024, completing by late September 2024. No admin action is required."
    }
  ],
  "EndDateTime": "2024-11-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC806104",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-22T21:15:41.35Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-27T23:58:59Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "(Update) Microsoft Outlook: Scheduling Assistant updates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
