{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Clipchamp, the <a href=\"https://support.microsoft.com/topic/how-to-use-brand-kit-in-clipchamp-e56bf921-7821-418d-9e8c-2e411a6a27ef#ID0EBF=Work_version\" target=\"_blank\">Brand kit</a> feature enables users to create and share brand asset collections including colors, fonts and logos to use when creating videos. With this rollout, users with these subscriptions will have Brand kit as a standard feature in Clipchamp:\n</p><ul><li>Microsoft 365 E3 and E5\n</li><li>Microsoft 365 Business Premium and Business Standard\n</li><li>Microsoft 365 A3 and A5\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398992\" target=\"_blank\">398992</a>.\n</p><p>This message applies to Clipchamp for Windows and for the web.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-July 2024 and expect to complete by late July 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out late July 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because users in your tenants have licenses which enable access to these capabilities. This update will not impact any other parts of your Microsoft 365 license or Microsoft 365 admin center.\n</p><p>Before this rollout: Users with the subscriptions in this message had no access to Brand kit in Clipchamp and manually managed brand assets when creating videos.\n</p><p>After this rollout, your users can expect these changes in Clipchamp:\n</p><ul><li>Creation, sharing, and manual usage of Brand kits will become available via all work and education accounts. (Future Brand kit capabilities reserved for Clipchamp Premium license may include scenarios such as automation of brand application in video.)\n</li><li>\"Official\" Brand kits for an organization can be made available to all users in a tenant by placing the Brand kits in the Organization Asset Library (OAL). Admins designate who can save to the OAL Brand kit document library. Learn more: <a href=\"https://support.microsoft.com/topic/creating-and-distributing-org-wide-brand-kits-in-clipchamp-aa677fe4-865c-4f63-bc7b-418baca6dcc0\" target=\"_blank\">Creating and distributing org-wide brand kits in Clipchamp - Microsoft Support</a>\n</li><li>Brand kit can now support extended elements beyond colors, fonts, and logos including up to 300 each of: videos, music, sound effects, images, backgrounds, and stickers. Users can store all assets in the Brand kit's folder on Microsoft OneDrive or Microsoft SharePoint.\n</li></ul><p><i>What users will see</i>\n</p><ul><li>In Clipchamp, Brand kits can be created, used, or opened by anyone if the creator generates a link to share with them.\n</li><li>User-created Brand kits can be stored in OneDrive or SharePoint.\n</li><li>Up to 300 of these brand elements can be stored with the Brand kit: videos, sound effects, music, images, backgrounds, and stickers.\n</li></ul><p>The default state of this feature is on and all users with the specified licenses can access it.\n</p><p>Clipchamp video editor with the <i>Brand kit</i> menu expanded to show example brand kits for Tailspin Toys and Microsoft. Select the <i>Brand kit</i> button from the left side of the screen:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mGrl?ver=ed1a\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>When this change takes effect, please make note of the new feature in Clipchamp for your administrative records and ensure that you update any relevant provisioning documentation, as needed.\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/how-to-use-brand-kit-in-clipchamp-e56bf921-7821-418d-9e8c-2e411a6a27ef\" target=\"_blank\">How to use brand kit in Clipchamp - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398992"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Clipchamp Brand kit feature is being added to certain Microsoft subscriptions, allowing users to create, share, and use collections of brand assets. It will roll out between mid-July and late August 2024 for users with specific licenses, and it will support extended elements. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC805215",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-25T23:35:08.68Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-25T23:31:54Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Clipchamp: The Brand kit feature is rolling out with extended elements to Microsoft subscriptions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
