{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting in mid-July, for organizations that use vanity domains and their users are on the following version of clients they will experience functionality diminishing:\n</p><ul><li>Outlook for iOS versions prior to 4.2411,\n</li><li>Outlook for Android versions before 4.2342, \n</li><li>Outlook for Mac versions older than 16.73\n</li><li>Windows Mail and Calendar applications \n</li></ul><p>We encourage users to switch to the new Outlook for Windows, and update to the newest versions of Outlook on iOS, Android, and Mac. Our ongoing development efforts and advanced security measures will be focused on these updated platforms.\n</p><p>Starting in mid-August, for Outlook on the web and Outlook.com:\n</p><ul><li>If users are using an old browser, they will receive an error page, and prompt to get the newer version of browser to continue using Outlook on the web.<ul><li>Internet Explorer</li><li>Microsoft Edge Legacy</li><li>New Microsoft Edge&lt;=79</li><li>Chrome&lt;=79</li><li>Safari &lt;=13.1</li><li>Mozilla Firefox&lt; =78</li><li>Opera &lt;=76</li></ul></li><li>The light version of Outlook on the web will also be retired.\n</li></ul><p><b>When this will happen:</b>\n</p><p>For Outlook iOS, Android, Mac and Windows Mail and Calendar Application, we'll be gradually rolling this out to customers in mid-July 2024, and the roll out will be completed by late September 2024.\n</p><p>For Outlook on the web, we’ll be gradually rolling this out to customers in mid-August 2024, and the roll out will be completed by late October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Once this change has rolled out legacy Outlook clients will no longer be supported.\n</p><p>For Outlook iOS, Android, Mac and Windows Mail and Calendar Application, users will no longer be able to send or receive new emails when this change is applied.\n</p><p>For Outlook on the web, <i>IsOptimizedForAccessibility</i> parameter will no longer be supported in Set-CASMailbox Cmdlet for Exchange Online User. Outlook on the Web latest supports all the accessibility features. We will no longer redirect to OWA light via this configuration. If users are still on the older browsers, they will see an error page.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend you upgrade your clients from legacy Outlook clients to the latest version of Outlook clients for the latest features and security protections.   \n</p><p>Learn more\n</p><ul><li>Outlook on the web: <a href=\"https://support.microsoft.com/office/supported-browsers-for-outlook-on-the-web-and-outlook-com-ca350265-6284-4682-9abd-85fc2bd37934\" target=\"_blank\">Supported browsers for Outlook on the web and Outlook.com</a>\n</li><li>Windows Mail and Calendar Application: <a href=\"https://support.microsoft.com/office/outlook-for-windows-the-future-of-mail-calendar-and-people-on-windows-11-715fc27c-e0f4-4652-9174-47faa751b199\" target=\"_blank\">Outlook for Windows: The Future of Mail, Calendar, and People on Windows 11 - Microsoft Support</a>\n</li><li>Outlook iOS: <a href=\"https://apps.apple.com/us/app/microsoft-outlook/id951937596?referrer=kmas_id%253d35566d87-7eeb-480e-3263-0ac2c47b0e19%2526ocid%253dcmmrmrikbmn%2526rid%253deEmOeSXU\" target=\"_blank\">Microsoft Outlook on the App Store (apple.com)</a>\n</li><li>Outlook Android: <a href=\"https://play.google.com/store/apps/details?id=com.microsoft.office.outlook&amp;referrer=kmas_id%253dbe847d74-dbca-91a0-0d41-af7a2926861d%2526ocid%253dcmmo2y8kpf1%2526rid%253dn8ZF4eU6\" target=\"_blank\">Microsoft Outlook - Apps on Google Play</a>\n</li><li>Outlook Mac: <a href=\"https://apps.apple.com/us/app/microsoft-outlook/id985367838?mt=12\" target=\"_blank\">Microsoft Outlook on the Mac App Store (apple.com)</a></li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting mid-July 2024, legacy Outlook clients will be retired, affecting users with outdated versions on iOS, Android, Mac, and Windows Mail and Calendar applications. From mid-August, outdated browsers will receive an error on Outlook web. Users must update to the latest versions for continued functionality and support."
    }
  ],
  "EndDateTime": "2024-11-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC801980",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-06-14T22:01:04.67Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-14T22:00:33Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Legacy Outlook clients retirement plan",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
