{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 6, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The Resources section on Microsoft Viva Connections mobile will show content from the recently revamped Resources section on Viva Connections desktop. The Resources section in Viva Connections is comprised of navigational links. If these links are created via in-app editing in Viva Connections, they will propagate to the Resources section in mobile as well. If no links have been added via in-app editing and Global Navigation is configured on the Home site, the Resources section on mobile will continue to show the navigational links from Global Navigation.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=388369\" target=\"_blank\">388369</a></p><p>\n</p><p><b>When this will happen:</b>&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out late August 2024 (previously mid-July) and expect to complete by mid-December 2024 (previously mid-November).</p><p><b>How this will affect your organization:</b><br></p><p>Navigational links created via in-app editing in the Viva Connections Resources section will now be consistent across endpoints.</p><p>For more information, visit <a href=\"https://learn.microsoft.com/viva/connections/viva-connections-overview#viva-connections-resources\" target=\"_blank\">Viva Connections resources</a>.</p><p>This feature is available by default.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388369"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Viva Connections mobile Resources section will be updated to match the desktop version, with navigational links syncing across both. Rollout starts late August 2024, completing by mid-December 2024. No admin action is needed, but users should be informed. Roadmap ID: 388369."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-02-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC804768",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-08T01:26:55.23Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-24T22:54:21Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Connections: Refreshed Resources section on mobile to align with desktop",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
