{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 2, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Before this rollout, users can indicate in Microsoft Teams if they are in office or remote by manually setting their location by selecting their profile photo at the top right of Teams. With this rollout, we are introducing automatic location updates on bookable desks to make it easier for users to keep their work location up to date and connect with others in the office.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=401118\" target=\"_blank\">401118</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General availability (Worldwide): We will begin rolling out early September 2024 (previously early August) and expect to complete by mid-September 2024 (previously late August).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Bookable desks refer to unassigned seats in the office that are equipped with devices such as monitors or other peripherals. Admins can associate these devices to a workspace account using the Teams Rooms Pro Management portal. This association will allow users to automatically claim a desk, and (in future) will provide IT with valuable usage analytics and reports. Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/rooms/bookable-desks\" target=\"_blank\">Setting up Bookable Desks in Microsoft Teams - Microsoft Teams | Microsoft Learn</a>.\nAfter configuring bookable desks, admins can <a href=\"https://learn.microsoft.com/powershell/module/teams/new-csteamsworklocationdetectionpolicy?view=teams-ps\" target=\"_blank\">enable automatic location updates</a> at the tenant level or for a specific user group. Then, users can enable the feature at Teams &gt; <i>Settings</i> (three-dot menu in top right of the screen) &gt; <i>Privacy</i> &gt;<i> Sharing your work location</i>. After users enable the feature, their work location will automatically update to <i>In the office</i> when they connect to a bookable desk, if their location was previously set to <i>Unknown</i> or <i>Remote.</i>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mQEm?ver=82dd\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>To help users find this feature, after an admin enables the feature, the banner \"Looks like you're in the office\" will appear the first time a user plugs into a bookable desk.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mKVG?ver=1c2c\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After a user enables automatic location updates, the banner \"You're connected to your organization's network or device\" will appear once when they plug into a bookable desk. The banner confirms that the user has successfully enabled automatic location update.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mQbb?ver=c355\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. To prepare for this feature, we recommend communicating this new feature to your users and admin team and sharing instructions if needed. After this feature rolls out, admins can enable automatic location updates at a tenant level or for a specific user group. Then, users can enable automatic location detection in Teams Settings <i>&gt; Privacy</i> as described earlier.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401118"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing automatic location updates on bookable desks to simplify updating work locations. This feature will be globally available from early to mid-September 2024. Admins can enable this at the tenant level, and users can activate it in Teams settings."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC808158",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-02T18:11:13.457Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-03T22:07:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Automatic location updates on bookable desks",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
