{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>A modernized user experience  (UX) for Microsoft Purview eDiscovery will be available in the Purview portal. In this new UX experience, Content Search, eDiscovery Standard, and eDiscovery Premium are unified so that users can now navigate a shared workflow that simplifies the transition between non-premium and premium features. This UX modernization also introduces features that enhance the eDiscovery process. Some of these new features include:<br></p><ul><li>Enhanced search efficiency with message ID and sensitivity labels for faster access to information.</li><li>Use of the improved search by Sensitive Information Type (SIT) interface for user-friendly selection without manual input. \n</li><li>Advanced Data Source Mapping allows linking a user's OneDrive using input such as the user's mailbox Simple Mail Transfer Protocol (SMTP) address or user’s name, streamlining data retrieval and management. \n</li><li>Acceleration through powerful investigation capabilities, such as user's frequent collaborators, providing a comprehensive view of the user's networks. \n</li><li>Stay updated with the new Data Source synchronization feature, which allows users to easily track any new or removed data locations, ensuring that eDiscovery investigations remain aligned with the latest data source landscape.\n</li><li>The new visual Statistics feature allows users to gain insights  at a glance, such as Results containing Sensitive Information Types, top communication participants, and so on.</li><li>Monitor long-running processes with an informed and transparent progress bar with the option to cancel (for certain process types) if needed.\n</li><li>Obtain a full process report for all actions taken, such as statistics for holds and exports, bolstering the defensibility of your eDiscovery efforts.\n</li><li>Customize your exports with new settings, including the option to export as a single PST file path truncation and the use of friendly names to make exported data more accessible.</li></ul><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=383744\" target=\"_blank\">383744</a></p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late July 2024 and expect to complete by early August 2024.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early October 2024 and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b></p><p>The unification of Content Search, eDiscovery Standard, and eDiscovery Premium into a single eDiscovery solution in the new Microsoft Purview portal will necessitate updates to your organization's training materials and documentation.</p><p><i>Content Search, eDiscovery Standard, and eDiscovery Premium as separate solutions in the compliance portal (left) vs unified eDiscovery experience in the new Purview portal (right)</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mGlE?ver=8dea\" style=\"width: 500px;\"><br></p><p><br></p><p>The current compliance portal eDiscovery Standard, Premium, and Content search experience will be deprecated as part of the portal deprecation by the end of 2024.</p><p><b>What you need to do to prepare:</b>\n</p><p>Update internal documentation and provide training to all eDiscovery users in your organization.</p><p>Learn more about the <a href=\"https://learn.microsoft.com/en-us/purview/purview-portal\" target=\"_blank\">new Purview Portal</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "383744"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Purview portal introduces a modernized eDiscovery experience, unifying Content Search, eDiscovery Standard, and eDiscovery Premium with enhanced features for efficiency and data management. Public Preview begins late July 2024, with General Availability starting early October 2024. Organizations should update training materials and documentation in preparation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC808165",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-03T22:16:59.74Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-03T22:16:43Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview eDiscovery | Modernized eDiscovery in new Microsoft Purview portal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
