{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 23, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>To help increase productivity while working online, web links from Azure Active Directory (AAD) accounts and Microsoft (MSA) accounts in the <a href=\"https://aka.ms/newoutlooktimeline\" target=\"_blank\">new Outlook for Windows </a>app will open in Microsoft Edge in a single view showing the opened link side-by-side with the email it came from. \n</p><p>We're adding this to the new Outlook for windows to have a consistent experience across our applications. If you have previously managed this change for the classic Outlook for Windows (MC545904, MC548092, MC541626) or for Teams (MC669480), your configuration will also apply to the new Outlook for Windows. If you wish to maintain this configuration across all three apps, no action is required.\n</p><p><b>Note: </b>This does not change the default browser setting in Windows.  \n</p><p><b>When will this affect your organization:</b>\n</p><p>We will begin rolling out in late July 2024 and expect to complete by mid-January 2025 (previously mid-December).&nbsp;</p><p><b>How this will affect your organization:</b> \n</p><p>Web links from emails in the new Outlook for Windows app will open side-by-side with the email in Microsoft Edge so users can easily reference the link and email without switching back and forth between apps. Links will open in Microsoft Edge even if it is not the system default browser in Windows. \n</p><ul><li>Only links set to open via a web browser are affected. Links that are set to open in a client app or within Outlook itself will continue to do so. \n</li><li>This initial release to the new Outlook for Windows application will only enable links reading pane's message body content\n</li><li>User experiences will vary by policy configuration; please see the next section. \n</li><li>Web links from all accounts in the Outlook for Windows app will open in Microsoft Edge.\n</li></ul><p><b>What you need to do to prepare:</b>  \n</p><p>To manage this change, you will need to configure the <i>Choose which browser opens web links policy, </i>which&nbsp;is available today, using the <a href=\"https://learn.microsoft.com/deployoffice/admincenter/overview-cloud-policy\" target=\"_blank\">Cloud Policy service for Microsoft 365</a> (formerly the Office Cloud Policy Service) and <a href=\"https://www.microsoft.com/download/details.aspx?id=49030\" target=\"_blank\">Administrative Templates for Microsoft 365 Apps</a>. \n</p><ul><li>To open web links from the Outlook for Windows app using the system default browser (current default behavior): Enable the policy and select System default browser from the policy options.  \n<ul><li>Users will not be able to disable or change this setting. \n</li></ul></li><li>To open web links from the Outlook for Windows app using Microsoft Edge (future default behavior): Enable the policy and select Microsoft Edge from the policy options.  \n<ul><li>Users will not be able to disable or change this setting. \n</li><li>Users will receive a notification of this change on the first occurrence. \n</li></ul></li><li>To allow users to manage the change: Disable the policy or leave the policy unconfigured. Please note that the future default behavior for web links will be to open in Microsoft Edge. \n<ul><li>Users will see a notification informing them of this change on the first occurrence. This notification provides users with the option to accept the change/learn more, or to disable the change. \n</li><li>The user’s selection will also apply to the experience in the classic Outlook for Windows and Teams. \n</li><li>Users may manage this setting at any time in the new Outlook for Windows app via Settings &gt; General &gt; Files and links &gt; Open hyperlinks from Outlook in.  \n</li><li>If there is an existing user preference set in the classic Outlook for Windows, the new Outlook for Windows will respect it. If the user only sets a preference to use the system default browser in Teams, the new Outlook for Windows will open the links in Microsoft Edge informing them of this change on the first occurrence and users can accept the change/learn more, or to disable the change.\n</li></ul></li></ul><p>If your organization uses a Microsoft 365 for business plan, your users will need to manage this change individually through the Outlook settings menu: Settings &gt; General &gt; Files and links &gt; Open hyperlinks from Outlook in.\n</p><p>Example of the user notification experience</p><p> \n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d75e9a4c-283f-4029-b6ca-8c4cdcd833f1\" style=\"width: 400px;\"></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/ce671b61-4d03-421a-9740-ee63a9c94d32\" style=\"width: 400px;\"><br></p><p>Read more about how we’re improving the experience between Microsoft 365 and Microsoft Edge with this feature in: <a href=\"https://learn.microsoft.com/outlook/troubleshoot/message-body/view-emails-and-web-links-in-browser\" target=\"_blank\">Web links from Outlook and Teams open in Microsoft Edge in side-by-side view - Outlook | Microsoft Learn</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Outlook for Windows will open web links in Microsoft Edge side-by-side with the email, enhancing productivity. This update, rolling out from late July 2024 to mid-January 2025, applies to AAD and MSA accounts. Users can manage this feature through Outlook settings or policy configuration."
    }
  ],
  "EndDateTime": "2025-02-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC803892",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-24T00:21:24.837Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-21T21:21:50Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Web links in the new Outlook for Windows to open side-by-side with email in Microsoft Edge",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
