{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft OneDrive for macOS: We are excited to announce an enhancement to how OneDrive runs in the background. Before this rollout, the OpenAtLogin plist controlled whether the OneDrive Sync app launched upon device startup. However, this setting could be overridden by a MacOS System Setting in Login Items, allowing users to modify their experience.\n</p><p>With our latest update, we are streamlining this process. OneDrive Sync will no longer support the Open at login setting. Instead, it will listen to the macOS System Setting Login Item, ensuring that it launches seamlessly in the background when your device starts up. This Login Item is now managed via configuration profile, accessible under Background Services.\n</p><p>We believe this change will improve the overall user experience and provide greater app reliability. This message does not apply to mobile.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD, USSec, USNat, and Gallatin): We will begin rolling out early July 2024 and expect to complete by late July&nbsp;2024.\n</p><p>The rest of the channels will follow in line with their normal cadence.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Administrators will no longer need to configure the OpenAtLogin plist setting. Instead, admins can manage the background behavior of OneDrive Sync directly through a Background Services configuration profile that can be deployed via Microsoft Intune, Jamf, etc.\n</p><p>This feature is off by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Review the <a href=\"https://learn.microsoft.com/sharepoint/deploy-and-configure-on-macos\" target=\"_blank\">Background Services configuration profile</a> and deploy it.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneDrive for macOS is updating to streamline background syncing. The OpenAtLogin plist setting will be replaced by macOS System Setting Login Item, managed through a configuration profile. Rollout begins early July 2024, with completion by late July. Admins should review and deploy the Background Services configuration profile."
    }
  ],
  "EndDateTime": "2024-09-20T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC808855",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-05T21:39:47.56Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-05T21:39:36Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: How to ensure/manage background syncing on macOS",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
