{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Engage: The community muting feature for admins is changing. Before this rollout, when admins muted a community, <i>only users who were not members of the community </i>would no longer see conversations from this community appear in their Home Feed, weekly discovery email, or daily digest email.\n</p><p>After this rollout, <i>members who were dynamically added into the community</i> (as part of a Dynamic Group) <i>will also no longer see</i> conversations appear in their Home feed, weekly discovery email, or daily digest emails. Other users who have voluntarily joined the community will continue to see conversations appear normally in their Home Feed and digest emails as before.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2024 and expect to complete by mid-July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This feature is on by default and accessible to all users with the appropriate permissions.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will update the community muting feature for admins, affecting visibility of conversations for dynamically added members in Home Feed and digest emails. The rollout is automatic, starting and completing mid-July 2024, with no required admin action before the rollout. Users should be notified."
    }
  ],
  "EndDateTime": "2024-09-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC809600",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-08T23:43:38.71Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-08T23:43:25Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Update on community muting for admins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
