{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Out of caution, we have paused automatic uninstallation of classic Microsoft Teams due to a rare issue impacting the Teams Meeting Add-in in Microsoft Outlook application. This message applies to Teams for Windows only. We will update this message when we are ready to resume the uninstallation.&nbsp;</p><p><b>How this will affect your organization</b>\n</p><ul><li>This pause will only impact customers who have not already uninstalled classic Teams.\n</li><li>This issue could result in the Microsoft Teams Meeting Add-in in Outlook disappearing from the Outlook application for Windows or could cause failure when users try to schedule or join Teams meetings.\n</li></ul><p></p><p><b>What you need to do to prepare</b>\n</p><p>If your users are experiencing this issue, a temporary workaround is to use the Microsoft Teams Calendar to schedule or join meetings. To repair users who continue to experience the Teams Meeting Add-in issues in Outlook, please refer to <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/meetings/teams-meeting-add-in-missing\" target=\"_blank\">Teams meeting add-in missing from Outlook and new Teams - Microsoft Teams | Microsoft Learn</a>\n</p><p>Can I uninstall classic Teams manually?\n</p><ul><li>Customers who experience this issue after the automatic uninstallation of classic Teams or after they manually uninstall classic Teams can review the troubleshooting steps in <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/meetings/teams-meeting-add-in-missing\" target=\"_blank\">Teams meeting add-in missing from Outlook and new Teams - Microsoft Teams | Microsoft Learn</a>\n</li><li>Additional details can be found in the <i>What happens if we can’t update users to new Teams</i> section of <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability#what-happens-if-we-cant-update-users-to-new-teams\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">End of availability for classic Teams client</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Automatic uninstallation of classic Microsoft Teams for Windows is paused due to an issue affecting the Teams Meeting Add-in in Outlook. Impacted users can use the Teams Calendar as a workaround and refer to Microsoft Learn for troubleshooting steps. Manual uninstallation guidance is also provided."
    }
  ],
  "EndDateTime": "2024-10-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC806095",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-27T23:54:16.173Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-27T23:53:39Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Classic Microsoft Teams: Uninstallation paused for Windows only",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
