{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 27, 2024: We have updated the content below with a link to additional information. Thank you for your patience.</p><p>Coming soon to Microsoft Viva: Leaders will be able to delegate access to their Microsoft Copilot Dashboard to others in their company. Designated delegates, such as the leader's chief of staff or direct reports, will be able to view Copilot Dashboard insights and use them to make data-driven decisions. Designated delegates have the same access to Copilot Dashboard as the leader but cannot see the leader's personal insights. This message applies to Viva Insights on Desktop, on the web, on iOS/Android, and in Microsoft Teams.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398976\" target=\"_blank\">398976</a>.<br></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late June 2024 and expect to complete by early July 2024.</p><p><b>How this will affect your organization:</b></p><p>Before this rollout: Leaders were unable to delegate access to their Copilot Dashboard.</p><p>After this rollout: A few things to note about delegating access to the Copilot Dashboard:</p><p>\n</p><ul><li>Admins will have the ability to <a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">set policies in PowerShell</a> to manage access to the Copilot Dashboard delegation feature.&nbsp;</li><li>Leaders can revoke access to anyone at any time.<br></li><li>Delegates cannot delegate access to others.\n</li><li>Leaders can delegate access to multiple people.</li></ul><p>Add delegates to view your Copilot Dashboard (Viva &gt; <i>Insights &gt; Copilot Dashboard &gt; </i>Three-dot menu in top right&gt; <i>Delegate access</i>):</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m607?ver=d51f\" style=\"width: 400px;\" alt=\"user settings\">\n<br></p><p>This feature is on by default and is available to all Viva leaders. Admins can disable the feature at the tenant level using Viva feature access management policies.</p><p><b>What you need to do to prepare:</b></p><p>Review and assess the impact for your organization. This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update training and documentation as appropriate.</p><p>Learn more:<br></p><ul><li><a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\" style=\"\">Microsoft Viva - Feature access management | Microsoft Learn</a></li><li><a href=\"https://go.microsoft.com/fwlink/?linkid=2275860\" target=\"_blank\">Delegate access to organizational insights and Copilot Dashboard</a>&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398976"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights will soon allow leaders to delegate access to their Copilot Dashboard to designated individuals within their company. This feature will enable delegates to view insights and make informed decisions, without seeing the leader's personal insights. It will be available on various platforms and is associated with Roadmap ID 398976. Rollout begins late June 2024. Admins can manage access with policies, and the feature is enabled by default. Organizations should prepare by reviewing the impact and updating documentation accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2024-09-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC801259",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-27T20:53:13.17Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-13T00:23:51Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights: Delegate access to Microsoft Copilot Dashboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
