{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Purview compliance portal: A new compliance boundary cmdlet <code>Invoke-ComplianceSecurityFilterAction</code> will be available as part of the Security &amp; Compliance PowerShell. This cmdlet allows user to check if a given mailbox or site has the compliance boundary property value set. If the property is not set or if the object is in arbitration, compliance admins&nbsp;can use this cmdlet to assign the property value for the mailbox or site for compliance boundary to take effect.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=397091\" target=\"_blank\">397091</a>&nbsp;and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398451\" target=\"_blank\">398451</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-July 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Admins had no single solution to check or set mailbox properties and arbitration status, requiring complex steps with Exchange PowerShell for different mailbox types.</p><p>After this rollout: This cmdlet will enhance your organization's ability to manage compliance boundaries. It will be especially beneficial in situations where a Microsoft OneDrive site needs to be brought back into compliance following a user's departure, or when an inactive mailbox is not correctly assigned. This cmdlet allows for the straightforward setting of the compliance boundary property, based on user input, to address these issues.</p><p>This new feature is off by default.</p><p><b>What you need to do to prepare:</b><br></p><p>This rollout will happen automatically by the specified date. To prepare for this update, we recommend reviewing the Compliance boundary cmdlet documentation at&nbsp;<a href=\"https://learn.microsoft.com/powershell/module/exchange/new-compliancesecurityfilter?view=exchange-ps\" target=\"_blank\">New-ComplianceSecurityFilter (ExchangePowerShell) | Microsoft Learn</a>. Additionally, ensure that your compliance admins are informed about the upcoming changes and are ready to incorporate the cmdlet into your organization’s process such as departed employees to ensure compliance boundary stay in effect.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "397091,398451"
    },
    {
      "Name": "Summary",
      "Value": "The message details an upcoming feature in the Microsoft Purview compliance portal: a new cmdlet, 'Invoke-ComplianceSecurityFilterAction', for managing compliance boundary properties for mailboxes and sites. It is associated with Microsoft 365 Roadmap IDs 397091 and 398451, with rollout starting mid-July 2024 and completing by late August 2024. The feature will simplify compliance management and is off by default. Organizations are advised to review the cmdlet documentation and prepare compliance admins for the update."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC804767",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-24T22:54:02.763Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-24T22:53:27Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal | eDiscovery: Compliance boundary cmdlet tool to manage compliance boundary property",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
