{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Later this year, we expect iOS 18 and iPadOS 18 to be released by Apple. Microsoft Intune, including the Intune Company Portal and Intune app protection policies (APP, also known as MAM), will require iOS/iPadOS 16 and higher shortly after the iOS/iPadOS 18 release.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>If you are managing iOS/iPadOS devices, you might have devices that will not be able to upgrade to the minimum supported version (iOS 16/iPadOS 16). Provided that <a href=\"https://www.microsoft.com/microsoft-365/microsoft-365-and-office-resources\" target=\"_blank\">Microsoft 365 mobile apps are supported on iOS 16/iPadOS 16 and higher</a>, this may not affect you; you have likely already upgraded your OS or devices.</p><p>See the following Apple documentation for devices to check which devices support iOS 16 or iPadOS 16 (if applicable):</p><ul><li><a href=\"https://support.apple.com/guide/iphone/supported-models-iphe3fa5df43/16.0/ios/16.0\" target=\"_blank\">Supported iPhone models</a></li><li><a href=\"https://support.apple.com/guide/ipad/supported-models-ipad213a25b2/16.0/ipados/16.0\" target=\"_blank\">Supported iPad models</a></li></ul><p>For instructions on how to check in the Microsoft Intune admin center which devices or users may be affected, read below.&nbsp;</p><p><b>Note:</b> Userless iOS and iPadOS devices enrolled through Automated Device Enrollment (ADE) have a slightly nuanced support statement due to their shared usage. The minimum supported OS version will change to iOS 16/iPadOS 16 while the allowed OS version will change to iOS 13/iPadOS 13 and later. For more details, see <a href=\"https://aka.ms/ADE_userless_support\" target=\"_blank\">https://aka.ms/ADE_userless_support</a>.</p><p> <b>What you need to do to prepare:</b></p><p>Check your Intune reporting to see what devices or users may be affected. For devices with mobile device management (MDM) go to <b>Devices </b>&gt; <b>All devices</b> and filter by OS. For devices with app protection policies go to <b>Apps </b>&gt; <b>Monitor </b>&gt; <b>App protection status</b> and use the <i>Platform </i>and <i>Platform version</i> columns to filter. \n</p><p>To manage the supported OS version in your organization, you can use Microsoft Intune controls for both MDM and APP. For more information, please review: <a href=\"https://learn.microsoft.com/mem/intune/fundamentals/manage-os-versions\" target=\"_blank\">Manage operating system versions with Intune - Microsoft Intune | Microsoft Learn</a>.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Intune will require iOS/iPadOS 16 and higher after the release of iOS/iPadOS 18 later this year. Organizations should check Intune reporting to identify affected devices and users, and review Apple documentation for supported models. Userless devices have specific support changes. Preparation steps are provided."
    }
  ],
  "EndDateTime": "2024-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC803005",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-18T23:23:26.697Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-18T23:23:13Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Plan for Change: Intune moving to support iOS/iPadOS 16 and higher later this year",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
