{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 5, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Word for the web, Microsoft Excel for the web, and Microsoft PowerPoint for the web: An enhanced <i>File</i> menu, so users can more easily create, open, share, export, and manage files. We have also updated the autosave experience and made file renaming more efficient.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We began rolling out mid-May 2024 and expect to complete by late July 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early August 2024 and expect to complete by late February 2024 (previously late November).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, we received feedback from users who were overwhelmed and confused by the file menu and found it difficult to find and use critical commands on the menu. It wasn't clear to users that their files were autosaved on web apps.\n</p><p>To address this user feedback, we have reimagined the <i>File</i> menu and file renaming to be more intuitive and easier to use.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f4465be5-6124-4b37-aa60-e2961656b949\" style=\"width: 400px;\" alt=\"user settings\"></p><p>After this rollout, users can use the <i>File</i> menu to: \n</p><ul><li>Quickly navigate to the folder where their file is saved from the link at the top of the <i>File</i> menu.\n</li><li>More efficiently find commands for downloading files as PDFs and other formats at <i>File &gt; Export</i>\n</li><li>Use <i>Create a copy</i> (formerly called <i>Save as)</i> to save a copy of file online or to a local device\n</li><li>Use the <i>Move File</i> command to move a file to a different folder\n</li><li>Explore previous versions of the file with <i>File Version History\n</i></li></ul><p>Also, users can rename a file by selecting the file name in the title bar near the top of the browser window and entering the new file name:</p>\n<p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c4903b1d-94c4-4899-8f8e-89b544b2cec3\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>All changes are available by default to users of Microsoft Word for the web, Microsoft Excel for the web, and Microsoft PowerPoint for the web.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. Please notify your users about this change and update any relevant documentation as appropriate</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Word, Excel, and PowerPoint for web will soon feature an enhanced File menu and more efficient file renaming. Rollout began mid-May 2024 and will continue until late February 2025. These updates aim to simplify file management and address user feedback for ease of use."
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC803014",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-06T00:41:02.273Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-18T23:27:48Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft 365 Word, Excel, and PowerPoint for web: Enhanced File menu and easier file renaming",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
