{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August14, 2024: Updated timing related to Office 365 connector retirement.</p><p>\n</p><ul><li>We will <b>extend the deadline to add new connector apps to Teams/Channels to December 31st, 2024</b> (from previously announced timeline of August 15, 2024). After this date, users will no longer see the \"Add\" new app button within the Connectors dialog from the channel settings page. Connector only apps such as Incoming Webhook and RSS will not be listed within the Teams app store.</li></ul><p>The following timelines are unaffected and remain as previously announced in our last update: </p><ul><li>Developers will no longer be able to create new Office 365 Connectors from the Developer Portal starting August 15th, 2024. </li><li>Connector owners will be required to update the respective URL to post by December 31st, 2024.  At least 90 days prior to the December 31, 2024, deadline, we will send further guidance about making this URL update. If the URL is not updated by December 31, 2024, the connector will stop working.  This is due to further service hardening updates being implemented for Office 365 connectors in alignment with Microsoft’s Secure Future Initiative </li><li>Users will be able to configure connectors wherever the relevant apps have already been added to a Team/Channel from now until December 2025.&nbsp;</li><li>Office 365 Connectors will be retired in December 2025&nbsp;<br></li></ul><p><b>How this will affect your organization:</b>\n</p><p>We will gradually roll out this change in two phases:\n</p><ul><li><i>Effective August 15, 2024:</i> All new connector creation will be blocked in all clouds (See latest date within the update above).</li><li><i>Effective October 1, 2024:</i> All existing connectors in all clouds will stop working (See latest date within the update above).</li></ul><p><b>What you need to do to prepare:</b><br></p><p>This change will happen automatically on the specified dates listed above. No admin action is required. Please notify your users about this change, update relevant documentation as appropriate, and share the <a href=\"https://support.microsoft.com/office/browse-and-add-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a\" target=\"_blank\">Browse and add workflows in Microsoft Teams</a> support article.\n</p><p>Learn more <a href=\"https://aka.ms/O365ConnectorDeprecation\" target=\"_blank\">about the retirement of Microsoft Office 365 connectors and migrating to Workflows</a>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The deadline to add new connector apps to Teams/Channels is extended to December 31, 2024. Office 365 Connectors will be retired in December 2025. No admin action is required, but users should be informed and referred to the provided support articles for more information."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC808160",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-20T17:33:10.81Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-03T22:12:23Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Office 365 Connectors feature retires starting August 15, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
