{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The <i>Publish to Power BI</i> feature will no longer be available in Microsoft Excel in Microsoft 365. We recommend users transition to Microsoft Power BI on the web (also known as the Power BI service), for their publishing needs. We will remove <i>Publish to Power BI</i> from Excel in Microsoft 365 starting August 19, 2024, and <i>Publish to Power BI</i> will not be included in the Excel 2024 perpetual release. This does not impact prior versions of on-premises Office.\n</p><p></p><p>The <i>Publish to Power BI</i> feature is no longer up to date with the publishing experience in the Power BI service. The Power BI service has all the capabilities of the Excel <i>Publish to Power BI</i> feature and more, such as non-default workspaces, workspace folders, and modern format data models, which are not available through Excel publishing.\n</p><p>This retirement will not impact any existing workbooks or workbook artifacts in the Power BI service or in Excel.\n</p><p>Users will need to transition to the Power BI service for their publishing needs. The Power BI service can do everything that the <i>Publish to Power BI</i> feature does and more. We recommend using these workflows in the Power BI service:\n</p><p><i>Upload your workbook to the Power BI service</i>\n</p><ul><li>Uploading a local Excel file to your Power BI workspace: Power BI no longer supports the upload of Excel files from local folders. To upload or view your Excel file in a Power BI workspace, resave your file in Microsoft OneDrive or Microsoft SharePoint.\n</li></ul><ul><li>Uploading a cloud (OneDrive or SharePoint) Excel file to your Power BI workspace: In your selected Workspace/folder, use <i>Upload</i> to upload files to the Power BI service.\n</li></ul><p><i>Export workbook data to the Power BI service</i>\n</p><ul><li>Use the Power BI service to import local Excel data into your Power BI workspace: In your selected Workspace/folder in the Power BI service, select <i>New</i> and then select <i>Semantic Model.</i>\n</li></ul><ul><li>Use the Power BI service to import cloud Excel data into your Power BI workspace: In your selected Workspace/folder in the Power BI service, select <i>New</i> and then select <i>Semantic Model.</i></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Publish to Power BI\" feature in Microsoft Excel will retire on August 19, 2024. Users should transition to the Power BI service for publishing needs. The Power BI service offers additional capabilities not found in Excel's publishing feature, and this change will not affect existing workbooks. Users must upload workbooks to Power BI from OneDrive or SharePoint."
    }
  ],
  "EndDateTime": "2024-10-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC808826",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-07-05T19:39:23.587Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-05T19:39:06Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Excel: Publish to Power BI retires starting August 19, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
