{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Currently, when you share a link with view-only permissions in Microsoft 365 apps,&nbsp;clicking on <i>Copy link</i>&nbsp;defaults to an \"Only people with existing access\" link that does not always target your intended people.<br></p><p>With this new feature, when you share a link with view-only permissions with other people, those people will now be able to copy that same link directly from the Share dialog when they attempt to share. If your only option to share with others is <i>Only people with existing access</i>, you will be able to send a request to the owner to share this file with specific people directly in the sharing control. The owner of the file will then receive a request and will be able to approve or reject the request.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-September (previously mid-August) 2024 and expect to complete by late September (previously late August) 2024.&nbsp;</p><p>General Availability (Worldwide, GCC, GCC High, and DoD): We will begin rolling out late September (previously mid-September) 2024 and expect to complete by mid-October 2024 (previously early October).&nbsp; &nbsp;<br></p><p><b>How this will affect your organization:</b></p><p>With this new feature, anyone who accesses a Microsoft 365 apps file with view-only permissions will see this new experience.&nbsp;</p><p>Learn more: <a href=\"https://support.microsoft.com/office/sharing-files-folders-and-list-items-e923c4f0-89f5-4cf0-8948-391e31fc0b30\" target=\"_blank\">Sharing files, folders, and list items - Microsoft Support</a>&nbsp;(content within will be updated before rollout begins).</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 apps are updating the resharing experience to allow users to copy view-only links directly from the Share dialog. The rollout timeline has been updated, starting mid-September and completing by mid-October 2024. No admin action is required for this automatic update."
    }
  ],
  "EndDateTime": "2024-11-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC805212",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-10T23:59:08.653Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-25T23:31:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 apps: Improved resharing experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
