{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Later this year, we expect macOS 15 Sequoia to be released by Apple. Microsoft Intune, the Company Portal app and the Intune MDM agent will be moving to support macOS 13 (Ventura) and later. Since the Company Portal app for iOS and macOS are a unified app, this change will occur shortly after the release of macOS 15. This does not affect existing, enrolled devices.</p><p><b>How this will affect your organization:</b></p><p>This will only affect you if you currently manage, or plan to manage macOS devices with Intune. This may not impact you because your users have likely already upgraded their macOS devices. See <a href=\"https://support.apple.com/102861\" target=\"_blank\">macOS Ventura is compatible with these computers – Apple Support</a> for a list of devices that are supported.</p><p><b>Note:</b> Devices that are currently enrolled on macOS 12.x or below will continue to remain enrolled even when those versions are no longer supported. New devices will be unable to enroll if they are running macOS 12.x or below.</p><p>Enrolled macOS devices without user affinity, either through Automated Device Enrollment (ADE) without user affinity or Direct Enrollment, have a slightly nuanced support statement due to their shared usage. For more details, see <a href=\"https://aka.ms/Intune/macOS/ADE-DE-support\" target=\"_blank\">https://aka.ms/Intune/macOS/ADE-DE-support</a>.</p><p><b>What you need to do to prepare:</b></p><p>Check your Intune reporting to see which devices or users may be affected. Go to <b>Devices </b>&gt; <b>All devices</b> and filter by macOS. You can add in additional columns to help identify who in your organization has devices running macOS 12.x or below. Request that your users upgrade their devices to a supported OS version before this change.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Intune will support macOS 13 and higher later this year, coinciding with the release of macOS 15 Sequoia. Devices on macOS 12.x or below will remain enrolled but won't be able to enroll new devices. Organizations should prepare by upgrading devices to a supported OS version."
    }
  ],
  "EndDateTime": "2024-10-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC803004",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-18T23:22:56.427Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-18T23:22:35Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Plan for Change: Intune moving to support macOS 13 and higher later this year",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
