{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 3, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Adaptive Protection integration with Microsoft Purview Data Loss Prevention will soon be available for government clouds (GCC, GCC High, and DoD). This integration enables admins with the appropriate access to change, create, update, and delete policies, and to configure policies where users are automatically included in the scope of data loss prevention (DLP) policies based on insider risk levels. For example, a DLP policy integrated with insider risk levels will prevent high-risk users from printing sensitive data, while allowing low-risk users to do so.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=377674\" target=\"_blank\">377674</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late February 2025 (previously mid-January) and expect to complete by late March 2025 (previously late February).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Adaptive Protection integrated with Purview DLP was not available for government clouds.\n</p><p>To use Adaptive Protection integrated with Purview DLP for your organization, go to Purview &gt; <i>Insider risk management</i> &gt; and turn on <i>Adaptive Protection:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/03f3bb80-9897-4db0-9c30-a7e7cd2a1177\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>Adaptive Protection is off by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-adaptive-protection?tabs=purview-portal\" target=\"_blank\">Help dynamically mitigate risks with adaptive protection (preview) | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "377674"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Adaptive Protection for Insider Risk Management will be available for government clouds with updated rollout dates: starting late February 2025 and completing by late March 2025. This feature allows admins to manage DLP policies based on insider risk levels. No action is required before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC803011",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-03T16:59:11.6Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-18T23:25:52Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Adaptive Protection in GCC, GCCH, DoD",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
