{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft is updating the default Microsoft Windows email and calendar applications, <a href=\"https://support.microsoft.com/office/11-715fc27c-e0f4-4652-9174-47faa751b199\" target=\"_blank\">transitioning from Mail, Calendar, and People to the new Microsoft Outlook for Windows</a>.&nbsp;<br></p><p>If your accounts are supported in the new Outlook for Windows, you'll see a toggle in the upper right corner of your application named Try the New Outlook. Selecting this toggle will download the new app and let you switch to new Outlook for Windows.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m3BU?ver=a88f\" style=\"width: 400px;\"><br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=399464\" target=\"_blank\">399464</a></p><p><b>When this will happen:</b>&nbsp;</p><p>Public Preview: We will begin rolling out in late July 2024 and expect to complete roll out by early August 2024.</p><p>General Availability: We will begin rolling out in early August 2024 and expect to complete by early September 2024.</p><p><b>How this will affect your organization:</b></p><p>COM add-ins, which are available in classic Outlook for Windows, aren’t supported in new Outlook for Windows. However, Office web add-ins are supported in new Outlook for Windows. To learn more about COM and web add-ins, see <a href=\"https://learn.microsoft.com/office/dev/add-ins/overview/office-add-ins\" target=\"_blank\">Office Add-ins platform overview</a> and <a href=\"https://learn.microsoft.com/deployoffice/outlook/get-started/migrate-com-to-web-addins\" target=\"_blank\">Migrate from COM to web add-ins</a>.&nbsp;<br></p><p>To help facilitate the migration of users to web add-ins and avoid any disruption to their productivity, we curated a list of COM add-ins that have equivalent web add-ins that are available today. <a href=\"https://support.microsoft.com/office/b85ce5ff-bef3-45ae-9e95-9d63c514abdc\" target=\"_blank\" style=\"\">Review the full list of these add-ins</a>.</p><p>When a user switches from classic Outlook to new Outlook for Windows, they go through a series of steps to help them get set up. As part of this onboarding process, a user can consent to install equivalent web add-ins from their existing COM add-ins from the curated list.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1m64h?ver=24ee\" style=\"width: 475px;\"><br></p><p>If the user has a COM add-in from the curated list and selects <i>Import Settings</i>, the web add-in is installed in new Outlook for Windows. If the user selects <i>Skip</i>, no web add-ins equivalents are installed for the user.&nbsp;</p><p>This feature is available for all users by default, including users blocked from the Store.</p><p><b>What you need to do to prepare:</b>\n</p><p>To opt out of this feature, set the following Group Policy Object (GPO) setting to <i>Enabled </i>by mid-July 2024: <i>Disable web add-in installation on migration to new Outlook for Windows</i>. For more information, see <a href=\"https://aka.ms/newOutlookSettingsGPO\" target=\"_blank\">Install web add-in counterparts of existing COM add-ins in new Outlook for Windows</a>.&nbsp;</p><p>These equivalent web add-ins are identified as user-installed add-ins. If you’re looking to deploy a web add-in as an admin-installed add-in, you can deploy it through Integrated Apps and hide the COM add-in using the following GPO to avoid duplication: <i>Deactivate Outlook web add-ins whose equivalent COM or VSTO add-in is installed</i>. For more information, see&nbsp;<a href=\"https://learn.microsoft.com/office/dev/add-ins/develop/make-office-add-in-compatible-with-existing-com-add-in#group-policy\" target=\"_blank\">Make your Office Add-in compatible with an existing COM add-in</a>.</p><p>The user can also <a href=\"https://support.microsoft.com/office/1ee261f9-49bf-4ba6-b3e2-2ba7bcab64c8\" target=\"_blank\">directly install add-ins from the Store</a> once they move to new Outlook for Windows. This feature only helps enable users find their existing add-in easily and avoid disruption to the work if an equivalent add-in is already available.&nbsp;<br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "399464"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is transitioning to the new Outlook for Windows, replacing COM add-ins with web add-ins. Users can switch to the new Outlook and install equivalent web add-ins during the onboarding process. The rollout begins in late July 2024, with general availability in early August 2024."
    }
  ],
  "EndDateTime": "2024-10-21T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC804770",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-24T22:56:35.363Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-24T22:56:18Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Installing web add-ins to replace COM add-ins in new Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
