{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 27, 2024: The following update is available. Thank you for your patience.</p><p>Update: Some users of classic Outlook may not see the app name change due to a known issue: <a href=\"https://support.microsoft.com/topic/outlook-icon-on-the-start-menu-is-not-updated-to-outlook-classic-8e10e5c7-a33d-4c7e-8ca3-213fba1eff10\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Outlook icon on the Start menu is not updated to Outlook (Classic) - Microsoft Support</a>. As a related change, the new Outlook icon has been updated as of August 1st to remove the \"New\" badge, and this update will be automatically applied when users launch the app.</p><p>Starting in July 2024, Microsoft will change the app name of the current Outlook for Windows for all customers as it appears in the Start menu now from \"Outlook\" to “Outlook (classic)”. This is not a change in status or support for the classic Outlook app. Please continue to refer to our blog post timeline for product support and availability. <a href=\"https://aka.ms/newOutlookTimeline\" target=\"_blank\">New Outlook for Windows: A Guide to Product Availability.</a> This change is intended to differentiate it from the new Outlook for Windows. Users will see this update in classic Outlook version 2407 and higher.<br></p><p>\n</p><p>This naming convention now also aligns with how it is referred to in <a href=\"https://support.microsoft.com/en-us/outlook\" target=\"_blank\">support documentation</a>. For instance, at the top of articles like <a href=\"https://support.microsoft.com/en-us/office/use-favorites-in-outlook-8913f2d0-b167-48cc-8983-86fa9b0d945f\" target=\"_blank\">this one on using favorites</a>, there are tabs for different instructions in new Outlook and classic Outlook so users can find the instructions appropriate for the version they are on.\n</p><p><b>When this will happen:</b><br></p><p>Users will see the new app name in the Start menu after they install version 2407 or later.\n</p><ul><li>Current Channel: We will begin rolling out late July 2024 and expect to complete by early August 2024.\n</li><li>Monthly Enterprise Channel will get this update September 2024\n</li><li>Semi-annual channel will get this update January 2025</li></ul><p><b>How this will affect your organization:</b><br></p><p>This change will only affect the app name as it appears in the Start menu installed apps list and Start pinned apps. The app icon and the executable file name will remain the same.</p><p><b>What you need to do to prepare:</b>\n</p><p>There is no action required for administrators to prepare for this change. This change also cannot be configured differently per organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Outlook for Windows app name will change to \"Outlook (classic)\" starting July 2024, affecting version 2407 and higher. Some users may not see the updated name due to a known issue. This change aligns with support documentation and does not affect the app's status or support. Rollout will complete by January 2025. No action is required from administrators."
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC803006",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-27T23:44:56.337Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-18T23:23:42Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "(Update) Outlook for Windows display name change",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
