{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In Microsoft Viva Learning, the updated Learner Completion Record bulk export is an extension of the existing feature to download Learner Completion records by Microsoft 365 user groups and security groups. Bulk export empowers enterprises to download learner records of multiple users at once using the Microsoft 365 user groups and security&nbsp;groups.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=334050\" target=\"_blank\">334050</a></p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2024 (previously mid-August) and expect to complete by late September 2024 (previously late August).</p><p><b>How this will affect your organization:</b><br></p><p>This updated Learner Completion Record bulk export feature allows you to download learner records for multiple users at once using the Microsoft 365 and security&nbsp;groups.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "334050"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Viva Learning's updated Learner Completion Record bulk export allows downloading of multiple user records at once using Microsoft 365 user and security groups. It will roll out worldwide from mid to late September 2024 without requiring admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-11-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC806522",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-10T13:52:32.62Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-28T22:33:45Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Learning: Learner Completion Record bulk export",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
