{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Effective immediately, we will be retiring the cmdlets in SharePoint Online Management Shell associated with the legacy SharePoint Invitation Manager. As of March 2024, the legacy SharePoint Invitation Manager is no longer used for any external sharing scenarios, as described in MC696169 <i>(Updated) Legacy SharePoint Invitation Manager is being retired</i> (December 2023). The two cmdlets that customized external sharing are no longer functional and are being retired.</p><p><b>How this will affect your organization:</b>\n</p><p>You will no longer be able to use the properties <code>-RequireAcceptingAccountMatchInvitedAccount</code> or <code>-NotifyOwnersWhenInvitationsAccepted</code> for <code>Set-SPOTenant</code>, because these properties only applied to legacy external invitations.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No admin action is required.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The SharePoint Online Management Shell's cmdlets for the legacy SharePoint Invitation Manager have been retired, with no further use for external sharing scenarios. Organizations can no longer use specific properties for 'Set-SPOTenant' related to legacy external invitations, and no admin action is required."
    }
  ],
  "EndDateTime": "2024-08-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC806097",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-27T23:55:25.3Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-27T23:55:15Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "SharePoint Online: Legacy SharePoint Invitation Manager PowerShell cmdlets have retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
