{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 18, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Teams Rooms on Microsoft Windows will soon support Proximity Join via ultrasound. It will be an alternative to using Bluetooth or QR codes and typically will not penetrate walls, therefore improving the quality of detected rooms by personal devices. This release will be rolling out to Microsoft Teams Desktop (Windows and MacOS) for receivers and to select Microsoft Teams Rooms on Windows.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=380681\" target=\"_blank\">380681</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-September 2024 (previously early September) and expect to complete by late September 2024 (previously mid-September).</p><p>General Availability (GCC): We will begin rolling out mid-September 2024 and expect to complete by early October 2024.</p><p>General Availability (GCC High): We will begin rolling out early October 2024 and expect to complete by early November 2024.</p><p><b>How this will affect your organization:</b></p><p>The user experience for Proximity Join on Microsoft Teams Rooms will not change as a result of this feature. The suggested room in the room list will be improved using ultrasound.</p><p>Previous tenants that were not able to leverage the Proximity Join feature due to Bluetooth restrictions will be able to use Proximity Join via ultrasound with this release.</p><p>This new feature will be enabled by default.</p><p><b>What you need to do to prepare:</b></p><p>\n</p><p>You may want to notify your users about this new capability to detect nearby rooms using the laptop microphones, which will receive the ultrasound signal broadcasted from select Microsoft Teams Rooms that have consoles built with a dedicated ultrasound speaker. Audio peripherals connected to laptops may affect the device's ability to detect the ultrasound signal.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401118"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"401118\":[{\"RoadmapId\":401118,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-07-04T05:34:54.7875719Z\",\"LatestRing\":null},{\"RoadmapId\":401118,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-07-04T05:34:54.787572Z\",\"LatestRing\":null},{\"RoadmapId\":401118,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-07-04T05:34:54.7875721Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon support Proximity Join via ultrasound, improving room detection without penetrating walls. Rollout starts mid-September 2024, with full availability expected by early November 2024. This feature will be enabled by default and is detailed on Microsoft 365 Roadmap ID 380681. Users should be notified about the new detection method."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC808158",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-18T23:23:14.783Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-03T22:07:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Automatic location updates on bookable desks",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
