{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 11, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p><b>Note:</b> Users with EDU licenses assigned will not receive this change.&nbsp;</p><p><b></b>Microsoft Teams will detect and hide inactive channels users have not interacted with recently. Users can choose to have Teams run this automatically as well as initiate the hiding process on demand when needed. They can review the list of channels and choose none, some or all of the inactive channels to be hidden. Users can opt out of automated hiding anytime from Teams Settings. This message applies to Microsoft Teams for Desktop, web, and Mac.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=325780\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">325780</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-July 2024 and expect to complete by late July 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 (previously mid-August) and expect to complete by mid-January 2025 (previously mid-September)</p><p>General Availability (GCC): We will begin rolling out early February 2025 (previously late September) and expect to complete by mid-February 2025 (previously early October).\n</p><p>General Availability (GCC High): We will begin rolling out early February 2025 (previously early October) and expect to complete by mid-February 2025 (previously mid-October).</p><p>General Availability (DoD): We will begin rolling out mid-February 2025 (previously late October) and expect to complete by late February 2025 (previously late October).</p><p><b>How this will affect your organization:</b><br></p><p>Before this rollout: Users had to manually manage their relevant channels list by hiding inactive and irrelevant channels.</p><p>After this rollout:&nbsp;</p><p><b>Manage preferences for automated hiding via Teams Settings&nbsp;</b></p><p>If users prefer to manage channels manually, they can opt out of the auto-hiding process. Simply go to Teams settings, select General, and toggle off \"Hide Inactive Channels.\"&nbsp;&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d5fe1175-6442-49b0-a6f7-20a7affae7d2\" style=\"width: 500.003px;\"><br></p><p><b>Hide inactive channels on demand when needed</b></p><p>Users can manually view which channels are inactive and choose to hide some or all of them whenever you need. This can be done from Settings, under General, by clicking the \"Hide Now\" button. Note that this action can be performed once every 24 hours.</p><p>&nbsp;<img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e27e302b-0906-4b0c-b49d-405750dedcd6\" style=\"width: 500.003px;\"><br></p><p><b>Automated hiding of inactive channels&nbsp;</b></p><p>With this, Teams will hide channels that have been inactive for the user. Inactive channels are identified based on the following criteria: if the user has not been active in the channel in the last 120 days – meaning there is no new messaging in the channel that the user has read or reacted to – the channel is considered inactive. Once the inactive channels are identified, the user is notified with the coach mark message, \"We're hiding some inactive channels for you.\"&nbsp;</p><p>The user can select View changes to see the details. The user can keep the channels hidden or show them again.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d6c577c3-0de2-4b29-a1f4-05d610e9a790\" style=\"width: 500.005px;\"></p><p>If a user has less than or equal to 25 shown channels, no channels will be hidden for that user.&nbsp; </p><p><b>What you need to do to prepare:</b></p><p>Admins need to be aware of this feature, but no additional action is needed. The feature will roll out starting in November 2024. Users will first see their settings enabled to manage their preferences for automated hiding; additional to the ability to manually hide inactive channels.&nbsp;</p><p>Users will start to see the automated hiding of inactive channels, a few weeks after the feature has rolled out.&nbsp;&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "325780"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"325780\":[{\"RoadmapId\":325780,\"Platform\":\"Web\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-12T12:28:19.0357817Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":325780,\"Platform\":\"Mac\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-12T12:28:19.035782Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":325780,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-12T12:28:19.0357822Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":325780,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-12T12:28:19.0357824Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon automatically detect and hide inactive channels, with rollout dates varying from mid-July 2024 to late February 2025, depending on the release stage. Users can manually hide channels, opt out, or manage preferences in Teams Settings. EDU license users are excluded from this update. Roadmap ID: 325780."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-04-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC804771",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-11T21:10:15.547Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-24T22:56:51Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Hiding inactive channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
