{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 12, 2024: We have updated this message with additional information regarding the experience with the Files and Insights tab. Thank you for your patience.</p><p>We will be retiring the Files page from Microsoft Defender for Cloud Apps starting October 28, 2024.&nbsp;</p><p>Information Protection policies can be created, modified and explored via the Policy Management page.  \n</p><p>You can explore malware files on the Policy Management page.</p><p>Additionally, as part of this retirement, we will also be removing the Files and Insights tabs under Settings &gt; Cloud apps &gt; App connectors.&nbsp;</p><p>\n</p><p>You are receiving this message because our reporting indicates one or more users in your organization are using the <i>Files</i> page in Defender for Cloud Apps.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/defender-cloud-apps/file-filters\" target=\"_blank\">File filters - Microsoft Defender for Cloud Apps | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Files page in Microsoft Defender for Cloud Apps will be retired on October 28, 2024. Users can manage Information Protection policies and explore malware files via the Policy Management page. The Files and Insights tabs will also be removed from App connectors settings."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC805203",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-09-12T22:56:17.27Z",
  "Services": [
    "Microsoft Defender for Cloud Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-25T23:19:26Z",
  "Tags": [
    "Updated message",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Defender for Cloud Apps: Files page retires September 1, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
