{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting July 29, 2024 and ending August 9, 2024, we will be retiring the <code>Remove-SPOExternalUser</code> PowerShell cmdlet for Microsoft SharePoint Online (SPO) users as part of our ongoing efforts to enhance security and streamline scope and permissions for external users.\n</p><p>After the retirement, requests using the&nbsp;<code>Remove-SPOExternalUser</code> cmdlet will be blocked with an error message similar to: \n</p><p>“To streamline scope and permissions for external users, enhance access management, and strengthen our security posture, this cmdlet has been deprecated. Alternatively, please use the <code>Remove-AzureADUser</code> cmdlet in Microsoft Entra ID for user management. Learn more:&nbsp;<a href=\"https://learn.microsoft.com/powershell/module/azuread/remove-azureaduser?view=azureadps-2.0\" target=\"_blank\">Remove-AzureADUser (AzureAD) | Microsoft Learn</a>.\"</p><p><b>How this will affect your organization:</b> \n</p><p>Our telemetry indicates that only a few organizations are active users of the <code>Remove-SPOExternalUser</code> cmdlet for their user management needs. If this change impacts your org, please note that the functionality will continue to be available through alternate means for the tenant admins/users (see below for details).\n</p><p><b>What you need to do to prepare:</b> \n</p><p>Please begin immediately transitioning from using the <code>Remove-SPOExternalUser</code> cmdlet. To avoid unexpected impact, also ensure none of your workflows are calling this cmdlet. Instead, please use the <code>Remove-AzureADUser</code> cmdlet as described in <a href=\"https://learn.microsoft.com/powershell/module/azuread/remove-azureaduser?view=azureadps-2.0\" target=\"_blank\">Remove-AzureADUser (AzureAD) | Microsoft Learn</a>, where we will continue to invest resources.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Remove-SPOExternalUser\" PowerShell cmdlet for SharePoint Online will retire on July 29, 2024. Users should transition to the \"Remove-AzureADUser\" cmdlet and update workflows to avoid disruption. Further details and guidance are available at Microsoft Learn."
    }
  ],
  "EndDateTime": "2024-09-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC806103",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-06-27T23:58:46.577Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-27T23:58:31Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft SharePoint: “Remove-SPOExternalUser” retires starting July 29, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
