{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 26, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Viva: Improvements to the Viva Insights design and leader reports. In Viva Insights, leaders are defined as users who have been assigned the group manager role and who have at least 4 direct and indirect reports or as defined by their admin. This message applies to Viva Insight on the Desktop, the web, and Android/iOS. This message applies to customers with a <a href=\"https://www.microsoft.com/en-us/microsoft-viva/insights#faq\" target=\"_blank\">Viva Insights subscription</a>.\n</p><p></p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=399427\" target=\"_blank\">399427</a> and Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=399426\" target=\"_blank\">399426</a>.\n<p></p><b>When this will happen:</b>&nbsp;<p></p><p></p><p>General Availability (Worldwide): We will begin rolling out late June 2024 and expect to complete by mid-August 2024 (previously mid-July).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Viva Insights home was focused on highlighting metrics. We received feedback asking for more leader reports.\n</p><p>After this rollout:\n</p><p><i>Home page and navigation updates\n</i></p><p>We will update the Viva Insight home page and left navigation to highlight reports.\n</p><ul><li>The left navigation will separate into two sections: <i>Team insights </i>and <i>Your insights</i>. The new reports will be under <i>Team insights</i> and the existing <i>Wellbeing, Productivity,</i> and <i>Teamwork</i> pages will be under <i>Your insights</i>. <i>Insights about your team</i> that was previously in <i>Wellbeing, Teamwork,</i> and <i>Productivity</i> pages will be moved to the new <i>Team insights</i> pages.</li><li>Our home page redesign will include new cards for new reports on external focus, new hire onboarding, and meeting cost and quality.\n</li><li>In the new <i>Library </i>page, users can access all metrics associated with existing reports. Users can also filter their metrics by sub-organizations, time periods, and peer benchmarks.\n</li></ul><p><i>Employee engagement with leadership communications report\n</i></p><p>We will release a new out-of-the-box report on employee engagement with leadership communication. This report helps leaders understand the reach of their communications in their organization, and their employees’ engagement with the leaders' emails, meetings, and shared files to better understand the effectiveness of different modes of communication.\n</p><p></p><i>Pulse survey as a recommendation action\n</i><p></p><p>Leaders can now send a Viva Pulse survey from leader reports to quickly gather employee sentiment feedback. A leader can take these Pulse-related actions:\n</p><ul><li><i>Send a Pulse survey</i> – Leaders can send a Pulse survey to ask their team about research and report findings. For new hires, Pulse leaders can choose from a set of research-backed questions.\n</li><li><i>View status of and results from a Pulse survey</i>– Leaders can see the status of a Pulse survey, including if it is in draft, still awaiting responses, or has results ready for review.\n</li></ul><p>These features are on by default. Admins can <a href=\"https://learn.microsoft.com/viva/insights/personal/teams/viva-teams-app-admin-tasks#install-the-app\" target=\"_blank\" style=\"\">disallow the app in their organization</a> if desired.\n</p><p>Home page and navigation updates:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1maF2?ver=dc4a\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>Employee engagement with leadership communications report:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mfTz?ver=0551\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p></p><b>What you need to do to prepare:</b>\n<p></p><p>No action is needed to enable this feature. Leaders can use this capability at their discretion. Inform your Viva Insights users that have been assigned the group manager role about this new capability and update any relevant training materials.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/insights/introduction#premium-viva-insights\" target=\"_blank\">Use Leader reports to uncover key business outcomes | Microsoft Learn</a></p><p>To learn more about Microsoft’s own review of this product with its works councils, please consider reading: <a href=\"https://aka.ms/VivaInsights/MSWorksCouncilsArticle\" target=\"_blank\">https://aka.ms/VivaInsights/MSWorksCouncilsArticle</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "399426,399427"
    },
    {
      "Name": "Summary",
      "Value": "The Viva Insights home and navigation will be updated to emphasize reports, with new features like employee engagement reports and Pulse surveys. Rollout starts late June 2024, completing by mid-August. No action is required for the update, which applies to Viva Insights subscribers."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2024-09-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC802697",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-26T18:51:52.49Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-17T23:19:08Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Viva: Viva Insights home & nav refresh, employee engagement report & Pulse recommended action for leaders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
