{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are updated the Windows Autopilot enrollment experience, starting September 5, 2024. Note that some customers received MC772891, describing this change but with a date of July 5. We are now extending the timeline until September 5, 2024. This change will prevent new device enrollments via the ‘Windows Autopilot deployment for existing devices’ feature, when organizational enrollment restrictions blocking personal device enrollment are configured.</p><p><b>How does this affect me</b> \n</p><p>You can continue to use Windows Autopilot for existing devices functionality with personal enrollment restrictions until September 5, 2024; however, we encourage your organization to upgrade devices with older operating systems to Windows 10 or 11 and register them through Windows Autopilot to avoid any impact resulting from this change. To continue using Autopilot for existing devices with enrollment restrictions blocking personal devices, register all devices for Autopilot or upload the Windows corporate identifiers.</p><p>For more information regarding the Windows Autopilot device registration process, please see the documentation:&nbsp;<a href=\"https://learn.microsoft.com/autopilot/registration-overview\" target=\"_blank\">Windows Autopilot registration overview</a>.  This is in line with the behavior of <a href=\"https://learn.microsoft.com/mem/intune/enrollment/enrollment-restrictions-set#blocking-personal-windows-devices\" target=\"_blank\">other automatic MDM enrollment methods</a> where we cannot verify the device identity.&nbsp;</p><p><b>What action do I need to take</b>\n</p><p>Move to using <a href=\"https://techcommunity.microsoft.com/t5/intune-customer-success/new-windows-corporate-device-identifier-feature-with-microsoft/ba-p/4180287\" target=\"_blank\">corporate identifiers</a> by September 5, 2024. If you cannot make enrollment changes, please refer to this blog post: <a href=\"https://aka.ms/Autopilot_7_2_update_blogpost\" target=\"_blank\">https://aka.ms/Autopilot_7_2_update_blogpost</a> for additional information and use the form linked in the blog to request extension.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Windows Autopilot enrollment for existing devices will change on September 5, 2024. Organizations should upgrade devices to Windows 10/11 and register them through Autopilot to avoid impact from enrollment restrictions on personal devices. More information and actions required can be found in the provided documentation links."
    },
    {
      "Name": "BlogLink",
      "Value": "https://aka.ms/Autopilot_7_2_update_blogpost"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC807794",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-02T22:57:55.907Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-02T22:55:58Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Plan for Change: Upcoming changes for deploying Windows Autopilot for existing devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
