{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring the Microsoft Office 365 connectors feature in Microsoft Teams starting August 15, 2024, and ending January 1, 2025. For similar functionality, we recommend <a href=\"https://support.microsoft.com/office/browse-and-add-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a\" target=\"_blank\">using the Workflows app</a> in Microsoft Teams, where we will continue to invest our development resources. As we strive for continuous improvement, the shift toward Power Automate workflows represents our commitment to providing scalable, flexible, and secure solutions. Power Automate workflows not only offer enhanced capabilities but also ensure that your integrations are built on a platform that can grow with your business needs.\n</p><p><b>How this will affect your organization:</b>\n</p><p>We will gradually roll out this change in two phases:\n</p><ul><li><i>Effective August 15, 2024:</i> All new connector creation will be blocked in all clouds.\n</li><li><i>Effective October 1, 2024:</i> All existing connectors in all clouds will stop working.\n</li></ul><p>When a user with an active Office 365 connector posts a message in Teams, a warning message about the impending retirement of the connector is included at the bottom of the message:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mIa0?ver=5260\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically on the specified dates listed above. No admin action is required. Please notify your users about this change, update relevant documentation as appropriate, and share the <a href=\"https://support.microsoft.com/office/browse-and-add-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a\" target=\"_blank\">Browse and add workflows in Microsoft Teams</a> support article.\n</p><p>Learn more <a href=\"https://aka.ms/O365ConnectorDeprecation\" target=\"_blank\">about the retirement of Microsoft Office 365 connectors and migrating to Workflows</a>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Teams Office 365 Connectors feature will be retired between August 15, 2024, and January 1, 2025. Users are advised to switch to the Workflows app in Teams for similar functionality. New connector creation will be blocked from August 15, 2024, and existing connectors will stop working from October 1, 2024. No admin action is required for this change. Users should be notified and directed to relevant support articles for guidance."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC808160",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-07-03T22:12:50.42Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-03T22:12:23Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Office 365 Connectors feature retires starting August 15, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
