{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Viva Amplify, access to templates that are user-created and specific to campaigns is changing. Previously, these templates were only accessible by opening <i>View all templates</i>.  The changes are:</p><ul><li>Users can see user-created templates as Campaign templates in positions 1-3 on the campaign overview page (the 4th template is always a blank template to allow easy access to template creation).&nbsp;</li></ul><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mGq8?ver=358b\" style=\"width: 400px;\"><br></p><ul><li>The most recently created or modified template will be in the 1st position. Every time a template is created or modified, other templates will be pushed out by one position.&nbsp;</li><li>Additional Viva Amplify templates or Campaign templates are visible under <i>View all templates </i>and&nbsp;can be edited or deleted from this modal.&nbsp; &nbsp;</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398978\" target=\"_blank\">398978</a></p><p><b>When this will happen:</b>&nbsp;</p><p>\n</p><p>General Availability (Worldwide): We began rolling out mid-June 2024 and expect to complete by end of June 2024.</p><p><b>How this will affect your organization:</b></p><p>This feature update makes it easier for users of Viva Amplify to find their most recently used templates.&nbsp;</p><p>For more information, see <a href=\"https://support.microsoft.com/topic/create-and-use-publication-templates-7ad7d6fa-2ff5-4376-a245-1fbc413329da#Overview\" target=\"_blank\">Create and use publication templates</a>.</p><p>This feature update is available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398978"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Amplify is updating template access. User-created templates will appear in the first three positions on the campaign overview page, with the most recent template first. Additional templates can be managed under 'View all templates.' Rollout began mid-June 2024 and will complete by end-June 2024. This update is part of Microsoft 365 Roadmap ID 398978."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC805198",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-25T23:17:37.293Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-25T23:17:12Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Amplify: Access to most recent templates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
