{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft SharePoint a new content pane for <i>Pages</i> and <i>News</i>. The content pane serves as a convenient hub for various panes that support authors in crafting their publications.\n</p><p>In Microsoft Viva Amplify, the content pane includes more tools such as the distribution channel selection, writing guidance, and audience selection.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=124827\" target=\"_blank\">124827</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early July 2024 and expect to complete by early August 2024.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late July 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users access section tools and templates on the left side of the canvas. Web parts can only be added through the on-canvas plus buttons.\n</p><p><i>After this rollout</i>\n</p><p>Users will see the new content pane when editing SharePoint <i>Pages</i> and <i>News</i>. This centralized space now has a user-friendly toolbox so authors can explore and insert content into their <i>Pages and News</i>. Users can navigate the content pane with the three icons on the right side of the screen for <i>Toolbox, Properties,</i> and <i>Design ideas.</i>\n</p><p>Users can access essential tools for page creation in the toolbox, which includes three content categories: web parts, media, and section templates. Authors can click and drag web parts and media onto the canvas. Items from any category can also be added to the canvas with a click. To view more options for any of the categories, select the <i>See all</i> and <i>See more</i> buttons.\n</p><p>The preexisting <i>Properties </i>pane is now in the content pane. Users can access properties for a web part or a section by selecting the <i>Properties</i> icon on the right of the content pane or by selecting the <i>Edit properties</i> button in the web part or section toolbars.\n</p><p>Users will now see updated section controls on the authoring canvas. To add a section, select the plus button on a section border and then select a section to add. Use the section toolbar in the top left of a section to move sections, edit properties, and duplicate or delete sections.\n</p><p>The control pane is on by default and accessible to all SharePoint authors. The three icons for <i>Toolbox, Properties,</i> and <i>Design ideas</i> are on the right side of the screen:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mGpY?ver=1006\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You might want to notify users, update your user training, and prepare your help desk.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "124827"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint is introducing a new content pane for Pages and News, enhancing tools for authors with features like distribution channel selection and audience selection. It will start rolling out in July 2024, with no admin action required for the update."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC803891",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-21T21:21:34.173Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-21T21:21:17Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: New content pane for Pages and News",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
