{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are bringing Microsoft SharePoint audience targeting support to Microsoft Viva Amplify. When publishing to one or more SharePoint sites from within Viva Amplify, you can now promote the news post to specific audiences by indicating security groups, Microsoft 365 groups, or Entra ID (previously Azure Active Directory)&nbsp;dynamic groups.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1&amp;filters=Microsoft%20Viva&amp;searchterms=398975\" target=\"_blank\">398975</a></p><p><b>When this will happen:</b> </p><p>General Availability: We will begin rolling out mid-June 2024 and expect to complete by late June 2024.</p><p><b>How this will affect your organization:</b></p><p>This new default feature will allow more targeted communications as desired by the authors and publishers to help create more engagement with your Viva Amplify publication. End users will be able to use audience targeting in the publishing pane in Viva Amplify.&nbsp;&nbsp;</p><p>For more information, see <a href=\"https://support.microsoft.com/topic/publish-a-viva-amplify-publication-68ee5c0d-8350-4fab-bafc-4a7a8ca72ec7\" target=\"_blank\">Publish a Viva Amplify publication</a>.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398975"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Amplify will support SharePoint audience targeting, allowing news posts to be promoted to specific audiences. This feature will be generally available from mid to late June 2024, with no admin action required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-08-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC800831",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-11T23:13:12.54Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-11T23:12:59Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Amplify: Support for Microsoft SharePoint audience targeting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
