{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring the SharePoint News connector from Microsoft Teams starting July 22, 2024 and ending August 31, 2024. To continue receiving SharePoint team site news notifications in Teams, we recommend using these alternatives, where we will continue to invest our development resources:</p>\n<ul><li><a href=\"https://learn.microsoft.com/en-us/viva/connections/mobile-notifications-viva-connections\" target=\"_blank\">Viva Connections News notifications</a>\n</li><li><a href=\"https://support.microsoft.com/topic/publish-a-viva-amplify-publication-68ee5c0d-8350-4fab-bafc-4a7a8ca72ec7\" target=\"_blank\">Viva Amplify</a>\n</li><li>Workflow in Teams\n</li></ul><p>Starting July 22, 2024, your users will not be able to create new SharePoint News connectors in any Teams channel. The process of retiring existing SharePoint News connectors will begin on August 26, 2024. After the connectors are retired, users will not receive new post notifications.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>While no admin action is required to implement the retirement, we recommend that you:</p><ul><li>Notify your users about the upcoming changes.\n</li><li>Update any relevant internal documentation to reflect these changes.\n</li><li>Guide your end users through the process of determining if they have configured the SharePoint News connector using the \n<a href=\"https://support.microsoft.com/office/sharepoint-news-connector-retirement-062bc8d1-b6f9-4716-a154-a6b9073d3461\" target=\"_blank\">detailed, step-by-step guide</a>. <b>Note:</b> our team lacks an automatic way to detect SharePoint news connectors set up in your tenants.\n</li><li>Determine the best alternative solutions and share the with your users to ensure a smooth transition.\n</li></ul><p>Learn more: <a href=\"https://support.microsoft.com/office/sharepoint-news-connector-retirement-062bc8d1-b6f9-4716-a154-a6b9073d3461\" target=\"_blank\">SharePoint News connector retirement - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The SharePoint News connector in Microsoft Teams will retire on July 22, 2024. Users should transition to alternatives like Viva Connections News notifications, Viva Amplify, or Teams Workflow. New connectors cannot be created after July 22, 2024, and existing ones will retire starting August 26, 2024. No admin action is required, but preparation steps are recommended."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC803508",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-06-20T16:48:40.07Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-20T16:47:53Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: SharePoint News connector retires July 22, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
