{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Use a new sensitivity label setting or protection with Double Key Encryption to prevent content within Word, Excel, PowerPoint, and Outlook from being sent to Microsoft for content analysis as a privacy control, even when these are stored in Microsoft’s cloud, such as SharePoint or OneDrive.<br></p><p>This helps your organization to optimize your data privacy needs on a per-content basis using the familiar configurations and end-user experiences available with Microsoft Purview.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=398991\" target=\"_blank\">398991</a></p><p><b>When this will happen:</b>\n</p><p>Public Preview: Available early June via Current Channel Preview v2406+<br></p><p>General Availability: Available late June/early July 2024 via Current Channel v2406+ in worldwide environments.</p><p><b>How this will affect your organization:</b>\n</p><p>This new label setting is off by default. When a sensitivity label is configured with <code>BlockContentAnalysisServices=True</code>, files and emails with this label will not send content to Microsoft services for analysis.</p><p>If you’re already using Double Key Encryption in your organization, files and emails protected with DKE will automatically prevent content in use from being sent to analysis services.</p><p><b>What you need to do to prepare:</b>\n</p><p>If your organization does not need to disable some connected experiences that analyze content in use, no action needed.</p><p>The sensitivity label configuration is not available in the Microsoft Purview portal or the Microsoft Purview compliance portal. You must use the PowerShell advanced setting BlockContentAnalysisServices with the Set-Label or New-Label cmdlet after you've connected to Security &amp; Compliance PowerShell.</p><p>The sensitivity label capability requires the built-in labeling client for Microsoft Purview in Office apps; the label setting is not compatible with the legacy Azure Information Protection Add-in.</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/sensitivity-labels-office-apps#prevent-some-connected-experiences-that-analyze-content\" target=\"_blank\">Prevent some connected experiences that analyze content</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398991"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview can now prevent content analysis by connected experiences using a new sensitivity label setting or Double Key Encryption. This feature is part of Microsoft 365 Roadmap ID 398991 and will be available in Public Preview in early June via Current Channel Preview v2406+ and for General Availability in late June/early July 2024 via Current Channel v2406+. The setting is off by default and requires PowerShell configuration."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-09-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC802004",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-15T00:00:31.5Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-15T00:01:00Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Use Microsoft Purview to prevent some connected experiences that analyze content",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
