{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for new Microsoft Outlook for Windows: A new policy to automatically configure accounts based on Active Directory Primary SMTP address.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=396729\" target=\"_blank\">396729</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-June 2024 and expect to complete by early July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: On the first-time login page in the new Outlook for Windows, the email field will be empty, and users will need to enter their email address.\n</p><p>After the rollout: On the first-time login page, the email field will be automatically filled with the primary SMTP address and the user will not be able to change it.</p><p>You can access the new policy called <i>Automatically configure accounts based on Active Directory Primary SMTP address</i> through the <a href=\"https://intune.microsoft.com\" target=\"_blank\">Microsoft Intune admin center</a> &gt; <i>Apps &gt; Policies for Office Apps.</i>\n</p><p>Admins are advised to configure the new policy for specific groups for an easier account setup process on managed devices and to guarantee that company policies will always be respected.\n</p><p>If this policy is enabled, the primary SMTP address used to log in to Windows will be suggested the first time a user adds their account to new Outlook for Windows.</p><p>The default state of the new policy is off.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/deployoffice/outlook/manage/policy-management\" target=\"_blank\">Policy Management - Deploy Office | Microsoft Learn</a> (will be updated before rollout begins)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "396729"
    },
    {
      "Name": "Summary",
      "Value": "A new Microsoft Outlook for Windows policy will automatically configure accounts using the Active Directory Primary SMTP address. This feature, detailed on the Microsoft 365 Roadmap ID 396729, will start rolling out in mid-June 2024 and is expected to complete by early July 2024. Admins can manage this policy through the Microsoft Intune admin center. The default policy state is off, and no admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-09-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC800501",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-10T23:51:33Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-10T23:51:09Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Automatically configure accounts with new policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
