{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>December 11, 2024 - Reminder: Users need to update their Webhook URLs by January 31, 2025, to ensure their notifications continue posting to Microsoft Teams. For more information on how to do this, please refer to the October 16th update below.</p><p>Updated October 16, 2024: Updated information related to Office 365 Connectors Retirement in Teams - Webhook URL Migration. Thank you for your patience.</p><p>&nbsp;As shared in the last communication, we are publishing guidance for owners of webhook-based connectors to update their URLs with a new structure. To allow ample time for replacing URLs, connector owners will have until <b>January 31, 2025, which is an extension from our previous deadline of December 31, 2024.</b> See below for complete guidance.</p><p>Webhook-based connectors within the O365 Connectors service in Teams are transitioning to a new URL structure due to the implementation of further service hardening updates. During this transition, you may receive notifications to update your configured connector to use the new URL. We strongly recommend that you update your connector immediately to prevent any disruption to connector services. URLs for all webhook-based connectors must be updated by January 31, 2025 for the connectors to continue posting messages into Teams. <b>Keep in mind the entire O365 Connectors service in Teams will be retired at the end of 2025</b>, so consider moving your webhooks to the Workflows app within Teams to avoid conducting another migration. Documentation: <a href=\"https://prod.support.services.microsoft.com/office/create-incoming-webhooks-with-workflows-for-microsoft-teams-8ae491c7-0394-4861-ba59-055e33f75498\" target=\"_blank\">Create incoming webhooks with Workflows for Microsoft Teams - Microsoft Support</a></p><p><b>How this will affect your organization:</b></p><p>This change is needed only for webhook-based Connectors such as Incoming Webhook and third-party connectors where a URL is provided for posting messages. The change is not required for polling-based connectors such as RSS.</p><p>To update webhook URLs for existing O365 Connectors, follow these steps: <a href=\"https://learn.microsoft.com/microsoftteams/m365-custom-connectors#update-connectors-url\" target=\"_blank\">Manage Microsoft 365 connectors and custom connectors - Microsoft Teams | Microsoft Learn</a></p><p>1. Go to<b> Manage Channel</b> in a Teams channel, select<b> Edit</b> under the Connectors option, and select <b>Configured </b>section. Review the existing connections listed on this page.</p><p>2.Do one of the following to generate a new URL:</p><ul><li>For connectors that contain a webhook URL, select <b>Manage</b> and <b>Update URL.</b></li><li>For other types of connectors, remove the connector and recreate the connector configuration.</li></ul><p>3. Replace the old URL with the new URL (or the new connection in the service that triggers the post). You'll know the new URL is ready for you to copy when the Configure page shows a message that the URL is updated (\"Url is up-to-date\").</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1f25c2c0-1a9e-49af-8c81-26fb2bc3252c\" style=\"width: 410px;\"><br></p><p><b>What you need to do to prepare:</b></p><p>The below dates are still unchanged and were communicated in previous updates:</p><ul><li>Entire O365 Connector service in Teams will retire in December 2025.</li><li>Developers will no longer be able to create new Office 365 Connectors from the Developer Portal starting August 15th, 2024.</li></ul><p>Additional documentation:</p><p><a href=\"https://prod.support.services.microsoft.com/office/create-incoming-webhooks-with-workflows-for-microsoft-teams-8ae491c7-0394-4861-ba59-055e33f75498\" target=\"_blank\">Create incoming webhooks with Workflows for Microsoft Teams - Microsoft Support</a></p><p><a href=\"https://support.microsoft.com/office/browse-and-add-workflows-in-microsoft-teams-4998095c-8b72-4b0e-984c-f2ad39e6ba9a#:~:text=Workflows%20let%20you%20automate%20repetitive%20tasks%20or%20processes\" target=\"_blank\">Browse and add workflows in Microsoft Teams - Microsoft Support</a></p><p><b>Note about parity features for the Workflows app</b></p><p>We are currently developing a method for webhooks in the Workflow app to support the following scenarios and will share more details before March 30, 2025.</p><ul><li>Post messageCard formatted message payloads (so you do not have to reformat the payload to adaptive card)</li><li>Post to private channels</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Office 365 Connectors feature in Microsoft Teams will retire on August 15, 2024. Users must update their Webhook URLs by January 31, 2025, to maintain notifications in Teams. Guidance for updating URLs is provided, with a final service retirement at the end of 2025."
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC808160",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-11T19:44:35.04Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-03T22:12:23Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Teams: Office 365 Connectors feature retires starting August 15, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
