{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 14, 2024: As an update, we would like to inform you that we are resuming the automatic uninstallation of classic Teams in your organization starting October 21, 2024. The attempt to uninstall classic Teams will commence in a staggered rollout.</p><p>This message applies to:</p><ul><li>Teams for Windows on non-VDI and VDI with the new Teams Only policy. Please see MC807466 for Mac details on the automatic uninstallation.\n</li><li>VDI customers in persistent environments where Classic Teams is version 1.7.00.7956 or higher. Persistent VDI environments are environments where Classic Teams was installed with the .exe installer in Appdata\\Local.\n</li></ul><p><b>Note:</b> For customers in non-persistent VDI environments where Teams was installed using the MSI in C:\\Program Files (x86), this MC Post does not apply, and IT admins should remove Classic Teams from the golden image.</p><p></p><p><b>What you need to do to prepare</b><br></p><p>No additional changes are needed. This is for informational purposes only.</p><p><b>Can I uninstall classic Teams manually?</b>&nbsp; </p><p>Please refer to <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-uninstall\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">How to uninstall the classic Teams client</a> for details.</p><p></p><p> </p><p>--Original message for reference--</p><p>Out of caution, we have paused automatic uninstallation of classic Microsoft Teams due to a rare issue impacting the Teams Meeting Add-in in Microsoft Outlook application. This message applies to Teams for Windows only. We will update this message when we are ready to resume the uninstallation.&nbsp;</p><p><b>How this will affect your organization</b>\n</p><ul><li>This pause will only impact customers who have not already uninstalled classic Teams.\n</li><li>This issue could result in the Microsoft Teams Meeting Add-in in Outlook disappearing from the Outlook application for Windows or could cause failure when users try to schedule or join Teams meetings.\n</li></ul><p></p><p><b>What you need to do to prepare</b>\n</p><p>If your users are experiencing this issue, a temporary workaround is to use the Microsoft Teams Calendar to schedule or join meetings. To repair users who continue to experience the Teams Meeting Add-in issues in Outlook, please refer to <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/meetings/teams-meeting-add-in-missing\" target=\"_blank\">Teams meeting add-in missing from Outlook and new Teams - Microsoft Teams | Microsoft Learn</a>\n</p><p>Can I uninstall classic Teams manually?\n</p><ul><li>Customers who experience this issue after the automatic uninstallation of classic Teams or after they manually uninstall classic Teams can review the troubleshooting steps in <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/meetings/teams-meeting-add-in-missing\" target=\"_blank\">Teams meeting add-in missing from Outlook and new Teams - Microsoft Teams | Microsoft Learn</a>\n</li><li>Additional details can be found in the <i>What happens if we can’t update users to new Teams</i> section of <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability#what-happens-if-we-cant-update-users-to-new-teams\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">End of availability for classic Teams client</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Automatic uninstallation of classic Microsoft Teams for Windows will resume on October 21, 2024, affecting non-VDI and certain VDI environments. No action is required from users; this is for information only. For manual uninstallation, refer to the provided link. Non-persistent VDI environments are not affected."
    }
  ],
  "EndDateTime": "2024-12-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC806095",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-14T22:22:31.307Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-27T23:53:39Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Classic Microsoft Teams: Uninstallation resuming for Windows only",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
