{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Viva Pulse is adding 4 new templates and 53 questions to the existing content library to provide survey authors with a wider selection of People Science backed questions to leverage with their teams.&nbsp;</p><p><b>When this will happen:</b>&nbsp;</p><p>General Availability: We will begin rolling out late June 2024 updates and expect to complete by early July 2024.</p><p><b>How this will affect your organization:</b></p><p>Users in your tenant will have access to new questions and templates.&nbsp;</p><p>The following templates and questions will be added:</p><ul><li>Focus and Alignment: Check on your team’s current understanding of priorities and alignment.&nbsp;</li><li>Process Efficiency: Identify and address your team’s efficiency-related challenges.&nbsp;</li><li>Town Hall Meeting: Check on meeting effectiveness for Town Hall meetings.&nbsp;</li><li>Organization Progress Follow Up: Org leaders can check in on team progress roughly 3 weeks after Glint org-wide survey results are released.&nbsp; </li></ul><p><b>What you need to do to prepare:</b></p><p>Tenant admins can review the new templates and questions through the content admin management feature and modify or restrict access to the templates and questions as needed.&nbsp;</p><p>For more information, see&nbsp;<a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/manage-available-surveys-and-questions\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif;\">Content Admin Learn Doc.&nbsp;</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Viva Pulse is expanding its content library with 4 new templates and 53 questions, focusing on team priorities, efficiency, meeting effectiveness, and organizational progress. Rollout starts late June 2024, with completion by early July. Tenant admins should review and manage these additions as needed."
    }
  ],
  "EndDateTime": "2024-07-18T23:27:21Z",
  "HasAttachments": false,
  "Id": "MC803013",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-18T23:27:33.483Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-18T23:27:21Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: New questions and templates added to the existing content library",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
