{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, you will now see message result suggestions when formulating a query. You can also narrow down search results to \"messages\" to help you quickly find the Teams message content that is most relevant for you.&nbsp;<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398955\" target=\"_blank\">398955</a></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early July 2024 and expect to complete by mid-July 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Users can now easily search for Teams messages, as per their allowed admin policy.</p><p>New message search scope abilities and message suggestions are available during query formulation. Now, you can find message suggestions while typing your search term in the suggestions box or by selecting the message filter ability that is available. Message suggestions are from recent chats and contain details like sender name, profile pic, location of the message, title of the meeting or group chat, participants, date of message, and icons for any web links or file attachments to help evaluate and find the most relevant message.</p><p>If a relevant message is not in the suggestions, you have an option to click <i>See more message results</i>&nbsp;or press <i>Enter </i>in the message-filtered state to see all relevant message suggestions in the message domain of the Search Results page.&nbsp;</p><p>These suggestions are crafted to enable you to find messages easily in Teams while typing the query.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mDsb?ver=cd3c\" style=\"width: 450px;\"></p><p><br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mARV?ver=7d47\" style=\"width: 400px;\"></p><p><br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mARY?ver=e2b9\" style=\"width: 450px;\"><br></p><p>Use the below instructions to explore the new query suggestions feature:</p><ol><li>Click in the search box in Teams, and in the first row you'll find a filter to narrow down results for \"messages\" along with other domain scoping filters (e.g., Files, Group chat, Teams &amp; Channels). You can select the&nbsp;message scoping filter at any point of formulating the search query to narrow down results and see most recent message suggestions.&nbsp;</li><li>Continue to type in the search terms to find relevant message suggestions below top hits (if you haven't selected the message scoping filter) or below powerbar in the filtered message state.&nbsp;</li><li>If you don’t see any relevant results, click on <i>See more messages</i>&nbsp;in the un-scoped state, or <i>View all messages</i> at the bottom of the box or press <i>Enter</i>&nbsp;in the filtered message state<i>&nbsp;</i>to land in the message domain in the&nbsp;Search Results page to see all relevant message suggestions for the typed search term. </li></ol><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically and will available out of box (OOB). You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398955"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"398955\":[{\"RoadmapId\":398955,\"Platform\":\"Mac\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-07-26T05:35:36.6191596Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":398955,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-07-26T05:35:36.6191594Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":398955,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-07-26T05:35:36.6191599Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce message result suggestions during search queries, allowing users to easily find relevant messages. This feature is part of the Microsoft 365 Roadmap ID 398955 and will be rolled out in stages starting early July 2024. Users can narrow down search results to \"messages\" and see suggestions with details like sender name, profile picture, and message location. The rollout will be automatic and requires no action from users."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC805211",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-25T23:30:58.423Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-25T23:30:34Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Message result suggestions when typing to search",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
