{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce public preview of preapproval policies for resource-specific consent (RSC) permissions. Preapproval policies for RSC permissions (enabled by PowerShell cmdlets) give admins the ability to allow users to grant consent to data through RSC without having to allow all RSC enabled applications in their organization. This feature will allow admins to create policies to allow users to consent to RSC permissions on an app-by-app basis. \n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We began rolling out June 24, 2024, and expect to complete by late June 2024.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-September 2024 and expect to complete by late September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Apps that used RSC permissions required admins to enable organization-wide settings, allowing users to consent to all RSC-enabled apps.\n</p><p>After this rollout: Preapproval policies will give admins more granular control over which RSC-enabled apps are available to users and enables better management of app upgrades that require new permissions. \n</p><p>With preapproval policies, users can grant RSC permission to their resources on an app-by-app basis. This means admins can approve apps for a particular set of permissions while keeping RSC blocked for all other applications. Admins can enable multiple preapproval policies to create custom RSC consent abilities in their organization. Admins will also be able to set preapproval policies based on sensitivity labels for Teams, allowing apps to be installed in Teams with certain sensitivity labels but not others. \n</p><p>Preapproval policies are enabled by a set of PowerShell cmdlets for now. Admins who have never used PowerShell to manage Teams can <a href=\"https://learn.microsoft.com/powershell/microsoftgraph/get-started?view=graph-powershell-1.0\" target=\"_blank\">learn more about using PowerShell</a>&nbsp;and the <a href=\"https://learn.microsoft.com/microsoftteams/platform/graph-api/rsc/preapproval-instruction-docs\" target=\"_blank\">preapproval policy documentation</a>.\n</p><p>This new feature is accessible to all Teams admins with appropriate permissions.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins do not need to take action for this rollout. No existing settings will be changed or affected by this rollout. Admins who wish to utilize the new preapproval policies should refer to the <a href=\"https://learn.microsoft.com/microsoftteams/platform/graph-api/rsc/preapproval-instruction-docs\" target=\"_blank\">preapproval policy documentation</a>.\n</p><p>You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/en-us/powershell/microsoftgraph/get-started?view=graph-powershell-1.0\" target=\"_blank\">Get started with the Microsoft Graph PowerShell SDK | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/platform/graph-api/rsc/resource-specific-consent\" target=\"_blank\">Resource-specific Consent for Apps - Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/platform/graph-api/rsc/grant-resource-specific-consent\" target=\"_blank\">Grant RSC permissions to an app - Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/platform/graph-api/rsc/preapproval-instruction-docs\" target=\"_blank\">Preapproval of RSC permissions - Teams | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams introduces a public preview of preapproval policies for RSC permissions, enabling admins to control user consent for RSC on an app-by-app basis. Rollout begins June 24, 2024, for Targeted Release and mid-September 2024 for General Availability. Admins can learn to manage these policies via PowerShell cmdlets. No action is required for the rollout."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC805712",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-26T23:08:11.88Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-26T23:07:58Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New preapproval policies for RSC permissions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
