{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 19, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft SharePoint: The ability for multiple authors to edit the same Page at the same time, without having to take turns. Authors can see real-time changes made by others as they happen in Pages, sections and web parts.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=124853\" target=\"_blank\">124853</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late June 2024 and expect to complete by late July 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early August 2024 and expect to complete by late March 2025 (previously late November).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Only one author can edit a Page at the same time. While an author is editing a Page, no other user can edit until the author publishes or saves the draft.\n</p><p><i>After this rollout</i>\n</p><p>Authors will be able to edit a Page or News post at the same time as others are editing. In this example, three authors are editing simultaneously, and each author can see the presence of other authors (top right corner of page) and the web parts each author is editing (top right corner of each web part).\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1msJN?ver=eaaf\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><i>Coauthoring details</i></p>\n<ul><li>Coauthoring will roll out to all new and existing Pages and News posts, so the feature will be available to all users at the same time. \n</li><li>After an author starts editing a page, they can see if other authors are also editing with the page presence in the command bar. \n</li><li>Multiple authors can simultaneously edit the same page and section, but coauthors cannot edit the same web part at the same time. \n</li><li>Changes made by authors are saved automatically every few seconds. If authors want to exit edit mode, they can select <i>Save and close</i>. \n</li><li>If an author attempts to publish or post a page while others are actively editing, the author will see a warning message that others are editing. If desired, the author can proceed with publishing and posting. The same behavior applies for scheduling and submitting for approvals. \n</li><li>To undo changes, authors can continue to use <i>Undo</i> as they do today to undo the most recent changes by the current author in the current browser session. To undo more changes or changes made by other users, authors can restore a prior version from <i>Version History</i> (under <i>Page details</i>).\n<ul><li>The command for <i>Save as draft</i> has been removed as it is no longer needed to check in the draft for another user to edit. \n</li></ul></li></ul><p>This feature is on by default and accessible to all SharePoint authors.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your SharePoint authors about this change and update any relevant documentation as appropriate.&lt;\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "124853"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint is introducing coauthoring for Pages and News, allowing multiple authors to edit simultaneously with real-time changes. Targeted Release begins late June 2024, with General Availability starting early August 2024. The feature will be on by default with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC803012",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-20T22:25:07.657Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-18T23:26:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: Collaborate on SharePoint Pages and News with coauthoring",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
