{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview eDiscovery support for search and legal holds of Microsoft Planner data will soon be generally available. This feature will enable admins to conduct a content search for eDiscovery and legal hold of Planner tasks in Purview. The Planner content available for eDiscovery includes tasks shared with groups as well as the comments and attachments associated with those tasks.\n</p><p>Please note this capability will only be available in tenants created before October 2022. Tenants created after this date will receive this feature in the future.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=399550\" target=\"_blank\">399550</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early July 2024 and expect to complete by mid-July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: eDiscovery content search and legal hold was not available for Planner data.\n</p><p>After the rollout: Admins will be able to access support for search and legal holds of Microsoft Planner data in the <a href=\"https://compliance.microsoft.com/\" target=\"_blank\">Purview compliance portal</a>.\n</p><p>Planner data review set:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mVL5?ver=aeab\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This feature is on by default and accessible to all Purview admins with appropriate permissions.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation as appropriate.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/office365/planner/planner-in-purview\" target=\"_blank\">Microsoft Planner support in Microsoft Purview - Microsoft Planner | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "399550"
    },
    {
      "Name": "Summary",
      "Value": "eDiscovery support for Microsoft Planner, including search and legal holds, will be generally available in early July 2024. This feature allows admins to search and hold Planner tasks, comments, and attachments in Purview, but only for tenants created before October 2022. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC808830",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-05T19:42:33.513Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-05T19:42:20Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Planner: eDiscovery support for Microsoft Planner",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
