{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 4, 2024: We recently discovered a significant issue that has resulted in the temporary disabling of this feature until it is resolved. We apologize for any inconvenience this may cause.</p><p>\n</p><p>There is a new experience for selecting which users should have which permissions when a sensitivity label configured for user-defined permissions is applied to a file in Microsoft 365 apps or when a user applies protection using standalone Information Rights Management.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=189826\" target=\"_blank\">189826</a><br></p><p>\n</p><p><b>When this will happen:</b><br></p><p>Preview (Worldwide, GCC): We will begin rolling out mid-July 2024 and expect to complete by late July 2024.</p><p>General Availability (Worldwide, GCC): We will begin rolling out early September 2024 and expect to complete by late December 2024 (previously late November).&nbsp;&nbsp;</p><p><b>How this will affect your organization:</b><br></p><p>Users will see a modernized dialog when configuring user-defined permissions, whether these are applied using a sensitivity label configured for user-defined permissions or with standalone Information Rights Management. There are new names for some usage rights groupings for pre-set permissions levels compared to those in Microsoft Azure Information Protection (AIP): </p><ul><li><i>Reviewer </i>is now called <i>Restricted Editor</i>.</li><li><i>Co-Author</i> is now called <i>Editor</i>.</li><li><i>Co-Owner</i> is now called <i>Owner</i>.</li></ul><p>The rights contained in each grouping are unchanged. </p><p>See <a href=\"https://learn.microsoft.com/azure/information-protection/configure-usage-rights\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Configure usage rights for Azure Information Protection</a> for further information on usage rights.</p><p>This new feature is available by default.</p><p><b>What you need to do to prepare:</b><br></p><p>If your organization has training materials or internal documentation regarding the use of pre-set permissions levels, you may need to make updates based on the new names for these permissions levels.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f929e939-ab56-47a4-8cbf-d48b2350dc4e\" style=\"width: 400px;\"><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "189826"
    },
    {
      "Name": "Summary",
      "Value": "The modernized permissions experience for Microsoft 365 apps has been temporarily disabled due to a significant issue. A new user permissions selection experience is introduced with updated names for usage rights groupings, and organizations may need to update internal documentation accordingly. Preview begins mid-July 2024, with general availability expected by late December 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-02-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC803292",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-05T01:12:20.147Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-19T21:58:50Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Modernized user-defined permissions experience for Word, Excel, and PowerPoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
