{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 6, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In Microsoft Teams, a new feature enhances the meeting view that is shown to attendees while the main meeting window is minimized.<br></p><p>When participants in a meeting minimize the main meeting window, they can multitask without losing sight of the meeting or missing important information by monitoring activity in a smaller meeting view window. </p><p>This view switcher feature update allows users to expand the default active speaker view of the meeting to an extended large gallery view. This view allows users to see up to 4 meeting participants, including reactions, raised hands, and a Me Video tile.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7c3ddd89-5fc8-4b66-a5d5-b05f1b1a9410\" style=\"width: 250px;\"><br></p><p>This expanded view can be toggled via a new UI control.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398449\" target=\"_blank\">398449</a></p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early August 2024 (previously early July) and expect to complete by mid-August 2024 (previously mid-July).<br></p><p>General Availability (Worldwide, GCC, GCC High, and DoD): We will begin rolling out mid-August 2024 (previously mid-July) and expect to complete by late December (previously late November).&nbsp;</p><p><b>How this will affect your organization:</b><br></p><p>When multitasking with the main meeting window minimized, meeting participants will now be able to better keep track of the meeting activity by using an extended meeting view window.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>This feature is available by default. No action is needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398449"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"398449\":[{\"RoadmapId\":398449,\"Platform\":\"Mac\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-06-11T05:34:28.7605664Z\",\"LatestRing\":null},{\"RoadmapId\":398449,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-06-11T05:34:28.7605665Z\",\"LatestRing\":null},{\"RoadmapId\":398449,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-06-11T05:34:28.7605665Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams introduces an expanded gallery view for minimized meeting windows, allowing users to see up to 4 participants. The rollout begins in August 2024, with general availability by December 2024. This feature is enabled by default and requires no preparation. Roadmap ID: 398449."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-02-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC800496",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-07T00:05:24.203Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-10T23:46:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: New expanded gallery view option for minimized meeting window",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
