{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, town hall and webinar currently support the ability for an external user outside the organization to present in an event. External presenters can be guests who are federated, unfederated, or anonymous to the organization. </p><p>With this update, if a federated or unfederated guest has not been successfully authenticated, the guest will be brought into the lobby rather than being restricted access when joining the event. Once in the lobby, an internal organizer or presenter has the option to approve or deny the guest's request to join the event.<br></p>Additional notes:<ul><li>It is recommended to keep the lobby enabled for your event if you intend to invite external presenters.</li><li>An external presenter that is successfully authenticated will be brought into the event automatically without waiting in the lobby.<br></li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out in early July 2024 and expect to complete by mid-July 2024.</p><p><b>How this will affect your organization:</b><br></p><p>Any events that are created or updated after the rollout of this improvement will receive the new lobby experience for external presenters. <br></p><p>For more information, see <a href=\"https://support.microsoft.com/office/schedule-a-town-hall-in-microsoft-teams-d493b5cc-9f61-4dac-8027-d837dafb7a4c\" target=\"_blank\">Schedule a town hall in Microsoft Teams</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>The improvement will be rolled out to organizations automatically with no admin action required. It is recommended that you notify your event organizers about this change and update any documentation as appropriate.<br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating the lobby experience for external presenters in town halls and webinars. Unauthenticated external guests will now wait in the lobby where organizers can approve or deny access. This rollout begins early July 2024 and requires no admin action but recommends informing event organizers."
    }
  ],
  "EndDateTime": "2024-08-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC807463",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-01T23:20:47.597Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-01T23:20:24Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Lobby experience for external presenters in town hall and webinar",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
