{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are excited to announce that we are getting ready to get Microsoft Graph PowerShell and Microsoft Graph CLI Entra app ('Microsoft Graph Command Line Tools') verified. \n</p><p><b>When this will happen:</b>\n</p><p>Starting June 24th, 2024, we will be migrating the Microsoft Graph Command Line Tools Entra app to new infrastructure. \n</p><p><b>How this will affect your organization:</b>\n</p><p>For most users, the transition will be seamless. However, there may be a few cases where reconsent will be required. \n</p><ol><li>No Impact for users who have their <a href=\"https://learn.microsoft.com/graph/tutorials/powershell?tabs=aad&amp;tutorial-step=1\" target=\"_blank\">own registered Entra (former Azure AD) app</a>  \n<ul><li>If you're using your own registered Entra (former Azure AD) app, your experience will remain unaffected by this migration. Therefore, no action is required on your part. \n</li></ul></li><li>Potential impact for some scenarios for users with dependency on the \"Microsoft Graph Command Line Tools\" App: \n<ul><li>If use Microsoft Graph PowerShell and CLI with the \"Microsoft Graph Command Line Tools\" app (i.e. without registering your own Entra app), you could potentially need to reauthenticate.\n</li></ul></li></ol><p><b>What you need to do to prepare:</b>\n</p><p>To help with the transition, please be aware of any interruptions beginning on June 24th. We appreciate your understanding and cooperation in improving the security and reliability of our tools. If you have any questions or need further assistance, please reach out on our GitHub repositories <a href=\"https://aka.ms/graph-ps-issues\" target=\"_blank\">https://aka.ms/graph-ps-issues</a> or <a href=\"https://aka.ms/graph-cli-issues\" target=\"_blank\">https://aka.ms/graph-cli-issues</a> or contact Support:&nbsp;<a href=\"https://developer.microsoft.com/en-us/graph/support\" target=\"_blank\">Microsoft Graph | Support</a>\n</p>",
    "ContentType": "html"
  },
  "Category": "preventOrFixIssue",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Graph PowerShell and CLI are migrating to new infrastructure on June 24th, 2024, which may require reconsent for some users. Users with their own registered Entra app will not be affected. Preparation and awareness of potential interruptions are advised."
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC804763",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-24T22:49:21.82Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-24T22:48:52Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Improved security for Microsoft Graph PowerShell and Microsoft Graph CLI",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
