{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 28, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Note: If you are not using frontline worker functionality, you can ignore this message.</p><p>Coming soon to Microsoft Teams: Cross-location Shifts is a new feature in the Microsoft Shifts app for Teams that enables frontline managers to offer open shifts across multiple locations in a region so managers can share the labor pool and workers can select available shifts across different locations. This message applies to Microsoft Teams for Desktop, web, Mac and Mobile.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=394351\" target=\"_blank\">394351</a>.\n</p><p><b>When this will happen:</b> \n</p><p>Targeted Release: We will begin rolling out late October 2024 (previously mid-October) and expect to complete by early November 2024 (previously late October).\n</p><p>General Availability (Worldwide): We will begin rolling out early November 2024 (previously late October) and expect to complete by mid-April 2025 (previously mid-March).</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout, frontline managers are not able to not able to offer open shifts across multiple locations in a region.\n</p><p><i>After the rollout</i>\n</p><p>Benefits of cross-location shifts:\n</p><ul><li>Optimize the manager’s workforce by balancing the supply and demand of labor across locations in a region. \n</li><li>Empower your frontline workers by giving them the flexibility to select open shifts at a location that is convenient for them.  \n</li><li>Improve customer satisfaction by ensuring that you have enough staff to serve them. \n</li></ul><p>The cross-location shifts feature requires the following conditions:\n</p><ul><li>An operational hierarchy must be established for the organization. \n</li><li>The team should have sister locations. \n</li><li>Team should have at least one matching schedule group code with other teams \n</li></ul><p>Admins or frontline managers can enable these prerequisites through: \n</p><ul><li>Defining the operational hierarchy in the Teams admin center, as described in <a href=\"https://learn.microsoft.com/microsoft-365/frontline/deploy-frontline-operational-hierarchy?view=o365-worldwide\" target=\"_blank\">Deploy your frontline operational hierarchy - Microsoft 365 for frontline workers | Microsoft Learn</a> \n</li><li>Creating schedule group codes via the Graph API, detailed in <a href=\"https://learn.microsoft.com/graph/api/schedule-post-schedulinggroups?view=graph-rest-beta&amp;tabs=http\" target=\"_blank\">Create scheduling Group - Microsoft Graph beta | Microsoft Learn</a> \n</li></ul><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/78f77019-185c-4619-9650-411d417dd076\" style=\"width: 400px;\" alt=\"admin or manager controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>Before rollout, we will update this post with revised documentation.\n</p><p>For reference: <a href=\"https://learn.microsoft.com/microsoftteams/expand-teams-across-your-org/shifts/manage-the-shifts-app-for-your-organization-in-teams\" target=\"_blank\" style=\"\">Manage the Shifts app for your organization - Microsoft Teams | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394351"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing Cross-location Shifts in the Shifts app, allowing frontline managers to offer open shifts across multiple locations. The rollout starts late October 2024 and completes by mid-April 2025. This feature optimizes workforce management and requires an operational hierarchy, sister locations, and matching schedule group codes. No admin action is needed before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-06-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC800503",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-28T19:14:47.907Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-10T23:54:15Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: New Cross-location shifts in the Shifts app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
