{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Adaptive Protection integrated with Microsoft Entra ID Conditional Access will soon be generally available in Microsoft Purview | Insider Risk Management. The integration will allow organizations to set up policies to enforce Conditional Access actions (such as blocks) on users with insider risk levels in Adaptive Protection. For example, a Conditional Access policy with an Insider Risk Condition can block elevated risk users from all Microsoft 365 applications while allowing minor risk users to continue to access company resources. With this rollout, we will also change the default Insider Risk Conditional Access policy to block elevated risk users from all Microsoft 365 applications instead of all applications.\n</p><p>Organizations will need an Entra ID P2 license to use Adaptive Protection integrated with Conditional Access policies.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=388737\" target=\"_blank\">388737</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We began rolling out in March 2024 and completed by early June 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early July 2024 and expect to complete by early August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Adaptive Protection integrated with Purview DLP was not generally available.\n</p><p>After this rollout, you will be able to set up or view Conditional Access policies with the Insider Risk Condition in Purview &gt; <i>Insider risk management &gt; Adaptive Protection:</i>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1msJG?ver=17a1\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>If you configured the default Insider Risk Conditional Access policy during the <a href=\"http://aka.ms/adaptiveprotection/blog\" target=\"_blank\">Public Preview</a>, your policy will remain unchanged.\n</p><p>The default state of this feature is off.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Your organization will need to <a href=\"https://learn.microsoft.com/purview/insider-risk-management-adaptive-protection?tabs=purview-portal\" target=\"_blank\">enable Adaptive Protection in Insider Risk Management and follow the setup instructions</a>. If you do not already have an Entra ID P2 license, your organization will need to obtain one.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://www.microsoft.com/security/business/microsoft-entra-pricing\" target=\"_blank\">Microsoft Entra Plans and Pricing | Microsoft Security</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-adaptive-protection?tabs=purview-portal\" target=\"_blank\">Help dynamically mitigate risks with adaptive protection (preview) | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388737"
    },
    {
      "Name": "Summary",
      "Value": "Adaptive Protection integrated with Microsoft Entra ID Conditional Access will be generally available in Microsoft Purview | Insider Risk Management. This integration allows setting policies to enforce Conditional Access based on insider risk levels. Organizations need an Entra ID P2 license to use it. Rollout begins in July 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC802699",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-06-17T23:21:08.187Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-17T23:20:08Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Adaptive Protection + Conditional Access will be GA",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
