{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 23, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Purview is enhancing the Audit custom retention policy experience to make it easier for customers to change the default retention policy across all their Audit logs. With this change, customers can now create blanket custom retention policies that apply to all Audit recordTypes. This capability will become available in addition to the existing support of manually selecting specific recordTypes in a custom policy.<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=395215\" target=\"_blank\">395215</a></p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late August 2024 (previously mid-July) and expect to complete by mid-September 2024 (previously late July).\n</p><p>General Availability: We will begin rolling out late September2024 (previously mid-August) and expect to complete by late October 2024 (previously late August).</p><p><b>How this will affect your organization:</b>\n</p><p>This change now allows security admins in your organization to apply a default retention policy to all of the Audit recordTypes. Previously, an admin had to manually select every single recordType in the dropdown menu of a custom retention policy. Moreover, it did not automatically include any new recordTypes added to the Audit log at a future time. \n</p><p>With this change, an admin can simply select <i>All</i>&nbsp;under the recordTypes field to apply the custom retention policy to all existing and future recordTypes.</p><p><b>What you need to do to prepare:</b>\n</p><p>To apply a custom retention policy to all recordType logs, an admin can simply select <i>All</i>&nbsp;under the recordTypes field to apply the custom retention policy to all existing and future recordTypes.</p><p>More information is available here:&nbsp;<a href=\"https://learn.microsoft.com/purview/audit-log-retention-policies?tabs=microsoft-purview-portal\" target=\"_blank\">Manage audit log retention policies | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395215"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview compliance portal is updating custom retention policies for all Audit recordTypes. The rollout includes enhancements to the Share-in-Meeting control, allowing users to share content to future Teams meetings and combining it with the Share to Teams dialog. Developers can opt into these features, which will be available on Teams for Windows, the web, and Mac. Rollout timelines have been updated, with Public Developer Preview in early June, Targeted Release in late August, and General Availability in late September 2024. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC800837",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-23T20:54:28.73Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-06-11T23:15:31Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Blanket custom retention policies which apply to all Audit recordTypes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
