{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, compliance admins can place Microsoft Purview eDiscovery legal holds on Microsoft Teams webinar and town hall data using Team's ability to target SharePoint locations where Teams content is housed. Due to heightened security requirements and the need for specialized compliance support, we are moving legal holds in Teams from the SharePoint integration to a more direct integration with Purview.\n</p><p><b>When this will happen:</b>\n</p><p>The more direct integration of Teams legal holds with Purview will begin July 31, 2024. Legal holds through SharePoint will not apply to any new Teams webinars or town hall meetings created after July 31, 2024, because newly created Teams town hall and webinar data will not reside in SharePoint. Legal holds on events created before July 31, 2024 will continue to work through SharePoint. Full support for Purview eDiscovery legal holds is anticipated by early 2025. Purview eDiscovery will continue to work for all events, even after July 31, 2025. Only eDiscovery legal hold will be affected by this integration.\n</p><p><b>How this will affect your organization:</b>\n</p><p>after this rollout, legal hold through Microsoft Purview will be on by default and accessible to all admins with appropriate permissions.\n</p><p><b>What you need to do to prepare:</b>\n</p><p><i>Learn more</i>\n</p><p>Articles will be updated when legal hold and eDiscovery are available through Purview in early 2025:\n</p><ul><li><a href=\"https://learn.microsoft.com/purview/purview\" target=\"_blank\">Learn about Microsoft Purview | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/ediscovery\" target=\"_blank\">Microsoft Purview eDiscovery solutions | Microsoft Learn</a>\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will integrate legal holds with Microsoft Purview directly, starting July 31, 2024, moving away from SharePoint integration. Legal holds on events before this date will continue through SharePoint, with full Purview eDiscovery support expected by early 2025. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-09-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC814576",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-16T04:54:00.103Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-16T04:52:55Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Legal hold and eDiscovery support for webinars and town halls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
