{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 15, 2024: We have updated the content below to show as intended. Thank you for your patience.</p><p>On August 1, 2024, the new Microsoft Outlook for Windows will transition from the Preview phase to General Availability for commercial accounts. This milestone will not affect existing users who continue to use classic Outlook for Windows; however, GA status helps organizations move forward with their migration plans. A future announcement will cover General Availability for US Government clouds (GCC, GCC High, and DoD) and availability in other sovereign clouds.<br></p><p>The new Outlook continues to be an opt-in experience. Please note that this update does not change any settings for your organization, will not automatically switch users from the classic version of Outlook for Windows, and will not introduce any disruptive changes. We will provide a 12-month notice prior to initiating any Microsoft-driven migration steps in managed environments. Learn more about how we are approaching our migration timeline: <a href=\"https://aka.ms/newOutlookTimeline\" target=\"_blank\">New Outlook for Windows: A Guide to Product Availability</a> \n</p><p><b>Key Updates starting August 2024</b>\n</p><ul><li>The new Outlook for Windows will receive full support from Microsoft’s support channels, including Assisted Support.\n</li><li>The app name for the classic Outlook for Windows will include “(classic)” starting from version 2407.\n</li></ul><p>We understand some organizations may have specific requirements that prevent them from transitioning from the classic Outlook app at this time. The new Outlook team is eager to gather your feedback and to understand your requirements. You and your users can submit feedback through:\n</p><ul><li>The Help tab in the new Outlook for Windows app\n</li><li>The dialog boxes that display when a user reverts to classic Outlook\n</li><li>Your account team (for larger organizations)\n</li></ul><p>Learn more about the future features of Outlook on the Microsoft 365 Roadmap: <a href=\"https://aka.ms/newOutlookforWindows\" target=\"_blank\">Microsoft 365 roadmap</a>\n</p><p>Side-by-side feature comparison of the classic and new Outlook: <a href=\"https://aka.ms/newOutlookFeatureComparison\" target=\"_blank\">New and classic Outlook for Windows feature comparison</a>\n</p><p>Resources to help with change management and enterprise adoption: <a href=\"https://aka.ms/newOutlookAdoption\" target=\"_blank\">New Microsoft Outlook for Windows</a>\n</p><p><b>Recommended actions</b>\n</p><ul><li><b>Control availability:</b> Organizations retain control over the new Outlook’s availability. Policies can be set to hide the toggle in classic Outlook for Windows, block new mailboxes from being added, or remove new Outlook from certain Windows builds. For detailed instructions, refer to <a href=\"https://aka.ms/newOutlookControlRelease\" target=\"_blank\">Control the installation and use of new Outlook</a>\n</li><li><b>Learn about policy management: </b>The new Outlook’s policies are managed through mailbox policies on the primary account, as they are for Outlook on the web. IT admins may choose to preconfigure an organization account as the primary account. Learn more: <a href=\"https://learn.microsoft.com/deployoffice/outlook/manage/policy-management\" target=\"_blank\">Policy Management - Deploy Office</a></li><li><b>Prepare to manage updates:</b> The new Outlook introduces features through service-based flighting, not through build updates. Features will be listed on the <a href=\"https://aka.ms/newOutlookforWindows\" target=\"_blank\">Microsoft 365 Roadmap</a>, and then released into the Targeted Release ring for 30 days before beginning generally available in Standard release. Learn how to <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/release-options-in-office-365?view=o365-worldwide\" target=\"_blank\">set up release options</a>.</li><li><b>Transition from COM to web add-ins:</b> <a href=\"https://learn.microsoft.com/office/dev/add-ins/overview/office-add-ins#how-are-office-add-ins-different-from-com-and-vsto-add-ins\" target=\"_blank\">COM add-ins</a> will not be supported in the new Outlook, and organizations need to transition to web add-ins instead. A variety of equivalent web add-ins are already available, and we offer assistance for organizations who rely on COM-only add-ins. Learn more about how to <a href=\"https://learn.microsoft.com/deployoffice/outlook/get-started/migrate-com-to-web-addins\" target=\"_blank\">Migrate from COM to web add-ins</a> and review a <a href=\"https://learn.microsoft.com/deployoffice/outlook/get-started/migrate-com-to-web-addins#transitioning-add-ins-from-classic-outlook-to-the-new-outlook-for-windows\" target=\"_blank\">list of available web add-ins</a>.\n</li><li><b>Plan for user migration:</b> Microsoft will provide a 12-month advance notice before initiating Microsoft-driven migrations to the new experience in managed environments. We know organizations prefer to time and drive their own upgrades. Organizations are encouraged to review these resources to help get started. IT administrators can now review and share within their organizations:\n<ul><li>Adoption and migration resources: <a href=\"https://aka.ms/newOutlookAdoption\" target=\"_blank\">New Microsoft Outlook for Windows</a>\n</li><li>Support content and user training for the new Outlook: <a href=\"https://aka.ms/newOutlookSupportDocs\" target=\"_blank\">Getting started with the new Outlook for Windows</a> \n</li><li>Admin documentation: <a href=\"https://aka.ms/newOutlookAdminDocs\" target=\"_blank\">Overview of the new Outlook for Windows</a> \n</li></ul></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Microsoft Outlook for Windows will be generally available on August 1, 2024, for commercial accounts, with no automatic changes for current users. Organizations can control its availability and are encouraged to plan for migration. Support and resources are provided for the transition from classic to the new Outlook."
    }
  ],
  "EndDateTime": "2024-10-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC810420",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-07-15T18:41:16.857Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-11T01:40:34Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook for Windows is GA on August 1, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
