{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As mentioned in MC715413, in October 2024 Intune will be moving to support Android 10 and later for user-based management methods which includes:</p><ul><li>Android Enterprise personally-owned work profile</li><li>Android Enterprise corporate owned work profile</li><li>Android Enterprise fully managed</li><li>Android Open Source Project (AOSP) user-based</li><li>Android device administrator</li><li>App protection policies (APP)</li><li>App configuration policies (ACP) for managed apps</li></ul><p>Moving forward, we will end support for one or two versions annually in October until we only support the latest four major versions of Android. You can learn more about this change by reading the blog: <a href=\"https://aka.ms/Intune/Android-10-support\" target=\"_blank\">Intune moving to support Android 10 and later for user-based management methods in October 2024</a></p><p><b>Important:</b> Userless methods of Android device management (Dedicated and AOSP userless) and Microsoft Teams certified Android devices will not be impacted by this change.</p><p><b>How this will affect your organization:</b></p><p>For user-based management methods (as listed above), Android devices running Android 9 or earlier will no longer be supported. For devices on unsupported Android OS versions:</p><ul><li>Intune technical support will no longer be provided.</li><li>Intune will no longer make changes to address bugs or issues. </li><li>New and existing features are not guaranteed to work.&nbsp;</li></ul><p>While Intune will not prevent enrollment or management of devices on unsupported Android OS versions, functionality is not guaranteed, and use is not recommended.</p><p><b>What you need to do to prepare:</b></p><p>Notify your helpdesk, if applicable, about this updated support statement. The following admin options are available to help warn or block users: \n</p><ul><li>Configure a <a href=\"https://learn.microsoft.com/mem/intune/apps/app-protection-policy-settings-android#conditional-launch\" target=\"_blank\">conditional launch</a> setting for APP with a minimum OS version requirement to warn and/or block users.</li><li>Use a <a href=\"https://learn.microsoft.com/mem/intune/protect/device-compliance-get-started\" target=\"_blank\">device compliance policy</a> and set the action for noncompliance to send a message to users before marking them as noncompliant.</li><li>Set <a href=\"https://learn.microsoft.com/mem/intune/fundamentals/manage-os-versions\" target=\"_blank\">enrollment restrictions</a> to prevent enrollment on devices running older versions.</li></ul><p>For more details, read the blog: <a href=\"https://aka.ms/Intune/Android-10-support\" target=\"_blank\">Intune moving to support Android 10 and later for user-based management methods in October 2024</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In October 2024, Intune will only support Android 10 and later for user-based management methods. Devices on Android 9 or earlier will not receive technical support, bug fixes, or guaranteed feature functionality. Admins should prepare by updating support statements and configuring relevant policies."
    },
    {
      "Name": "BlogLink",
      "Value": "https://aka.ms/Intune/Android-10-support"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/mem/intune/fundamentals/manage-os-versions"
    }
  ],
  "EndDateTime": "2024-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC814570",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-16T04:47:34.347Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-16T04:47:02Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Intune moving to support Android 10 and later for user-based management methods in October 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
