{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Forms offers surveys and quizzes to collect information from your audience. We have added a new feature that lets you quickly and easily sync the responses to a Microsoft Excel file so you will always have the latest responses, updated automatically. This message applies to Excel for the web. Learn more: <a href=\"https://techcommunity.microsoft.com/t5/microsoft-forms-blog/forms-data-sync-to-excel-is-now-fully-available-with-more/ba-p/4177152\" target=\"_blank\" style=\"\">Forms data sync to Excel is now fully available with more functionality - Microsoft Community Hub</a>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=374909\" target=\"_blank\">374909</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out in late June 2024 and expect to complete by late July 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p><i>New features for this rollout</i>\n</p><ul><li>Create an Excel workbook in your Microsoft OneDrive on the form/quiz responses page.\n</li><li>Form responses will automatically sync to a table in the Excel workbook where you can start manipulating the data.\n</li><li>New responses will automatically sync while the workbook is open in Excel for the web.\n</li><li>Excel coauthors will also get automatically synced responses in Excel for the web.\n</li></ul><p>This feature was released with the Preview label in March 2024. We are removing the preview label in July 2024.&nbsp;\n</p><p>After we remove preview label, the new data sync solution will also support two types of forms:\n</p><ul><li>Group forms created in your Microsoft 365 group. Learn more: <a href=\"https://support.microsoft.com/office/create-a-group-form-or-quiz-7228eebb-a6ab-45ec-8123-52026a2f52ff\" target=\"_blank\">Create a group form or quiz - Microsoft Support</a>\n</li><li>Forms created in workbooks in Excel for the web\n</li></ul><p>Note: The data sync will be triggered while the workbook is open in Excel for the web. Over time, we will gradually enable data sync for Excel for Desktop.\n</p><p>This feature will be automatically enabled for all users who are able to use Microsoft Forms and Microsoft Excel in your organization. They can find the entry point for this feature from the Forms website and Excel for the web.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "374909"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Forms now offers a live data sync feature to Excel, with automatic updates and coauthor support. This applies to Excel for the web and will be fully available by late July 2024, supporting both group forms and individual forms created in Excel for the web. No admin action is required for rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-09-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC816207",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-17T04:03:51.823Z",
  "Services": [
    "Microsoft Forms"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-17T04:03:19Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Forms now supports live data sync to Microsoft Excel with more functionality",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
