{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 25, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>When joining a meeting in Teams Room on Windows with a companion device (laptop or mobile), in-room participants will be grouped under the room node. Participants must join through Proximity Join. This update includes additional UI elements to create visual clarity of the in-room participants who are together.<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=400702\" target=\"_blank\">400702</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late September 2024 (previously mid-September) and expect to complete by mid-November 2024 (previously late September).</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out mid-November 2024 and expect to complete rollout by late November 2024 (previously late October).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>This update is available by default if the companion device has enabled the Bluetooth setting and the Teams Room device has any one of the following XML &lt;SkypeSettings&gt; configuration settings enabled:</p><ul><li>&lt;BluetoothAdvertisementEnabled&gt;true&lt;/BluetoothAdvertisementEnabled&gt;</li><li>&lt;UltrasoundAdvertisementEnabled&gt;true&lt;/UltrasoundAdvertisementEnabled&gt;</li><li>&lt;RoomQRcodeEnabled&gt;true&lt;/RoomQRcodeEnabled&gt;</li></ul><p>\nOn the roster, in-room participants will automatically be grouped under the room node. The two scenarios in which in-room participants can be ungrouped from the room node are:</p><ul><li>Raised hand: For raised hand, we continue to follow the sequential order of raised hands. Therefore, in-room participants who use their companion device to raise their hand will be broken up and ordered accordingly. </li><li>Role assignment: For changes in roles (Presenters/Attendees), in-room participants can be broken up and placed in the appropriate category on the roster.</li></ul><p>In both scenarios, the room information will be listed below the participant's name.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mTXj?ver=93db\" style=\"width: 295px;\"><br></p><p>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "400702"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"400702\":[{\"RoadmapId\":400702,\"Platform\":\"Desktop\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2024-09-30T01:08:31.3832009Z\",\"LatestRing\":\"TargetedRelease\"},{\"RoadmapId\":400702,\"Platform\":\"All\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2024-09-30T01:08:31.3832014Z\",\"LatestRing\":\"TargetedRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will group in-room participants under the room node when joining via Proximity Join on Teams Rooms on Windows. The rollout starts late September 2024 and ends mid-November 2024. This feature requires specific Bluetooth or XML settings enabled and will include new UI elements."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-12-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC814577",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-26T00:10:46.323Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-16T04:54:15Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Roster grouping for in-room participants through Proximity Join for Teams Rooms on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
