{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 23, 2024: We have updated the content below for clarity. Thank you for your patience.</p><p>Coming soon for Microsoft Defender XDR | Microsoft Defender for Identity: We’re adding to Microsoft Secure Score improvement actions to ensure a more accurate representation of security posture. We will update your score automatically.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-August 2024 and expected to complete by mid-September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Defender XDR portal: we will add these new Microsoft Defender for Identity recommendations as Microsoft Secure Score improvement actions:\n</p><ul><li>Azure SSO account configuration: Password last set more than 90 days ago\n</li><li>Azure SSO account configuration: Resource Based Constrained Delegation configured\n</li><li>Remove unnecessary replication permissions for Microsoft Entra Connect accounts\n</li><li>Rotate password for Entra Connect connector users</li></ul><p>These new identity recommendations are new security posture reports related to hybrid identities and will be available by default only to customers who have installed an MDI sensor on Entra Connect server.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend reviewing the improvement actions listed in Microsoft Secure Score. We will continue to add suggested security improvement actions on an ongoing basis.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity will introduce new recommendations to Microsoft Secure Score, enhancing security posture accuracy. These recommendations include Azure SSO account configurations and actions for Microsoft Entra Connect accounts. Rollout starts mid-August 2024, completing by mid-September 2024, with no admin action required before the rollout."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC816173",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-23T20:50:34.27Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-17T03:58:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity: New recommendations for Microsoft Secure Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
