{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 30, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Based on customer feedback, we are introducing the ability to provide a meaningful name to the General channel in a new or existing team. The General channel can be renamed by the team owners to show up in the teams' and channels' list of all members in alphabetical order.&nbsp;</p><p>In addition, Microsoft Teams users must also set a name for the first channel during team creation within the Microsoft Teams client. Instead of \"General\" as the default name, the first channel of a new team must be given another name, providing the flexibility to provide a specific and more meaningful channel name.</p><p>\"General\" cannot be used for the first channel name for new teams, and for an existing General channel that has been renamed, it cannot be changed back to the \"General\" name.</p><p>To create a new team from the Microsoft Teams client, navigate to the + button in the header and select New team from the context menu. Users can name the first-created channel in this team during this step (it will no longer be named General by default). This channel cannot be archived or deleted, and it will appear in alphabetical order with the other channels in that team.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=395931\" target=\"_blank\">395931</a></p><p>\n</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late August 2024 (previously early August) and expect to complete by early September 2024 (previously mid-August).\n</p><p>General Availability </p><ul><li>Worldwide: We will begin rolling out late August 2024 and expect to complete by early September 2024.&nbsp;</li><li>GCC: We will begin rolling out early September 2024 and expect to complete by mid-September 2024.\n</li><li>GCC High: We will begin rolling out mid-September 2024 and expect to complete by late September 2024.\n</li><li>DoD: We will begin rolling out mid-September 2024 and expect to complete by late September 2024.</li></ul><p><b>How this will affect your organization:</b> \n</p><p>You can encourage your users to provide a meaningful name to General channels in their teams.  \n</p><p><b>What you need to do to prepare:</b> \n</p><p>You may consider updating your internal documentation to inform your users that this feature is now available.&nbsp;</p><p>\n</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395931"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"395931\":[{\"RoadmapId\":395931,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-07-16T05:33:56.3582792Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":395931,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-07-16T05:33:56.3582794Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing the ability for team owners to rename the General channel based on feedback. This feature will be rolled out from early August to early September 2024, depending on the release schedule. Organizations are advised to update their documentation accordingly. The feature is associated with Microsoft 365 Roadmap ID 395931."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-11-11T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC814583",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-30T23:38:30.387Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-16T04:57:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Ability to rename General channel",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
