{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, Microsoft Viva Pulse admins can configure the <i>Minimum number of responses required to see feedback in the Viva Pulse app </i>under the <i>Manage</i> tab. This control is used to determine the minimum number of recipients a Pulse author needs to send their request to and how many responses must be received for a report to be created and provided to the author.\n</p><p>Coming soon: A new <i>Minimum number of recipients</i> control will allow admins to separately manage the minimum number of recipients and minimum number of responses required, for more granular control. Both are required, and the minimum number of recipients must always be equal to or greater than the minimum number of responses required.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability: We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>When we add the new <i>Minimum number of recipients</i> control, the <i>Minimum number of responses required to see feedback</i> category under the <i>Privacy</i> section in the <i>Manage</i> tab will become the <i>Minimum number of recipients and responses</i> section, which contains two controls. Your organization’s <i>Minimum recipients</i> and <i>Minimum responses</i> settings will both be set to your <i>Minimum number of responses required to see feedback</i> value at the time of the rollout.\n</p><p>This will make the change invisible to users in your organization, until or unless you adjust the controls.\n</p><p>Before the rollout, the Viva Pulse Administrator can manage the number of responses required for an author to see the feedback they receive:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ngpb?ver=f1ae\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>After the rollout, the Viva Pulse Administrator will also be able to manage the number of recipients required for an author to send a survey.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nbdf?ver=158a\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You can prepare for this change by doing the following:\n</p><ol><li>Decide if you would like to change the minimum recipients and/or minimum responses settings for users within your organization.\n</li><li>If you want to adjust one or both controls, you can do so after the updated controls have been released.\n</li></ol><p>Learn more: <a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/set-up-in-app-pulse-experience\" target=\"_blank\">Set up the in-app Viva Pulse experience | Microsoft Learn</a> (will be updated before rollout)\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins and users about this change and update any relevant documentation.</p><p>To learn more about Microsoft’s own review of this product with its works councils, please consider reading: https://aka.ms/VivaPulse/MSWorksCouncilsArticle&nbsp;</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse is updating privacy controls, adding a new 'Minimum number of recipients' control. This allows separate management of minimum recipients and responses required for feedback visibility. Rollout begins mid-August 2024, with no admin action needed before then. Preparation involves deciding on control settings and updating documentation."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC816195",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-17T04:02:07.66Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-17T04:01:56Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: Updates to Privacy controls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
