{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<div>With the ever-increasing sophistication of cyber-attacks, the increasing use of cloud-based services, and the proliferation of mobile devices, it’s essential that organizations secure access for both human and non-human identities to all on-premises and cloud resources, while continuously working to improve their security posture.<div><p></p><div>We're excited to share the Microsoft Entra feature release information for April – June 2024, along with second-quarter change announcements. This quarter’s updates include general availability releases for Entra ID and important change announcements on Azure AD Graph Retirement, enhancing the security of Apple devices in the enterprise with hardware-bound device identity, security updates to Entra ID affecting clients running old, unpatched builds of Windows, and many more.<div><p></p><div>\n<p></p><div>Please refer to this <a href=\"https://techcommunity.microsoft.com/t5/microsoft-entra-blog/what-s-new-in-microsoft-entra-june-2024/ba-p/3796387\" target=\"_blank\">link</a> for a summary of the June 2024 product updates. We also communicate these updates via <a href=\"https://aka.ms/entra/whatsnew\" target=\"_blank\">What's New</a>, email, and the release notes.<div><p></p><div>Note: The product update summary is organized by Microsoft Entra products, so you can quickly scan what’s relevant for your deployment.<div><p></p><div>Learn more:<p></p><ul><li><a href=\"https://learn.microsoft.com/entra/fundamentals/whats-new#june-2024\" target=\"_blank\">What's new in Microsoft Entra ID?</a></li></ul>>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The June 2024 updates for Microsoft Entra include general availability releases for Entra ID and changes like Azure AD Graph Retirement. Security enhancements for Apple devices and updates for Entra ID affecting old Windows builds are also featured. For a detailed summary, refer to the provided links."
    }
  ],
  "EndDateTime": "2024-08-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC810910",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-11T22:53:11.62Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-11T22:52:50Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "What's new in Microsoft Entra - June 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
