{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Introducing four new Microsoft Purview Data Loss Prevention (DLP) Microsoft Exchange (EXO) predicates:<br></p><ul><li><i>Message is not labeled</i>: Detects if message body has no label.</li><li><i>Attachment is not labeled</i>: Detects if there is any attachment without a label.</li><li><i>Message contains</i>: Detects if the message body contains specified sensitive information types (SITs) or labels. Note that there is no trainable classifiers or non-advanced rule support yet.</li><li><i>Attachment contains</i>: Detects if an attachment contains specified SITs or labels. Note that there is no trainable classifiers or non-advanced rule support yet.</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=377000\" target=\"_blank\">377000</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late September (previously late August) 2024 and expect to complete by late October 2024 (previously late September).</p><p><b>How this will affect your organization:</b>\n</p><p>You can now create new DLP policies or edit existing policies to include predicates to target specific email components like email body or attachments only.</p><p>This feature is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>For information about how to prepare, visit&nbsp;<a href=\"https://learn.microsoft.com/purview/dlp-create-deploy-policy\" target=\"_blank\">Create and deploy a data loss prevention policy | Microsoft Learn</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "377000"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention introduces four new Exchange predicates for detecting unlabeled messages and attachments, and those containing specific sensitive information. Rollout begins late September 2024, completing by late October. Organizations can update DLP policies accordingly, with resources available for preparation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC822718",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-12T23:55:21.323Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-19T16:49:39Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Purview Data Loss Prevention: New Microsoft Exchange predicates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
