{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In February 2024 the retirement of Viva Topics (<a href=\"https://learn.microsoft.com/microsoft-365/topics/changes-coming-to-topics?view=o365-worldwide\" target=\"_blank\">Changes coming to Topics</a>) was announced. As part of that change, Viva Engage will return to a simplified topics model, called Engage topics, and the integration with Viva Topics will be retired. \n</p><p>The following premium Viva Topics experiences and lightweight topics management experiences will no longer be available in Viva Engage, including: \n</p><ul><li>Viewing Viva Topics card when hovering on a topic \n</li><li>Viewing or using AI-discovered Viva Topics \n</li><li>Links to Viva Topics pages \n</li><li>Topic management via Viva Topics or lightweight topics management \n</li><li>Featuring of topics in Answers \n</li></ul><p>Using Engage topics, users will continue to be able to create topics, add topics to posts, follow topics, edit topics they created, and increase the relevance of their feeds by following topics. Topic creators will gain the ability to delete topics they created. Applicable admins will continue to be able to edit topics and will gain the ability to delete topics within Viva Engage. \n</p><p>Organizations using Answers in Viva (<a href=\"https://support.microsoft.com/topic/answers-in-viva-introduction-e6331234-e044-4009-a0c8-7c519a2cf668\" target=\"_blank\">Answers in Viva: Introduction</a>) will continue to see additional topic capabilities including bulk topic deletion for admins, AI suggested topics for questions, topics promoted for following, and topic browse experiences. The described topic experiences will be available to Viva Engage tenants that have been migrated to Engage topics.</p><p><b>When this will happen:</b></p><p>Rollout will begin August 2024 and will complete for all tenants migrated to use Viva Topics in Viva Engage by April 2025. Tenants using legacy topics in Viva Engage will begin migrations in September 2024 and migrations will continue until all Native mode networks have been completed.</p><p> \n</p><p><b>Why is this change happening?</b> \n</p><p>As a result of the retirement of Viva Topics, Viva Engage will retire the integration with Viva Topics, but continue to support a simplified topics model to help organize, amplify, route, and recall knowledge posted with topics. To ensure customer data is retained we will migrate customer topics data from Viva Topics into Viva Engage to preserve topics applied to posts and associated Engage topic metadata such as followers, description and creator. \n</p><p>During the transition, we will stop topics migrations to use Viva Topics and Topics lightweight management but continue by-request migrations that enable Viva Engage networks to use Answers in Viva (<a href=\"https://learn.microsoft.com/viva/engage/eac-answers-overview-set-up#technical-requirements\" target=\"_blank\">Technical requirements</a>). Learn more about the migration to Viva Topics (<a href=\"https://learn.microsoft.com/microsoft-365/topics/topic-experiences-viva-engage?view=o365-worldwide\" target=\"_blank\">Topics in Viva Engage</a>), the Topics experience (<a href=\"https://support.microsoft.com/topic/viva-topics-experience-in-yammer-8e85bc0d-086e-49a2-974b-39f60129257d\" target=\"_blank\">Topics experience in Viva Engage</a>), and the Topics retirement (<a href=\"https://learn.microsoft.com/microsoft-365/topics/changes-coming-to-topics?view=o365-worldwide\" target=\"_blank\">Changes coming to Topics</a>).</p><p><b>How this will affect your organization:</b> \n</p><p>Starting in August 2024, newly created tenants will default to the Engage topics and tenants that have been migrated to use Viva Topics will begin topic migrations to Engage topics. Tenants will be migrated in batches after their Viva Topics license expires or after the Viva Topics retirement date of February 22, 2025, whichever comes first. If your tenant is impacted, notice of topic migration will be shared via message center post approximately one month before topic migration.</p><p>Migrations for legacy topics experiences (tenants not yet migrated to Viva Topics) will kick off in September&nbsp;2024 and continue until all Viva Engage networks in Native mode have migrated to Engage topics.</p><p><b>What you need to do to prepare:</b> \n</p><p>Before the migration a tenant admin can get a snapshot of which topics will be migrated by exporting topics in Viva Engage with PowerShell (<a href=\"https://learn.microsoft.com/microsoft-365/topics/export-topics-powershell?view=o365-worldwide\" target=\"_blank\">Export topics created in Viva Engage with PowerShell</a>). No other actions are recommended.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In February 2024, Viva Engage will simplify its topics model and retire integration with Viva Topics. Premium and management experiences will be removed, but users can still create, edit, and follow topics. Rollout begins August 2024, with all migrations completed by April 2025."
    }
  ],
  "EndDateTime": "2025-04-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC823308",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-07-19T21:44:02.287Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-19T21:43:23Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Changes to Topics in Viva Engage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
