{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are changing the hardware requirements for Microsoft Edge. Starting in Microsoft Edge version 128, devices that do not have a CPU with SSE3 will no longer be supported or receive updates, including critical security updates. </p><p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\"><b>When this will happen:</b></p><p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">This change will roll out to Stable channels of Edge no-sooner than the end of August 2024.</p><p><b>How this will affect your organization:</b></p><p>Users with devices without SSE3 will no longer receive Microsoft Edge updates once this change is implemented.</p><p>Impacted devices will see a banner in Microsoft Edge versions 126 &amp; 127 stating:&nbsp;</p><p> \n</p><p>“This computer will soon stop receiving Microsoft Edge updates because its hardware is no longer supported.”&nbsp;<br></p><p><b>What you need to do to prepare:</b></p><p>Users with devices without SSE3 will need to move to a device with SS3 to continue receiving Microsoft Edge updates. While not recommended, users will have access to Edge version 128 on devices without SSE3. However, they will not receive any updates, including critical security updates.</p><p>To learn more about Microsoft Edge requirements, review:&nbsp;<a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-supported-operating-systems\" target=\"_blank\">Microsoft Edge supported Operating Systems</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message informs that Microsoft Edge will change its hardware requirements, no longer supporting devices without SSE3 starting from version 128. This change will take effect by the end of August 2024, and affected users will need to upgrade their devices to continue receiving updates."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/deployedge/microsoft-edge-supported-operating-systems"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC823307",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-07-19T21:43:12.01Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-19T21:42:37Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Configuration Change - Microsoft Edge Supported Hardware Requirements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
