{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 28, 2024: We have updated the rollout timeline and content below. Thank you for your patience.</p><p>Microsoft Defender for Office 365 is retiring four legacy override alerts that are now mostly redundant due to <a href=\"https://learn.microsoft.com/defender-office-365/secure-by-default\" target=\"_blank\">Secure by default</a>. With Secure by default, <a href=\"https://learn.microsoft.com/defender-office-365/zero-hour-auto-purge\" target=\"_blank\">ZAP (zero-hour auto purge)</a> blocks high confidence phishing emails by default despite the legacy overrides. The four alerts are:\n</p><ol><li>Phish not zapped because ZAP is disabled\n</li><li>Malware not zapped because ZAP is disabled\n</li><li>Phish delivered due to ETR override\n</li><li>Phish delivered due to IP allow</li></ol><p>As part of the deprecation and rollout,\n</p><ul><li>These policies will no longer be part of the Alert policies in the Microsoft Defender portal.\n</li><li>Existing alerts that are already generated will be in the system (part of Alerts) until data retention applies.\n</li><li>Any features like AIR built on these policies will not function (return no data) but will not result in any crashes or issues to the system.\n</li><li>Any features like Investigations or post-breach functionalities will not have these alerts as part of the selection, filtering, or processing.\n</li></ul><p><i>When is the change?\n</i></p><p>We plan to turn off these alerts starting August 18, 2024 and ending September 15, 2024. \n</p><p><i>Who is impacted?</i>\n</p><ol><li>Phish not zapped because ZAP is disabled: E5/G5 or Microsoft Defender for Office 365 P2 add-on subscription\n</li><li>Malware not zapped because ZAP is disabled: E5/G5 or Defender for Office 365 P2 add-on subscription\n</li><li>Phish delivered due to ETR override: E1/F1/G1, E3/F3/G3, or E5/G5\n</li><li>Phish delivered due to IP allow: E1/F1/G1, E3/F3/G3, or E5/G5\n</li></ol><p><i>What should I do if I am impacted?</i></p><p>This change will happen automatically by the specified date. No admin action is required. Since these alerts are mostly redundant, we do not expect any impact. Defender XDR Customers using Defender for O365 as a secondary filter (MX record pointed to 3rd party service) and still want the alerts can create a custom detection rule on EmailEvents table with filters on OrgLevelAction &amp; OrgLevelPolicy.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Four legacy override alerts in Microsoft Defender for Office 365 will be retired in September 2024 due to redundancy from the Secure by default feature. Affected users with specific subscriptions will not need to take any action as this change will occur automatically."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC822720",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-30T23:15:49.18Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-19T16:51:20Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Defender for Office 365: Four override alerts retire in August 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
