{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With the release of Apple iPadOS 17, Microsoft Teams will now support external webcams and cameras in meetings and calls on Apple iPads.&nbsp; Simply connect your external webcam and camera to your Apple iPad.&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, DoD): We will begin rolling out late June 2024 and expect to complete by early July 2024.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>To conduct their Teams meeting experience on Apple iPads using external webcams and cameras, users must connect their webcam to their Apple iPad before joining their meeting.  If users want to switch to their Apple iPad camera, they must disconnect from their external webcam.</p><p>This update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams now supports external USB webcams for meetings on Apple iPads with iPadOS 17. Rollout will begin late June 2024 and complete by early July 2024. No admin action is required for this update. Users should connect the external webcam before joining a meeting."
    }
  ],
  "EndDateTime": "2024-09-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC822724",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-19T16:52:57.617Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-19T16:52:40Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: External USB Webcams are now supported in Teams meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
