{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for new Microsoft Outlook: Intelligent recap is an AI-powered feature from Microsoft Teams that will help users catch up on missed meetings with AI-generated notes, follow-up tasks, name mentions, topics, chapters, speaker identification, and more. This feature can now be directly accessed from the calendar in new Outlook. This message applies to new Outlook for Windows and new Outlook for the web. All new Outlook users will be able to access Recap artifacts in Outlook, with the specific artifacts available depending on their license status. Users with Microsoft Teams Premium or Microsoft Copilot for Microsoft 365 licenses will see the full set of Recap artifacts. Users without Teams Premium or Copilot for Microsoft 365 licenses will see the basic set of Recap artifacts, such as recordings, transcription, and shared files.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=403099\" target=\"_blank\">403099</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: New Outlook users did not have access to intelligent recap from Teams.\n</p><p><i>After this rollout</i>\n</p><p>Shortly after a meeting ends, and if the meeting is recorded or transcribed, participants will see <i>View recap</i> and a set of all meeting artifacts in the new Outlook calendar.\n</p><p>User can access the Recap feature from the new Outlook calendar in two ways:\n</p><ul><li>Users can select a meeting in the calendar and then select <i>View recap,</i> which takes users to the meeting Recap tab in Teams.\n</li><li>Users can select and open the meeting from the calendar, which takes users to the Meeting summary in Outlook with information on speakers, name mentions, tasks, and files, and more. Select <i>View recap</i> to access the Recap tab in Teams. Some meeting artifacts (such as transcripts and attendance reports) will be shown under the Files tab in Teams.\n</li></ul><p>In the Meeting summary, users can interact with Recap artifacts features such as speakers, name mentions, tasks, and files, which are now automatically available after a meeting, just as they would with Recap artifacts in Teams Chat.\n</p><p>The intelligent recap feature is on by default and available to all users with the appropriate licenses and for all meetings with transcription or recording enabled.\n</p><p>Select a meeting in the new Outlook calendar and then select <i>View recap</i> to review the meeting Recap tab in Teams:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nmj8?ver=5023\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The meeting Recap tab in Teams:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nhbx?ver=dff5\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>If a user selects and opens the meeting from the calendar, the Meeting summary opens in Outlook, and the user can select the <i>View recap</i> button to go to the Recap tab in Teams:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nhqL?ver=3089\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "403099"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Outlook will integrate an AI-powered Intelligent recap feature from Microsoft Teams, allowing users to access AI-generated meeting notes and tasks directly from the Outlook calendar. This feature is available for new Outlook for Windows and the web, with full access depending on license status. Rollout begins mid-August 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC835642",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-25T22:40:35.827Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-25T22:40:19Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Intelligent recap integration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
