{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams: Town hall and webinar organizers will be able to download a CSV file of questions and answers posted in Teams Q&amp;A by town hall or webinar attendees. This message applies to Teams for Desktop on PC and Mac.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398446\" target=\"_blank\">398446</a>.\n</p><p><b>When will this happen</b>\n</p><p>General Availability (Worldwide): We will begin rolling out in mid-August 2024 and expect to complete by early September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Town hall and webinar organizers were not able to download Q&amp;A to CSV.\n</p><p>After the rollout:\n</p><p>After concluding a town hall or webinar, organizers can go to the <i>Reports</i> section of their Teams town hall or webinar invitation and download the Q&amp;A report, which contains:\n</p><ul><li>Source: Who posted the conversation (organizer or attendee)\n</li><li>Type | Conversation type: Discussion, Question, or Reply\n</li><li> Identity: Identity of user who engaged in the conversation\n</li><li>Time stamp: When the conversation was posted\n</li><li>Conversation ID: Unique identifier of the conversation\n</li><li>Reply to ID: Reply ID of the conversation in response to a question or a discussion\n</li><li>Content: The content of the conversation\n</li><li>Reactions: The total number of reactions to the conversation\n</li></ul><p>This feature is on by default and accessible to all Teams users on Desktop and web on PC and Mac.\n</p><p>After a town hall or webinar, users will be able to go to Teams &gt; <i>Calendar &gt; Details &gt; Manage event:</i>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ndRt?ver=153d\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>From the <i>Manage event</i> page, users can select <i>Reports &gt; Download &gt; Q&amp;A report:</i>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nlAz?ver=897a\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The Q&amp;A report downloads to CSV and contains content from the town hall or webinar:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nlAA?ver=3929\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Let Teams town hall and webinar organizers know that in August 2024 they can download content from their Q&amp;A to CSV, just like they can for Teams Live Events.\n</p><p> </p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to update any relevant documentation as appropriate.\n</p><p><i>Learn more</i>\n</p><ul><li>For users: <a href=\"https://aka.ms/GetQnA\" target=\"_blank\">Q&amp;A in Microsoft Teams meetings - Microsoft Support</a> (https://aka.ms/GetQnA)\n</li><li>For admins: <a href=\"https://aka.ms/QnAadmin\" target=\"_blank\">Manage Q&amp;A in Teams meetings and events - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398446"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow town hall and webinar organizers to download Q&A sessions as CSV files. This feature will be globally available from mid-August to early September 2024 and will be accessible by default on Teams for Desktop on PC and Mac. Organizers can access the report under the 'Reports' section after the event. No admin action is required for this rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC830253",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-22T23:03:18.327Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-22T23:02:47Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Download town hall and webinar Q&As to CSV",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
