{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting October 1st, 2024, we're gradually enabling IPv6 for all customer Accepted Domains that use Exchange Online for inbound mail. Microsoft is modernizing Exchange Online so our customers can easily meet their local regulations as well as benefit from the enhanced security and performance offered by IPv6.<br></p><p>More information on IPv6 support for Microsoft 365 services can be found at: <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/ipv6-support?view=o365-worldwide\" target=\"_blank\">IPv6 support in Microsoft 365 services</a></p><p><b>When this will happen:</b></p><p>October 1, 2024</p><p><b>How this will affect your organization:</b>\n</p><p>After we enable IPv6 for your Accepted Domains, when someone tries to send an email to one of your users and queries the MX record for the domain, they will receive both IPv4 and IPv6 addresses (AAAA records) in response to their MX record query.    \n</p><p><b>What you need to do to prepare:</b>\n</p><p>To take advantage of IPv6 connectivity, please make sure that your network allow-lists allow Exchange Online IPv6 endpoints in the same way it allow-lists IPv4.\n</p><p>The Exchange Online IPv6 endpoints can be found here: <a href=\"https://aka.ms/m365endpoints\" target=\"_blank\">Microsoft 365 URLs and IP address ranges</a>.  \n</p><p>We understand customers have unique situations and may require their own timeline for IPv6 enablement. For customers who need to remain IPv4-Only, we will update this post in September with details on how to opt-out of IPv6 for your Accepted Domains.   \n</p><p>With this change, please note that traffic moved to IPv6 will have more stringent authentication requirements, as described here <a href=\"https://learn.microsoft.com/defender-office-365/mail-flow-about#support-for-anonymous-inbound-email-over-ipv6\" target=\"_blank\">Support for anonymous inbound email over IPv6</a></p><p>If you expect this change to cause any issues for your organization, please reach out via your regular support channels.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting October 1, 2024, Microsoft will enable IPv6 for Accepted Domains in Exchange Online, enhancing security and performance. Organizations should update network allow-lists to include Exchange Online IPv6 endpoints. Opt-out details will be provided in September for those needing to remain IPv4-Only."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC835648",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-07-25T22:50:53.34Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-25T22:50:26Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Announcing IPv6 Enablement for Accepted Domains",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
