{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Amplify: An improved content pane on the right side of the screen is the hub for various panes that support authors in creating their publications. We have consolidated several existing features into the content pane, such as the authoring features in the Toolbox, the Distribution channel selection, and the Writing guidance.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398977\" target=\"_blank\">398977</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out at the end of July 2024 and expect to complete it by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users access sections to build their publication on the left side of the canvas. Web parts can only be added through the on-canvas plus buttons. Users access Writing Guidance and Distribution channels from buttons at the top of the screen.\n</p><p><i>After this rollout</i>\n</p><p>When users create a new publication in Viva Amplify, the content pane's selection bar will appear on the right side of the screen. Users will be able to use the content pane's selection bar to navigate to different panes, such as <i>Toolbox, Properties, Writing guidance,</i> and <i>Distribution channels</i>.\n</p><ul><li><i>Toolbox: </i>Users will have quick access to essential tools in the Toolbox, which contains three content categories: web parts, media, and section templates. Authors can click and drag to place web parts and media on the canvas or add items from any category to the canvas with one click. To access more options for these categories, select the <i>See all / See more</i> buttons.\n</li><li><i>Properties: </i>The preexisting <i>Properties</i> for a webpart are now accessible in the content pane. Users will be able to access web parts or section properties by selecting <i>Properties in </i>the content pane or by selecting <i>Edit properties</i> in the web part or section toolbars.\n</li><li><i>Writing guidance</i>: Users will be able to access <i>Writing guidance</i> from an icon in the content pane's selection bar.\n</li><li>Distribution channel selection: The Distribution channel selection, where users can select the channels they want to publish to, will move to the content pane's selection bar.\n</li></ul><p>Additionally, when viewing the publication in preview and customize mode for specific channels, users will be able to add or remove channels directly from the tabs.\n</p><p>These new Viva Amplify features are on by default and accessible to all users with Authoring permissions.\n</p><p>The Viva Amplify content pane selection bar showing the Toolbox, Properties, Writing guidance, and Destination channel selection:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nhrZ?ver=1821\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You might want to notify users, update your user training, and prepare your help desk.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/preview-and-customize-a-viva-amplify-publication-5c96c06e-449f-4374-bbd3-503caf870bfa\" target=\"_blank\">Preview and customize a Viva Amplify publication - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398977"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Amplify is updating authoring options, consolidating features into the content pane, and enhancing navigation. Rollout starts end of July 2024, with completion by late August 2024. No admin action needed; users should be informed and training updated."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC830246",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-22T22:58:43.97Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-22T22:58:30Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Amplify: Updated authoring options in the content pane",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
