{
  "ActionRequiredByDateTime": "2025-01-27T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 6, 2025: Enforcement actions on unlicensed OneDrive accounts are ongoing. Please continue to monitor your <a href=\"http://spo.ms/admin#/oneDriveAccounts/management\" target=\"_blank\">Unlicensed OneDrive Account report</a>, as all accounts listed will be subject to enforcement if no action is taken.  To support more informed decision-making, we’ve introduced new and more granular reasons for why an account may appear unlicensed but and has not been deleted. This added detail should help you take the appropriate actions for each case and will be available in your Unlicensed OneDrive Accounts report no later than June 24th.  In some cases, admin action is required to delete the accounts. The timeline for enforcement remains unchanged from our last update.</p><p>Enforcement began on January 27, 2025. The rollout has slowed to ensure a safe roll-out with sufficient time for admins to adjust. Admins should anticipate that it takes time for all unlicensed accounts to complete the enforcement process. The initial enforcement rollout will be complete by October 29, 2025.</p><p><b>Timeline for accounts unlicensed before July 28, 2025\n</b></p><ul><li>September 26, 2025: By this date, all unlicensed accounts transition to read-only mode. Admins are advised to check after this date. Checking earlier can result in an incomplete status snapshot.\n</li><li>October 29, 2025: By this date, all unlicensed accounts are archived. Admins are advised to check after this date. Checking earlier can result in an incomplete status snapshot.</li></ul><p><b>Timeline for accounts unlicensed after July 28, 2025</b></p><ul><li>For accounts unlicensed after July 28, 2025, the account will be put into read-only mode on the 60th unlicensed day, and will be archived or moved to the recycle bin on the 93rd unlicensed day.\n</li></ul><p><b>Example:\n</b></p><ul><li>Unlicensed Date: October 1, 2025\n</li><li>Day 60: Nov 30, 2025. The account is placed in read-only mode. </li><li>Day 93: January 2, 2026: The account is archived. If the user is still active in Entra ID but the admin hasn't enabled billing, then this is also the date on which the account will begin the deprovisioning process.</li><li>Admins are encouraged to monitor account statuses based on these timelines to ensure compliance and take any necessary actions.</li></ul><p><b>When will this happen:</b> \n</p><p>&nbsp;General Availability (Worldwide): We began rolling out late January 2025 and expect to complete by late October 2025 (previously late March).</p><p><b>How this will affect your organization</b>\n</p><p>After this storage policy goes into effect in your tenant, any OneDrive user accounts that have been unlicensed for more than 93 days will be archived automatically and will become inaccessible to end users. Admins can view these accounts with admin tools, but the accounts will not be accessible to users until admins take action on them. For example, a OneDrive account that became unlicensed on August 1, 2025 will be inaccessible to users as of October 1, 2025.</p><p>As an admin, you can view a list of unlicensed accounts in your tenant by navigating to SharePoint admin center &gt; <i>Reports &gt; OneDrive accounts</i>. Some admins will have access to this page as soon as July 26, 2024, but most admins will be able to access the page closer to August 16, 2024.\n</p><ul><li>Set up the Archive billing for unlicensed accounts to be able to access and edit the archived files.\n</li><li>Delete the unlicensed OneDrive account, if it does not have a retention policy applied to it. \n</li><li>Renew the unlicensed account to maintain access.\n</li></ul><p></p><p>The <i>Unlicensed OneDrive accounts</i> page that will be in Microsoft admin center:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/8f5c65a0-5515-49e1-b876-07e81c69a89a\" style=\"width: 400px;\" alt=\"admin controls\"> \n</p><p>After the unlicensed accounts are automatically archived, you can access the files in these accounts by enabling unlicensed account billing in the Microsoft 365 admin center. Once enabled, unlicensed account billing applies to all unlicensed OneDrive accounts in your tenant. There is a fee of $0.05/GB/month to store unlicensed accounts in the Microsoft 365 Archive, and a fee of $0.60/GB to reactivate accounts stored in the Microsoft 365 Archive. Account reactivation takes up to 24 hours and provides 30 days of access to the account, and then the account returns to an archived state.\n</p><p>If you take no action for OneDrive accounts that have been unlicensed for longer than 93 days, these accounts will remain inaccessible to end users until you set up an Azure subscription and enable unlicensed account billing in the Microsoft SharePoint admin center. This action will not affect tenants who have not changed the default tenant retention settings.\n</p><p><b>What you need to do to prepare</b>\n</p><p>To prepare for this change, admins can view a list of all the unlicensed OneDrive accounts in their tenant by going to the SharePoint admin center and navigating to <i>Reports &gt; OneDrive accounts</i> (this page will be rolled out to admins between July 26, 2024 and August 16, 2024). This page will provide the number of unlicensed accounts and why the accounts are unlicensed. You may have unlicensed accounts in your tenant for four reasons: \n</p><ol><li>Retention period – Account is no longer licensed but is still active because a retention period setting is keeping the account from being deleted.\n</li><li>Retention policy – Account is no longer licensed but is still active because a retention policy in Purview is keeping the account from being deleted. \n</li><li>Active user with no license – Account is active but is not licensed. This can happen if the license is removed but the user is not removed from Microsoft Entra ID (formerly Azure Active Directory).  \n</li><li>Duplicate accounts – Account is a duplicate because a licensed user has multiple OneDrive accounts associated with them. Duplicate accounts (also known as non-primary accounts) may arise if a user has geographic move, if a user leaves and then rejoins an organization, or from other factors. \n</li></ol><p>After you have taken inventory of your unlicensed accounts, we recommend that you take the following action before January 27, 2025. \n</p><ol><li>Delete unlicensed accounts that you no longer wish to retain. \n</li><li>Set up billing for accounts that you wish to retain.\n</li><li>You may want to notify your users about this change and update any relevant documentation.\n</li></ol><p>*<b>At this time, these changes do not apply to customers in Education tenants. An Education tenant is any tenant with more than 50% education licenses. Any tenant with fewer than 50% education licenses is considered commercial.&nbsp;</b>However, for any education tenant, unlicensed OneDrive accounts consume pooled storage and can pose security and compliance risks. IT admins can view the unlicensed accounts on the <i>OneDrive accounts</i> page to identify unlicensed accounts and take action.</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/SharePoint/unlicensed-onedrive-accounts\" target=\"_blank\">Manage unlicensed OneDrive user accounts - SharePoint in Microsoft 365 | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/sharepoint/retention-and-deletion\" target=\"_blank\">OneDrive retention and deletion - SharePoint in Microsoft 365 | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/add-users/delete-a-user?view=o365-worldwide\" target=\"_blank\">Delete a user from your organization - Microsoft 365 admin | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Enforcement actions on unlicensed OneDrive accounts are ongoing, with detailed reasons for unlicensed status available by June 24, 2025. Accounts unlicensed before July 28, 2025, will transition to read-only mode by September 26, 2025, and be archived by October 29, 2025. Admins must monitor and take necessary actions."
    }
  ],
  "EndDateTime": "2025-12-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC836942",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-06T21:08:33.007Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-26T19:37:42Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: Update for unlicensed accounts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
