{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>When scoping policies to Microsoft 365 Groups in Microsoft Teams Data Loss Prevention (DLP) policies, members of Teams standard and shared channel chats associated with the groups are currently protected by the policies. The messages are scanned/evaluated for sensitive content. This change will automatically extend the protection to standard/shared channels chats in other Microsoft 365 Groups and 1:1/n (non-channel) chats. There is no longer a need to add users, security groups, or other Microsoft 365 Groups to protect these chats, except for customers that have enabled optical character recognition (OCR) in Teams chat.<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=401126\" target=\"_blank\">401126</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late August 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>There is no change to your existing Teams DLP policy if you are also including users and security groups to protect the same set of users for 1:1/n chats.  If you have a specific policy that only aims to protect channel chats for a specific set of users and not on their 1:1/n chat, file a Microsoft support ticket to provide more information for consideration to delay the rollout for your organization.</p><p><b>What you need to do to prepare:</b></p><p>Admins should review their existing Teams DLP policies to determine whether there will be any impact on particular policies in which users are protected only by Microsoft 365 Groups and no other Teams DLP policies that are scoped with user accounts or security groups.</p><p>This does not apply if your organization has enabled OCR. See <a href=\"https://learn.microsoft.com/microsoft-365/syntex/ocr-overview\" target=\"_blank\">Overview of optical character recognition in Microsoft Syntex - Microsoft Syntex | Microsoft Learn</a> for details.&nbsp;</p><p>Refer to <a href=\"https://learn.microsoft.com/purview/dlp-microsoft-teams?tabs=purview#scope-of-dlp-protection\" target=\"_blank\">Data loss prevention and Microsoft Teams | Microsoft Learn</a> for more information on Teams DLP policy scoping once the rollout begins.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401126"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Groups in Teams DLP policy will now automatically include 1:1 and group chats for protection, without needing to add users or groups manually, except when using OCR. Rollout begins late August 2024, with completion by late September 2024. Admins should review their Teams DLP policies in preparation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC837079",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-26T21:38:15.147Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-26T21:37:52Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Purview | Data Loss Prevention: Microsoft 365 Groups scoping in Teams DLP policy extend protection to 1:1/n chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
