{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 22, 2024: We have updated the content. Thank you for your patience.</p><p>This feature update expands how Microsoft Outlook for iOS and Android gives external recipient warnings.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DOD): We will begin rolling out mid-August 2024 and expect to complete by late November 2024 (previously late September).</p><p><b>How this will affect your organization:</b></p><p> A new optional administrative setting (InternalDomains) allows your organization to configure a list of internal domains to inform the external recipients warning in Outlook for iOS and Android. If set, this list of domains will be used to make determinations for external recipient warnings rather than the MailTip service</p><p>This feature update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>Manage the option to provide a list of external domains to provide external recipient MailTip warnings by Outlook for iOS and Android. For more information, see <a href=\"https://review.learn.microsoft.com/Exchange/clients-and-mobile-in-exchange-online/mailtips/mailtips?branch=pr-en-us-3931#external-recipients-mailtip-offline-domain-configuration\" target=\"_blank\">External recipients MailTip domain configuration</a>.</p><p>You may want to notify your users about this change and update any relevant documentation as appropriate.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details an update for Microsoft Outlook for iOS and Android, expanding external recipient warnings with a new administrative setting for internal domains. Rollout starts mid-August 2024 and ends late November 2024. Organizations should manage external domain lists and inform users about the update."
    }
  ],
  "EndDateTime": "2025-01-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC834102",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-23T21:27:12.1Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-24T23:02:04Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "External recipients MailTip offline behavior update for Microsoft Outlook for iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
