{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Outlook on the web and new Outlook for Windows are enhancing users' experience by automatically hiding contacts that are exact duplicates or proper subsets of other contacts. This means that if you have multiple entries for the same person, Outlook will consolidate them, keeping only the most complete contact visible. This update aims to declutter your contact list, making it easier to navigate and manage.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out late August 2024 and expect to complete by late September 2024.</p><p><span>General Availability (Worldwide): We will begin rolling out early September 2024 (late September) and expect to complete by mid-October 2024 (late September).</span></p><p><b>How this will affect your organization:</b></p><p><i>Impact on different Outlook clients:</i> Cleanup will affect the Outlook w<span></span>eb app and new Outlook for Windows, while classic Outlook for Windows, Outlook on Mac, and Outlook mobile will remain unchanged, showing all contacts.</p><p><i>Synchronization Across Platforms: </i>Updates made to any contact will be synchronized across all Outlook clients.</p><p><i>How to access hidden duplicate contacts</i>: Exact or proper subset duplicate contacts are automatically hidden to streamline your view. They remain accessible via classic Outlook for Windows, Outlook on Mac, and Outlook mobile. Users can also export contacts from any Outlook app to view them.&nbsp;</p><p><i>How users can determine which contacts are subsets/hidden versus supersets:</i><b>&nbsp;</b>This is currently a manual process that can only be completed by reviewing contacts from within classic Outlook for Windows, Outlook on Mac, or Outlook mobile.  There is no method for admins to automate this process at this time.</p><p><i>Exporting Contacts:</i><b>&nbsp;</b>If users need to export their contacts for review in another tool, including the hidden ones, you can <a href=\"https://support.microsoft.com/office/import-and-export-outlook-email-contacts-and-calendar-92577192-3881-4502-b79d-c3bbada6c8ef\" target=\"_blank\">export contacts</a> in all Outlook clients.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook is updating to automatically hide duplicate contacts, with rollouts starting late August 2024 and ending mid-October 2024. This affects Outlook on the web and new Outlook for Windows, while other versions will show all contacts. No admin action is needed, but users should be informed."
    }
  ],
  "EndDateTime": "2025-01-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC835643",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-12T23:30:33.113Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-25T22:41:07Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Contact deduplication",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
