{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Clipchamp: Users will be able to make the background of an image transparent for their videos without sacrificing their original PNG or JPEG image quality. This feature is available by default for all Clipchamp users (no Clipchamp premium access required). This message applies to Clipchamp for Windows and Mac desktops and to Clipchamp on the web.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=Microsoft%20Clipchamp&amp;searchterms=388485\" target=\"_blank\" style=\"\">388485</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late July 2024 and expect to complete by early August 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early August 2024 and expect to complete by mid-August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: Users are not able to make an image's background transparent in Clipchamp. Instead, they use other software.\n</p><p>After the rollout, users will be able to:\n</p><ul><li>Upload and improve their images to add to videos, with no additional software required. \n</li><li>Replace the background in marketing videos and images to help their products stand out.\n</li><li>Remove unwanted distractions in the background of images.\n</li><li>Remove image backgrounds and add text behind the subject to elevate slideshow presentations.\n<p></p></li></ul><p>This feature is opt-in only and the data handling practices are fully compliant with <a href=\"https://www.microsoft.com/trust-center/product-overview#Microsoft-365\" target=\"_blank\">Microsoft Trust Center Overview | Microsoft Trust Center</a>.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://support.microsoft.com/topic/how-to-remove-background-from-your-photos-and-images-8b18df1d-9177-4ab2-82c7-521b0bb7e4a2\" target=\"_blank\">How to remove background from your photos and images - Microsoft Support</a>\n</li><li><a href=\"https://clipchamp.com/en/blog/image-background-removal/\" target=\"_blank\">Image background removal | Clipchamp Blog</a>\n</li><li><a href=\"https://clipchamp.com/en/background-removal/\" target=\"_blank\" style=\"\">Image background remover. Remove background for free online (clipchamp.com)</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "388485"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Clipchamp will soon allow users to make image backgrounds transparent in videos without losing quality. This feature will be available to all users, with rollouts starting late July 2024 and completing by mid-August 2024. No admin action is required for the update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC837084",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-26T21:41:26.53Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-26T21:41:15Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Clipchamp: Remove image background from videos",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
