{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This feature update expands how Microsoft Outlook for iOS and Android gives external recipient warnings when the client cannot reach the MailTip service.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DOD): We will begin rolling out mid-August 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b>\n</p><ul><li>When your organization has external recipient MailTip warnings enabled, results will be cached from the MailTip service in the users' phones local databases, enabling Outlook&nbsp;to use these results to make determinations when it is&nbsp;unable to reach the MailTips service, such as when a user's device is offline. </li><li>A new optional administrative setting (InternalDomains) allows your organization to configure a list of internal domains to inform the external recipients warning in Outlook for iOS and Android when the MailTip service cannot be reached, such as when a user is offline.</li><li>If the client is unable to reach the MailTip service, cached results are not available, and an internal domain list is not provided, Outlook will compare the domain of the sending account to the domain of each recipient.</li></ul><p>This feature update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>Manage the option to provide a list of external domains to provide external recipient MailTip warnings by Outlook for iOS and Android. For more information, see <a href=\"https://learn.microsoft.com/exchange/clients-and-mobile-in-exchange-online/mailtips/mailtips\" target=\"_blank\">External recipients MailTip offline domain configuration</a>.</p><p>You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The update for Microsoft Outlook for iOS and Android will allow external recipient warnings to function offline by caching MailTip service results, with a rollout from mid-August to late September 2024. Organizations can manage this feature by configuring a list of internal domains. Users should be informed of these changes."
    }
  ],
  "EndDateTime": "2024-11-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC834102",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-24T23:03:15.157Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-24T23:02:04Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "External recipients MailTip offline behavior update for Microsoft Outlook for iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
