{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 8, 2024: We have updated the content. Thank you for your patience.</p><p>Starting October 16, 2024, we're gradually enabling IPv6 for all customer Accepted Domains that use Exchange Online for inbound mail. Microsoft is modernizing Exchange Online so our customers can easily meet their local regulations as well as benefit from the enhanced security and performance offered by IPv6.<br></p><p>More information on IPv6 support for Microsoft 365 services can be found at: <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/ipv6-support?view=o365-worldwide\" target=\"_blank\">IPv6 support in Microsoft 365 services</a></p><p><b>When this will happen:</b></p><p>October 16, 2024 (previously October 1, 2024)</p><p><b>How this will affect your organization:</b>\n</p><p>After we enable IPv6 for your Accepted Domains, when someone tries to send an email to one of your users and queries the MX record for the domain, they will receive both IPv4 and IPv6 addresses (AAAA records) in response to their MX record query.    \n</p><p><b>What you need to do to prepare:</b>\n</p><p>To take advantage of IPv6 connectivity, please make sure that you and your partner's update network allow-lists to allow Exchange Online IPv6 endpoints in the same way it allow-lists IPv4.\n</p><p>The Exchange Online IPv6 endpoints can be found here: <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/urls-and-ip-address-ranges?view=o365-worldwide\" target=\"_blank\">Microsoft 365 URLs and IP address ranges</a>.\n</p><p>To opt a domain out of inbound IPv6 so traffic flowing to the domain remains IPv4-only,  please use <a href=\"https://learn.microsoft.com/powershell/module/exchange/disable-ipv6foraccepteddomain?view=exchange-ps\" target=\"_blank\">Disable-IPv6ForAcceptedDomain -Domain for each domain you want to opt out of IPv6 (Disable-IPv6ForAcceptedDomain (ExchangePowerShell) | Microsoft Learn)</a>.\n</p><p>IPv6 enablement may impact the source IP type used by Senders when connecting to Exchange Online, as the source and destination IP versions must match. For any IP Address-based Inbound connectors in Exchange Online that are referencing IPv4 addresses, you need to either:\n</p><ul><li>Keep the sending server as IPv4.\n<ul><li>Coordinate with the Sender so the Sender keeps connecting to your domain(s) via IPv4 or Opt your domain(s) out of IPv6\n</li></ul></li><li>Change the IP based connector to certificate domain based connector.\n<ul><li>This applies to both OnPremises type (From: <i>Your organization's email server</i>, To: <i>Office 365</i>) and Partner Type connectors (From: <i>Partner organization</i>, To: <i>Office 365</i>).</li></ul></li></ul><p></p><ul></ul><p></p><p>Update: If you are using any Exchange Transport Rules or Data Loss Prevention policies which rely on the SenderIPRanges predicate, you need to opt out all your domains from IPv6.</p><p>You can manage IPv6 for your Exchange Online Accepted Domains using the commands Enable-IPv6ForAcceptedDomain or Disable-IPv6ForAcceptedDomain.\n</p><p>Currently, you can check the status of your Accepted Domains with the Get-IPv6StatusForAcceptedDomain command. While some customers have already enabled IPv6, most will see it as disabled until October 16th.\n</p><p>After October 16, once IPv6 is enabled for your tenant, if you haven't explicitly set the IPv6 status for your Accepted Domains, the Get-IPv6StatusForAcceptedDomain command will reflect the new default behavior (enabled). \n</p><p><b>IMPORTANT:</b> To ensure your preferred settings are applied, please use the Enable-IPv6ForAcceptedDomain or Disable-IPv6ForAcceptedDomain commands before October 16th, after which IPv6 will be enabled by default if you haven't explicitly set it.</p><p>If you have enabled DNSSEC for mail flow, you may have issues executing the Get-IPv6StatusForAcceptedDomain cmdlet for the DNSSEC-enabled domain. We are rolling out the fix now. Please ensure to run Disable-IPv6ForAcceptedDomain to opt out of the IPv6 enablement if you need to opt a DNSSEC-enabled domain out of the IPv6 by default rollout. The IPv6 rollout will not affect DNSSEC-enabled domains until after Nov 18th.</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "IPv6 will be enabled for Exchange Online Accepted Domains starting October 16, 2024, to meet local regulations and enhance security. Organizations should update allow-lists and consider IP version matching for email connectors. Opt-out options and management commands are available if needed."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC835648",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-10T22:27:04.58Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-25T22:50:26Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Announcing IPv6 Enablement for Accepted Domains",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
