{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to access package approval settings in Entitlement Management. We're introducing a new configuration that will prevent Global Administrators and Identity Governance Administrators from bypassing approval settings configured in access package policies.<br></p><p><b>When this will happen:</b></p><p>Starting August 26, 2024</p><p><b>How this affects your organization:</b></p><p>You are receiving this message because our reporting indicates that your organization has one or more users with active access package assignments.<br></p><p>If a Global Administrator or Identity Governance Administrator attempts to directly assign a user to a package and selects a policy with an approval setting that they do not meet, then the request will need to be approved by a designated approver.</p><p><b>What you need to do to prepare:</b></p><p>No action is required on your end. This change is being rolled out to all customers and is in accordance with Microsoft Entra ID Governance best practices.</p><p>For additional information, click <a href=\"https://learn.microsoft.com/entra/id-governance/entitlement-management-access-package-assignments#directly-assign-a-user\" target=\"_blank\">here</a> to learn more.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting August 26, 2024, changes to Entitlement Management will enforce approval settings for Global Administrators and Identity Governance Administrators, preventing them from bypassing access package policy approvals. No action is needed from your organization as this is an automatic update."
    }
  ],
  "EndDateTime": "2024-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC847883",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-02T23:25:59.623Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-02T23:25:46Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Enforce policy approval settings for admins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
