{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We recently introduced a feature called Rewrite that uses Compose in Microsoft Edge. Rewrite helps end users edit text that they have typed into Microsoft Edge. This includes elaborating on text, re-writing, adjusting tone, formatting the text, and more.<br></p><p>We have received questions from customers regarding policy information related to Rewrite. To reduce customer confusion, we will walk through policies that can be used to allow or block Rewrite. We apologize that we missed providing advance notice of this change and for any confusion this change has caused.</p><p><b>When this will happen:</b></p><p>Rewrite has been rolled out to all customers as default on. Commercial data protection will apply to Rewrite for <a href=\"https://learn.microsoft.com/copilot/manage#commercial-data-protection-eligibility\" target=\"_blank\">eligible end users</a>&nbsp;signed in with their Entra ID. With commercial data protection, prompts and responses will not be logged or stored, visible to Microsoft employees, or used for large language model training purposes.</p><p><b>What you need to do to prepare:</b>\n</p><p>There is no action required by you; however, you can use the <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-policies#composeinlineenabled\" target=\"_blank\">ComposeInlineEnabled </a>policy to allow or block the Rewrite feature in Microsoft Edge. Compose in the Microsoft Edge sidebar must be managed separately with the <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-policies#hubssidebarenabled\" target=\"_blank\">HubsSidebarEnabled</a> policy. Data Loss Prevention (DLP) policies will be respected by the Rewrite feature.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Edge introduced a new feature, Rewrite, which aids in editing text. It's enabled by default with commercial data protection for eligible users. No action is needed, but policies are available to manage this feature's allowance or restriction. Apologies were made for any confusion caused by its rollout."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/deployedge/microsoft-edge-policies"
    }
  ],
  "EndDateTime": "2024-09-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC841237",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-07-29T21:47:43.76Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-29T21:47:30Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Rewrite in Microsoft Edge",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
