{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 13, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Before this rollout, in Microsoft Teams town halls, the videos that organizers and presenters share may appear cropped and display in a \"fill to frame\" view (that may cut important parts of the video) for attendees. To ensure a proper viewing experience for attendees, this rollout will ensure all videos shared in town halls will retain a 16:9 aspect ratio and a \"fit to frame\" view for attendees, with no cropping. Also, when content and video is shared, videos will appear in the center of the video section to the attendees (instead of in the upper right of the video section).\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-August 2024 and expect to complete by mid-August 2024.\n</p><p>General Availability (Worldwide and GCC): We will begin rolling late August 2024 and expect to complete by late September 2024 (previously late August).</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: Videos that the presenter and organizer share may be cropped and not centered in the video space:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nwW1?ver=cf14\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After the rollout: Attendees will see videos appear in a \"fit to frame\" view, without cropping, and centered in the video space:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nrG4?ver=60cb\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default and available to all Microsoft Teams users.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams updates will ensure videos in town halls are displayed in a \"fit to frame\" view without cropping, centered for attendees. Rollout begins mid-August 2024, with completion by late September 2024. This feature is default and requires no admin action, but users should be informed."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC841009",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-13T22:59:31.5Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-29T18:49:50Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Videos in town halls will display without cropping",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
