{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>For tenants with a Microsoft E5 license or Microsoft Compliance E5 license: AI Hub will soon be accessible to users with either a Microsoft Purview Compliance Administrator or Purview Security Reader role. The Purview Compliance Administrator has admin-level access to AI Hub with the ability to create policies and complete tasks. The Purview Security Reader is a read-only role allowing a user to view analytics, policies, and AI Interactions. Note: For specific capabilities, additional roles may be required. Learn more about the capabilities of both roles in AI Hub: <a href=\"https://go.microsoft.com/fwlink/?linkid=2276967\" target=\"_blank\">Permissions for AI Hub</a>.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=408542\" target=\"_blank\">408542</a>.</p><p>\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early August 2024 and expect to complete by mid-August 2024.\n</p><p>General Availability (<code>Worldwide</code>): We will begin rolling out mid-November 2024 and expect to complete by late November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: You can assign Microsoft Entra Global Administrator and Microsoft Entra Compliance Administrator to access AI Hub. This capability will not change after this rollout.\n</p><p>After this rollout: You will have the ability to assign either of the two new roles in the <a href=\"https://purview.microsoft.com\" target=\"_blank\">Purview portal</a> to those in your organization to grant access to AI Hub. You can choose to include these roles in a custom role group or to assign the built-in role groups for these roles.\n</p><p>This feature is on by default and accessible to all admins with the appropriate permissions.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Get ready for this change by reviewing the capabilities of both roles in AI Hub: <a href=\"https://go.microsoft.com/fwlink/?linkid=2276967\" target=\"_blank\">Permissions for AI Hub</a>. Align the capabilities with the level of access required to AI Hub to determine the correct role assignment.\n</p><p>Learn more: <a href=\"https://go.microsoft.com/fwlink/?linkid=2276967\" target=\"_blank\">Considerations for deploying Microsoft Purview AI Hub and data security and compliance protections for Microsoft Copilot | Microsoft Learn</a></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408542"
    },
    {
      "Name": "Summary",
      "Value": "New roles for accessing Microsoft Purview AI Hub will be available for Microsoft E5 or Compliance E5 license holders. The Purview Compliance Administrator and Purview Security Reader roles offer different levels of access. Rollouts begin in August 2024, with full availability by late November 2024. Preparation involves reviewing role capabilities and permissions."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC847878",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-02T23:24:02.517Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-02T23:23:07Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview AI Hub: Enabling new roles to access AI Hub",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
