{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Outlook for iOS is supported on the two most recent versions of iOS. When a new version of iOS is released, Outlook’s Operating System requirement becomes the two most recent versions: the current version and the previous version of iOS, iPadOS and watchOS.\n</p><p>With iOS 18 currently in beta, Outlook for iOS is preparing to drop support for iOS 16. In addition, once iOS 18 is released to GA, the system requirements for Outlook for iOS will be updated to reflect support for iOS 18. Microsoft will update the minimum system requirements for Outlook for iOS app from iOS 16 to iOS 17.\n</p><p>Microsoft will retire support for iPadOS 16 and watchOS 9. iPadOS 17 &amp; 18, watchOS 10 &amp; 11 will be the only supported versions for iPad and Apple Watch.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After iOS 18 is released, Outlook devices running iOS 16, or lower will no longer receive Office app updates.\n</p><p>At that time, customers will be able to continue to use the older version of Outlook for iOS. Once they update their device to iOS 17 or above, they will receive the newest version of Outlook.\n</p><p>Over time, Outlook for iOS on iOS 16 devices will eventually stop synchronizing email and calendar data, unless they have a supported version of iOS.\n</p><p>This change does not affect anyone using Outlook for iOS apps on iOS 17 or above.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend that you communicate this change to your users to ensure they update their device operating system.\n</p><p>Please visit&nbsp;<a href=\"https://www.microsoft.com/en-us/microsoft-365/microsoft-365-and-office-resources#coreui-heading-3b8v07b\" target=\"_blank\">Additional Information</a> to refer to the current minimum system requirements for Office 365.\n</p><p><br></p><p> \n</p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook for iOS will soon require iOS 17 as the minimum system requirement, dropping support for iOS 16 once iOS 18 is released. Users on iOS 16 will not receive updates and may eventually lose synchronization capabilities. It's recommended to update devices and inform users about these changes."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC847884",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-02T23:26:55.53Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-02T23:26:16Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "We've changed the minimum iOS system requirements for Outlook for iOS",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
