{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 9, 2024: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>\n</p><p>When eligible customers activate default labels and policies for Microsoft Purview Information Protection, labels will soon be scoped to files, email, and meetings.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398458\" target=\"_blank\">398458</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide):&nbsp; We will begin rolling out mid-October 2024 (previously late September) and expect to complete by mid-November 2024 (previously late October).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this change, default labels and policies are scoped to files and email.\n</p><p>After this rollout, activating the default labels will include meetings.&nbsp;</p><p>This rollout will not affect current sensitivity labels used by your organization. This rollout will only affect organizations that choose to activate default labels.\n</p><p>This change is on by default and accessible to all Purview admins with the appropriate permission.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Before the rollout begins, we will document the <a href=\"https://learn.microsoft.com/purview/mip-easy-trials#default-sensitivity-labels\" target=\"_blank\">default label scope</a> in <a href=\"https://learn.microsoft.com/purview/mip-easy-trials#default-sensitivity-labels\" target=\"_blank\">Learn about the default labels and policies to protect your data | Microsoft Learn</a>.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The rollout of default sensitivity labels and policies enhancements for Microsoft Purview Information Protection now includes meetings, in addition to files and email. The updated timeline is mid-October to mid-November 2024. This change is automatic and documentation will be provided for preparation."
    }
  ],
  "EndDateTime": "2024-12-30T19:15:00Z",
  "HasAttachments": false,
  "Id": "MC841050",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-09T22:59:09.32Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-29T19:15:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Default sensitivity labels and policies enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
