{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams is introducing a feature that allows organizers and co-organizers of meetings, webinars, and town halls to enable attendees to upvote significant questions and declutter by archiving questions from the main Q&amp;A feed.<br></p><p>This message is associated with Microsoft 365 Roadmap ID&nbsp;<a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398445\" target=\"_blank\">398445</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early-September 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Voting on questions: With voting enabled, attendees can prioritize questions by upvoting to move them to the top of the Q&amp;A feed. Organizers and co-organizers have the ability to organize questions by most upvoted or most recent. Voting is automatically activated in events using Q&amp;A. Organizers and co-organizers have the option to disable voting via the Q&amp;A settings.</p><p>Archiving Questions: Organizers and co-organizers have the option to archive questions from the main Q&amp;A feed. This feature is particularly useful for recurring meetings or events, where previous questions may no longer be relevant and need to be cleared from the main Q&amp;A feed.</p><p>They have the ability to archive questions individually or in bulk from the Q&amp;A feed. Once a question is archived, it gets moved to the archived Q&amp;A feed. Additionally, questions can be restored to the main Q&amp;A feed at any time.</p><p><b>What you need to do to prepare:</b><br></p><p>Notify the meeting organizers within your organization that voting and archiving features will be available for use in meetings, webinars, and town halls. The <a href=\"https://support.microsoft.com/office/q-a-in-microsoft-teams-meetings-f3c84c72-57c3-4b6d-aea5-67b11face787\" target=\"_blank\">Q&amp;A public documentation</a>&nbsp;will soon be updated to include details on voting and question archiving.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398445"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is rolling out a feature for meeting organizers to enable attendee voting on questions and archiving questions from the Q&A feed. This is part of Microsoft 365 Roadmap ID 398445 and will be available worldwide by late September 2024. Organizers should be notified to prepare for these updates."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2024-11-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC844923",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-01T00:39:17.36Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-01T00:35:27Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Voting and archiving questions in Teams Q",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
