{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 17, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>A new feature for Microsoft OneDrive enables bulk export of device status, including username, sync app version, known folders, last sync date, and sync errors.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=88870\" target=\"_blank\">88870</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out early July 2024 and expect to complete by early January 2025.&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 (previously early December) and expect to complete by late March 2025 (previously January).</p><p><b>How this will affect your organization:</b>\n</p><p>You will be able to export <a href=\"https://learn.microsoft.com/sharepoint/sync-health\" target=\"_blank\">OneDrive sync report</a>&nbsp;data through <a href=\"https://learn.microsoft.com/graph/data-connect-concept-overview\" target=\"_blank\">Microsoft Graph Data Connect</a>. The data is transferred to a Microsoft Azure account owned by the tenant, where you can use tools like Azure Synapse and Power BI to transform this into insightful reports and dashboards.</p><p><b>What you need to do to prepare:</b>\n</p><p>Make sure that OneDrive sync reports are enabled on your organization's devices so that the data is available for export.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "88870"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft OneDrive is introducing a bulk data export feature for admin reports, with a rollout from July 2024 to March 2025. It allows the export of device status reports via Microsoft Graph Data Connect to Azure for insightful reporting. Organizations should enable OneDrive sync reports to prepare."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC844917",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-18T00:23:04.68Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-01T00:32:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: Bulk data export for OneDrive Sync admin reports",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
