{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 11, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In new Outlook for Windows and web, when single-clicking on an empty time slot on the calendar surface, the quick compose pop-up will no longer appear. Instead, you will be able to create an appointment by typing directly in the time slot on the calendar grid, just as you can in classic Outlook for Windows. There will be no change to double-click behavior; the full compose form will still open as it does today.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=406948\" target=\"_blank\">406948</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early December 2024 (previously early November) and expect to complete by late February 2025 (previously early January).\n</p><p>General Availability (Worldwide): We will begin rolling out late January 2025 (previously early December) and expect to complete by late March 2025 (previously early February).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>This may affect how users create appointments quickly on the calendar surface. We expect this to be a better experience, especially for those familiar with classic Outlook inline appointment creation.\n</p><p>This update is available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "406948"
    },
    {
      "Name": "Summary",
      "Value": "Outlook's quick compose pop-up will be replaced with inline appointment creation in the new Outlook for Windows and web. The rollout begins in December 2024 and completes by March 2025. No admin action is required, but users should be informed of this change."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-05-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC846387",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-11T22:52:56.867Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-01T22:51:48Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Replace quick compose pop-up with inline appointment creation in new Outlook for Windows and web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
