{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 10, 2024: We have updated the content and timeline below with additional information&nbsp;</p><p>Starting August 2024 for classic Outlook for Windows, we will add new built-in reporting buttons that allow users to report emails as phishing / junk / not junk.&nbsp; Admins can control the appearance and behavior of these buttons from the<i> </i><a href=\"https://security.microsoft.com/securitysettings/userSubmission\" target=\"_blank\"><i>User reported</i> settings</a> page in the Microsoft 365 Defender portal (<a href=\"https://security.microsoft.com/\" target=\"_blank\">security.microsoft.com</a>). Admins can also customize where messages get reported to (reporting mailbox, Microsoft, or both) and what the user sees both before and after reporting messages from these buttons. Your current <i>User reported</i> settings page will not be changed by this rollout.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=371388\" target=\"_blank\">371388</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability: If you are on the monthly enterprise/current channel build of Outlook, we will begin rolling out early August 2024 and expect to complete by mid-November 2024 (previously late September).</p><p>\n</p><p>\n</p><p>Rollout to additional channels will follow the standard timing.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Classic Microsoft Outlook for Windows users do not see reporting buttons.\n</p><p>After the rollout:</p><ul><li>OWA (Outlook on the web) and new Outlook for Windows have had this functionality since November 2022 and there is no change to it.\n</li><li>The new built-in buttons on Outlook for Windows will inherit your existing User reported settings from OWA.\n</li><li>Other versions of Outlook such as Mac, Mobile (iPhone and Android) will not be affected by this change. We are working on the adding the reporting buttons to other versions of Outlook.\n</li><li>If you have the reporting feature turned off in the Microsoft 365 Defender <i>User reported</i> settings page or are using a third-party add-in, the reporting buttons in classic Outlook for Windows won't be visible.\n</li><li>The Microsoft reporting add-in (the Microsoft report message add-in and the Microsoft phishing add-in) will be supported until further notice. Customers who currently use the add-in and the new reporting buttons will see two sets of reporting buttons in the ribbon.  However, when Outlook Mac and Mobile add the new reporting buttons in the near future, the reporting add-in will no longer be needed and can be removed.</li><li>The selections you make on the user reported settings page will determine the reporting experience for your users whether they choose the add-in or built-in reporting option in Outlook. Either option will report to the same place (Microsoft, custom mailbox, or both) based on the <i>User reported</i> settings selected.\n</li><li>Unlike OWA and new Outlook for windows, the built-in reporting buttons in classic Outlook for windows do not support reporting from shared and delegate mailboxes.\n</li></ul><p>New reporting buttons and menu options in Outlook Classic:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nzyW?ver=26fc\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/defender-office-365/submissions-outlook-report-messages\" target=\"_blank\">Report phishing and suspicious emails in Outlook for admins - Microsoft Defender for Office 365 | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/defender-office-365/submissions-user-reported-messages-custom-mailbox?view=o365-worldwide\" target=\"_blank\">User reported settings - Microsoft Defender for Office 365 | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "371388"
    },
    {
      "Name": "Summary",
      "Value": "Starting August 2024, classic Outlook for Windows will integrate new reporting buttons for phishing, junk, and not junk emails. Admins can customize these buttons and reporting options via the Microsoft 365 Defender portal. This update is part of Microsoft 365 Roadmap ID 371388."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC841229",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-10T22:50:40.34Z",
  "Services": [
    "Exchange Online",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-07-29T21:46:20Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Classic Microsoft Outlook for Windows: New reporting buttons integrated with Microsoft Defender for Office 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
