{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Bulk emails play a crucial role in modern enterprise communications. Determining the right balance of these messages—what should be allowed and what should be blocked—poses a significant challenge. Many organizations default to standard settings, often leading to issues like false positives (FP) and false negatives (FN) in email.<br></p><p>With <a href=\"https://learn.microsoft.com/en-us/defender-office-365/anti-spam-bulk-senders-insight\" target=\"_blank\">Bulk Senders Insight</a>&nbsp;in Microsoft Exchange Online Protection powered by Microsoft Defender for Office 365, admins will have a simulation tool that empowers them to fine-tune bulk email policies. This tool offers real-time simulations to help identify the optimal BCL (bulk complaint level) and potential FPs and FNs based on user preferences across your tenant. By simulating changes in BCL and Simulation Sender Quality, potential issues like FP and FN can be identified and mitigated, ensuring efficient email communications aligned with user preferences.</p><p><b>When this will happen:</b><br></p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out mid-August 2024 and expect to complete by mid-September 2024.<br></p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Admins faced challenges in configuring the allow and block list for bulk emails.&nbsp;</p><p>After this rollout: Admins will have the ability to determine the optimal BCL using the simulation tool, ensuring that any adjustments are data driven. There will be no impact on mail flow or end users unless admins choose to modify the BCL thresholds based on the simulation results.</p><p>This feature is off by default and available to all Exchange customers with the appropriate permissions.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nJlH?ver=32df\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b><br></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Learn more<br></p><ul><li><a href=\"https://learn.microsoft.com/defender-office-365/anti-spam-bulk-senders-insight\" target=\"_blank\">Bulk senders insight - Microsoft Defender for Office 365 | Microsoft Learn</a>\n</li><li><a href=\"https://techcommunity.microsoft.com/t5/microsoft-defender-for-office/introducing-bulk-senders-insight-optimizing-bulk-email/ba-p/4193963\" target=\"_blank\">Introducing Bulk Senders Insight: Optimizing Bulk Email Management for Enterprises - Microsoft Community Hub</a><br></li></ul><p><br></p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office 365 introduces Bulk Senders Insight, a tool to optimize bulk email management. It helps admins fine-tune bulk email policies by simulating the optimal bulk complaint level and identifying potential issues. Rollout begins mid-August 2024 with no admin action required before then."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC856754",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-09T23:02:08.267Z",
  "Services": [
    "Exchange Online",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-09T23:01:52Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Introducing Bulk Senders Insight to optimize bulk email management for enterprises",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
