{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 3, 2024: We have updated the content. \n</p><p>\n</p><p>Go to Connections button is now rolling out to customers. It will show up on your company's intranet site header in a few days.<br></p><p>If your company is not ready to roll out Viva Connections to your employees, you can turn it off using the navigation setting which is now 100% GA and available to all customers. Thank you for your patience.</p><p>Microsoft Viva Connections is already available in any browser, giving your employees easy access to Viva Connections outside of Teams.\n</p><p>We are working on an additional entry point to access Viva Connections on web. This entry point will allow your employees to access Connections on web from your organization's Microsoft SharePoint home site.</p><p>Navigation setting to turn the link to Connections on your SharePoint home site is starting to release now and will be available to you in next few days as we continue rolling out.</p><p>\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late August 2024 (previously early August) and expect to complete by early September 2024 (previously mid-August).\n</p><p>General Availability (Worldwide, GCC, GCCH, DoD): We will begin rolling out early September (previously mid-August) 2024 and expect to complete by late October 2024 (previously late September).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this release, the <i>Go to Connections</i> link will display in the upper right of your company's SharePoint home site menu. This feature will be on by default and accessible to all users in your tenant unless you turn it off.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nJkL?ver=5075\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b><br></p><p>Go to Connections button is now rolling out to all customers. It will show up on your company's intranet site header.<br></p><p>\n</p><p>If your company is not ready to roll out Viva Connections to your employees, you can turn it off using the navigation setting.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nBOZ?ver=3b1d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The 'Go to Connections' button for Microsoft Viva Connections is now rolling out and will appear on SharePoint site headers soon. Companies can disable it using the navigation setting. Rollouts began in August and will continue until October 2024. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC855689",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-03T21:38:06.283Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T22:59:55Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "(Update) Microsoft Viva: Updates to Connections on the web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
