{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for new Outlook for Windows and new Outlook for the web: Use the Alt key to access key tips for Outlook. Alternatively, Win+Alt will continue to work.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=403109\" target=\"_blank\">403109</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out mid-September 2024 and expect to complete by mid-September 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>Users who are accustomed to using only Alt to review key tips will now be able to do so. Users who are accustomed to using Win+Alt will not be impacted.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "403109"
    },
    {
      "Name": "Summary",
      "Value": "Outlook will soon allow using the Alt key for key tips. The rollout starts mid-August 2024, completing by late August for worldwide users, and from mid-September to mid-September for GCC, GCC High, DoD. No admin action is required, but user notification is advised. Microsoft 365 Roadmap ID 403109."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-11-22T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC851627",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-05T22:48:20.503Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 suite",
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-05T22:48:05Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "New Microsoft Outlook and Microsoft Outlook on the web: Using the Alt key to access key tips",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
