{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The <i>Manage what attendees see</i> feature in Microsoft Teams helps organizers to easily deliver polished events by simplifying the attendee view and keeping the focus on participants who have been brought onscreen. With this rollout, we are enhancing <i>Manage what attendees see</i> with new intuitive controls to make it even simpler to produce an event and create a professional viewing experience for attendees. This message applies to Teams on Windows desktop and on the web.\n</p><p><b>When this will happen:</b>\n</p>Targeted Release: Available now.\n<p></p><p>General Availability (Worldwide, GCC): We will begin rolling out in late August 2024 and expect to complete by early September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: The <i>Manage what attendees see</i> feature requires users to bring presenters on or off screen with a two-step process using the presenter's context menu.\n</p><p>After this rollout: The <i>Manage what attendees see</i> feature enhancements will include new toggles to bring presenters on or off screen, live indicators, pinning, pagination, and a new fit-to-frame presenter layout in <i>Manage screen</i> in the left panel.\n</p><p>Any new meetings or events created after mid-September 2024 will receive the new <i>Manage what attendees see</i> feature.\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>We recommend you review the updated <a href=\"https://support.microsoft.com/office/manage-what-attendees-see-in-teams-meetings-19bfd690-8122-49f4-bc04-c2c5f69b4e16\" target=\"_blank\">Manage what attendees see in Teams meetings - Microsoft Support</a> for a comprehensive overview of the feature and conduct a test session with the feature turned on to get acquainted with the new controls.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is enhancing the \"Manage what attendees see\" feature with new intuitive controls for a simpler event production and professional attendee viewing experience. This update is already available for Targeted Release and will roll out globally from late August to early September 2024. The update will apply automatically, with no admin action needed, but users should be informed and documentation updated. A test session is recommended to familiarize with the new controls."
    }
  ],
  "EndDateTime": "2024-10-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC859870",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-13T00:18:19.863Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-13T00:18:04Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Improvements to the \"Manage what attendees see\" feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
