{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Syntex (Microsoft SharePoint Premium) pay-as-you-go services: We will update the service setting to only process files where you have applied a model to a library on an enabled site. Before this rollout, if you make a model available to process files on a site and then disable the site, this action will not disable the model. After the rollout, you can still use models to process files and incur charges. You can make a model available to process files by creating a model on that site or in a content center. This change will make the model processing consistent with the other content processing services.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early September 2024 and expect to complete by mid-September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: All files are processed in a site library where a model has been applied, even after the service has been disabled for that site. \n</p><p>After this rollout: Files will no longer be processed unless the service is enabled for the site. This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>If you have applied models to sites where you want processing to continue, you must enable the Syntex service for that site. \n</p><p><i>Learn more about managing sites that require you to enable a service:</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/syntex/prebuilt-setup\" target=\"_blank\">Set up and manage prebuilt document processing in Microsoft Syntex - Microsoft Syntex | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365/syntex/structured-freeform-setup\" target=\"_blank\">Set up and manage structured and freeform document processing in Microsoft Syntex - Microsoft Syntex | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365/syntex/unstructured-setup\" target=\"_blank\">Set up and manage unstructured document processing in Microsoft Syntex - Microsoft Syntex | Microsoft Learn</a>&nbsp;</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint document models will only process files on enabled sites post-September 2024 rollout. Before, models processed files even if the site was disabled. Changes apply automatically; no admin action needed before rollout. Ensure Syntex service is enabled on sites where processing should continue."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC856748",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-09T23:00:32.783Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-09T22:59:02Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint: document processing models will no longer process files if the service is not enabled for the site",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
