{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Attacker in the Middle detection will be Generally Available for users in Microsoft Entra ID Protection.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This high-precision detection will be triggered on a user account that has been compromised by an adversary who has intercepted the user's credentials, including tokens issued to the user. The risk is identified through Microsoft 365 Defender and will elevate the user to high risk, triggering the configured Conditional Access policy.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/entra/id-protection/concept-identity-protection-risks\" target=\"_blank\">What are risks in Microsoft Entra ID Protection - Microsoft Entra ID Protection | Microsoft Learn</a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Attacker in the Middle detection feature will be generally available in Microsoft Entra ID Protection by late August 2024, enhancing security by identifying compromised user accounts. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC855696",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-08T23:01:57.123Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T23:01:24Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Entra ID: Attacker in the Middle detection alert in ID Protection is GA",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
