{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Two new Microsoft Graph APIs will soon be generally available:\n</p><ul><li>update admin report settings\n</li><li>get admin report settings\n</li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We began rolling out early August 2024 and expect to complete by mid-August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>These two APIs help Global admins change how usernames, group names, and site names are displayed in the Microsoft 365 admin center based on their organization’s privacy practices without having to manually change the setting in <i>Org settings &gt; Services &gt; Reports.</i> User, group and site names are concealed by default. When this setting is changed, administrative roles and the report reader role will be able to see identifiable user-level information<i> if they have access to user/group/site level information.</i> Changing the setting in <i>Org settings &gt; Reports</i> using the Graph API or Graph user interface is a logged event in the Microsoft 365 Compliance Center Audit log.\n</p><p>The update admin report setting API requires Global admin permissions. Learn more: <a href=\"https://learn.microsoft.com/graph/api/resources/report?view=graph-rest-beta\" target=\"_blank\">Working with Microsoft 365 usage reports in Microsoft Graph - Microsoft Graph beta | Microsoft Learn</a>.\n</p><p>This feature is accessible to all Global admins with the appropriate permissions.\n</p><p>The Data privacy control for Microsoft 365 admin center reports at <i>Org settings &gt; Services &gt; Reports:</i>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nW0V?ver=b3e4\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/graph/api/resources/adminreportsettings?view=graph-rest-beta\" target=\"_blank\">adminReportSettings resource type - Microsoft Graph beta | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details the general availability of Microsoft Graph API v1.0 for managing names and the upcoming release of two APIs for updating and getting admin report settings. Rollout starts early August 2024, with completion by mid-August. Global admins can change name display settings in the Microsoft 365 admin center. No action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC859853",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-13T00:07:03.413Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-13T00:06:53Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Graph API is generally available in v1.0 to manage username, group names, and site names",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
