{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 3, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>When investigating alerts in Microsoft Purview Insider Risk Management, you can now use the power of Microsoft Copilot for Security. This tool not only provides concise alert summaries but also allows you to delve into specific user activities. By doing so, you can promptly assess whether the user associated with the alert warrants further investigation or if the alert can be safely dismissed. Also, in one click, you can obtain a summary of the user’s risk profile, highlighting crucial details and top risk factors. Copilot for Security streamlines investigations by reducing the triage workload and enabling faster decisions.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=407864\" target=\"_blank\">407864</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early August 2024 and expect to complete by late August 2024. \n</p><p>General Availability (Worldwide): We will begin rolling out early June 2025 (previously early March) and expect to complete by late June (previously late March)</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Customers with Copilot for Security licenses can use it for alert summarization only.\n</p><p>After this rollout, enhanced alert and user investigation with Copilot for Security in Purview Insider Risk Management:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b7191ee7-8eb2-44b3-a4a7-6d442796ef56\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Using Copilot for Security in Purview Insider Risk Management for Exfiltration actions involving the user:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/4bb18166-900e-40a7-8965-0782ea30fb15\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You must have a Copilot for Security license configured for your tenant and give proper permissions to users who will use this feature. Learn about <a href=\"https://learn.microsoft.com/security-copilot/get-started-security-copilot#assign-roles-to-users\" target=\"_blank\">permissions required to access Copilot for Security: Copilot for Security</a>.\n</p><p>Access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/copilot-in-purview-overview\" target=\"_blank\">Microsoft Copilot for Security in Microsoft Purview | Microsoft Learn</a>.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "407864"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management now includes enhanced alert and user investigation with Microsoft Copilot for Security. The rollout timeline has been updated, with public preview in August 2024 and general availability in June 2025. Users need a Copilot for Security license and proper permissions. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC851630",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-03T16:26:29.53Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-05T22:49:26Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Enhanced alert and user investigation with Microsoft Copilot for Security",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
