{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 30, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Before this rollout, Global admins used the Microsoft MSCommerce PowerShell to manage self-service trials and purchases by users. After this rollout, the Microsoft 365 admin center will have new settings for Global admins to manage user actions for eligible products with self-service trials and purchases. The MSCommerce PowerShell option will continue to be available.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2024 and expect to complete by early October 2024 (previously late September).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Global admins can access the new settings in the Microsoft 365 admin center at <i>Settings &gt; Org Settings &gt; Self-service trials and purchases</i> (<a href=\"https://admin.microsoft.com/Adminportal/Home#/Settings/manageselfservicepurchase\" target=\"_blank\">Edit Self-Service trials and purchases</a>):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1mX0R?ver=879a\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>An example of the new options for managing self-service trials and purchases (for Microsoft Planner):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nJ1N?ver=aec9\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Self Service trial and purchase settings are enabled default and accessible to all Microsoft 365 Global admins. As future self-service options are launched by products, they will be available to manage in this new setting.</p><p>You can review the new settings at Settings - Microsoft 365 admin center or use your MSCommerce PowerShell scripts to disable them. Note that the release of the self-service purchase settings in the Admin Center honor your existing state and do not override your current status settings set in PowerShell. <a href=\"https://learn.microsoft.com/microsoft-365/commerce/subscriptions/allowselfservicepurchase-powershell?view=o365-worldwide#view-a-list-of-self-service-purchase-products-and-their-status\" target=\"_blank\">Learn more: Manage self-service purchases and trials (for admins) | Microsoft Learn.</a></p><p>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/commerce/subscriptions/manage-self-service-purchases-admins?view=o365-worldwide\" target=\"_blank\">Manage self-service purchases and trials (for admins) | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft 365 admin center is introducing new settings for Global admins to manage self-service trials and purchases. Rollout begins mid-September 2024, with completion by early October 2024. Admins can access these settings under Org Settings, with the MSCommerce PowerShell option remaining available."
    }
  ],
  "EndDateTime": "2024-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC853238",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-30T22:46:00.79Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-06T22:50:33Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: New self-service purchase and trial settings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
