{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for new Microsoft Outlook for Windows and the web: When focused on the folder pane, users will be able to press Ctrl+Y and the first letter of the folder name to quickly navigate to a folder.\n</p><ol><li>If a user enters the same letter multiple times, the selection will jump to the next matching folder.\n</li><li>Users can enter all or part of specific folder names. For example: Press Ctrl+Y and enter \"dele\" to jump to the \"Deleted Items\" folder.\n</li></ol><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=403108\" target=\"_blank\">403108</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out late July 2024 and expect to complete by late August 2024.\n</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late August 2024 and expect to complete by mid-September 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>Before this rollout, users scroll to find the desired folders.\n</p><p>This feature is on by default and available to all users of Outlook for Windows and the web.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/keyboard-shortcuts-for-outlook-3cdeb221-7ae5-4c1d-8c1d-9e63216c1efd#PickTab=Classic_Outlook\" target=\"_blank\">Keyboard shortcuts for Outlook - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Microsoft Outlook update allows users to quickly navigate to folders using the Ctrl+Y shortcut and typing the folder name. This feature is rolling out from late July to mid-September 2024 and will be on by default. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC859862",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-13T00:14:06.253Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-13T00:13:35Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows and the web: Use the Ctrl Y shortcut to jump to a folder",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
