{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of MC696169 (Updated) <i>Legacy SharePoint Invitation Manager is being retired</i> (originally published December 2023, updated January 2024), we have retired all related settings from the Microsoft SharePoint admin center. The only setting specific to the legacy Invitation Manager (that retired late February 2024) is the setting for <i>Guests must sign in using the same account to which sharing invitations are sent</i>. Please note that all link sharing today requires guests to accept link sharing invitations with the account that was invited. If your users want guests to access links with a different account, users should select the <i>Anyone </i>link sharing setting instead.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The setting <i>Guests must sign in using the same account to which sharing invitations are sent</i> will no longer appear in the SharePoint admin center. As the SharePoint Invitation Manager has already been retired, there is no behavior change in the product.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nt4A?ver=ecc2\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>We recommend using the <i>Anyone</i> link sharing setting, which admins can enable in the SharePoint admin center as shown below. Learn how to configure external sharing to meet your organization's needs: <a href=\"https://learn.microsoft.com/sharepoint/deploy-file-collaboration\" target=\"_blank\">Plan and deploy a file collaboration environment - SharePoint - SharePoint in Microsoft 365 | Microsoft Learn</a>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nJ0i?ver=ba0d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message informs that the Legacy SharePoint Invitation Manager settings have been retired, with the specific setting for guests to sign in with the invited account no longer appearing. The SharePoint Invitation Manager's retirement doesn't change product behavior. It recommends using the 'Anyone' link sharing setting and provides a link for configuring external sharing. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC854657",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-08T02:32:58.663Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T02:32:31Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Legacy Microsoft SharePoint Invitation Manager settings have retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
