{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Entra ID, device-based Conditional Access to Microsoft 365 and Microsoft Azure resources on Red Hat Enterprise Linux will be generally available.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\nr></p><p>This release extends support to Red Hat Enterprise Linux 8.x and 9.x (LTS) and enables these capabilities:\n</p><ul><li>Entra ID registration and enrollment of Red Hat LTS (8/9) desktops.\n</li><li>Conditional Access policies protecting web applications with Microsoft Edge.\n</li><li>Provides SSO for native and web applications (such as Microsoft Azure CLI, Microsoft Edge Browser, Microsoft Teams PWA, and more) to access Microsoft 365 and Azure protected resources.\n</li><li>Standard Microsoft Intune compliance policies.\n</li><li>Support for Bash scripts with custom compliance policies.\n</li><li>Package Manager now supports Red Hat Enterprise Linux RPM packages in addition to Linux Debian DEB packages.\n</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/mem/intune/fundamentals/deployment-guide-platform-linux\" target=\"_blank\">Deployment guide for Linux device management | Microsoft Learn</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Device-based Conditional Access for Microsoft 365 and Azure on Red Hat Enterprise Linux is going GA in mid to late August 2024. It brings Entra ID registration, Conditional Access policies, SSO, Intune compliance, and support for Red Hat RPM packages. No admin action is required before rollout."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC855692",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-08T23:00:58.287Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T23:00:40Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Entra ID: Device-based Conditional Access to M365/Azure resources on Red Hat Enterprise Linux is GA",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
