{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 13, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>As communicated in MC816207 <i>Microsoft Forms now supports live data sync to Microsoft Excel with more functionality</i> (July 2024), Microsoft Forms is introducing a new data sync solution with higher reliability to sync Forms response data to Microsoft Excel for the web. Before this rollout. Forms supported an older version of live data sync to Excel.<b> The older version of live data sync will be replaced by the newer solution on January 13, 2025.</b> This message describes the support that we will provide for migrating from the older solution to the newer solution.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=410988\" target=\"_blank\">410988</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Support for migrating the older data sync to the new solution will begin rolling out late September 2024 (previously late August), and we expect to complete by early October 2024 (previously early September).<br></p><p><b>How this will affect your organization:</b><br></p><p>Users who rely on the older version to sync data from Forms to Excel will need to manually update the data sync to the new solution after October 20, 2024. After this date, existing Excel files with the older data sync will be retained but will no longer receive automatic data updates from Forms.<br></p><p>The older version of the data sync exists in two types of Forms:&nbsp;&nbsp;</p><ul><li>Forms created from Microsoft OneDrive and Excel for the web \n</li><li>Group forms created with SharePoint Online, Microsoft Teams, and Microsoft 365 Groups.\n</li></ul><p>For these two types of Forms, we will provide this support to migrate to the new solution:</p><ul><li>Users who own Forms with the older version of the data sync will get notifications through email, Forms, and Excel for the web.</li><li>In Forms, users will be able to recreate the data sync with the new solution. A new worksheet will be created in the same workbook as the older data sync. The new worksheet will be connected to the latest data from Forms.  \n</li><li>After the older solution is retired, the user can still recreate a new data sync to the Excel workbook. \n</li></ul><p>\n</p><p>\n</p><p>For workflows that connect to Excel data from Forms responses (such as Power Automate workflows), users will need to update the workflow to the Forms connector for new response updates. Learn more: <a href=\"https://support.microsoft.com/office/create-an-automated-workflow-for-microsoft-forms-dee28c00-503a-48b3-89df-91a5084e6e43\" target=\"_blank\">Create an automated workflow for Microsoft Forms - Microsoft Support</a><br></p><p><b>Note:</b> The new data sync can only be triggered in Excel for the web. If users want to receive new Forms response data in the Excel desktop app, open the file in Excel for the web, and then wait for the desktop app file to sync from the web file. (Support for other versions of Excel is in progress.)<br></p><p>The new data sync solution will be on by default and available to all Forms and Excel for the web customers.&nbsp;</p><p>Notification in Forms to update workbook to continue syncing with Forms:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nJaK?ver=b74a\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>Notification in Excel for the web to update the data sync to new solution:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nJaL?ver=93ec\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>Excel workbook is successfully updated to new solution:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nBGG?ver=c8ef\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p><b>What you need to do to prepare:</b><br></p><ul><li>Send a notification to impacted users and groups to migrate their data syncs to new solution.</li><li>Share the migration solution if users report they cannot get Forms data updated in Excel.</li><li>Learn more: <a href=\"https://techcommunity.microsoft.com/t5/microsoft-forms-blog/introducing-forms-data-sync-to-excel/ba-p/4036051\" target=\"_blank\">Introducing Forms data sync to Excel - Microsoft Community Hub</a></li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Before rollout, we will update this post with revised documentation.<code><br></code></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410988"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Forms introduces a new, more reliable data sync to Excel for the web, replacing the older version on January 13, 2025. Migration support begins late September 2024. Users must manually update to the new solution after October 20, 2024, to continue syncing data from Forms to Excel. Notifications and support for migration will be provided. The message is associated with Microsoft 365 Roadmap ID 410988."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC855685",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-13T22:41:58.473Z",
  "Services": [
    "Microsoft Forms"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T22:56:38Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Forms | Data sync to Microsoft Excel: Support for migrating from the older solution to the new solution",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
