{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Active Directory Federation Services (AD FS) application migration wizard will provide IT admins with a guided experience to migrate AD FS relying party applications from AD FS to Microsoft Entra ID. \n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2024 and expect to complete by late August 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The Active Directory Federation Services (AD FS) application migration wizard allows users to quickly identify which AD FS relying party applications are compatible with being migrated to Microsoft Entra ID. The tool shows the migration readiness of each application, highlights issues and suggests actions to remediate them, and guides users through preparing individual applications for migration and configuring their new Microsoft Entra applications.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/entra/identity/enterprise-apps/migrate-ad-fs-application-howto\" target=\"_blank\">Use AD FS application migration to move AD FS apps to Microsoft Entra ID</a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The AD FS application migration wizard for Microsoft Entra ID is now generally available, providing a guided experience for migrating AD FS relying party applications. Rollout begins mid-August 2024, with completion expected by late August. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC855698",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-08T23:02:43.173Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T23:02:23Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Entra ID:  Active Directory Federation Services (AD FS) application migration wizard is GA",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
