{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 4, 2024: We have updated the rollout timeline below. Thank you for your patience</p><p>Microsoft is releasing a new <i>Admin-Controlled Migration to New Outlook</i> policy that will allow IT admins to migrate users from classic Outlook for Windows to new Outlook for Windows.<br></p><p><u>User experience\n</u></p><p>Enabling this policy (see instructions below) switches users from classic Outlook to new Outlook in three steps. Each step runs on a new app session (app launch).&nbsp;</p><p>Step 1: Users see a teaching callout encouraging them to try the new Outlook in the first session after the migration policy is enabled.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nGu9?ver=d5b0\" style=\"width: 300px;\"></p><p> \n</p><p>Step 2: If users don’t switch to new Outlook in step 1, they’ll see this Business bar message in the next session: “Your organization recommends using the new Outlook for Windows. If you skip this now, you’ll be taken to the new experience the next time you start Outlook.”<br><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nE0g?ver=a598\" style=\"width: 800px;\"></p><p>Step 3: Users see a blocking prompt encouraging them to switch to new Outlook. Users will be able to toggle back to classic Outlook for Windows any time.</p><p>&nbsp;<img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nE0t?ver=47cd\" style=\"width: 300px;\"></p><p><u>\n</u></p><p><u>Pre-requisite to enabling the policy</u></p><p>The new Outlook toggle should be available to users; users will not see the migration experience if the new Outlook toggle is hidden via group policy (GPO) or Windows Registry key. If you previously disabled access to the toggle, you can enable it by following the instructions here: <a href=\"https://learn.microsoft.com/exchange/clients-and-mobile-in-exchange-online/outlook-on-the-web/enable-disable-employee-access-new-outlook#use-the-registry-to-enable-or-disable-the-new-outlook-toggle-in-outlook-desktop\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Enable or disable access to the new Outlook for Windows</a>.</p><p><u style=\"\">Setting the policy</u><br></p><ul><li>Policy name:<b> </b><i>Admin-Controlled Migration to New Outlook</i></li><li>Possible values (Boolean): 1 (enabled) / 0 (disabled)</li></ul><p>This is a GPO and can be managed via Cloud Policy. It can also be deployed as a Registry key: <code><b>HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\16.0\\Outlook\\Options\\General</b> “DoNewOutlookAutoMigration”: dword:00000001</code></p><p>The migration will run only once until users switch to new Outlook. You can set the interval policy (see below) to re-initiate migration in the scenario that users toggle back to classic Outlook. The policy functionality can be used in Current Channel Version 2406 (Build 16.0.17830.20138).</p><p><u>Policy to define the interval between migration attempts</u><br>A new <i>Interval between new Outlook migration attempts&nbsp;</i>policy can be used to re-initiate the migration to new Outlook for Windows if users switch back to classic Outlook, based on the defined interval.<br></p><p>Pre-requisite: The admin-controlled migration policy must be enabled for this policy to be respected.<br></p><ul><li>Policy name: <i>Interval between new Outlook migration attempts\n</i></li><li>Possible values:<br>0/Not set: New Outlook for Windows migration will not be re-initiated.<br>1: Migration will be attempted each time and users will see the blocking prompt (as in step 3) on every launch of classic Outlook for Windows.<br><code>2-99000 (N): Migration will be re-initiated from step 1 N days after user switches back.</code></li></ul><p>This is GPO and can be managed via Cloud Policy. It can also be deployed as a Registry key: <code><b>HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\16.0\\Outlook\\Options\\General</b> “NewOutlookAutoMigrationRetryIntervals”: dword:00000001</code></p><p>Important note<i>:</i>&nbsp;new Outlook is not supported in on-premises environments and in sovereign clouds.</p><p><b>When will this happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out early August 2024 and expect to complete by mid-September 2024 (previously mid-August).</p><p><b>How this will affect your organization:</b><br></p><p>No changes will be made unless you enable this policy for a set of or for all of your users. Users who have this policy enabled will go through the migration flow as described above.</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required to prepare for the rollout. Organizations ready to migrate users to the new Outlook for Windows can use this policy.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft has updated the Admin-Controlled Migration to New Outlook policy, allowing IT admins to migrate users from classic to new Outlook for Windows. The migration involves a three-step process to encourage users to switch, with prerequisites and settings detailed for policy implementation. Rollout begins early August 2024, completing by mid-September 2024."
    }
  ],
  "EndDateTime": "2024-10-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC854648",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-04T22:25:34.003Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T02:26:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Admin policy to migrate users from classic Outlook to new Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
