{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We would like to inform you about an upcoming change to the Copilot experience for Entra ID users in the Microsoft Edge mobile application. Starting with version 128 in late August 2024, the Copilot button that provides access to work and web chat for Entra ID users will be retired. Copilot and the corresponding settings will be removed from the Edge mobile application for Entra ID users. Work and web chat will be available to Entra ID users through the Microsoft 365 mobile application.\n</p><p>Please note that in versions prior to Edge version 128, the Copilot button may still function temporarily, but the feature is expected to be completely removed by mid-September.\n</p><p><b>When this will happen</b>\n</p><p>This update will occur in late August 2024, with the release of version 128 for the Edge mobile application on iOS and Android devices.\n</p><p><b>What you need to do to prepare</b>\n</p><p>There is no action required by you. However, you may want to inform your users about this upcoming change and guide them to use Copilot for work and web chat in the Microsoft 365 mobile application.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Copilot feature in the Microsoft Edge mobile app for Entra ID users will be retired with version 128 in late August 2024. Users should use the Microsoft 365 mobile app for work and web chat instead. No action is required, but informing users is recommended."
    }
  ],
  "EndDateTime": "2024-10-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC853228",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-06T22:45:38.237Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-06T22:44:58Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Copilot in the Microsoft Edge mobile application is being retired for Entra ID users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
