{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 16, 2025: The deprecation for old data sync solution will start from Jan 20th, 2025. For GCC, the deprecation will start from Feb 13th, 2025.\n</p><p>After the old data sync solution has been deprecated, existing Excel workbooks using the old data sync solution will no longer receive new responses. Users can still migrate these existing Excel workbooks to the new data sync solution to receive new responses when needed.\n</p><ul><li>&nbsp;For each form using the old syncing solution, users can migrate the form according to the instructions provided in Forms and Excel for the web. More details can be found here: <a href=\"https://techcommunity.microsoft.com/blog/microsoftformsblog/update-to-the-new-solution-for-syncing-forms-responses-to-excel/4229844#M2155\" target=\"_blank\">Update to the new solution for syncing forms responses to Excel - Microsoft Community Hub</a>.</li><li>If users are using the old data sync solution in a workflow that relies on the Excel workbook being updated automatically without any user action, they will be impacted by the change as the Excel file will only get updated when it’s opened in a supported Excel client. These users will have to manually update their workflow. Our suggested solution is to use Power Automate: <a href=\"https://support.microsoft.com/office/setting-up-an-automated-workflow-between-microsoft-forms-and-excel-through-power-automate-b59076a5-abe6-4659-8bb3-28076b3a9a7e\" target=\"_blank\">Setting Up an Automated Workflow Between Microsoft Forms and Excel Through Power Automate - Microsoft Support</a></li><li>If a form using the old syncing solution is still receiving new responses, the form owner (a user or a group) will get an email notification about migrating their form. Some form owners might have already received these emails. Form owners will receive at most one email for each form they own.\n</li></ul><p>The old data sync solution deprecation only impacts commercial users.</p><p>As communicated in MC816207 <i>Microsoft Forms now supports live data sync to Microsoft Excel with more functionality</i> (July 2024), Microsoft Forms is introducing a new data sync solution with higher reliability to sync Forms response data to Microsoft Excel for the web. Before this rollout. Forms supported an older version of live data sync to Excel.<b> The older version of live data sync will be replaced by the newer solution on January 13, 2025 and for GCC on February 13, 2025.</b> This message describes the support that we will provide for migrating from the older solution to the newer solution.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID 410988.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Support for migrating the older data sync to the new solution will begin rolling out in late October 2024 (previously early October). We expect to complete by late November 2024 (previously early October).&nbsp;</p><p>General Availability (GCC) Support for migrating the older data sync to the new solution will begin rolling out in early January 2025 (previously late November). We expect to complete by late January 2025 (previously mid-December 2024).&nbsp;</p><p><b>How this will affect your organization:</b><br></p><p>Users who rely on the older version to sync data from Forms to Excel will need to manually update the data sync to the new solution before January 13, 2025 (previously October 20, 2024). After this date, existing Excel files with the older data sync will be retained but will no longer receive automatic data updates from Forms.<br></p><p>The older version of the data sync exists in two types of Forms:&nbsp;&nbsp;</p><ul><li>Forms created from Microsoft OneDrive and Excel for the web \n</li><li>Group forms created with SharePoint Online, Microsoft Teams, and Microsoft 365 Groups.\n</li></ul><p>For these two types of Forms, we will provide this support to migrate to the new solution:</p><ul><li>Users who own Forms with the older version of the data sync will get notifications through email, Forms, and Excel for the web.</li><li>In Forms, users will be able to recreate the data sync with the new solution. The data sync will be created to the same table in the existing workbook as the older data sync. The new worksheet will be connected to the latest data from Forms.</li><li>After the older solution is retired, the user can still recreate a new data sync to the Excel workbook. \n</li></ul><p>\n</p><p>\n</p><p>For workflows that connect to Excel data from Forms responses (such as Power Automate workflows), users will need to update the workflow to the Forms connector for new response updates. Learn more: <a href=\"https://support.microsoft.com/office/create-an-automated-workflow-for-microsoft-forms-dee28c00-503a-48b3-89df-91a5084e6e43\" target=\"_blank\">Create an automated workflow for Microsoft Forms - Microsoft Support</a><br></p><p><b>Note:</b> The new data sync can only be triggered in Excel for the web. If users want to receive new Forms response data in the Excel desktop app, open the file in Excel for the web, and then wait for the desktop app file to sync from the web file. (Support for other versions of Excel is in progress.)<br></p><p>The new data sync solution will be on by default and available to all Forms and Excel for the web customers.&nbsp;</p><p>Notification in Forms to update workbook to continue syncing with Forms:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/a66bcff6-d6b6-4a22-af57-183347091300\" style=\"width: 40%;\"><br></p><p>Notification in Excel for the web to update the data sync to new solution:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/a4706865-2492-4baf-875a-67b0783306ad\" style=\"width: 40%;\"><br></p><p>Excel workbook is successfully updated to new solution:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b4e1cbe7-19e5-4353-a712-07081d877160\" style=\"width: 40%;\" alt=\"user notification\">\n</p><p><b>What you need to do to prepare:</b><br></p><ul><li>Send a notification to impacted users and groups to migrate their data syncs to new solution.</li><li>Share the migration solution if users report they cannot get Forms data updated in Excel.</li><li>Learn more: <a href=\"https://techcommunity.microsoft.com/t5/microsoft-forms-blog/introducing-forms-data-sync-to-excel/ba-p/4036051\" target=\"_blank\">Introducing Forms data sync to Excel - Microsoft Community Hub</a></li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Before rollout, we will update this post with revised documentation.<code><br></code></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410988"
    },
    {
      "Name": "Summary",
      "Value": "The message details Microsoft Forms' transition from an old data sync solution to a new one, with deprecation starting January 20, 2025, and February 13, 2025, for GCC. Users must migrate to the new solution to continue receiving form responses in Excel. Instructions and support are provided for migration, with notifications for form owners and impacts outlined for automated workflows. The change affects commercial users only."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC855685",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-16T22:30:52.133Z",
  "Services": [
    "Microsoft Forms"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T22:56:38Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Forms | Data sync to Microsoft Excel: Support for migrating from the older solution to the new solution",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
