{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "Starting August 8, 2024, the Delete stub, unlicensed, and removed Microsoft Entra group users feature will be generally available. <br><br> \n<b>How does this affect me?</b><br>Previously, stub users, unlicensed, or removed Microsoft Entra group users couldn't be deleted from a Dataverse environment. These types of users remained in a Dataverse environment with a <i>disabled status</i> and were unable to log into the environment.<br><br> \nYou can now delete these users with the disabled status in your environment to comply with privacy laws, regulatory requirements, and to free up storage space.<br><br> \n<b>What action do I need to take?</b><br>  \nWhen you import users from another system, these users are created as <i>stub users</i> with a disabled status in Dataverse. These stub users will stay in the environment with a disabled status, or they can now be deleted. For more information, review <a href=\"https://aka.ms/7955/delete-stub-users\" target=\"_blank\">Delete stub users from an environment</a>.<br><br> \nIf an active user loses their Power Platform license, or if a user is moved out of the environment's Microsoft Entra group, they are set to a disabled status. You can delete these disabled status users in your environment. For more information, see <a href=\"https://aka.ms/7955/delete-unlicensed-users\" target=\"_blank\">  Delete unlicensed or removed Microsoft Entra group users</a>.  <br><br> \n<b>Additional Information</b>  \n<ul><li>For information about this release: <a href=\"https://aka.ms/7955/delete-stub-app\" target=\"_blank\">Delete stub, app, and non-security group users</a></li> \n<li>For information about delete stub users: <a href=\"https://aka.ms/7955/delete-stub-users\" target=\"_blank\">Delete stub users from an environment</a></li> \n<li>For information about delete unlicensed or removed Microsoft Entra group users: <a href=\"https://aka.ms/7955/delete-stub-users\" target=\"_blank\">Delete unlicensed or removed Microsoft Entra group users</a></li>  \n<li>For information about delete users: <a href=\"https://aka.ms/7955/delete-users\" target=\"_blank\">Delete users from an environment</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-09-08T17:12:33Z",
  "HasAttachments": false,
  "Id": "MC855402",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-08T17:14:19.62Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-08T17:12:33Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Microsoft Dynamics 365 – Delete stub, unlicensed, and removed Microsoft Entra group users feature is now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
