{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated on August 8, 2024:  This feature has been delayed.  We will update this Message center announcement again once we have new rollout dates.</p>\n\n<p>Coming soon for Microsoft Teams: Users will have expanded options for searching for content related to a person. Users will be able to expand their search from a keyword search of a 1:1 chat to all results related to a person, with suggestions to search with or without a keyword. This message applies to Teams on Windows, Mac, and the web.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early August 2024 and expect to complete by mid-August 2024 (delayed, please check back for an updated timeline).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: When searching for a keyword in a 1:1 chat, users do not have an option to expand the search to all results for a person in Teams. Also, in the search results page, users do not have an option to filter search results by a person.\n</p><p>After this rollout, users who use the <i>Find in chat</i> feature in 1:1 chats will see a suggestion at the end of the search results to expand search results across Teams, either by pairing their search keywords with the person in the chat or by seeing all results in Teams related to the person in the chat:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nr55?ver=f242\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The search results page for a keyword, filtered by all results related to a person:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nwkW?ver=f815\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be on by default and is accessible to all Microsoft Teams users.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon introduce expanded search options for 1:1 chats, allowing users to search content related to a person across Teams. This feature will be available on Windows, Mac, and the web, starting early August 2024 and completing by mid-August 2024. It will be enabled by default."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC853236",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-08T17:31:13.93Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-06T22:49:57Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Expanded search options for 1:1 chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
