{
  "ActionRequiredByDateTime": "2025-03-31T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In a security update in 2017, Microsoft Word disabled support for certain Dynamic Data Exchange (DDE) features, as documented in <a href=\"https://msrc.microsoft.com/update-guide/en-US/advisory/ADV170021\" target=\"_blank\">Microsoft Office Defense in Depth Update</a>. At the time, a registry key was added to re-enable the disabled functionality. Beginning in April 2025, the functionality affected by that registry key will be fully removed, and the registry key will no longer have any effect.</p><p><b>When this will happen:</b> \n</p><p>This retirement will begin in April 2025.</p><p><b>How this will affect your organization:</b></p><p>You may be affected by this change if you currently depend on the <code>HKCU\\Software\\Microsoft\\Office\\16.0\\Word\\Security\\AllowDDE</code> registry key being set to a value other than <code>0</code>. If you do not have that key set or if it is currently set to <code>0</code>, this change will have no effect.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Word will fully remove certain Dynamic Data Exchange features in April 2025, affecting organizations using the specific registry key. No admin action is required, but users should be notified and documentation updated."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC863140",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-15T23:15:08.293Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-15T23:14:49Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Word: Certain Dynamic Data Exchange features will be removed in April 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
