{
  "ActionRequiredByDateTime": "2025-01-13T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 10, 2025: This is a friendly reminder.</p><p>To enhance the security and compliance of Viva Engage, we will be retiring all private unlisted groups (also known as \"Secret Groups\") on January 13, 2025. These groups and all associated data will be deleted on February 10, 2025. \n</p><p><b>How this will affect your organization:</b>  \n</p><p>Viva Engage will no longer support private unlisted groups in external networks. All underlying content, including messages and files, will be deleted. Users will no longer be able to:  \n</p><ul><li>Create private unlisted groups in external networks.  \n</li><li>Participate in private unlisted groups in external networks. \n</li><li>Access and export data in unlisted groups in external networks.  \n</li></ul><p><b>What you need to do to prepare:</b> \n</p><p>There will be no exceptions to the deprecation and deletion starting on January 13, 2025. We recommend you communicate clearly to group owners of this impending change and coordinate an effort to remove the groups or convert them to a listed private or public group.</p><p>Here is a guide on<a href=\"https://learn.microsoft.com/viva/engage/work-with-external-users/create-and-manage-an-external-network\" target=\"_blank\"> How to find and manage your external Viva Engage network</a>. Verified Admins can see all external networks created for the tenant. Learn how more about managing admin roles here: <a href=\"https://learn.microsoft.com/viva/engage/eac-key-admin-roles-permissions#verified-administrator\" target=\"_blank\">Manage administrator roles in Viva Engage</a>. \n</p><p>To convert the group to listed, select “List in our network’s directory and search results” in the group settings page and save changes. Converting private unlisted groups is the only way to keep the group and its data active in external networks.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c607fcfb-2244-4a54-bf39-354d8269e924\" style=\"width: 400px;\"></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e9c735c4-4ef5-4537-919f-7811ac79a9ef\" style=\"width: 400px;\"><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Private unlisted groups in external networks on Microsoft Viva Engage will be retired on January 13, 2025, and deleted on February 10, 2025. Users should convert these groups to listed to retain data and comply with updated security and compliance measures."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC867664",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-01-10T17:54:50.767Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-20T22:52:43Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Viva Engage: Private unlisted groups in external networks will retire and be deleted in January 2025",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
