{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 4, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Outlook: If users have enabled <a href=\"https://support.microsoft.com/office/set-your-work-hours-and-location-in-outlook-af2fddf9-249e-4710-9c95-5911edfd76f6\" target=\"_blank\">work hours and location</a> in Settings, their colleagues will be able to more quickly see who plans to be in the office with a new calendar feature.\n</p><p>This message applies to new Outlook for Windows and Outlook on the web.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=&amp;searchterms=410986\" target=\"_blank\">410986</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out in mid-August 2024 and expect to complete by late August 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early October 2024 and expect to complete by mid-January 2025 (previously late October).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users select the <i>Location</i> icon for each day in the calendar to see who plans to be in the office:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nOGa?ver=294d\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After this rollout: In addition to the <i>Location</i> icon, users will have a new \"always on\" peek in the top right of the calendar that shows who plans to be in the office for the current day:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nWnt?ver=f771\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default and available to all users of new Outlook for Windows and Outlook on the web.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410986"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook is introducing a new calendar feature that allows users to see who is in the office based on their work hours and location settings. The rollout for Targeted Release will begin in mid-August 2024 and for General Availability in early October 2024, with completion expected by mid-January 2025. This feature will be on by default for new Outlook for Windows and Outlook on the web. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-02-21T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC862229",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-05T01:05:22.717Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-14T23:39:06Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Quickly see who is in the office based on work hours and location",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
