{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Amplify Reports and Analytics has introduced new data visualizations in the form of line graphs for both unique viewers and promotions.</p><p>Both the Unique Viewer count, and the Promotions count now provide historical data that can look back up to 12 months.</p><p>Furthermore, the graphs allow for further breakdown of the information by publishing endpoint and allow the user to include or exclude endpoints from the graph</p><p>The new “Copy as image” functionality allows the user to easily copy the card, and it graph to reuse in a document or email.&nbsp; &nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=407862\" target=\"_blank\">407862</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late August 2024 and expect to complete by late September 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>Amplify reports will now present what was previously represented as a single, point-in-time aggregate number, as a historical trend chart. This allows the campaign members to see not only the total impact and reach of their publications, but to better understand when and in which endpoints there are reaching their audiences.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o1bq?ver=6e03\" style=\"width: 400px;\"><br></p><p>The default view of the Unique viewers card appears with the last 7 days as the selected time horizon and the aggregate numbers in the trend chart.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o6lh?ver=80a2\" style=\"width: 400px;\"></p><p>But if the campaign member desires to view the data differently, they can select a different time horizon from the dropdown, as well as toggle the “view channel breakdown” to see the data trends for each endpoint. And, they can further customize the view by enable or disable the desired endpoints in the provided legend.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o6lk?ver=bb7f\" style=\"width: 400px;\"></p><p>The Promotions card defaults to showing the total number of Shares, @mentions, email forwards for the entire history (All time). The campaign member can select different time horizons or enable and disable endpoint to appear using the dropdown and legend after the “View channel breakdown” toggle is switched.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o8Zz?ver=885b\" style=\"width: 400px;\"></p><p>Hovering over the graph lines will display a card with specific data for the point in time selected with the mouse hover. The data displayed will reflect the current setting, UTC time, and enabled channels.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o3IV?ver=c9bf\" style=\"width: 400px;\"></p><p>After a card is configured as needed, the new “Copy as image” allows for a single click to copy the card as viewed on the report to the local machine’s clipboard. It is then pasted into any desktop or browser application that supports Cut &amp; Paste from the clipboard.</p><p><b>What you need to do to prepare:</b></p><p>For admins: you might want to inform users and/or update existing internal user training materials and documentation.</p><p><a href=\"https://support.microsoft.com/topic/use-reporting-signals-in-microsoft-viva-amplify-to-understand-campaign-performance-776ac7ec-71ef-48af-a67f-a6875f15d4e6\" target=\"_blank\">Use reporting signals in Microsoft Viva Amplify to understand campaign performance</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "407862"
    },
    {
      "Name": "Summary",
      "Value": "Viva Amplify introduces new line graph visualizations for unique viewers and promotions with historical data up to 12 months. Users can customize graphs by publishing endpoint and use \"Copy as image\" functionality. Rollout begins late August 2024, with completion by late September 2024. Microsoft 365 Roadmap ID 407862."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC866441",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-19T22:51:51.97Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-19T22:51:43Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Amplify: User signals Graphs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
