{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We want to inform you that certain Microsoft 365 and Office 365 subscriptions will soon feature a new service plan called Graph Connectors Search with Index. This plan provides an index limit of 50 million items per tenant without any extra cost. The following subscriptions will be automatically configured for this service plan.\n</p><p><i>Applicable to subscriptions:</i><b> </b>Office 365 E1, Office 365 E3, Office 365 E5, Microsoft 365 E3, Microsoft 365 E5, Microsoft 365 F1, Microsoft 365 F3, Office 365 F3, Microsoft 365 Business Basic, Microsoft 365 Business Standard, Microsoft 365 Business Premium, Office 365 G1, Office 365 G3, Office 365 G5, Microsoft 365 G3, Microsoft 365 G5, Office 365 A3, Office 365 A5, Microsoft 365 A3, Microsoft 365 A5\n</p><p>If you use Microsoft Graph connectors for Copilot for Microsoft 365 or Microsoft Search and have the subscriptions mentioned above, your limit will change to a 50 million item tenant index. Subscribers with 'Extra Graph Connector capacity' will be contacted about their active plans.\n</p><p>Microsoft Graph connectors allow your organization to index third-party data into Microsoft Graph. Microsoft Graph connectors enable Microsoft 365 Copilot better as it has more information relevant to your organization to answer prompts.\n</p><p><b>When this will happen:</b>\n</p><p>We will begin rolling out service plan in mid-September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Previously, to index third-party data into Microsoft Graph through Microsoft Graph connectors, you either needed to have a built-in entitlement through specific licenses (e.g., 500 items of index quota per Microsoft Copilot for Microsoft 365 license) or purchase add-on quota. With this change, the index quota per license entitlement is removed, as is add-on cost for additional quota. You now receive an entitlement of 50 million items for each tenant.\n</p><p>&nbsp;As a reminder: Each entity (or record) from the source data system that you add to Microsoft Graph can be considered an item which then shows up as a unique citation in Copilot's responses, as a unique search result in Microsoft Search, etc. Depending on the type of data source, 1 item is –\n</p><ul><li>1 document (word, excel, ppt, pdf, etc.) in file share\n</li><li>1 wiki page in Confluence\n</li><li>1 webpage in a website\n</li><li>1 ticket/issue in Jira\n</li></ul><p>Total quota utilized is calculated in terms of total items stored in the index. Updates/changes to an item are not counted in any manner. There are no cost implications of updating an item multiple times. It still counts as 1 item only.\n</p><p><b>What you need to do to prepare:<b></b>\n</b></p><p>Review resources about Microsoft Graph connectors and consider data sources you'd want to connect to Microsoft 365.\n</p><p><a href=\"https://learn.microsoft.com/microsoft-365-copilot/extensibility/overview-graph-connector\" target=\"_blank\">Build Microsoft Graph connectors for Microsoft Copilot for Microsoft 365 | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 and Office 365 subscriptions will soon include a new service plan, Graph Connectors Search with Index, offering a 50 million item index limit per tenant at no extra cost. Rollout begins mid-September 2024. Subscribers should review Microsoft Graph connectors resources to prepare."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/en-us/microsoft-365-copilot/extensibility/overview-graph-connector"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC865187",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-18T19:57:38.72Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-18T19:56:53Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Backfilling Microsoft Graph Connector Entitlement to 50M items",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
