{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Currently, Viva Amplify users have no easy way to reuse content that has previously been published in a campaign and often must copy and paste content from one publication to the next manually. Coming soon, a Viva Amplify user will be able to reuse content by copying an existing publication using a centralized ‘Save copy’ button available on any given campaign publication. This new feature streamlines the content creation process and maximizes efficiency for all communicators.</p><p><b>Important</b>: Due to the recent our recent editor updates for Outlook and Teams distribution channels, any publications that were created using the old editor version will have their content reset to the main draft without customizations when copying a publication. This only applies to publications created on the old editor versions. For any new publications created, copying a publication will create a copy of the publications including any customized content and audiences as intended.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=409234\" target=\"_blank\">409234</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early January 2025 (previously mid-December) and expect to complete by late January 2025 (previously late December).&nbsp;</p><p><b>How this affects your organization:</b></p><p>Soon, Amplify users will be able to copy existing publications in a campaign regardless of the publication’s status. This feature is available for users in the web/desktop experience. Please note that Amplify on Mobile iOS &amp; Android applications are out of scope currently.  </p><p>The “save a copy” button is present under the ‘More options’ button in the campaign overview and publications tab where all the publications are present. Users can also access it when authoring right under the ‘Save and close’ button on the command bar. Please note that when a publication is copied, it will copy all content of the publication, including all channel customization across SharePoint, Teams and Outlook, as well as the audiences of the original publication if desired.&nbsp;</p><p>Additionally, for preview customers, the copy a publication feature does not support the ability to copy Viva Engage customized content.  This will come as part of a separate release in the future.&nbsp;&nbsp;</p><p><b>What you can do to prepare:</b></p><p>There is no action for admins beyond reviewing any internal help or guidance you have may have created for end users. &nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "409234"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva is introducing a 'Save copy' button for Viva Amplify, allowing users to easily copy publications within a campaign. Rollout starts early January 2025, completing by late January. Publications created with the old editor will reset to the main draft when copied. This feature is not yet available on mobile apps."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC868912",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-10T21:50:34.207Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-22T02:04:15Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva: Viva Amplify - Copy a publication within a campaign",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
