{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting in early September 2024, customers will see a new setting in the Microsoft Viva Engage admin center to mute&nbsp;users across their networks. Muting a user removes new posts from that user from the Home feed, Storylines feed, and all email digests.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=396168\" target=\"_blank\">396168</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early September 2024 and expect to complete by late October 2024.</p><p><b>How this will affect your organization:</b></p><p>Network, Engage, and Global admins will be able to add or remove a user from mute for network status. The feature can be found in the Engage admin center under the Governance and Compliance tab. All admin activity related to muting users for the network is captured in the user audit log for Engage.</p><p>While muted, new ThreadStarters from a user cannot show in discovery surfaces, including the Home feed, Storylines feed, and email digests. Comments and replies from a muted user can show in discovery surfaces.</p><p>Muting a user does not affect visibility of ThreadStarters, comments, or replies in community feeds. Users and their content remain visible through search.</p><p>Muted users will not see any indication they’ve been muted. Admins can only see who is muted within the admin center. Users do not receive a notification when added or removed from mute status. Customers own all internal communication around the use of the feature.</p><p>Admins can mute any user in their network, including guest users. Muting applies per user per network. Up to 1,000 users can be muted simultaneously per network.</p><p>This new feature is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Please review the available documentation on Microsoft Support and Microsoft Learn, which will be available publicly after general availability rollout begins in September 2024:&nbsp;<a href=\"https://learn.microsoft.com/en-us/viva/engage/work-with-external-users/mute-user-in-network\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Reduce visibility of a user's posts in Viva Engage (Private Preview) | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "396168"
    },
    {
      "Name": "Summary",
      "Value": "Starting September 2024, Microsoft Viva Engage will introduce a mute user feature, allowing admins to remove a user's posts from various feeds and email digests. This feature is part of the Microsoft 365 Roadmap ID 396168 and will be available by default. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2024-12-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC869926",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-22T23:23:20.53Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-22T23:22:37Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Mute user for network",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
