{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 16, 2024: The updates to Microsoft Copilot as outlined in MC862983 will start rolling out today with an expected completion date of September 30, 2024.\n</p><p>As Microsoft Copilot updates, users will begin to see the new simplified user experience designed for work and education. During the rollout, the updates may not happen to all users—or on all Copilot surfaces—at the same time. As noted above, all updates are expected to be completed by September 30, 2024.\n</p><p>These user interface updates include:\n</p><ul><li>A shield outline at the top of the user interface to indicate enterprise data protection (this was previously green with commercial data protection)\n</li><li>The ‘New chat’ button moving to the top of the user interface next to the shield outline\n</li><li>New prompt cards in the center of the user interface to help users get started\n</li><li>A new ‘Chats’ pane on the right side of the user interface for users to refer back to previous chats</li></ul><p>Image of UI on copilot.cloud.microsoft:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p7F8?ver=bf28\" style=\"width: 400px;\"><br></p><p>Image of UI in the Microsoft 365 web app (if Copilot has been pinned):</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oXls?ver=3ceb\" style=\"width: 400px;\"><br></p><p>Additionally, the Microsoft Copilot documentation has been updated to reflect the updates rolling out: <a href=\"https://aka.ms/Copilot/Docs\" target=\"_blank\">https://aka.ms/Copilot/Docs</a>&nbsp;</p><p>We recommend that you read the documentation to further understand the updates and to prepare your organization.\n</p><p>---Original message---</p><p>Next month, we are making several updates to the free Microsoft Copilot service for users with a Microsoft Entra account to enhance data security, privacy, and compliance and simplify the user experience. For users signed in with an Entra account, Microsoft Copilot will offer enterprise data protection (EDP) and redirect users to a new simplified, ad-free user interface designed for work and education. Learn more here: <a href=\"https://aka.ms/MsftCopilot-MTCBlog\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Updates to Microsoft Copilot to bring enterprise data protection to more organizations</a>.<br></p><p><b>Note:</b> There is no change for Copilot for Microsoft 365 graph-grounded chat or any Copilot experience in the Microsoft 365 productivity apps like Word, Excel, and PowerPoint. Enterprise data protection is already provided as part of these experiences.\n</p><p><b>Note: </b>Government cloud customers and students under 18 are not yet eligible.</p><p>\n</p><p><b>When this will happen:</b><br></p><p>These updates will begin to roll out in mid-September 2024 and expect to complete by mid-October 2024.</p><p><b>How this will affect your organization:</b><br></p><p>Microsoft Copilot will offer enterprise data protection and redirect users to a new simplified, ad-free user interface designed for work and education when they are signed in with an Entra account. Users will be able to navigate to Microsoft.com/copilot to access this experience. For existing users who are logged in with their Entra account they will automatically be redirected as follows:</p><ul><li>Web: Users signed into Bing.com/chat and copilot.microsoft.com with an Entra account will be redirected to the simplified experience on Microsoft.com/copilot.</li><li>Windows: Users signed in to Windows with an Entra account will be redirected to the Microsoft 365 app and will be able to opt in to Microsoft Copilot.</li><li>Mobile: Users signed into Copilot mobile app with an Entra account will be redirected to the Microsoft 365 mobile app and will be able to opt in to Microsoft Copilot.</li></ul><p><b>Note: </b>Please see \"What you need to do to prepare\" for instructions on how to manage pinning Microsoft Copilot in your organization.</p><p><b>What you need to do to prepare:</b></p><p> \n</p><p>Users who sign in with an Entra account to Microsoft Copilot will be redirected automatically—no action is required.</p><p>To ensure people across your organization have easy access to Microsoft Copilot and can benefit from the security and experience updates to Copilot, we recommend you enable in-app access today by pinning Microsoft Copilot. If you elect to pin Microsoft Copilot for your users, it will appear in the Microsoft 365 app starting mid-September, and it will be coming soon to Microsoft Teams and Outlook. The option to pin Copilot can be found under Settings on the <a href=\"https://admin.cloud.microsoft/?#/copilot/settings\" target=\"_blank\">Copilot page in the Microsoft 365 admin center</a>&nbsp;(Global Admin permissions required).</p><p><b>Note:</b> This setting is for users who don't have a license for Copilot for Microsoft 365; licensed users will have it pinned by default just as it is today.\n</p><p>Additionally, if your organization manages app distribution for mobile devices, you should push the Microsoft 365 mobile app to these users before mid-September. For self-managed devices, you should encourage users to download the Microsoft 365 mobile app before mid-September or they will be prompted to do so when this change happens.\n</p><p>If you wish to inform your users prior to the change, you can use the below message: \n</p><p>“Microsoft Copilot provides a powerful, web-grounded AI chat experience for work with enterprise data protection. Starting mid-September, you’ll be redirected from copilot.microsoft.com and bing.com/chat to microsoft.com/copilot to access a simplified, ad-free Microsoft Copilot experience. If you use the Copilot mobile app, you will be redirected to the Microsoft 365 mobile app. If you do not have the Microsoft 365 app installed, you should do so.\"</p><p>If you elect to pin Copilot, you can also include the following:\n</p><p>\"Microsoft Copilot will also be pinned inside the apps you use every day like the Microsoft 365 app, Outlook, and Teams to make it easier to use Copilot in your flow at work.”\n</p><p><b>Note:</b> If you do not make a pinning selection by mid-September, your users will be prompted to pin Microsoft Copilot themselves. While not recommended, you can disable the prompt for end users with the same setting.\n</p><p><b>Additional Information:</b>\n</p><p>If you would like to try the updated Microsoft Copilot with enterprise data protection prior to mid-September, a private preview is available (space limited). To apply, please visit here: <a href=\"https://aka.ms/CopilotPreviewSignup\" target=\"_blank\">Private Preview: Microsoft Copilot with enterprise data protection</a>&nbsp;</p><p>For additional information about these changes, please visit the FAQ: <a href=\"https://aka.ms/MsftCopilot-BlogFAQ\" target=\"_blank\">Frequently asked questions about Copilot</a>&nbsp;</p><p>For information on how to configure the Windows taskbar:\n</p><ul><li><a href=\"https://learn.microsoft.com/windows/configuration/taskbar/pinned-apps?tabs=intune&amp;pivots=windows-11\" target=\"_blank\">Configure the applications pinned to the taskbar - Configure Windows | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/windows/configuration/taskbar/policy-settings?tabs=taskbar&amp;pivots=windows-11\" target=\"_blank\">Taskbar policy settings - Configure Windows | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot will update next month to include enterprise data protection for users with an Entra account. It will feature a new ad-free interface, with no changes for other Copilot experiences in Microsoft 365 apps. Rollout begins mid-September 2024, with no action needed for automatic redirection."
    },
    {
      "Name": "BlogLink",
      "Value": "https://aka.ms/MsftCopilot-MTCBlog"
    }
  ],
  "EndDateTime": "2024-11-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC862983",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-16T20:32:12.99Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-15T19:30:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot to update to enterprise data protection",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
