{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The campaign goals feature allows you to set specific goals for your campaigns and track progress towards completion. With campaign goals, you can now easily monitor how well your campaign is performing and make data-driven decisions to achieve your desired outcomes.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=409233\" target=\"_blank\">409233</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability: We will begin rolling out late August 2024 and expect to complete by late September 2024.\n</p><p><b>How this affects your organization:</b></p><p>Soon, Viva Amplify users will be able to set goals for a given campaign. By directly tying goals to key metric like the unique viewer metric, users will be able to track how many people viewed their campaigns and measure its effectiveness.  Currently, campaign goals are only integrated with the unique viewer analytics metric.</p><p>  \n</p><p>\n</p><p>To set a campaign goal, navigate to the campaign brief where you can plan your campaign strategy. When you set a campaign goal, you can specify your target outcome, such as increasing the open rate or reaching a certain percentage of views, and it will be applied at the campaign level and to each distribution channel that you distribute content to. Once a goal is set, our analytics tool will then track your progress and provide detailed reports, making it easy for you to view and understand how close you are to achieving your goal. To view more insights on your campaign goals, navigate to the reporting page. The reporting experience will not only display the campaign goal with clear details on the actual audience reached for your campaign, but it will also provide detailed insights broken down by distribution channels to give you a better understanding on how far or close you are from achieving your goal and why. Currently, campaign goals are integrated with the unique viewer analytics metric only.</p><p>It is important to note that if you publish to an open SharePoint site or to Viva Engage storyline (i.e to a whole organization), you can still set a campaign goal. However, users should be mindful that goals may be harder to reach as the audience will be very large. In this case, the campaign goal will not be displayed unless the user takes explicit action to include the whole organization which should then enable the goal tracker to be displayed.&nbsp; &nbsp;This feature is available for users in the web/desktop experience. Please note that Amplify on Mobile iOS &amp; Android applications are out of scope currently.  </p><p><b>What you can do to prepare:</b></p><p>There is no action for admins beyond reviewing any internal help or guidance you have may have created for end users.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "409233"
    },
    {
      "Name": "Summary",
      "Value": "The new Campaign Goals feature in Viva Amplify allows users to set, track, and achieve specific goals for campaigns, integrated with the unique viewer metric. Rolling out from late August to late September 2024, it provides detailed reports and insights, although currently not available on mobile iOS & Android apps."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC868909",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-22T02:03:53.523Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-22T02:03:40Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Unlock success with our New Campaign Goals Feature: Set, Track, Achieve!",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
