{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>If you use the deployment configuration service from the Microsoft 365 Apps Admin Center (config.office.com) to create deployment configurations for Microsoft 365 apps, get ready for a change. The ability to access these deployment configurations via a direct URL will be retired.</p><p><b>When this will happen:</b></p><p>We will begin rolling out this change in late September 2024 and expect to complete by early October 2024.</p><p>\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates your organization may be using the deployment configuration service to create and store deployment configurations for Microsoft 365 apps.\n</p><p>Administrators will no longer be able to access their deployment configurations via a direct URL.  The deployment configurations can still be created, edited and downloaded.\n</p><p><b>What you need to do to prepare:</b></p><p>Admins that use direct URLs with the Office Deployment Tool (ODT) will need to download the deployment configurations in order to use them with the Office Deployment Tool (ODT).</p><p><a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-office-customization-tool\" target=\"_blank\">Overview of the Office Customization Tool</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Direct URL access to deployment configurations in the Microsoft 365 Apps Admin Center will be retired between late September and early October 2024. Organizations using this service must download configurations to use with the Office Deployment Tool."
    }
  ],
  "EndDateTime": "2024-11-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC867651",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-20T22:46:35.893Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-20T22:46:18Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "URLs for deployment configurations will be retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
