{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This message covers a change in behavior in Microsoft Outlook for Android regarding App Protection Policy and App Configuration Policy. Before this rollout, Outlook for Android does not adhere to the documented behavior when the App Protection Policy (APP) Org Data Notifications is set to <code>Block</code>. Instead of blocking sensitive data from being exposed in an Outlook notification, Outlook for Android blocks all notifications.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-September and expect to complete by mid-September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, Outlook for Android will match the documented behavior and align with the behavior of Outlook for iOS. Specifically, Outlook for Android will ignore the <code>Block </code>setting value for the <code>Org Data Notifications</code> key. We are letting customers know because they might be dependent on the existing behavior and need to change settings to match their organization's requirements.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Prior to September 16, review the <a href=\"https://techcommunity.microsoft.com/t5/intune-customer-success/limiting-sensitive-data-in-notifications/ba-p/1009778\" target=\"_blank\">Outlook App Config Policy (microsoft.com)</a> documentation and your organization's settings ensure that the combination of settings you have chosen will result in your desired behavior after Outlook for Android matches the documentation. After this date, the <code>Block </code>setting for <code>Org Data Notifications</code> will no longer have an effect in Outlook for Android, and you should use <code>Block Org Data</code> if you want to customize the data shown in notifications.</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook for Android will soon align with documented behavior, ignoring the 'Block' setting for 'Org Data Notifications' after mid-September 2024. Organizations should review their settings before this date to ensure desired notification behavior, as no admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC862228",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-14T23:38:15.727Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-14T23:37:43Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Behavior change for \"Org Data Notifications\" for Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
