{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are updating the Admin experience for our new Viva Learning – SuccessFactors integration set-up experience. We are planning to upgrade all existing customers to the new experience by September 2024, </p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in late August 2024 and expect to complete by mid-September 2024.<br></p><p><b>How this affects your organization:</b></p><p>The new SuccessFactors set up experience consolidates configuration steps to a single interface in Viva Learning. See below for a summary of major changes coming to the new experience:\n</p><ul><li>All configuration updates (done previously in SuccessFactors portal) can now be done directly in the Viva Learning Admin experience.\n</li><li>SFTP details are now collected from SuccessFactors and pre-populated in Viva Learning, including the username, Host URL, and root folder path. Admins will not need to enter these details manually moving forward.\n</li><li>Public encryption keys are updated in SuccessFactors automatically \n</li><li>Updates to the SFTP subfolder path in the Viva Learning Admin set-up experience reflect in SuccessFactors automatically \n</li></ul><p><b>What you can do to prepare:</b></p><p>There is no action, but you may consider updating your training and documentation as appropriate.</p><p>For the detailed feature breakdown in our newly updated product documentation, review: <a href=\"https://learn.microsoft.com/viva/learning/successfactors-integration-add-as-content-source\" target=\"_blank\">Add SAP SuccessFactors as a content source | Microsoft Learn</a></p><p></p><p>Documentation for the current experience is still available here while you wait for the new experience: <a href=\"https://learn.microsoft.com/viva/learning/sfsf-add-as-content-source\" target=\"_blank\">Add SAP SuccessFactors as a content source | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Viva Learning - SAP SuccessFactors integration process is being updated to improve the admin setup experience. The rollout will begin in late August 2024 and is expected to complete by mid-September 2024. The update consolidates configuration steps, automates data collection and updates, and requires no immediate action but suggests preparing updated training and documentation."
    }
  ],
  "EndDateTime": "2024-10-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC868915",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-22T02:06:14.28Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-22T02:05:44Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Update to Viva Learning - SAP SuccessFactors integration configuration process",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
