{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for new Microsoft Outlook for Windows and the web: A new <i>Get diagnostics</i> feature will allow users to submit logs after they open a ticket with Microsoft Support. To submit diagnostic information to a support agent, users will be able to select <i>Get diagnostics</i> in the Help tab, select <i>Upload logs</i>, copy the Support ID that is generated, and then share the Support ID with the support agent.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late August 2024 and expect to complete by late September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users are not able to provide diagnostics to the Microsoft Support after they open a ticket unless the support agent shows them how to provide them.\n</p><p>After this rollout: Users will find the <i>Get diagnostics</i> feature in the Help tab of the Ribbon if you have enabled it.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nLu2?ver=ae0d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This new feature is now off by default, but you can turn it on by following the instructions below. In late September, it will be on by default unless you have turned it off before then. Admins can use a <a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Cloud Policy for a Microsoft 365 organization</a> to enable or disable it in their tenant, if needed. When you create a policy, after providing a name and setting a scope, you can search for \"new outlook\" from the <i>Policies</i> screen to see all available policies for new Outlook for Windows. One of these policies is <i>Configure Get diagnostics,</i> which you can change to <i>Not configured </i>or<i> Enabled.</i>\n</p><p>To disable the new feature after configuring it: In the Microsoft 365 admin center, go to <i>Customization</i> and follow the <a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy#steps-for-creating-a-policy-configuration\" target=\"_blank\">Cloud Policy steps</a>:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nWnd?ver=5bd3\" style=\"width: 400px\" alt=\"admin controls\">\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1nBk7?ver=bf0d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more</p><ul><li>For admins: <a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Overview of Cloud Policy service for Microsoft 365 - Microsoft 365 Apps | Microsoft Learn</a>\n</li><li>For users: <a href=\"https://support.microsoft.com/office/contact-support-and-provide-feedback-in-new-outlook-for-windows-4a4bcc80-c71e-4e44-97c1-d0e62452ef4a\" target=\"_blank\">Contact support and provide feedback in new Outlook for Windows - Microsoft Support</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Microsoft Outlook will feature a 'Get diagnostics' option to submit logs to Microsoft Support. Rolling out late August to late September 2024, it will be available in the Help tab and is initially off by default. Admins can enable it using Cloud Policy. No action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC869930",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-08-22T23:27:24.993Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-22T23:24:47Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook: New Get diagnostics feature for users to submit logs to Microsoft Support during an interaction",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
