{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Insider Risk Management will be rolling out minor changes for when it detects a potential high impact user whose activities may lead to potential data security incidents. These changes will include improving accessibility and more prominently highlighting the reasons for the detection on the <i>Alert</i> page. Also, we will provide additional descriptors for how the risk score booster is applied to the user.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=156016\" target=\"_blank\">156016</a> and Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=171720\" target=\"_blank\">171720</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late August 2024 and expect to complete the rollout by early September 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, the <i>Alerts</i> page had fewer details about why the user was detected as potential high impact user.</p><p>After this rollout, The <i>Alert </i>page&nbsp;will have improved accessibility, it will be easier to see the reasons for the detection of a potential high impact user, and admins will have additional descriptors for how the score booster is applied to the user.<br></p><p>This feature is on by default and accessible to all Purview admins with appropriate permissions.&nbsp;<br></p><p><b>What you need to do to prepare:</b>\n</p><p>No action is needed to enable these features. You will see the potential high impact user experience enhancements on the alert/case detail pages.</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the <a href=\"https://sip.compliance.microsoft.com/homepage\" target=\"_blank\">Microsoft Purview compliance portal</a>.</p><p>  \n</p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-policies?view=o365-worldwide\" target=\"_blank\">Create and manage insider risk management policies - Microsoft Purview (compliance) | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/insider-risk-management-activities?view=o365-worldwide\" target=\"_blank\">Investigate insider risk management activities - Microsoft Purview (compliance) | Microsoft Learn</a><a href=\"https://learn.microsoft.com/purview/insider-risk-management-activities?view=o365-worldwide\" target=\"_blank\"></a><br></li></ul><p>This rollout will happen automatically by the specified dates. You may want to notify your admins about this change and update any relevant documentation.<br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "156016,171720"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing enhancements for detecting potential high-impact users, including improved accessibility and detailed reasons for detections on the Alerts page. These updates are associated with Roadmap IDs 156016 and 171720, and will roll out between late August and early September 2024. The feature is on by default and requires no action to enable."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC869936",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-22T23:30:45.083Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-22T23:27:42Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Enhancements to potential high-impact user detections",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
