{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The default calculation of the audience size, both in the aggregate campaign report and for individual publication reports, has been updated to account for scenarios in which a publication has been sent to an endpoint that is open to all members of an organization. Such publishing scenarios often result in very large audiences, which in turn may cause the denominator in the percentage of Unique Viewers calculation to be confusing to users, even though correct.</p><p>In cases where an audience is not explicitly defined and is simply “open to all”, the new Amplify reports will show the count rather than the percentage to provide the user a more comprehensible data point at first glance.&nbsp;</p><p>Example: The total audience is calculated by summing up the members of the groups with rights to see the published item. The user count is obtained by adding the Microsoft Entra ID users with permissions to the published item. This can result in a very large audience which in turn may cause the percentage of unique viewers to appear a very small tenth or hundredth of a percentage point. If 2.4K or 7.3K people of the impacted organization have viewed the publication, a campaign owner or author might naturally expect to see a report indicating they have reached ~30% of their audience. But because the publication was shared beyond the impacted business group, as a general interest story to the company’s intranet, the actual potential audience (everyone with permission to see the publication) is now 521,000 employees worldwide, resulting in the report displaying 0.5% unique viewers. This is not incorrect, but also not particularly meaningful.&nbsp; &nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=407862\" target=\"_blank\">407862</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): Gradually rolling out to everyone from 8/28.&nbsp;</p><p><b>How this will affect your organization:</b><br></p><p>When one or more publications are published to an “all company audience” the default view of any report will not show percentages. This will impact certain components on the report pages.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o6lF?ver=c720\" style=\"width: 400px;\"><br></p><p>In the image above you see that the Campaign Goals control is disabled as a result of not being able to calculate the percentage needed to measure the goal. You also see that the unique views are displayed as a number (2.4K), and each endpoint accounts for the “all company” versus discrete audience scenarios. A percentage is displayed when possible and a number with an information icon when a denominator is not available.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o3Jx?ver=7be0\" style=\"width: 400px;\"><br></p><p>It is possible that in certain business scenarios the calculation across the entire available audience is precisely what the campaign members are interested in. In those scenarios you can open the “Edit View” button and toggle the “Include whole organization” switch&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o1bE?ver=5fb7\" style=\"width: 400px;\"><br></p><p>After the switch is toggled, the Campaign Goal is now visible as well as a percentage of unique viewers of the available target audience which is equal to all ADD users with permissions to the publication.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o6lG?ver=3aec\" style=\"width: 400px;\"><br></p><p><b>What you can do to prepare:</b></p><p>For admins: you might want to inform users and/or update existing internal user training materials and documentation.</p>\n<p></p>\n<p><a href=\"https://support.microsoft.com/topic/use-reporting-signals-in-microsoft-viva-amplify-to-understand-campaign-performance-776ac7ec-71ef-48af-a67f-a6875f15d4e6\" target=\"_blank\">Use reporting signals in Microsoft Viva Amplify to understand campaign performance</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "407862"
    },
    {
      "Name": "Summary",
      "Value": "Viva Amplify updates now show the count of viewers instead of the percentage for publications sent to large audiences, like an entire organization. This change, associated with Microsoft 365 Roadmap ID 407862, aims to provide clearer data points and will be available from 8/28. Users can still toggle to view percentages for the whole organization if needed. Admins should update training materials accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC866446",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-19T22:53:15.897Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-19T22:53:07Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Amplify: Reports displaying count and percentage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
