{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Viva Amplify: Improvements to the title area at the top of a publication.</p><p>The title area is now a full-width section containing the new Banner web part with new layouts.&nbsp;</p><p>The first banner at the top of the publication (in the full-width section) acts as a title and is automatically synchronized to the publication Title on the command bar at the top of the screen. Additional banners can be added to the publication content in the available columns.&nbsp;</p><p>Users will be able to remove the title area, which is no longer mandatory on a publication.&nbsp; </p><p><b>When this will happen:</b><br></p><p>Targeted Release: We will begin rolling out mid-August 2024 and expect to complete by early September 2024.</p><p>General Availability (Worldwide): We will begin rolling out late August 2024 mid-September 2024.&nbsp;</p><p><b>How this affects your organization:</b></p><p>\n</p><p>Before this rollout: Users creating a publication see a mandatory, unremovable title area. The title area has four layouts: Image and title, Plain, Color block, Overlap. The title area shows in the distribution channels as--</p><ul><li>Email: Image &amp; title (the title is also the subject line of the email), Plain layout&nbsp;</li><li>Teams: Title only&nbsp;</li></ul><p>After the rollout: On creating a new publication or accessing an existing publication, users see a removable section at the top which includes the Banner webpart with the title. This area is not mandatory anymore and can be kept or removed. After removing the banner area, users can select Undo or choose to re-add a full-width section with a Banner web part to restore the title. In the properties of the Banner, users can also see two additional layout options: Author and Fade.&nbsp;</p><p>Viva Amplify authors can choose to add one banner in a full-width section at the top of the publication. In the content of the publication, they can also choose to add additional banners.&nbsp;</p><p>The first banner at the top of the page (in full-width section) acts as the title and is automatically synchronized to the page Title on the command bar at the top of the screen.&nbsp;</p><p>Note: You must enter a Title in the first banner or on the command bar before you can proceed to preview or customization of the distribution channels.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o1qJ?ver=6e53\" style=\"width: 400px;\"><br></p><p>The new Banner will be supported in email. When users select Outlook as one of their distribution channels, the layout of the banner changes in that the banner image will appear above the banner text. The title added in the Banner, or the title in the command bar if no Banner is selected, will be the Subject line in Outlook, which can be customized in the distribution channel customization. In the Teams distribution channel, the banner image is not supported. The banner title will also be the default title in the Teams post, which can be customized in the distribution channel.</p><p>When customizing the Outlook distribution channel, the user also has the option to include full-width banners in the content of the email.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p><a href=\"https://support.microsoft.com/topic/preview-and-customize-a-viva-amplify-publication-5c96c06e-449f-4374-bbd3-503caf870bfa\" target=\"_blank\">Preview and customize a Viva Amplify publication</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Amplify is introducing a new Banner web part and updates to the title area, allowing for more layout options and the ability to remove the title area. Rollout begins mid-August 2024 with full availability by mid-September 2024. No admin action is required for this update."
    }
  ],
  "EndDateTime": "2024-10-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC867653",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-20T22:47:38.637Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-20T22:47:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Amplify: New banner web part and updated title area",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
