{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Insider Risk Management will be rolling out cumulative exfiltration tuning.  With this new feature, Cumulative Exfiltration Activities will not be detected and scored if the events have already been detected in a previous Cumulative Exfiltration Activities risk. This change will reduce noise for alerts generated from Cumulative Exfiltration Activities.<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=402195\" target=\"_blank\">402195</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-August 2024 and complete by late August 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>With this update, Cumulative Exfiltration Activities will no longer be detected and scored if they have already been identified in a previous cumulative exfiltration alert. This change will reduce unnecessary alerts generated from Cumulative Exfiltration Activities.&nbsp;&nbsp;</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>This feature is enabled by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal.</a>\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-policies?tabs=purview-portal#cumulative-exfiltration-detection-preview\" target=\"_blank\">Create and manage insider risk management policies</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "402195"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management is introducing cumulative exfiltration tuning to reduce alert noise by not scoring previously detected activities. This update will be globally available from mid to late August 2024 and requires no admin action. It is enabled by default and accessible via the Microsoft Purview compliance portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC866451",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-19T22:56:20.887Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-19T22:55:57Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Insider Risk Management cumulative exfiltration tuning",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
