{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>End-users of Outlook have the ability to set a meeting to have a ‘Private’ or ‘Confidential’ sensitivity level in order to protect the information of a meeting they consider sensitive. To ensure that these meetings cannot be analyzed, Viva Insights would remove these meetings from metric computation.</p><p><b>When this will happen:</b></p><p>We will begin rolling this out in mid-September 2024 and expect to complete by mid-October 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>As this change begins rolling out, your organization will see the following updates: \n</p><ul><li>Sensitive meetings would be excluded from the output of Meeting Query\n</li><li>Subjects of sensitive meetings would remain hidden and cannot be used in any query\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>No action needed from your organization. You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Viva Insights will exclude meetings marked as 'Private' or 'Confidential' from metrics, starting mid-September 2024, with full rollout by mid-October 2024. No action is required from organizations, but updating training and documentation may be considered."
    }
  ],
  "EndDateTime": "2024-11-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC876291",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-28T23:53:53.07Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-28T23:53:30Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Sensitive meetings to be excluded from Viva Insights metrics",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
