{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 30, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>A new Microsoft Purview compliance portal introduces a pivotal communications enhancement that integrates Insider Risk Management (IRM) alerts within Communication Compliance (CC) triage flows, providing a holistic approach to compliance risk assessment. This integration empowers investigators with enriched insights by correlating communication alerts with a user's risk profile and activity history from IRM directly in a CC triage flow. This synergy between IRM and CC facilitates a more nuanced and informed decision-making process during investigations.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=408534\" target=\"_blank\">408534</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-November 2024 (previously early November) and expect to complete by mid-November 2024 (previously late October)<br></p><p>General Availability (Worldwide): We will begin rolling out mid-December 2024 (previously mid-November and expect to complete by late January 2025 (previously late December).</p><p> <b>How this will affect your organization:</b>\n</p><p>The integration of IRM context into CC is a significant stride towards enhancing the efficacy of compliance investigations. This will allow investigators to view a user's risk profile and history alongside communication alerts, enabling a more informed and efficient triage process.\n</p><p>The insider risk severity (Low, Medium, or High) determined by activity detected in IRM policies helps to prioritize and respond to user activity accordingly. A new user activity timeline will show messages and activities from IRM in one screen, simplifying the review process. \n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/ddfd4015-92af-4464-bed3-8ca48dffbccc\" style=\"width: 500px;\"><br></p><p><br></p><p><b>What you need to do to prepare:</b>\n</p><p>To use this feature, please connect with IRM administrators to enable <i>Data sharing</i> from IRM settings. If you don't turn this setting on, you will see <i>Insider risk activity not available.</i></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c227a8e6-dde4-481e-b799-94fe8efb9469\" style=\"width: 500px;\"><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408534"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview compliance portal is updated to integrate Insider Risk Management alerts within Communication Compliance triage flows, enhancing compliance risk assessment. Rollout begins mid-November 2024 for Public Preview and mid-December 2024 for General Availability. Organizations must enable Data sharing in IRM settings to prepare."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC878431",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-30T22:33:51.26Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-30T20:53:32Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview Communication Compliance: Enrich triage with Insider Risk Management context",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
