{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams tenants will soon be able to enable verification for anonymous meeting participants via CAPTCHA. This release of CAPTCHA Verification for Anonymous Meeting Participants will be rolling out across Microsoft Teams Desktop, Mobile and Web and will provide additional security against malicious bot and third-party app joins.&nbsp;<br></p><p><b>When this will happen:</b><br></p><p>General Availability (Worldwide): We will begin rolling out early October 2024 and expect to complete by mid-October 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Tenants can enable anonymous meeting attendee verification via CAPTCHA in the Teams Admin Center. When enabled, any users that join the meeting as an anonymous user will be required to pass a CAPTCHA verification before landing in the meeting (including the meeting lobby, if enabled).</p><p><b>What you need to do to prepare:</b>\n</p><p>This feature is off by default and Tenant Admins will need to enable CAPTCHA verification for their tenants through Meeting policies in the Teams Admin Center.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing CAPTCHA verification for anonymous participants, rolling out in early to mid-October 2024. This feature, which is off by default, can be enabled by Tenant Admins in the Teams Admin Center to provide additional security."
    }
  ],
  "EndDateTime": "2024-11-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC875061",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-27T23:07:34.573Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-27T23:07:09Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "CAPTCHA Verification for Anonymous Meeting Participants",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
