{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Like Lists and libraries, Viva Amplify campaigns can contain sensitive information, such as marketing campaign budgets or human resources initiatives. The <i>Required approval</i> feature brings compliance, accountability, and workflows to Lightweight Approvals in Viva Amplify. Whether you require multiple levels of approvals or approvals from a single decision maker, the new <i>Required approval</i> feature in Viva Amplify empowers communicators to customize the process to suit their approval workflow and ensure every piece of content undergoes a thorough review process before it is published.</p><p>The <i>Required approval</i> button is present under the <i>Advanced settings</i> of the <i>Campaign settings</i> experience, which can be accessed in any given campaign’s header section. When the <i>Required approval</i> setting is enabled, all newly created publications will be required to go through the approval process before content can be published.&nbsp;</p><p>This is an optional setting.&nbsp; </p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=409233\" target=\"_blank\">409233</a>.</p><p><b>When this will happen:</b>&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out late August 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b></p><p>\n</p><p>Viva Amplify users will be able to set a campaign’s setting so that approval is required across all publications before the content is published. This feature is available for users in the web/desktop experience. Please note that Viva Amplify on Mobile iOS and android applications is currently out of scope.  &nbsp;</p><p>This update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "409233"
    },
    {
      "Name": "Summary",
      "Value": "The new 'Required approval' feature in Microsoft Viva Amplify ensures content undergoes review before publishing. It's an optional setting found under 'Campaign settings'. Rollout begins late August 2024, with no admin action needed but users should be informed. Viva Amplify on mobile is excluded."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC873749",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-26T22:48:30.693Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-26T22:48:20Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Required approval for Viva Amplify",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
