{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Many users have voiced frustrations over copying messages in Teams, particularly the inclusion of metadata like names and timestamps. Customer feedback has been clear, signaling that this feature was adding more noise than value to user workflow.</p><p>\n</p><p>We are rolling out the change that copied messages are only showing the message content moving forward.</p><ul><li>Streamlined Experience: Most users simply want to copy and paste messages without the extra clutter. Removing names and timestamps from copied content helps maintain focus and reduces unnecessary noise.</li><li>Better Alternatives for Specific Needs: For those who need to forward messages or extract conversations, we recommend using the Forward feature for message transfer between chats, and the Teams Export API for conversation extraction. These tools are more robust and prevent manipulation of message content.</li></ul><p><b>When this will happen:</b><br></p><p>General Availability (Worldwide): Available now and we apologize for not communicating prior to the rollout occurring.<br></p><p><b>How this will affect your organization:</b><br></p><p>Some users might have used this timestamp and message author name for different purposes and might report that this information is not part of the pasted content anymore.</p><p><b>What you can do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Teams has removed timestamps and author names from copied messages to reduce clutter. Users who need detailed message transfer should use the Forward feature or Teams Export API. This change is already in effect, and organizations may need to update training materials accordingly."
    }
  ],
  "EndDateTime": "2024-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC878422",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-30T20:48:47.543Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-30T20:48:36Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Teams copy/paste of messages does not include timestamp and message author name",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
