{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As communicated in MC805200 Microsoft Teams: Tenant Federation setting to control external access with trial-only tenants (June 2024), we introduced a new admin control&nbsp;to enable you to block external access (federation) with Teams trial-only tenants. Some malicious actors have used free Teams trials to launch phishing or abuse attacks against Teams users. With this setting you can add another layer of protection for users against some of these attacks.\n</p><p>Between June 2024 and August 2024, we provided a 45-day window to allow you to review and update the setting before enforcement began. Now, by default, this new setting will block external access with trial-only tenants and requires explicit action from you to continue to federate with trial tenants.&nbsp;</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Available now. Blocking or allowing external access with trial-only tenants with this setting was enabled August 15, 2024. If you missed MC805200, you can still manage the setting for your organization at any time. </p><p><b>How this will affect your organization:</b><br></p><p>Teams PowerShell now supports the new Tenant Federation setting <code>-ExternalAccessWithTrialTenants</code> with the values <code>Allowed</code> or <code>Blocked</code>. When set to <code>Blocked</code>, all external access with users from Teams subscriptions that contain only trial licenses will be blocked. This means users from these trial-only tenants will not be able to search or reach your users via chats, Teams calls, and meetings (using the users' authenticated identity) and your users will not be able to reach users in these trial-only tenants. If this setting is set to <code>Blocked</code>, users from the trial-only tenant will also be removed from any existing chats. The default setting will be to block external access with trial-only tenants.\n</p><p><i>Important Notes</i></p><ul><li>A \"trial-only\" tenant is defined as a tenant with a Teams service plan that has only Trial subscriptions (0 purchased licenses).\n</li><li>Shared Channels, Guest access and Anonymous Meeting joins will not be affected by this setting.\n</li><li>This new setting only controls external communication with trial-only tenants within the same Microsoft 365 cloud environment. When enforcement starts, users from trial-only tenants <code>in public clouds</code> will be blocked by default from external communication with users in other Microsoft 365 cloud environments and with Microsoft Skype for Business server users. No admin control will exist to allow cross-cloud external communication with trial tenants.\n</li><li>If your tenant has enabled <i>Allow only specific domains</i> and specified domains in the Allow list, and if <code>-ExternalAccessWithTrialTenants</code> is set to <code>Blocked</code>, trial-only tenants in the Allow list will be blocked. If this setting is set to <code>Allowed</code>, all domains in the Allow list will be allowed.\n</li><li>If your tenant has enabled <i>Block all external domains,</i> the <code>-ExternalAccessWithTrialTenants</code> setting has no impact.\n</li><li>If your tenant has enabled <i>Block specific domains</i> and specified domains in the Block list, and if the <code>-ExternalAccessWithTrialTenants</code> setting is set to <code>Blocked</code>, trial-only tenants not in the Block list will also be blocked. If set to <code>Allowed</code>, this setting has no impact.</li><li>For two trial-only tenants to be able to federate, both of them need to have the <code>-ExternalAccessWithTrialTenants</code> set to <code>Allowed</code>.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Review your settings for external access to determine if you need to change the default value for this new setting. To change this setting, install the latest PowerShell package (6.4.0) and use the <code>Set-CsTenantFederationConfiguration</code> command to set the desired value when the setting is available:\n</p><ol><li>Download or upgrade to the latest PowerShell package: <a href=\"https://www.powershellgallery.com/packages/MicrosoftTeams/\" target=\"_blank\">https://www.powershellgallery.com/packages/MicrosoftTeams/</a>\n</li><li>To allow external communication with trial-only tenants, use this command: <code>Set-CsTenantFederationConfiguration -ExternalAccessWithTrialTenants \"Allowed\"</code>\n</li><li>To block external communication with trial-only tenants, use this command: <code>Set-CsTenantFederationConfiguration -ExternalAccessWithTrialTenants \"Blocked\"</code>\n</li></ol><p><i>Learn more</i></p><ul><li>PowerShell cmdlet configuration: <a href=\"https://learn.microsoft.com/en-us/powershell/module/teams/set-cstenantfederationconfiguration?view=teams-ps&amp;viewFallbackFrom=skype-ps\" target=\"_blank\">Set-CsTenantFederationConfiguration | Microsoft Learn</a>\n</li><li>Manage external communication: <a href=\"https://learn.microsoft.com/microsoftteams/trusted-organizations-external-meetings-chat?tabs=organization-settings\" target=\"_blank\">IT Admins - Manage external meetings and chat with people and organizations using Microsoft identities</a></li></ul><p>You may want to notify your admins about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams has introduced a new admin control to block external access with Teams trial-only tenants. This setting, which defaults to 'Blocked', aims to protect against malicious activities. Admins can review and update this setting using PowerShell commands. General availability of this feature started on August 15, 2024."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC870997",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-23T23:22:37.423Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-23T23:22:02Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "[Reminder] Microsoft Team: Review and update Tenant Federation setting to block external access with trial-only tenants",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
