{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As mentioned in MC798311, in late September 2024, the Intune Company Portal app for Windows will be updated with a new, modernized design, offering an improved user experience while maintaining the same functionality. Read the blog to learn more: <a href=\"https://aka.ms/Intune/Windows-CP-redesign\" target=\"_blank\">New look for Intune Company Portal app for Windows</a></p><p><b>How this will affect your organization:</b></p><p>This is a user interface (UI) update only, there is no change in functionality. Users with automatic updates enabled will see the new design automatically once it is released to the Microsoft Store. If automatic updates are not configured, users will see the new design once they have manually updated the app.</p><p><b>What you need to do to prepare:</b></p><p>Review the blog: <a href=\"https://aka.ms/Intune/Windows-CP-redesign\" target=\"_blank\">New look for Intune Company Portal app for Windows</a>. Update your IT admin and user documentation to reflect the new design, as needed.  \n</p><p><b>Note:</b> A preview version is available in the <a href=\"https://go.microsoft.com/fwlink/?linkid=2272709&amp;clcid=0x409\" target=\"_blank\">Microsoft Download Center</a> for testing purposes only and will be removed when the Company Portal update is released in late September 2024.&nbsp;</p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In late September 2024, the Intune Company Portal app for Windows will receive a new design, enhancing user experience without altering functionality. Organizations should review the blog and update documentation as needed. A preview is available for testing."
    }
  ],
  "EndDateTime": "2024-10-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC870995",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-23T23:21:05.657Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-23T23:19:09Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Plan for Change: New design for Intune Company Portal app for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
