{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Defender XDR | Microsoft Defender for Identity: We’re adding to Microsoft Secure Score improvement actions to ensure a more accurate representation of security posture. We will update your score automatically.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-September 2024 and expect to complete by late September 2024.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD, USSec, USNat): We will begin rolling out mid-September 2024 and expect to complete by mid-October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, the Defender XDR portal will include these new Microsoft Defender for Identity recommendations as Microsoft Secure Score improvement actions:\n</p><ul><li>Accounts with non-default Primary Group ID\n</li><li>Domain Controllers with computer account password unchanged for more than 45 days\n</li><li>GPO assigns unprivileged identities to local groups with elevated privileges\n</li><li>GPO can be modified by unprivileged accounts\n</li><li>GPO contains passwords Group Policy Preferences files\n</li><li>Built-in Active Directory Guest account is enabled\n</li><li>Unsafe permissions on the DnsAdmins group\n</li><li>Ensure that all privileged accounts have the configuration flag \"this account is sensitive and cannot be delegated\"\n</li><li>Change password of krbtgt account\n</li><li>Change password of built-in domain Administrator account\n</li></ul><p>Additionally, we are updating the existing recommendation of \"Modify unsecure Kerberos delegations to prevent impersonation\" to include indication of Kerberos Constrained Delegation with Protocol Transition to a privileged service.\n</p><p>These new identity recommendations are new security posture reports related to Active Directory and Group policy objects and will be available by default to customers who have installed a Defender for Identity sensor.\n</p><p>These recommendations are on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend reviewing the improvement actions listed in Microsoft Secure Score. We will continue to add suggested security improvement actions on an ongoing basis.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/defender-for-identity/security-assessment\" target=\"_blank\">Security posture assessments - Microsoft Defender for Identity | Microsoft Learn</a>&nbsp;(article will be updated before rollout begins)</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Identity will soon add new recommendations to Microsoft Secure Score, automatically updating scores to better reflect security posture. Public Preview and General Availability rollouts will begin mid-September 2024. Organizations should review Microsoft Secure Score improvement actions to prepare."
    }
  ],
  "EndDateTime": "2024-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC875063",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-27T23:08:04.077Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-27T23:07:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity: New recommendations for Microsoft Secure Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
