{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re bringing a new theme creation experience into the <a href=\"https://learn.microsoft.com/sharepoint/brand-center-overview\" target=\"_blank\">Microsoft SharePoint Brand center,</a> allowing you to easily create and manage themes for your sites and related experiences.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=374871\" target=\"_blank\">374871</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early September 2024 and expect to complete by mid-September 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2024 and expect to complete by mid-October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With our latest update to the SharePoint Brand center, we are enabling customization through colors. This update introduces a brand color management experience along with a new experience for creating and managing themes for your organization.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oko3?ver=3aaf\" style=\"width: 450px;\" alt=\"user settings\">\n</p><p>The all-new brand color experience allows you to create a standard set of colors for your organization that will be utilized in other experiences. This allows you to seamlessly create and standardize your color options.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ohOC?ver=8adb\" style=\"width: 450px;\" alt=\"user settings\">\n</p><p>You will also be able to create and manage your organization’s themes in the Brand center for SharePoint and Microsoft Viva Connections.  With this new theme creation and management experience, you will be able to easily create themes for your organization and make them available in the \"Change the look\" experience.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oko6?ver=9cc2\" style=\"width: 450px;\" alt=\"user settings\">\n</p><p>Note: Themes previously created with PowerShell will remain outside of this management experience and be managed via PowerShell.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To use the new brand color and theme experience, you must have previously enabled the SharePoint Brand center in the Microsoft 365 Admin center.  \n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://support.microsoft.com/office/change-the-look-of-your-sharepoint-site-06bbadc3-6b04-4a60-9d14-894f6a170818\" target=\"_blank\">Change the look of your SharePoint site - Microsoft Support</a>\n</li><li><a href=\"https://learn.microsoft.com/sharepoint/brand-center-overview\" target=\"_blank\">SharePoint Brand Center - SharePoint in Microsoft 365 | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "374871"
    },
    {
      "Name": "Summary",
      "Value": "The new theme creation experience in the SharePoint Brand center allows easy creation and management of themes for SharePoint and Viva Connections sites. Rolling out starts in early September 2024, with general availability by mid-October 2024. Organizations can standardize colors and themes, enhancing customization. Preparation requires enabling the SharePoint Brand center."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-21T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC876281",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-28T23:49:35.337Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-28T23:49:23Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Create themes for SharePoint and Viva Connections in brand center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
