{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 26, 2024:&nbsp; We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Outlook: Work hours and location information will be available in the <i>My Day</i> pane in Outlook. Users will be able to update their Work Hours and Location information from My Day and also see who is coming to Office. This message applies to new Outlook for Windows desktop and Outlook for the web.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412618\" target=\"_blank\">412618</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release:&nbsp; We will begin rolling out early December 2024 (previously mid-November) and expect to complete by late December 2024 (previously mid-November).&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out mid-December 2024 (previously early October) and expect to complete by early January 2025 (previously early December).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users can review and update their work hours and location information in Outlook <i>Settings &gt; Calendar &gt; Work hours and location</i>. This settings page will remain in place after the rollout.\n</p><p>After this rollout, users will also be able to see and update their work hours and location information in the <i>My Day</i> pane in Outlook. Changes to the My Day pane will sync to any other work hours and location settings made in Outlook.\n</p><p><i>My Day</i> pane with prompt to <i>Set up your work location:\n</i></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1c7ac8b3-9038-4d20-8d0e-05d0ba99d8f2\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>My Day </i>pane with work location information, which can be updated:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2575f4a4-117b-48aa-b03b-8151a21f5c93\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412618"
    },
    {
      "Name": "Summary",
      "Value": "Outlook is updating the My Day pane to allow users to view and edit work hours and location, with a revised rollout timeline from mid-December 2024 to early January 2025. This feature is associated with Microsoft 365 Roadmap ID 412618 and will be on by default. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC877318",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-26T19:40:33.307Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-29T21:57:51Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Review and update work hours and location in the My Day pane",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
