{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 26, 2024: This feature is now live and is active in your tenant.</p><p>Coming soon for Microsoft Fabric: Two new settings in the <a href=\"https://app.fabric.microsoft.com/admin-portal/tenantSettings?experience=power-bi\" target=\"_blank\">Fabric Admin portal</a> that are designed to enhance security and flexibility for applications interacting with Microsoft OneLake.   \n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late September 2024 and expect to complete by late September 2024. You can start saving your settings in late August 2024.\n</p><p>When the General Availability release timeline is known, we will update you.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users could not generate SAS tokens in OneLake.\n</p><p>After this rollout: Admins will have support for short-lived user-delegated OneLake shared access signature (SAS) tokens in public preview. This functionality allows applications to request a user delegation key backed by a Microsoft Entra ID, which can then be used to build a OneLake SAS token. This token can be handed off to provide delegated access to another tool, node, or user, ensuring secure and controlled access.  OneLake SAS tokens are constructed and used similarly to <a href=\"https://learn.microsoft.com/rest/api/storageservices/create-user-delegation-sas\" target=\"_blank\">Azure Storage SAS tokens</a>, with a few key differences: \n</p><ul><li>OneLake user delegation keys and SAS tokens cannot exceed a lifetime of one hour.  \n</li><li>OneLake SAS tokens are always user delegated and must be backed by an Entra ID.  \n</li><li>OneLake SAS can only grant access to data items in Fabric.\n</li></ul><p>The usage of OneLake SAS in a Fabric tenant is controlled by two tenant switches:\n</p><ol><li>A switch managed by tenant admins that controls the generation of OneLake SAS tokens\n</li><li>A switch automatically delegated to workspace admins that controls the acceptance of OneLake SAS tokens\n</li></ol><p>Both switches must be turned on to allow the use of OneLake SAS in a workspace.\n</p><p><i>Scenarios supported by SAS \n</i></p><p>Delegated access with SAS tokens allows applications without native support for Microsoft Entra to gain temporary access to specific folders or files in OneLake. SAS tokens are commonly used for data integration workloads by granting external engines temporary permissions to write data to a staging location.  Many ISVs also use SAS tokens to grant their users temporary scoped-down access to their data.   \n</p><p><i>New tenant settings</i>\n</p><p>1. <i>Use Short-lived user-delegated SAS tokens</i> (Preview):\n</p><ul><li>Default Status: ON\n</li><li>This setting allows the creation of short-lived user-delegated SAS tokens by turning on the user delegation key API for the entire tenant.   \n</li></ul><p>2. <i>Authenticate with OneLake user-delegated SAS tokens</i> (Preview): \n</p><ul><li>Default Status: OFF \n</li><li>This setting enables authentication using OneLake user-delegated SAS tokens. This setting is automatically delegated to workspace admins, allowing them to decide whether their workspace will accept OneLake SAS as a valid authentication method.  \n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>1. Review and decide on settings: \n</p><ul><li><i>Use short-lived user-delegated SAS tokens:</i> As this setting is turned ON by default, please review its implications and decide if it should remain enabled for your organization. \n</li><li><i>Authenticate with OneLake user-delegated SAS tokens</i>: This setting is OFF by default, and workspace admins will be able to enable this feature. Evaluate its potential benefits and determine if you would like to enable it automatically for all workspaces.  \n</li></ul><p>2. Action for tenant admins: \n</p><ul><li>In late September 2024, OneLake SAS will be available in public preview. If no actions are taken on the tenant setting, workspace admins will be able to turn ON OneLake SAS authentication for their workspace. Note that <i>Authenticate with OneLake user-delegated SAS tokens</i> is automatically delegated to workspace admins. If you prefer not to have these features available for your organization, please turn OFF the <i>Use short-lived user-delegated SAS tokens</i> setting in Fabric before late September 2024. This will disable OneLake SAS generation for your tenant, ensuring OneLake SAS cannot be used, regardless of the workspace admins setting.  \n</li><li>Workspace admins will be able to enable authentication with SAS tokens for their workspaces if no action is taken by tenant admins.  \n</li><li>We encourage you to assess these new settings and make any necessary changes to align with your organization's security and access control policies. \n</li></ul><p>If you have any questions or need further assistance, please do not hesitate to contact our support team. \n</p><p>This rollout will happen automatically by the specified dates with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Explore <a href=\"https://learn.microsoft.com/fabric/\" target=\"_blank\">Microsoft Fabric documentation</a>. Before rollout, we will update this post with links to new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details the live feature of short-lived user-delegated SAS tokens in Microsoft Fabric, with new tenant settings available in the Fabric Admin portal. It outlines the rollout timeline, effects on organizations, supported scenarios, new settings, and preparation actions required for tenant and workspace admins."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC873746",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-26T22:21:07.08Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-26T22:46:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Fabric: New tenant settings for short-lived user-delegated SAS tokens (Preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
