{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In mid-2023, we introduced colored folders for Microsoft OneDrive on the web as a way to personalize and customize folders. With this rollout, we will bring that functionality to the OneDrive folder in the Microsoft Windows File Explorer.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=410218\" target=\"_blank\">410218</a>.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-September 2024 and expect to complete by early October 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>Before this rollout, users are not able to view or apply color to folders in File Explorer.\n</p><p>After this rollout, users will be able to see folder colors applied from OneDrive on the web in the OneDrive folder in File Explorer and manage folder colors in File Explorer by right clicking a folder name and then selecting <i>OneDrive &gt; Folder color.\n</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ofRR?ver=ee35\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You should expect the change to gradually roll out on Sync client builds newer than 24.132\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410218"
    },
    {
      "Name": "Summary",
      "Value": "Colored folders introduced on OneDrive web mid-2023 will be available in Windows File Explorer for OneDrive folders starting mid-September 2024. Users can view and manage folder colors directly in File Explorer. The feature will be on by default with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-12-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC878504",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-30T22:02:23.987Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-30T22:02:03Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft OneDrive for Business: Colored folders in the OneDrive folder in Microsoft Windows File Explorer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
