{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 9, 2024: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>\n</p><p>As communicated in MC711020 <i>Outlook: Outlook for web – new application ID</i> (January 2024), Microsoft Outlook for the web is undergoing an authentication platform migration to a public client authentication model using <a href=\"https://github.com/AzureAD/microsoft-authentication-library-for-js#microsoft-authentication-library-for-javascript-msaljs\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">MSAL (Microsoft Authentication Library)</a>. The change to client-side authentication will be subject to <a href=\"https://developers.google.com/privacy-sandbox/blog/cookie-countdown-2023oct\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Google's third-party cookie block</a> that may be active in Chrome and Edge.<br></p><p>Google's third-party cookie block impacts navigation to Microsoft Entra ID to perform silent single sign-on (SSO). To overcome this block, Outlook for the web will present a banner for the user to refresh their session. This will enable navigation to Entra ID to refresh their token. SSO-enabled Windows devices are expected to silently sign in users with SSO without requiring further interaction and will not display the banner. This issue affects Outlook for web users. It will not affect users of new Outlook for Windows, Outlook (classic), Outlook for Mac, Outlook Mobile for iOS and Outlook Mobile for Android.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late November 2024 (previously late September) and expect to complete by late January 2025 (previously late December).</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late December 2024 (previously late October) and expect to complete by late February 2024 (previously late December).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this migration: Outlook for the web users were not affected by the third-party cookie block in Chrome and Edge and were able to stay signed in unless they signed out or were signed out due to inactivity.\n</p><p>After Outlook for the web migrates to MSAL, Outlook for the web users without device SSO who are using Google Chrome or Microsoft Edge and who have third-party cookie blocking enabled will start seeing the following if Outlook for the web is not able to silently sign in the user with SSO:\n</p><ul><li>Outlook for the web will display a red banner below the ribbon and require users to sign in when a session is open for more than 24 hours.\n</li><li>Windowed (deep linked) Mail items and Calendar events will display a blocking dialog requesting users to return to Outlook for the web to sign in when the deep-linked item token expires.\n</li><li>Independent of Outlook for the web's migration to MSAL, Outlook for the web may include embedded experiences such as apps that may stop functioning due to the third-party cookie block. If this happens, the app may provide an app-specific experience to refresh their token. Alternatively, the user may be able to right-click the app to launch the app in a browser or can choose to refresh the entire Outlook for the web session.</li></ul><p>Sign-in error message in red banner below the ribbon in Outlook for the web: \"You need to sign in. Your session has expired. You may need to enable pop-ups in your browser for this site. Sign in to continue\":\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/448c4484-c2d3-4755-9023-ac7a4293f503\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>Dialog box requesting users to sign in again:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/efa9f7ff-409a-4e2a-8464-2898cb950db7\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>The authentication rollout will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><ul><li>In Chrome, enterprise administrators can reset the <a href=\"https://chromeenterprise.google/policies/#BlockThirdPartyCookies\" target=\"_blank\">BlockThirdPartyCookies</a> setting to avoid the block.\n</li><li>Enterprise administrators can also <a href=\"https://learn.microsoft.com/entra/identity/devices/device-sso-to-on-premises-resources#Overview\" target=\"_blank\">enable SSO from their Windows devices</a> or add the<a href=\"https://chromewebstore.google.com/detail/ppnbnpeolgkicgegkbkbjmhlideopiji\" target=\"_blank\"> Microsoft Single Sign On extension for Chrome</a> to ensure their users are not impacted.\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook for the web's migration to MSAL may cause sign-in prompts due to third-party cookie blocks in Chrome and Edge. Users without device SSO might see a red banner or dialog box requesting re-authentication. Rollout begins late November 2024, with preparations advised for enterprise administrators."
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC871011",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-09T22:53:42.273Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-23T23:38:07Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook for the web: Third-party cookie block causes users to sign in again on Chrome and Edge",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
