{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Within Microsoft Purview AI Hub, prompts and responses will appear in Activity explorer for the AI Interaction event for Microsoft Copilot for Microsoft 365.&nbsp;<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=408545\" target=\"_blank\">408545</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will roll out in late August.</p><p>\nGeneral Availability (Worldwide): We will roll out in late November 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, prompts and responses were not available within Activity explorer in Microsoft Purview AI Hub.</p><p>After this rollout, you will have the ability to see user prompts and responses from Copilot for Microsoft 365 within Microsoft Purview AI Hub.&nbsp;</p><p>To see the prompts and responses, the Microsoft Purview Content Explorer Content Viewer role must be assigned to the user. For more information, see&nbsp;<a href=\"https://go.microsoft.com/fwlink/?linkid=2276967\" target=\"_blank\">Permissions for Microsoft Purview AI Hub</a>.&nbsp;</p><p>Some use cases do not properly display the prompts and responses within Microsoft Purview AI Hub and have been documented as <a href=\"https://go.microsoft.com/fwlink/?linkid=2281654\" target=\"_blank\">known issues.&nbsp;</a></p><p><b>What you need to do to prepare:</b>\n</p><p>Get ready for this change by reviewing the documentation and assigning the Microsoft Purview Content Explorer Content Viewer role to users who should have access to view prompts and responses within Microsoft Purview AI Hub.</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/ai-microsoft-purview-considerations\" target=\"_blank\">Considerations for Microsoft Purview AI Hub and data security and compliance protections for Microsoft Copilot</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408545"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview AI Hub will display prompts and responses from Copilot for Microsoft 365 in Activity explorer. Public Preview begins in late August, with full rollout in November 2024. Users need the Content Explorer Content Viewer role to access this feature, and some known issues are documented. Preparation involves role assignment and reviewing documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC873747",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-26T22:48:02.02Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-26T22:46:53Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview compliance portal: Microsoft Purview AI Hub prompts and responses",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
