{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft OneDrive for the web: Improved search experience for finding files stored in your OneDrive, shared folders, and document libraries.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=395379\" target=\"_blank\">395379</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late September 2024 and expect to complete by late October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users are not able to easily filter by date or file types and cannot easily identify location of files with similar names. \n</p><p>After this rollout: Users can filter search results by file types, date modified and easily switch between <i>My files, All files, Current folder </i>and <i>Current document library</i>. This feature is on by default.\n</p><p>New search results page with file type filters, date filters, and a clickable <i>Location</i> column that searches all locations (personal OneDrive, shared folders, and document libraries):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ooZX?ver=f7ff\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Use the <i>Date</i> filter to filter search results based on when files were modified. In this example, the results are filtered to <i>Today:\n</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oeI6?ver=8aac\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395379"
    },
    {
      "Name": "Summary",
      "Value": "An improved search experience is coming to OneDrive for the web, enabling users to find files more efficiently with new filters and a clickable location column. Rollout starts late September 2024, completing by late October 2024, and requires no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC875179",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-08-28T01:54:15.68Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-08-28T01:54:04Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft OneDrive: Find files faster with the improved search experience in OneDrive for the web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
