{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>For new Microsoft Outlook for Windows and Microsoft Outlook for web, users will be able to filter search results by All, Mail, Files, Teams, and People.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=398707\" target=\"_blank\">398707</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We began rolling out mid-August 2024 and expect to complete by mid-September 2024.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-September 2024 and expect to complete by mid-October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users will not be able to filter their search results. After this rollout, the following new search filters will be available in new Outlook for Windows and Outlook for web:</p><ul><li>All</li><li>Mail</li><li>Files</li><li>Teams</li><li>People</li></ul><p>The Teams filter shows relevant chat messages. In the People filter results, users can select a person's name to display their full People card.</p><p>This feature is available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "398707"
    },
    {
      "Name": "Summary",
      "Value": "Outlook for Desktop and web will introduce search filters such as All, Mail, Files, Teams, and People. The rollout begins mid-August 2024 for Targeted Release and mid-September 2024 for General Availability, completing by mid-October 2024. No admin action is required for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-11-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888052",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-11T22:13:07.847Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-11T22:12:33Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Outlook for Desktop and web: Users can scope search suggestions to specific entities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
