{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To simplify our communications for ‘Azure Information Protection’ events in Service health and Message center, we’re consolidating communications under the existing ‘Microsoft Purview’ service listing. Once the change is in place, you’ll see ‘Azure Information Protection’ events communicated under ‘Microsoft Purview’.<br></p><p>\n</p><p><b>When this will happen:</b><br></p><p>This will be rolled out to Service health and Message center by the end of September 2024.&nbsp;</p><p><b>How this will affect your organization:</b><br></p><p>Communications related to ‘Azure Information Protection’ will be communicated under ‘Microsoft Purview’ in Service health and Message center.</p><p><b>What you need to do to prepare:</b><br></p><p>You might consider updating your administrator training and documentation as needed. If you would like to receive email notifications for events related to ‘Azure Information Protection’ after this change, please configure your email preferences to include ‘Microsoft Purview’, within Service health and Message center pages respectively.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Azure Information Protection communications will be consolidated under Microsoft Purview in Service Health and Message Center by September 2024. Organizations should update training and documentation, and configure email preferences to include Microsoft Purview for related notifications."
    }
  ],
  "EndDateTime": "2024-10-21T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC888878",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-12T23:11:23.263Z",
  "Services": [
    "Azure Information Protection",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-12T23:11:13Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Service health and Message center: Azure Information Protection consolidation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
