{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft OneDrive Sync: When users are about to delete shared items, a new prompt will ask users to confirm the deletion. When users are about to mass delete local items, an updated prompt will ask users to confirm the deletion. This message applies to OneDrive on Windows desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415705\" target=\"_blank\">415705</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-September 2024 and expect to complete by early October 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>Before this rollout, users are able to delete shared items in File Explorer without being asked to confirm the deletion. Users are prompted to confirm deletion before they mass delete local items, which might have included shared items.\n</p><p>After this rollout, when users are running OneDrive and OneDrive is not paused, and users are about to delete shared items or mass delete local items (more than 200 items by default) in File Explorer, users will be asked to confirm the deletion of shared items in a new prompt or the deletion of mass items in an updated prompt in File Explorer:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p1sd?ver=c559\" alt=\"user prompt\" style=\"width: 400px;\">\n</p><p>Prompt to confirm the mass deletion of local items:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p6DN?ver=8755\" style=\"width: 400px;\" alt=\"user prompt\">\n</p><p>In the Microsoft admin center, admins can set a value for the Group policies (SharedContentDeleteConfirmation and LocalMassDeleteFileDeleteThreshold) to prevent users from opting out of seeing the confirmation prompts. Admins can also set the threshold for mass delete (the default is 200 items). If admins do not set a value for the Group policies, users will be able to opt out of the confirmation messages.\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will be applicable in builds later than One Drive 24.091.0505.0001. No admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Admins who set a value for the Group policies should be aware of these features in case internal support is needed for users who are not able to opt out of the confirmation dialogs.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneDrive is introducing a new confirmation prompt for deleting shared items and an updated prompt for mass local deletions, with rollout starting mid-September 2024. Admins can set policies to manage these prompts, which are enabled by default. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2024-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888872",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-12T23:07:16.183Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-12T23:06:48Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: New prompt to confirm deletion of shared items and updated prompt for local mass item deletions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
