{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 7, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>When users in Microsoft Outlook for iOS or Android select a PDF file protected with Microsoft Purview Information Protection sensitivity labels, they will be prompted to open the file in the Microsoft 365 app.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out early September 2024 and expect to complete by late November 2024 (previously late October).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout when users select a PDF with Purview Information Protection sensitivity labels in Outlook for iOS or Android, they are presented with a message that the file needed to be opened with a compatible app.\n</p><p>After this rollout when users select a PDFs with Purview Information Protection sensitivity labels in Outlook for iOS or Android, they will be presented with a button suggesting they open the file in the Microsoft 365 app if it is installed, or to install the Microsoft 365 app from the store if it is not installed:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1opPM?ver=02c4\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook's handling of PDFs with Purview Information Protection labels on iOS/Android is updated. Users will be prompted to open such PDFs in the Microsoft 365 app. Rollout starts early September 2024 and ends late November 2024. No admin action is needed, but user notification is advised."
    }
  ],
  "EndDateTime": "2025-01-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC883195",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-08T23:32:18.193Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-04T23:04:57Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Updated handling of PDFs with Purview Information Protection sensitivity labels for iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
