{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to new Microsoft Outlook: Users will be able to share Microsoft Word, Microsoft Excel and Microsoft PowerPoint files stored on their device (not stored in a cloud like Microsoft OneDrive) from new Outlook for Windows.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=397094\" target=\"_blank\">397094</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-September 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users are only able to see old Outlook for Windows when they try to share a Word, Excel or PowerPoint fie.\n</p><p>After this rollout, when users want to share a Word, Excel, or PowerPoint file that is saved to their device (not stored in a cloud like Microsoft OneDrive), the user can right-click the file name in File Explorer, select <i>Share</i>, and select new Outlook for Windows to email the file.\n</p><p>This option is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "397094"
    },
    {
      "Name": "Summary",
      "Value": "Outlook for Windows will soon allow sharing of Word, Excel, and PowerPoint files stored locally on devices via email. The rollout starts mid-September 2024, completing by mid-November 2024, with no admin action required. Users can right-click a file and select new Outlook to share it."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-01-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC882252",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-03T23:07:40.767Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-03T23:06:57Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Sharing Word, Excel, and PowerPoint local files through email",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
