{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>You can now collaborate better by having Microsoft Mesh event attendees join on a PC as a guest user. Event organizers can invite guest users outside their organization, providing an opportunity for broader collaboration and networking in Mesh events. Guests can sign in to the Mesh app to join events, participate in discussions, and experience the same interactive features as internal users, all while maintaining secure access control. </p><p>Guest users' creation follows the existing process for tenant guest user creation (outside of Mesh). For this release, guest users will require a Mesh license, just like regular tenant attendees, to collaborate within Mesh. </p><p>Guest access for the Mesh app on Meta Quest and support for anonymous participants will be supported in a future update.</p><p>Relevant links for licensing:</p><ul><li><a href=\"https://learn.microsoft.com/en-us/microsoftteams/teams-add-on-licensing/licensing-enhance-teams\" target=\"_blank\">Acquiring Teams Premium license</a></li><li><a href=\"https://learn.microsoft.com/en-us/mesh/setup/content/it-admin-led-trials\" target=\"_blank\">Acquiring Mesh Trial license</a></li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/en-us/microsoft-365/roadmap?filters=Microsoft%20Teams%2CGeneral%20Availability%2CDesktop%2CLaunched%2CIn%20development&amp;searchterms=413713\" target=\"_blank\">413713</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early October 2024 and expect to complete by mid-October 2024.</p><p>General Availability (Worldwide): We will begin rolling out mid-October 2024 and expect to complete by late October 2024.</p><p><b>How this will affect your organization:</b></p><p>Prior to this release, only users within your tenant could collaborate in Mesh events. When this feature is released, you can experience broader collaboration in Mesh with guest users in your tenant.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This feature rollout will happen automatically by the specified date with no admin action required.</p><p>You may want to notify your users about this change. For example, it would be helpful for Mesh event organizers to know upon release that Mesh events will support a broader collaboration with guest users in your tenant.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413713"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Mesh app on PC now supports guest access for events, allowing external users to join with a Mesh license. This feature will roll out in October 2024, enabling broader collaboration in Mesh events without requiring admin action. Event organizers can invite guests outside their organization, and future updates will include guest access on Meta Quest and anonymous participation. Microsoft 365 Roadmap ID 413713 is associated with this update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-12-09T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888047",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-11T22:10:03.44Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-11T22:09:50Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Microsoft Mesh app on PC supports guest access for events",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
