{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Groups experience will become the default groups experience in Microsoft Outlook on the web and new Outlook for Windows.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in early October 2024 and expect to complete by end late November 2024&nbsp;</p><p><b>How this will affect your organization:</b></p><p>Group users won’t have access to the old Groups experience in the left navigation pane below the primary mailbox level after this change. Users can access the new Groups experience by going to the navigation bar on the left margin and selecting the <i>Groups </i>icon below the <i>People </i>icon or by clicking on the <i>Groups </i>button below primary mailbox.&nbsp;&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1o6VZ?ver=11d1\" style=\"width: 500px;\"><b><br></b></p><p>Groups management in the people module will be deprecated, but users can continue to complete Groups management tasks in the new Groups experience</p><p>Please note that users who wish to continue accessing Groups in Primary Mailbox can do so by favoriting a group (right-click on the <i>respective group &gt; Add to favorites</i>).</p><p><u>About the new Groups experience</u></p><p>Outlook now has a new home for Microsoft 365 Groups - one central destination for users to connect, communicate, and collaborate with their teams. This new Groups experience includes the following benefits:&nbsp;</p><ul><li>New Group Home: Users can now stay updated on their groups, including recent files across the groups, and quickly access frequently used groups and find new ones based on their interests.&nbsp;</li><li>Users can find quick links to get to files, emails, events, and member management for Groups from the Groups Home itself.&nbsp;</li><li>Once inside a specific Group, users can create, consume, and share information related to a group, as well as manage events and members efficiently in fewer clicks.&nbsp;</li><li>Users can find recommended actions including member approval and storage management across the Groups Home&nbsp;</li></ul><p>Users can navigate to the individual group from the left navigation or the recent groups. For more information, see <a href=\"https://support.microsoft.com/topic/try-the-new-groups-in-outlook-02e9d556-45cb-481d-9a8a-d4b59c0cc945\" target=\"_blank\">Try the new Groups in Outlook</a>.&nbsp;</p><p><b>What you need to do to prepare:</b>&nbsp;</p><p>You may want to notify users about this new capability and update your training and documentation as appropriate.&nbsp;</p><p>For more information about Microsoft 365 Groups in Outlook, see <a href=\"https://support.microsoft.com/office/get-started-with-microsoft-365-groups-in-outlook-b86c141b-39cf-49d9-a4db-124c3d786204#ID0EBJ=Talk\" target=\"_blank\">Get started with Microsoft 365 Groups in Outlook</a>.&nbsp;</p><p><u>FAQs&nbsp;</u></p><p>1. Is there any functionality difference in the new Groups experience?&nbsp;</p><p>All the functionality of the old Groups experience is present in new Groups as well as a few additional features including recommended actions for owners and recent files across Groups.&nbsp;</p><p>2. Can I access Groups in primary mailbox still?&nbsp;</p><p>Users can favorite a group and continue to access Groups in primary Inbox</p><p>3. How to access new Groups experience.&nbsp;</p><p>In Outlook on the web and new Outlook for Windows, new Groups can be accessed from the Navigation Bar on the left margin, typically below the People icon or by clicking on the Groups button below primary mailbox.&nbsp;&nbsp;</p><p>4. Is this change applicable to classic Outlook for Windows as well?&nbsp;</p><p>No, this change only impacts Outlook on the web and the new Outlook for Windows. There are no changes in other clients including classic Outlook for Windows. The new Groups experience is not available in Mac.&nbsp;<b>&nbsp;</b></p><p>Note: This update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Groups experience in Outlook will become the default in early October 2024, with rollout completion by late November 2024. Users will access Groups via the navigation bar, and the old experience will be unavailable. The update includes a central destination for group activities and additional features like recommended actions and recent files. Preparation involves user notification and documentation updates."
    }
  ],
  "EndDateTime": "2025-01-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC882271",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-03T23:16:33.487Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-03T23:16:09Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Exchange Online: New Groups experience default update in Outlook on the web and new Outlook for windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
