{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Entra ID now supports FIDO2 provisioning via API, allowing organizations to pre-provision security keys (passkeys) for users. These new APIs can simplify user onboarding and provide seamless phishing-resistant authentication on day one for employees.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out mid-September 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Admins can onboard employees with admin provisioning of FIDO2 security keys (passkeys) on behalf of users, providing secure and seamless authentication from day one. While admins can still deploy security keys in their default configuration to their users or allow users to bring their own security keys which requires self-service registration by a user, these APIs allow keys to be pre-provisioned for users, so users have an easier experience on first use.</p><p>Passkey authentication method is enabled through Authentication method policy.</p><p>For more information on how to use this feature, see <a href=\"https://learn.microsoft.com/entra/identity/authentication/how-to-enable-passkey-fido2\" target=\"_blank\">Enable passkeys (FIDO2) for your organization</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra ID introduces FIDO2 provisioning APIs in public preview, enabling pre-provisioning of security keys for users, simplifying onboarding, and ensuring phishing-resistant authentication. Rollout begins mid-September 2024, with completion by late September. No admin action is required for the rollout."
    }
  ],
  "EndDateTime": "2024-11-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC883192",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-04T23:03:04.73Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-04T23:02:38Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Public Preview: Microsoft Entra ID FIDO2 provisioning APIs",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
