{
  "ActionRequiredByDateTime": "2024-10-15T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As mentioned in MC862873, starting on or after&nbsp;<b>October 15, 2024</b>, to further increase security, Microsoft will require admins to use multi-factor authentication (MFA) when signing into the Microsoft Azure portal, Microsoft Entra admin center, and Microsoft Intune admin center. <b>Note:</b> This requirement will also apply to any services accessed through the Intune admin center, such as Windows 365 Cloud PC. To take advantage of the extra layer of protection MFA offers, we recommend enabling MFA as soon as possible. To learn more, review <a href=\"https://aka.ms/mfaforazure\" target=\"_blank\">Planning for mandatory multifactor authentication for Azure and admin portals</a>.</p><p><b>How this will affect your organization:</b></p><p>MFA will need to be enabled for your tenant to ensure admins are able to sign-in to the <a href=\"https://portal.azure.com/\" target=\"_blank\">Azure portal</a>, <a href=\"https://entra.microsoft.com/\" target=\"_blank\">Microsoft Entra admin center</a> and <a href=\"https://intune.microsoft.com\" target=\"_blank\">Intune admin center</a> after this change.</p><p><b>What you need to do to prepare:</b></p><ul><li>If you have not already, <a href=\"https://aka.ms/mfaforazure\" target=\"_blank\">set up MFA</a> before <b>October 15, 2024</b>, to ensure your admins can access the Azure portal, Microsoft Entra admin center, and Intune admin center.</li><li>If you are unable to set up MFA before this date, you can <a href=\"https://aka.ms/managemfaforazure\" target=\"_blank\">apply to postpone the enforcement date</a>.</li><li>If MFA has not been set up before the enforcement starts, admins will be prompted to register for MFA before they can access the Azure portal, Microsoft Entra admin center, or Intune admin center on their next sign-in.</li></ul><p>For more information, refer to: <a href=\"https://aka.ms/mfaforazure\" target=\"_blank\">Planning for mandatory multifactor authentication for Azure and admin portals</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Enable multifactor authentication (MFA) for your tenant by October 15, 2024, to access Microsoft Azure portal, Microsoft Entra admin center, and Microsoft Intune admin center. Postponement is possible, but without MFA, admin sign-in will prompt MFA registration."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://aka.ms/mfaforazure"
    }
  ],
  "EndDateTime": "2025-03-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC889517",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-13T22:25:20.743Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-13T22:25:06Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Take action: Enable multifactor authentication for your tenant before October 15, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
