{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 16, 2024: Based on customer feedback, we have determined we will not be moving forward with the domain change as originally communicated. Users will not see a new URL and will continue to see outlook.office365.com/Encryption as they do today. Thank you for your feedback.</p><p>We will be proceeding with the minor design updates on the portal (fonts, colors, controls and more). These changes are to align with Purview branding and should not disrupt users.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-October 2024 and expect to complete by mid-December 2024.</p><p><b>How this affects your organization:</b></p><p>Users will see minor design changes within the UI.</p><p><b>What you need to do to prepare:</b></p><p>You may consider updating training and documentation as appropriate.</p><p>---Summary of original message---</p><p>The Microsoft Purview Message Encryption portal provides access to encrypted messages sent from your organization's users to external recipients. The <code>cloud.microsoft</code> domain was provisioned in early 2023 to provide a unified, trusted, and dedicated DNS domain space to host Microsoft’s first-party authenticated SaaS products and experiences. With this rollout, selected Microsoft products and scenarios will transition to a similar <code>static.microsoft</code> domain, in parallel with the previous domains. As part of this transition, the design of the portal (fonts, colors, controls, and more) will be adjusted to align with Purview branding and domain change.</p><ul></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview Message Encryption portal will not change domains as previously planned but will undergo minor design updates to align with Purview branding. These changes, expected to roll out from mid-October to mid-December 2024, should not disrupt users. Organizations may need to update training and documentation accordingly."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC887373",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-09-16T22:53:28.587Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-10T23:21:41Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Minor encrypted message portal design updates, URL to remain the same",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
