{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 13, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The availability of the delete API (removeallaccessforuser API) does not stop a malicious user from resending a Microsoft Teams message to the same victim. To help prevent that, a block user feature will allow the admin to block the malicious user from reaching out again. To make this possible, we will use a similar feature as the allow/block list in federation identity credentials to block the malicious user from the entire organization.&nbsp; &nbsp;<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=411138\" target=\"_blank\">411138</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early November 2024 (previously late October) and expect to complete by mid-November 2024 (previously early November).</p><p><b>How this will affect your organization:</b>\n</p><p>Admins can now set up a list of users that are blocked from collaborating with their organization. If a user is added to the block list, your organization will not be able to have 1:1 and group chats with these users. If chats already exist before a user is added to the block list, the blocked user will be removed from the chat.</p><p>This feature is turned off by default.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>If you wish to use this feature, navigate to external access organization settings to turn this feature on and add users to the block list.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "411138"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a block user feature to prevent malicious users from contacting an organization again. This feature, associated with Microsoft 365 Roadmap ID 411138, will be available worldwide in early November 2024. Admins can block users, preventing 1:1 and group chats with them. It's off by default and can be enabled in external access settings."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2024-12-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888879",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-13T22:29:39.423Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-12T23:11:49Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Block a user for your organization",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
