{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><b>Note:</b> If you are not using frontline worker functionality, you can ignore this message.</p><p>Coming soon in the Microsoft Teams admin center: Admins will be able to deploy location-based frontline teams where team membership is automatically managed, and team owners can also add frontline workers or remove them from teams. This rollout will allow admins to take advantage of dynamic rules to keep teams updated as members join and leave the organization and also give team owners the autonomy to manage membership at the team level.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=410774\" target=\"_blank\">410774</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early October&nbsp;2024 and expect to complete by mid-October 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-October 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, admins are able to:\n</p><ul><li>Create location-based <i>dynamic</i> frontline teams where team membership is strictly managed with dynamic rules.\n</li><li>Identify frontliner workers in their organization with a Microsoft Entra attribute and value pairings in the Deploy Teams at Scale tool.\n</li><li>Assign a single team owner for all frontline teams.\n</li></ul><p>After this rollout, admins will be able to:\n</p><ul><li>Create location-based frontline teams where team membership is automatically managed with dynamic rules, while respecting manual changes made by team owners.\n</li><li>Identify frontline workers in their organization with dynamic groups in the <i>Deploy Teams at Scale</i> tool.\n</li><li>Assign multiple individuals in the organization as team owners of frontline teams.\n</li></ul><p>After this rollout, team owners will be able to:\n</p><ul><li>Add or remove frontline workers at their frontline locations if they are assigned team owner of their team.\n</li></ul><p>This feature is on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>Review the documentation:\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/frontline/frontline-team-options?view=o365-worldwide\" target=\"_blank\">How to find the best frontline team solution for your organization - Microsoft 365 for frontline workers | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365/frontline/deploy-dynamic-teams-at-scale?view=o365-worldwide\" target=\"_blank\">Deploy frontline dynamic teams at scale - Microsoft 365 for frontline workers | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365/frontline/frontline-usage-report?view=o365-worldwide\" target=\"_blank\">Microsoft Teams frontline usage report - Microsoft 365 for frontline workers | Microsoft Learn</a>\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410774"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"410774\":[{\"RoadmapId\":410774,\"Platform\":\"Web\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-10-06T05:12:57.1900238Z\",\"LatestRing\":null},{\"RoadmapId\":410774,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-10-06T05:12:57.190024Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Teams admin center will soon allow the deployment of location-based frontline teams with flexible membership, where admins can use dynamic rules for automatic updates and team owners can manage members. This rollout, associated with Microsoft 365 Roadmap ID 410774, will begin in early October 2024 and is expected to be completed by mid-November 2024. It will be on by default with no required admin action before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC883199",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-04T23:07:40.07Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-04T23:06:39Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: Deploy frontline teams with flexible membership",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
