{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "Updated September 6, 2024: We have added an image below. Thank you for your patience.</p><p>We're making some changes to the handling of ActiveX objects in the Microsoft Office client apps.\n</p><p>Starting in new Office 2024, the default configuration setting for ActiveX objects will change from <i>Prompt me before enabling all controls with minimal restrictions</i>&nbsp;to <i>Disable all controls without notification</i>. This change applies to the Win32 desktop versions of Word, Excel, PowerPoint, and Visio.</p><p>\n</p><p><b>When this will happen:</b>&nbsp;</p><p>For new Office 2024, this change will happen immediately when it’s released in October 2024.\n</p><p>For Microsoft 365 apps, this change will rollout in stages beginning in April 2025.</p><p><b>How this will affect your organization:</b></p><p>Users will no longer be able to create or interact with ActiveX objects in Office documents when this change is implemented. Some existing ActiveX objects will still be visible as a static image, but it will not be possible to interact with them. In non-commercial SKUs of Office, users will see this notification when an ActiveX object is blocked by the new default behavior:</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oPhU?ver=d6f0\" style=\"width: 746.003px;\"><br></p><p>The new default setting is equivalent to the existing DisableAllActiveX group policy setting.</p><p> <b>What you need to do to prepare:</b>\n</p><p>When this change takes effect, if you need to use ActiveX controls in Office documents, you can change back to the previous default behavior using any one of the following methods:\n</p><ul><li>In the Trust Center Settings dialog, under <i>ActiveX Settings</i>, select the <i>Prompt me before enabling all controls with minimal restrictions</i>&nbsp;option.</li><li>In the registry, set HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\Common\\Security\\DisableAllActiveX to 0 (REG_DWORD).</li><li>Set the <i>Disable All ActiveX</i>&nbsp;group policy setting to 0.</li></ul><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "ActiveX will be disabled by default in Office 2024, affecting Word, Excel, PowerPoint, and Visio. This change occurs in October 2024 for Office 2024 and begins in April 2025 for Microsoft 365 apps. Users can re-enable ActiveX by adjusting Trust Center Settings, the registry, or group policy settings."
    }
  ],
  "EndDateTime": "2025-07-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC884011",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-09-18T17:38:55.6Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-05T23:22:05Z",
  "Tags": [
    "Updated message",
    "Admin impact",
    "Retirement"
  ],
  "Title": "ActiveX will be disabled by default in Microsoft Office 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
