{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 16, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Purview: Information Protection's Advanced Message Encryption will provide email encryption capability in Microsoft Exchange Online and will be integrated with Message Recall for email stored in a cloud mailbox and sent within an organization.  Users with a license for Microsoft 365 E5 or Microsoft Office 365 E5 will be able to&nbsp;use the new Microsoft Outlook for Windows and Outlook on the web to recall encrypted email from their Sent folder. The same behaviors for unencrypted email apply to encrypted email, as described in <a href=\"https://techcommunity.microsoft.com/t5/exchange-team-blog/exchange-online-message-recall-updates/ba-p/4226568\" target=\"_blank\">Exchange Online Message Recall Updates - Microsoft Community Hub</a>.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413431\" target=\"_blank\">413431</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD<mark></mark>): We will begin rolling out early October 2024 and expect to complete by mid-November 2024 (previously late October).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users with one of the specified licenses are not able to recall encrypted email from their Sent folder. The Message recall control is greyed out.\n</p><p>After this rollout: Users with one of the specified licenses will be able to select an encrypted email in the Sent folder to recall the message.\n</p><p>This feature will be on by default for users with one of the specified licenses.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more\n</i></p><ul><li><a href=\"https://techcommunity.microsoft.com/t5/exchange-team-blog/exchange-online-message-recall-updates/ba-p/4226568\" target=\"_blank\">Exchange Online Message Recall Updates - Microsoft Community Hub</a>\n</li><li><a href=\"https://learn.microsoft.com/exchange/mail-flow-best-practices/work-with-cloud-based-message-recall#does-recall-work-for-encrypted-email\" target=\"_blank\">Work with Cloud-based Message Recall | Microsoft Learn</a> (will be updated before rollout)<p></p></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413431"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Information Protection will soon integrate Advanced Message Encryption with Message Recall in Outlook, allowing licensed users to recall encrypted emails. Rollout begins early October 2024, completing by mid-November. No admin action needed; feature enabled by default for eligible licenses. Roadmap ID 413431."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC882266",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-16T20:28:20.447Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-03T23:13:59Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Message Recall for encrypted emails in Microsoft Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
