{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>To simplify our communications for ‘Microsoft 365 Defender for Cloud Apps’ events in Service health and Message center, we’re consolidating communications under the existing ‘Microsoft Defender XDR’ service listing. Once the change is in place, you’ll see ‘Microsoft 365 Defender for Cloud Apps’ events communicated under ‘Microsoft Defender XDR’.<br></p><p><b>When this will happen:</b><br></p><p>This will be rolled out to Service health and Message center by the end of September 2024.&nbsp;</p><p><b>How this will affect your organization:</b><br></p><p>Communications related to ‘Microsoft 365 Defender for Cloud Apps’ will be communicated under ‘Microsoft Defender XDR’ in Service health and Message center.</p><p><b>What you need to do to prepare:</b>\n</p><p>You might consider updating your administrator training and documentation as needed. If you would like to receive email notifications for events related to ‘Microsoft 365 Defender for Cloud Apps’ after this change, please configure your email preferences to include ‘Microsoft Defender XDR’, within Service health and Message center pages respectively.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is consolidating 'Microsoft 365 Defender for Cloud Apps' communications under 'Microsoft Defender XDR' in Service health and Message center by September 2024. Organizations should update training and documentation, and configure email preferences to include 'Microsoft Defender XDR'."
    }
  ],
  "EndDateTime": "2024-10-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC889525",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-13T22:30:17.623Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-13T22:29:46Z",
  "Tags": [
    "Feature update"
  ],
  "Title": "Service health and Message center: Microsoft Defender for Cloud Apps consolidation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
