{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, meeting participants who use language interpretation will be able to control the volume ratio between the original meeting audio and the interpretation audio after they select the language to listen to in the meeting. This message applies to Teams on Windows desktop and Teams on Mac desktop. <b>NOTE:</b> Meeting organizers must enable language interpretation when setting up the meeting.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=411569\" target=\"_blank\">411569</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early October 2024 and expect to complete by early October 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-October 2024 and expect to complete by late October 2024.\n</p><p>General Availability (GCC): We will begin rolling out late November 2024 and expect to complete by late November 2024.\n</p><p>General Availability (GCC High): We will begin rolling out early December 2024 and expect to complete by early December 2024.\n</p><p>General Availability (DoD): We will begin rolling out late December 2024 and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Meeting participants using language interpretation are not able to control the volume ratio of the original meeting audio and the interpretation audio.\n</p><p>After this rollout: If a meeting organizer has enabled language interpretation when setting up the meeting, participants will be asked which language they want to listen when they first join the meeting, or they can go to the <i>More menu &gt; Language and speech &gt; Language interpretation</i> to choose a language:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oNTq?ver=dac3\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After choosing a language, participants will see the control for the volume ratio of the original meeting audio and the interpretation audio:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oG74?ver=afde\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-language-interpretation-in-microsoft-teams-meetings-b9fdde0f-1896-48ba-8540-efc99f5f4b2e\" target=\"_blank\">Use language interpretation in Microsoft Teams meetings - Microsoft Support </a>(will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "411569"
    },
    {
      "Name": "Summary",
      "Value": "In Microsoft Teams, a new feature will allow meeting participants to adjust the volume ratio between original and interpretation audio. This applies to Teams on Windows and Mac desktops, provided the meeting organizer enables language interpretation. Rollouts will occur from October to December 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC889529",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-13T22:34:25.42Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-13T22:34:11Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Volume ratio setting for meeting participants using language interpretation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
