{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 11, 2024: The Microsoft Purview Message Encryption portal will undergo minor design updates to align with Purview branding. Organizations may need to update training and documentation accordingly.</p><p>Microsoft will be updating fonts, colors, controls, and more to align with Purview branding. These changes are designed to enhance the user experience without causing any disruptions.\n</p><p>We will be proceeding with the minor design updates on the portal (fonts, colors, controls and more). These changes are to align with Purview branding and should not disrupt users.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-October 2024 and expect to complete by mid-December 2024.</p><p><b>How this affects your organization:</b></p><p>Users will see minor design changes within the UI.\n</p><p>This isn't the final or complete list, but here are some prominent changes that users will notice:</p><p>1.\tRemoved the bottom button bar.\n</p><p>2.\tMoved the emoji button to the formatting bar.\n</p><p>3.\tRelocated the toggle formatting option button to the top bar.\n</p><p>4.\tUpdated the insert table control to allow size entry.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qcyc?ver=3d90\" style=\"width: 800px;\"><br></p><p>\n</p><p><b>What you need to do to prepare:</b></p><p>You may consider updating training and documentation as appropriate.</p><p>---Summary of original message---</p><p>The Microsoft Purview Message Encryption portal provides access to encrypted messages sent from your organization's users to external recipients. The <code>cloud.microsoft</code> domain was provisioned in early 2023 to provide a unified, trusted, and dedicated DNS domain space to host Microsoft’s first-party authenticated SaaS products and experiences. With this rollout, selected Microsoft products and scenarios will transition to a similar <code>static.microsoft</code> domain, in parallel with the previous domains. As part of this transition, the design of the portal (fonts, colors, controls, and more) will be adjusted to align with Purview branding and domain change.</p><ul></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Message Encryption portal will have minor design updates to match Purview branding, with changes like updated fonts, colors, and controls. Rollout starts mid-October 2024 and should end by mid-December 2024. Organizations may need to update their training and documentation. The portal's URL will remain unchanged."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC887373",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-11T21:35:51.63Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-10T23:21:41Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Minor encrypted message portal design updates, URL to remain the same",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
