{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>For non-active sidebar users and new Microsoft Edge users, the sidebar will be turned OFF.  Users can go to <i>Settings &gt; Sidebar</i> to turn the sidebar ON again at any time. For active sidebar users, the current sidebar state will remain the same.  Administrators can control the availability of the sidebar using the <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-policies#hubssidebarenabled\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">HubsSidebarEnabled policy</a>.<br></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out in Microsoft Edge Stable version 129 by late September 2024 and expect to complete by early October 2024.</p><p><b>How this will affect your organization:</b><br></p><p>If the sidebar is not managed by administrators via policy, a user could have their sidebar put into the OFF state and they will not see the sidebar until they turn it back ON in the Settings page.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Administrators should be aware of this change, and if end users are affected, they can turn the sidebar back ON in the Settings page.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Edge sidebar will be off by default for non-active and new users, but can be re-enabled in settings. Active users will see no change. Administrators can use the HubsSidebarEnabled policy to manage this. The update rolls out in late September to early October 2024."
    }
  ],
  "EndDateTime": "2024-11-18T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888041",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-11T22:08:10.2Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-11T22:07:49Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge: Sidebar visibility changes",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
