{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 11, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Given the recent global security threats on online meetings, Microsoft Teams is taking steps to make your meetings more secure. We are increasing the minimum length of the meeting passcodes from 6 characters to 8 characters. The nature of the passcodes will remain the same, consisting of letters and numbers.&nbsp;<br></p><p>General Availability (Worldwide): We will begin rolling out early November 2024 (previously late October) and expect to complete by mid-November 2024 (early-November).<br></p><p>General Availability (GCC): We will begin rolling out early November 2024 and expect to complete by mid-November 2024.<br></p><p>General Availability (GCC High, DoD): We will begin rolling out mid-November 2024 and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>This update will not impact any usage of Teams meetings within your organization, as typically users will click on meeting links or on the meetings on their calendars. Only the users - within or outside of your organization - who join the meetings with a Meeting ID and passcode will be impacted by this change. They will have to enter a longer passcode after this update rolls out.</p><p><b>What you need to do to prepare:</b>\n</p><p>There is no admin action needed. The only users who will be impacted are meeting invitees outside of your organization who use a Meeting ID and passcode to join meetings. You can reach out to these users via meeting organizers as needed.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is enhancing security by extending meeting passcodes to a minimum of 8 characters. Rollouts will start in early November 2024 and finish by late November, varying by availability zones. This change affects users joining with a Meeting ID and passcode, requiring no admin action."
    }
  ],
  "EndDateTime": "2025-01-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC889520",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-11T22:06:41.293Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-13T22:27:10Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Increase in meeting passcodes length for added security",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
