{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Amplify: Authors editing sections in the Amplify main draft or the Amplify distribution channel for Microsoft SharePoint can now use <i>Design ideas</i> to rearrange and reformat their image, text sections, and the banner webpart. The selected designs for these sections are displayed in Outlook and Teams according to the channel specific render capabilities.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412943\" target=\"_blank\">412943</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early September 2024 and expect to complete by mid-September 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2024 and expect to complete by late September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users don’t see design ideas in Viva Amplify.\n</p><p><i>After this rollout\n</i></p><p>Authors editing a section in the Amplify main draft or the Amplify distribution channel for SharePoint will see an icon for <i>Design ideas</i> in the content pane selection. For sections containing the webparts listed later in this message, a red dot will appear in the <i>Design ideas</i> content pane pivot (on the right of the screen) to let you know it has ideas available. Select this pivot to open the <i>Design ideas</i> pane. \n</p><p>Figure 1: The Viva Amplify main draft showing the <i>Design ideas</i> content pane pivot with the red dot (on the right of the screen).\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oEFS?ver=798f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The <i>Design ideas</i> pane contains suggestions for new layouts, backgrounds, text formatting, and image webparts to enhance the section selected. The author can click on the suggestions to try and apply different ideas.\n</p><p>Figure 2: The Amplify main draft showing <i>Design ideas</i> for a section containing 2 text webparts:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oEFR?ver=6764\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The selected ideas on main draft or the SharePoint distribution channel are visible for the published SharePoint page. The distribution channels for Outlook and Teams will adopt the design within the limits of the render capabilities of the channels. These designs can be previewed and customized specific to the channels.\n</p><p>After this first release, <i>Design ideas</i> will only be available for sections containing one or more of these:  \n</p><ul><li>1 banner webpart \n</li><li>1, 2, and 3 text webparts  \n</li><li>1, 2 and 3 text and image webparts \n</li><li>1 blank text webpart\n</li></ul><p>These new Viva Amplify features will be on by default and accessible to all users with Authoring permissions.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You might want to notify users, update your user training, and prepare your help desk.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412943"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Amplify will introduce 'Design ideas' for authors to enhance sections with new layouts and formats, rolling out in September 2024. This feature will be available by default for users with Authoring permissions and requires no admin action prior to rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC884007",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-05T23:20:11.28Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-05T23:20:01Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva: Design ideas in Viva Amplify",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
