{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 7, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are rolling out enhanced app discovery for Microsoft Teams. This rollout allows users to easily discover and use apps that they have previously used in group chats, channels, and meetings, enabling users to consent to use the app everywhere in Teams with one click. This message applies to Teams on Windows and Mac desktops and to Teams on the web. \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=397089\" target=\"_blank\">397089</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 (previously mid-December) and expect to complete by late January 2025 (previously early January).\n</p><p><b>How this will affect your organization:</b>\n</p><p>In Teams, when one user installs an app to a group chat, channel, or meeting, others in the group can use it without installing the app. Before this rollout, it is not easy for others in the group to rediscover these apps for use everywhere in Teams.\n</p><p>After this rollout, users can more easily find and use apps they previously used in Teams, because these apps will appear at the top of the list of apps in Teams menus:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oMDe?ver=64bf\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After this rollout, users will be able to find apps they used in a group experience, but did not install themselves. If users click such an app, a consent screen appears. If the user agrees, the app will be installed and be available everywhere in Teams, including group chats, channels, and meetings:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oEYe?ver=3c84\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins should ensure that their tenant's app permission policies are configured to allow users to add and use apps in group experiences. No additional admin configuration is needed for this feature\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "397089"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating to enhance app discovery and enable one-click app installation. The rollout, starting mid-January 2025 and completing by late January, will allow users to easily find and use previously utilized apps in Teams. No admin action is required, but updating documentation is recommended. Roadmap ID 397089."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888049",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-08T23:48:48.287Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-11T22:10:27Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Enhanced discovery of apps and one-click app installation across Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
