{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 23, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>By consolidating information from multiple sources in one place, this feature will provide admins responsible for the Microsoft Teams app and Microsoft Copilot for Microsoft 365 extension deployment with comprehensive security and certification information for faster assessment of compliance with tenant security standards. The information will include outcomes from specific Microsoft 365 certification tests and evidence, as available, submitted by ISVs during Microsoft's audit of their app or Copilot extension. Also, for non-certified apps, admins will receive details on data handling, security, and compliance as self-attested by the ISV. This feature is available in the Teams admin center (TAC) and the Microsoft 365 admin center (MAC).\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412935\" target=\"_blank\">412935</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late October 2024 (previously mid-October) and expect to complete by late November 2024 (previously mid-November).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, admins can find this information in <a href=\"https://learn.microsoft.com/microsoft-365-app-certification\" target=\"_blank\">Microsoft 365 App Compliance Program - Microsoft 365 App Certification | Microsoft Learn</a>.\n</p><p>After this rollout, admins using the TAC can find this new information and content in individual app cards for apps and Copilot extensions for which information is available on the Manage apps page (may change slightly between now and GA):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oilF?ver=97a7\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>In the Microsoft 365 admin center, admins can find this new information when available on the Integrated apps page (may change slightly between now and GA):</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1okQC?ver=9031\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412935"
    },
    {
      "Name": "Summary",
      "Value": "New Microsoft Teams apps and Copilot extensions will provide admins with security and certification information for compliance assessment. This feature, available in the Teams and Microsoft 365 admin centers, will include Microsoft 365 certification outcomes and ISV-submitted data. It will roll out worldwide from late October to late November 2024 and is on by default. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC889528",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-23T23:05:39.603Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-13T22:33:31Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams apps and Microsoft Copilot extensions: New security and certification information",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
