{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 26, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>As a part of Team’s ongoing effort to enable our customers to create, manage, and run large scale events, end users can now embed Teams town hall in sites they manage. This capability allows town hall attendees to watch the event instance within a particular website.<br></p><p>Embed for town hall introduces embeddable support for town hall engagement features on release. Attendees will have the same engagement feature access within the embed player as they do in client such as Q&amp;A, Captions, Reactions and more.   \n</p><p>To implement embed for town hall, organizers can access their town hall events unique embed code from the town hall scheduling template upon publish. Organizers can then take that code and inject it to their SharePoint or Microsoft 365 site as desired. On event start, attendees will be able to view and engage with the embed stream on the published site.  \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=401120\" target=\"_blank\">401120</a></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early November 2024 (previously early October) and expect to complete by mid-November 2024 (previously mid-October).</p><p>General Availability (Worldwide, GCC): We will begin rolling out early December 2024 (previously late October) and expect to complete by mid-December 2024 (previously late November).</p><p><b>How this will affect your organization:</b> \n</p><p>Users will be able to copy embed code directly from town hall scheduling form on event publish. After the embeddable code is placed in the website, the town hall player will be accessible to attendees who have access to the URL.</p><p><b>Note:&nbsp;</b>Attendee access to the embedded video player is driven by the town hall event access.</p><p>  \n</p><p><b>What you need to do to prepare:</b> \n</p><p>Organizers with SharePoint or Microsoft 365 site who want to utilize embed support for town hall can begin implementing the embeddable code upon release.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401120"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams now supports embedding town hall events in sites managed by users, with features like Q&A and reactions. The rollout timeline has been updated, starting in early November 2024 for Targeted Release and early December for General Availability. Organizers can embed the event using a unique code from the town hall scheduling template."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-01-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC889534",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-26T22:44:03.847Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-13T22:37:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Embed support for Teams town hall",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
