{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Viva Pulse:\n</p><ul><li>New Pulse templates\n</li><li>Conversations in Pulse reports</li><li>eDiscovery and Microsoft 365 Audit support for Viva Pulse\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=381744\" target=\"_blank\">381744</a>.\n</p><p>These features apply to Pulse on Windows and Mac desktop, on the web, and on iOS/Android.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: Available now.\n</p><p>General Availability (Production): We will begin rolling out early September 2024 and expect to complete by mid-September 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout:\n</p><ul><li>Pulse authors are able to view open text responses from Pulse participants but are not able to respond to any open text responses to continue the conversation with the Pulse participant. \n</li><li>Users with Microsoft Purview access and global administrators do not have the ability to search for the Viva Pulse content in the Microsoft Purview portal or look up audit log of Pulse events, for example, requests sent, responses submitted, etc.\n</li></ul><p><i>After this rollout</i>\n</p><p>New Pulse templates:\n</p><p>We will add two new templates to the existing Viva Pulse content library to provide survey authors with a wider selection of research-backed questions to leverage with their teams. The new questions from these templates will also be added to the Pulse question library as part of the <i>Change management</i> category. These new templates are: \n</p><ul><li>Microsoft 365 Copilot Readiness: Prepare for a successful Microsoft 365 Copilot rollout by understanding your team’s readiness.\n</li><li>Microsoft 365 Copilot Adoption: Get useful insights into how your team is progressing in key areas of Microsoft Copilot adoption.\n</li></ul><p>Conversations in Pulse reports:\n</p><p>Pulse authors will be able to respond to open text responses from Pulse participants. The Pulse author will not know who they are having a conversation with because the responder's identifiable data will be removed from the conversation. The responder is notified that their identity is hidden from the survey author.\n</p><p>eDiscovery and Microsoft 365 Audit support for Viva Pulse: \n</p><p>Users with Microsoft Purview access and tenant administrators can use eDiscovery to search Viva Pulse content from the Microsoft Purview compliance portal. Pulse requests and responses data are stored in Microsoft Forms and can be looked up with an eDiscovery search of Microsoft Forms data in Microsoft Purview. You can now also look up an audit log for all Pulse events in the Microsoft 365 Security compliance portal.\n</p><p>A Pulse author responds to an open text response:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1olrF?ver=d662\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically, and the features shared here are enabled by default by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><ul><li>Tenant admins can review the new templates and questions through the admin Content management feature in Viva Pulse and modify or restrict access to the templates and questions as needed.\n</li><li>Tenant admins can manage the visibility of conversations in Pulse reports through <a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/granular-access-controls\" target=\"_blank\">granular access controls</a> for Viva Pulse. \n</li></ul><p><i>Resources</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/manage-available-surveys-and-questions\" target=\"_blank\">Manage available surveys and questions | Microsoft Learn</a>\n</li><li><a href=\"https://support.microsoft.com/topic/respond-to-open-text-responses-in-pulse-reports-6420567b-c731-4187-b811-33cadc2c7889\" target=\"_blank\">Respond to open text responses in Pulse reports - Microsoft Support</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/ediscovery-pulse\" target=\"_blank\">Use eDiscovery for Viva Pulse content | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/track-pulse-events\" target=\"_blank\">Track Viva Pulse events in the Microsoft 365 audit log | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/granular-access-controls\" target=\"_blank\">Granular access controls for Viva Pulse | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "381744"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse will introduce new templates, enable conversations in Pulse reports, and offer eDiscovery and Microsoft 365 Audit support. These updates are available in Public Preview and will roll out in early September 2024. Features will be enabled by default with no admin action needed."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC883193",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-04T23:03:36.723Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-04T23:03:24Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: New Pulse templates, Conversations in Pulse reports, eDiscovery and Microsoft 365 Audit support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
