{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Introducing new advanced trainable classifiers in Microsoft Purview Communication Compliance to detect potential workplace safety violations such as hateful or violent content and to assign severity scores to unsafe text across over 100 languages. These classifiers are built using large language models for enhanced detection.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=146859\" target=\"_blank\">146859</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We began rolling out late August 2024 and expect to complete by early September 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Microsoft Purview Communication Compliance provides tools to help organizations detect business conduct and regulatory compliance violations (e.g. SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to help ensure user-level privacy. </p><p>These new classifiers are configured by default in the ‘Detect Inappropriate Content’ template policy and can be selected in the trainable classifier menu when creating a custom policy.&nbsp;&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>You can access the Communication Compliance solution in the <a href=\"https://sip.compliance.microsoft.com/homepage\" target=\"_blank\">Microsoft Purview compliance portal.</a>  \n</p><p>Learn more:<a href=\"https://learn.microsoft.com/purview/communication-compliance?view=o365-worldwide\" target=\"_blank\"> Learn about Communication Compliance</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "146859"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance introduces advanced classifiers for detecting workplace safety violations in over 100 languages, available worldwide from late August to early September 2024. No admin action is required for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC884016",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-05T23:25:08.667Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-05T23:24:47Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Purview compliance portal: Advanced trainable classifiers to detect workplace safety scenarios",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
