{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Viva Engage: We are moving settings file and conversation settings from the older Yammer admin center to the <i>Tenant Settings</i> page in the Engage admin center, a new, more efficient platform.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415169\" target=\"_blank\">415169</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Production): We will begin rolling out late October 2024 and expect to complete by mid-November&nbsp;2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This rollout is designed to be seamless, with no expected downtime or disruption to the current functionalities. Admins will continue to manage the settings as they currently do, but with improved performance and reliability.\n</p><p>After this rollout, these admin roles will be able to access and manage the preferences for files, rich media, and notifications in the Viva Engage admin center:\n</p><ul><li>Global admin\n</li><li>Engage admin (Yammer AAD)\n</li><li>Yammer network admin\n</li></ul><p>This rollout will honor all existing choices and preferences set by your organization.\n</p><p><i>Key functions and their utility\n</i></p><p><i>File upload permissions</i>: Admins can change the file upload preferences for users within their organization. Admins will have these three options:\n</p><ul><li>Allow upload of files of any format (this option is the default state for all tenants)\n</li><li>Allow only image or video file uploads\n</li><li>Not allow any files to be uploaded to conversations\n</li></ul><p><i>Toggles in Viva Engage admin center\n</i></p><ul><li><i>Tenor GIFs: </i>Admins use this feature to enable or disable using GIFs (powered by Tenor) in Viva Engage conversations (starters and threads). This will be <i>enabled by default.\n</i></li><li><i>Fetching URL metadata:</i> Admins use this feature to enable or disable fetching metadata for URLs posted in Viva Engage conversations (starters and threads). This will be <i>enabled by default</i>. When enabled, Microsoft may use a third-party service to include links, images, and summaries.\n</li><li><i>Message translation:</i> Admins use this feature to enable or disable message translation in Viva Engage. This is <i>disabled by default</i> and must be enabled by an admin to be effective.\n</li><li><i>Abbreviated mentions:</i> Admins use this feature to enable or disable changes to the @mention feature in Viva Engage conversations. When enabled, users will be able to @mention using the first name (example: Adam) or last name (example: Smith) instead of the full name (example: Adam Smith). This is <i>enabled by default.\n</i></li><li><i>Private messages: </i>Admins use to feature to allow users to send and receive private messages in Viva Engage. This feature will be <i>enabled by default. \n</i></li></ul><p><b>What you need to do to prepare:</b>\n</p><ul><li>No action is required from admins prior to the rollout. The change will be automatically applied.\n</li><li>Review your current configuration to determine the impact for your organization.</li><li>Learn more: <a href=\"https://learn.microsoft.com/viva/engage/configure-your-viva-engage-network/configure-viva-engage\" target=\"_blank\">Configure your Viva Engage network | Microsoft Learn</a>&nbsp;(will be updated prior to release)</li><li>You may want to notify your admins about this change and update any relevant documentation.\n</li><li>We appreciate your cooperation and understanding as we work to improve the admin experience.\n</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "415169"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva is transferring file and conversation settings from the Yammer admin center to the Viva Engage admin center. Rollout starts late October 2024, with completion by mid-November 2024, enhancing performance without disrupting current functions. Admins will manage file upload permissions, GIFs, URL metadata, message translation, and private messages. No action is needed before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888046",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-11T22:09:31.34Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-11T22:09:12Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Moving file and conversation settings to the Viva Engage admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
