{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We've added new capabilities to the Text web part in Microsoft SharePoint Online, which include:&nbsp;<br></p><ul><li>Ability to set custom font colors.</li><li>New paragraph style option to select normal text with or without spacing between paragraphs.</li><li>Option to add/remove spacing before/after paragraphs and headings.</li><li>Ability to set custom line spacing.&nbsp;</li><li>New quote style options.</li><li>Ability to highlight the number of columns and rows to insert in a new table.</li></ul><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCCH, and DoD): We will begin rolling out early September 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>All SharePoint Online page authors will have these new capabilities.&nbsp;</p><p>This new feature is available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New enhancements to SharePoint Online's Text web part include custom font colors, paragraph styles, spacing options, line spacing, quote styles, and table column/row highlighting. Rollout begins early September 2024, with no admin action required. Users should be informed of these updates."
    }
  ],
  "EndDateTime": "2024-11-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC888883",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-12T23:13:46.683Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-12T23:13:21Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "SharePoint Online: Enhancements to Text web part",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
