{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Microsoft Purview Message Encryption portal provides access to encrypted messages sent from your organization's users to external recipients. The <code>cloud.microsoft</code> domain was <a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/introducing-cloud-microsoft-a-unified-domain-for-microsoft-365/ba-p/3804961\" target=\"_blank\">provisioned in early 2023</a> to provide a unified, trusted, and dedicated DNS domain space to host Microsoft’s first-party authenticated SaaS products and experiences. With this rollout, selected Microsoft products and scenarios will transition to a similar <code>static.microsoft</code> domain, in parallel with the previous domains. As part of this transition, the design of the portal (fonts, colors, controls, and more) will be adjusted to align with Purview branding and domain change.\n</p><p>Microsoft Purview Message Encryption portal (<a href=\"https://MessageEncryption.purview.static.microsoft\" target=\"_blank\">https://MessageEncryption.purview.static.microsoft</a>)\n</p><p>A full list of products and scenarios already being delivered on the <code>static.microsoft</code> domain can be found at <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/cloud-microsoft-domain?view=o365-worldwide\" target=\"_blank\">Unified cloud.microsoft domain for Microsoft 365 apps - Microsoft 365 Enterprise | Microsoft Learn</a>.\n</p><p></p><b>When this will happen:</b>\n<p></p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-October 2024 and expect to complete by mid-December 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>Users that receive encrypted messages that have a link to open the mail in the encrypted message portal will be redirected to applications under <code>static.microsoft</code> domains gradually and automatically. No specific user action is required. Links to the previous domains are backwards compatible and will continue to be supported. Users may notice that the new application domains are lacking the <code>.com</code> extension, which is by design, because <code>.microsoft</code> is Microsoft’s own top-level domain. This exclusivity allows for additional security and protection against spoofing.\n</p><p>This change is on by default.\n</p><p><b>What you need to do to prepare:</b></p><ul><li>Educate users to recognize and expect <code>static.microsoft</code> as a key domain for Microsoft cloud experiences. Users can learn more about the <code>.microsoft</code> domain in <a href=\"https://support.microsoft.com/office/what-is-cloud-microsoft-7ba4c8b9-d062-4444-84a5-fca6c3006d2b\" target=\"_blank\">What is cloud.microsoft? - Microsoft Support</a>\n</li><li>If your organizational websites, tools, or other materials reference the old URL outlook.office365.com/Encryption, those links will be automatically redirected. It would be good practice to update those assets and any documentation with screenshots to avoid user confusion.\n</li><li>Admins should ensure that connections to <code>*.static.microsoft</code> are not blocked from their clients and enterprise networks. This recommendation should require no action if you are following standard <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/urls-and-ip-address-ranges\" target=\"_blank\">Microsoft network guidance on domains and service endpoints</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview Message Encryption portal is moving to the \".microsoft\" domain by late 2024. Users will be redirected to the new domain automatically, with no action required. Organizations should update references and ensure the new domain is not blocked. The portal's design will also be updated."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC887373",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-09-10T23:23:07.02Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-10T23:21:41Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview: Message Encryption portal transitioning to the \".microsoft\" domain by the end of 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
