{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: To enhance the efficiency of Microsoft Teams, we will implement a significant update to the UDP signaling ports used for Calling and Meetings.\n</p><p>Before this rollout, Teams uses UDP Source Ports 49152-65535 for Calling and Meetings signaling API Calls. This includes functionality such as mute/unmute, hold, adding participants, and reactions.\n</p><p>After this rollout, Teams will transition UDP signaling from source ports 49152-65535 to 50070-50089, maintaining the destination UDP port 3478. This change aims to reduce the number of ports used and enable you to apply Quality of Service (QoS) DSCP markers to this traffic.\n</p><p>When this will happen: General Availability (Worldwide): We will begin rolling out early October 2024 and expect to complete by early October 2024.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Allow UDP Source Ports 50070-50089 to Destination Ports 3478 to 52.112.0.0/14, 52.122.0.0/15, 2603:1063::/38 (ID 11, Optimized Category for Microsoft Teams). Since the new range is a smaller subset inside of the existing ranges, no changes should be required for admins currently allowing UDP signaling.\n</p><p>Learn more in the <i>Microsoft Teams</i> section of <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/urls-and-ip-address-ranges?view=o365-worldwide#microsoft-teams\" target=\"_blank\">Microsoft 365 URLs and IP address ranges - Microsoft 365 Enterprise | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating UDP signaling ports for Calling and Meetings to enhance efficiency. The source ports will change from 49152-65535 to 50070-50089, with the destination UDP port remaining at 3478. Rollout begins early October 2024. Admins should allow the new UDP source ports to the specified destination ports."
    }
  ],
  "EndDateTime": "2024-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC898392",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-26T00:43:31.387Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-26T00:43:20Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Microsoft Teams: UDP Signaling Ports configuration change",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
