{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Copilot experience on Windows is changing in response to your feedback. Moving forward, users with work or school accounts will access Microsoft Copilot through the Microsoft 365 app. In addition, Microsoft Copilot will offer enterprise data protection (EDP) at no additional cost for all users signed in with an Entra account. This means that security, privacy, and compliance controls and commitments available for Microsoft 365 Copilot will extend to Microsoft Copilot prompts and responses.  \n</p><p><b>When will this happen?</b></p><p>The update to Microsoft Copilot to offer enterprise data protection is rolling out now—and is replacing the current Copilot in Windows experience. The shift to the Microsoft 365 app as the entry point for Microsoft Copilot is coming soon. Changes will be rolled out to managed PCs starting with the optional non-security preview release on September 24, 2024, and following with the monthly security update release on October 8 for all supported versions of Windows 11. These changes will be applied to Windows 10 PCs the month after.  \n</p><p><b>How this will affect your organization:</b></p><p>If your organization hasn’t enabled Copilot in Windows (in preview), your existing preferences will be respected. Neither the Microsoft Copilot app nor the Microsoft 365 app are pinned to the taskbar. \n</p><p>If you had previously activated Copilot in Windows (in preview) for your workforce, to provide the best Copilot experience for your employees moving forward, we won't automatically pin the Microsoft 365 app to the taskbar in Windows. Rather, we'll ensure that you have control over how you enable the Copilot experience within your organization. If you want your users to have uninterrupted access to Microsoft Copilot after the update, use the configuration options to pin the Microsoft 365 app to the taskbar as the Copilot in Windows (preview) icon will be removed from the taskbar as part of the update. \n</p><p>Users signing into new PCs with work or school accounts can access Microsoft Copilot using the Microsoft 365 app, which comes pre-installed with all Windows PCs. For additional details, see <a href=\"https://learn.microsoft.com/windows/client-management/manage-windows-copilot?#users-signing-in-to-new-pcs-with-microsoft-entra-accounts\" target=\"_blank\">Users signing in to new PCs with Microsoft Entra accounts</a>. \n</p><p><b>What you need to do to prepare:</b></p><p>You can enable the Microsoft Copilot experience for your users now by using the <a href=\"https://learn.microsoft.com/windows/client-management/mdm/policy-csp-windowsai\" target=\"_blank\">TurnOffWindowsCopilot policy</a> and pinning the Microsoft 365 app using the existing policies for Taskbar pinning.  \n</p><p>Additional resources \n</p><p>For more information on this change, please read <a href=\"https://aka.ms/Windows/CopilotBlog\" target=\"_blank\">Enhanced data protection with Windows and Microsoft Copilot</a>. For details on how to enable and manage Microsoft Copilot for your users, please see the following resources: \n</p><ul><li><a href=\"https://learn.microsoft.com/windows/client-management/manage-windows-copilot\" target=\"_blank\">Manage Copilot in Windows</a></li><li><a href=\"https://learn.microsoft.com/windows/client-management/manage-windows-copilot\" target=\"_blank\">Updated Windows and Microsoft Copilot experience</a></li><li><a href=\"https://learn.microsoft.com/copilot/edpfaq\" target=\"_blank\">FAQ: Microsoft Copilot updates and enterprise data protection</a> \n</li><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/enterprise-data-protection\" target=\"_blank\">Enterprise data protection in Copilot for Microsoft 365 and Microsoft Copilot&nbsp;</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Copilot experience for Windows is updating to include enterprise data protection at no extra cost and will be accessed via the Microsoft 365 app. Changes begin with a preview release on September 24, 2024, and a security update on October 8, 2024, for Windows 11, followed by Windows 10. Organizations should prepare by adjusting their settings and pinning the Microsoft 365 app if needed."
    }
  ],
  "EndDateTime": "2024-12-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC890889",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-18T19:17:40.177Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-16T15:47:51Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Changes coming to the Copilot experience for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
