{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Expected in the upcoming October Windows update, the Windows enrollment experience for managed devices will be updated to automatically enable quality updates during the out-of-box experience (OOBE). This change ensures that devices are fully patched and ready to use as soon as they are enrolled. For more information, review the blog: <a href=\"https://techcommunity.microsoft.com/t5/intune-customer-success/important-changes-to-the-windows-enrollment-experience-coming/ba-p/4246689\" target=\"_blank\">Important changes to the Windows enrollment experience coming soon</a></p><p><b>How this will affect your organization:</b></p><p>For new enrollments, all Windows 11, version 22H2 and higher devices will automatically download and install quality updates during OOBE. This applies to all enrolled Windows devices, regardless of whether they are pre-registered with Windows Autopilot or not. The updates will be applied before the user reaches the desktop, ensuring that the device is fully patched before logging in. <b>Note:</b> Device setup may require additional time due to quality update installation during OOBE.</p><p><b>What you need to do to prepare:</b></p><p>Plan accordingly for additional device set up time. If you are using <a href=\"https://learn.microsoft.com/entra/identity/authentication/howto-authentication-temporary-access-pass\" target=\"_blank\">Temporary Access Passwords</a>, we recommend extending the validity period during enrollment to prevent the passcode from expiring. For more information, review the blog: <a href=\"https://techcommunity.microsoft.com/t5/intune-customer-success/important-changes-to-the-windows-enrollment-experience-coming/ba-p/4246689\" target=\"_blank\">Important changes to the Windows enrollment experience coming soon</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The upcoming October Windows update will include automatic quality updates during the OOBE for managed devices, ensuring they are fully patched before use. New enrollments for Windows 11, version 22H2 and higher will be affected, potentially extending device setup time. Preparation for this change is advised."
    }
  ],
  "EndDateTime": "2024-11-23T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC891223",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-16T23:14:52.183Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-16T23:12:52Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Plan for Change: Windows enrollment will include quality updates during OOBE",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
