{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 2, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Outlook for iOS and Android: Online archive mailboxes is a feature that offers users advanced archiving capabilities in the Mailbox archive. An Outlook online archive mailbox can store older email messages where they won't occupy space in the user's primary mailbox. This specialized mailbox appears with your other mailbox folders in Outlook. After this rollout, if you have enabled <i>Mailbox archive</i> for your users, the <i>Online Archive</i> mailbox will appear in the folder list, which users can access by tapping their profile in the top left of their screen.\n</p><p><b>NOTE:</b> The <i>Online Archive</i> folder is different than the <i>Archive </i>folder. Using the <i>Archive </i>button to move messages to the <i>Archive </i>folder doesn't reduce your mailbox size. Learn more about the <i>Archive </i>folder: <a href=\"https://support.microsoft.com/office/archive-in-outlook-for-windows-25f75777-3cdc-4c77-9783-5929c7b47028\" target=\"_blank\">Archive in Outlook for Windows - Microsoft Support</a>.\n</p><p>Before this rollout, users are only able to access their online archive emails in Outlook for iOS and Android through Search. After this rollout, users will be also able to access archived email in the <i>Online Archive</i> folder.\n</p><p>Learn more about the admin policy: <a href=\"https://learn.microsoft.com/purview/enable-archive-mailboxes\" target=\"_blank\">Enable archive mailboxes for Microsoft 365 | Microsoft Learn</a>\n</p><p>Learn more about the user experience: <a href=\"https://support.microsoft.com/office/manage-email-storage-with-online-archive-mailboxes-1cae7d17-7813-4fe8-8ca2-9a5494e9a721\" target=\"_blank\">Manage email storage with online archive mailboxes - Microsoft Support</a> (will be updated soon)\n</p><p><b>When this will happen:</b>\n</p><p>General Availability | Outlook for iOS (Worldwide GCC, GCC High, DoD): We began rolling out mid-August 2024 and expect to complete by late October 2024.\n</p><p>General Availability | Outlook for Android: We will begin rolling out early October 2024 (previously late September) and expect to complete by late October 2024.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>For tenants where admins have enabled <i>Mailbox archive</i> for users in the Exchange admin center, users will start seeing <i>Online Archive</i> in their folder list in Outlook mobile. \n</p><p>If admins do not turn on <i>Mailbox archive</i> for a user, this feature is disabled. Learn more in the section called <a href=\"https://learn.microsoft.com/purview/enable-archive-mailboxes#how-to-enable-an-archive-mailbox\" target=\"_blank\">How to enable an archive mailbox</a> in <a href=\"https://learn.microsoft.com/en-us/purview/enable-archive-mailboxes\" target=\"_blank\">Enable archive mailboxes for Microsoft 365 | Microsoft Learn</a>.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p3vV?ver=d194\" style=\"width: 300px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically. You may want to notify your users about their archives appearing in the folder list and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Online Archive\" feature is coming to Microsoft Outlook for iOS and Android, allowing users to access archived emails directly from their folder list. Rollouts began in mid-August for iOS and will start in early October for Android, with completion expected by late October 2024. Admins must enable the \"Mailbox archive\" for users to see this feature."
    }
  ],
  "EndDateTime": "2024-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC896712",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-02T17:06:09.813Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-24T00:15:29Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: \"Online Archive\" feature for iOS and Android",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
