{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 15, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Viva: Pulse admins can adjust Viva Pulse notification settings for users in their tenant by setting the notification delivery methods where users receive Pulses. For example, admins can turn off the capability for Pulse notifications to be delivered through the Microsoft Teams Activity feed, which means that users will only receive Pulse survey notifications in email and Teams Chat. This rollout applies to Viva Pulse on the web and to the Viva app in Microsoft Teams.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=408163\" target=\"_blank\">408163</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late October 2024 (previously early October) and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, it is not possible for Pulse admins adjust Pulse notifications for users in their tenant.\n</p><p>After this rollout, Pulse admins can adjust how users receive Pulse notifications (Email, Teams Activity feed, and Teams chat) at Viva Pulse &gt; <i>Manage &gt; Notifications:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f19b9659-02b6-442b-b584-dbff31daed4c\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This feature is on by default\n</p><p><b>What you need to do to prepare:</b>\n</p><p>As a reminder, if users in your tenant want to receive Teams Chat notifications from Viva Pulse, please ensure that you install the Viva Pulse Teams app for users in your tenant through a Teams app setup policy or encourage users to download the Viva Pulse Teams app from the Teams app store.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/set-up-in-app-pulse-experience\" target=\"_blank\">Set up the in-app Viva Pulse experience | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408163"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva: Pulse admins will soon manage notification settings, choosing delivery methods for users' Pulse surveys. Rollout begins late October and completes by late November 2024. This feature is on by default and is associated with Roadmap ID 408163. Admins should prepare by installing the Viva Pulse Teams app."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC892053",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-15T23:51:18.1Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-17T23:30:19Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Pulse admins can manage Pulse notifications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
