{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 4, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>Anonymous users (guests) who join Microsoft Teams meetings in the Chrome web browser will soon experience performance improvements.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=401116\" target=\"_blank\">401116</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early November and expect to complete by mid-November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late-November 2024.\n</p><p>General Availability (GCC, GCC High and DoD): We will begin rolling out early January 2025 and expect to complete by late April 2025 (previously late March).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, anonymous users (guests) may experience longer wait times when attempting to join a Teams meeting.\n</p><p>After this rollout, anonymous users (guests) will be able to join meetings faster, even on low-end devices.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may want to update your internal documentation to inform your users about this improvement. However, because the improvement is for external users and does not change the look of Teams, you can skip this step.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401116"
    },
    {
      "Name": "Summary",
      "Value": "Anonymous users joining Microsoft Teams meetings in Chrome will see performance improvements. Rollout starts in November 2024 and completes by April 2025. Update internal documentation if necessary, though it's not required since the change is for external users and doesn't alter Teams' appearance."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC894581",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-04T20:58:39.237Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-21T00:09:07Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Performance improvements for meetings in Chrome web browser for guests",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
