{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In MC853238 <i>Microsoft 365 admin center: New self-service purchase and trial settings</i> (August 2024), we communicated the new self-service purchase and trial settings in the Microsoft admin center. In October 2024, self-service purchase settings for Microsoft 365 Copilot will be generally available for global admins or billing admins.  If you have an E3 or E5 license, you can set your preferences now for Microsoft 365 Copilot self-service purchases that will go live at a future date. We will update this message when we know that date.\n</p><p><b>Note: </b>Self-service purchase will be available for users with an eligible Microsoft 365 Business suite license: Microsoft 365 Business Basic, Business Standard, or Business Premium, in October.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): This setting will be available early October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout of the self-service purchase for Microsoft 365 Copilot, admins were not able to set preferences for self-service purchase of M365 Copilot in settings.\n</p><p>After this rollout, as a global admin or billing admin, you will be able to control settings on self-service purchases of Microsoft 365 Copilot for your users.\n</p><p>Self-service purchase settings are enabled by default. You can review the new settings at <a href=\"https://admin.microsoft.com/Adminportal/Home?#/manageselfservicepurchase/:/SelfServiceTrialPurchaseSetting/CFQ7TTC0MM8R\" target=\"_blank\">Settings - Microsoft 365 admin center</a> or use your MSCommerce PowerShell scripts to disable them. Note that the release of the self-service purchase settings in the Admin Center honor your existing state and do not override your current status settings set in PowerShell. Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/commerce/subscriptions/allowselfservicepurchase-powershell?view=o365-worldwide#view-a-list-of-self-service-purchase-products-and-their-status\" target=\"_blank\">Manage self-service purchases and trials (for admins) | Microsoft Learn</a>.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>This message is associated with MC818889 <i>Microsoft 365 admin center: Self-service purchase notifications</i> (July 2024)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In October 2024, Microsoft 365 Copilot self-service purchase settings will be available in the admin center for E3 and E5 license holders. Global and billing admins can set preferences ahead of the rollout, which will happen automatically. Settings are enabled by default but can be managed or disabled."
    }
  ],
  "EndDateTime": "2025-05-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC899941",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-28T00:48:43.337Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-28T00:47:11Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot: Self-service purchase settings in Microsoft 365 admin center (E3, E5)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
