{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft SharePoint and Lists in Microsoft Teams: An updated Microsoft Lists. This rollout introduces new features to users, including the ability to add ratings to any list, drag and/or paste images directly into a list, see who is collaborating with you in real time, switch views by clicking tabs, and more.\n</p><p>This is an update to MC600726: <i>(Updated) Microsoft Lists User Experience Update</i> (updated October 2023) and MC709979<i> (Updated) Microsoft SharePoint: Updated Lists in Team Sites, Lists progressive web app (PWA), and Teams</i> (January 2024).\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late September 2024 and expect to complete by late October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, Lists do not have features like visible real time collaborators, easy access to views via tabs, and applied filters at the top of a list. Note: Some features described in the May 2023 blog <a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/microsoft-lists-easier-better-faster-stronger/bc-p/3842882\" target=\"_blank\">Microsoft Lists: Easier, Better, Faster, Stronger - Microsoft Community Hub</a>, such as new forms to collect information easily, have started to roll out or have fully rolled out.\n</p><p>After this rollout, users in active tenants will see the remaining Lists feature updates described in the May 2023 blog when browsing lists on SharePoint sites, the Lists progressive web app (PWA), the Lists app on the web, and the Lists app in Teams. All Lists in SharePoint sites will retain the SharePoint site's theme and navigation.  \n</p><p>Existing lists configured with these features will be updated after this rollout:\n</p><ul><li>SharePoint Framework (SPFx) command extensions\n</li><li>Power Apps forms\n</li><li>Approvals\n</li></ul><p>These Lists components are not included in the new rollout:\n</p><ul><li>SharePoint Framework (SPFx) field customizers\n</li><li>The Playlist template integrated with Microsoft Stream\n</li></ul><p>All new and updated List features are on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No admin action is needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/microsoft-lists-easier-better-faster-stronger/bc-p/3842882\" target=\"_blank\">Microsoft Lists: Easier, Better, Faster, Stronger - Microsoft Community Hub</a> (May 2023)\n</li><li><a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/introducing-drag-and-drop-to-reorder-items-in-microsoft-lists/ba-p/4216966\" target=\"_blank\">Introducing Drag and Drop to Reorder Items in Microsoft Lists - Microsoft Community Hub</a> (August 2024)\n</li><li><a href=\"https://techcommunity.microsoft.com/t5/microsoft-sharepoint-blog/collect-information-like-a-pro-new-microsoft-lists-forms/ba-p/4086659\" target=\"_blank\">Collect information like a pro New Microsoft Lists forms experience in Microsoft 365</a> (March 2024)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Microsoft Lists rollout in SharePoint and Teams, starting late September 2024, will introduce features like ratings, direct image pasting, real-time collaboration visibility, tabbed view switching, and more. No admin action is required for preparation. Some features are already available as per the May 2023 blog."
    }
  ],
  "EndDateTime": "2025-01-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC891238",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-16T23:28:09.023Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-16T23:27:46Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft SharePoint and Microsoft Teams: Update on new Microsoft Lists rollout",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
