{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This informational message addresses several frequently asked questions regarding Microsoft Teams town halls and Teams Live Events (TLE).\n</p><p>First, as a reminder, TLE <i>will not </i>be retiring this calendar year, as announced in <a href=\"https://techcommunity.microsoft.com/t5/microsoft-teams-blog/updates-for-town-hall-in-microsoft-teams-and-teams-live-events/ba-p/4148352\" target=\"_blank\">Updates for Town Hall in Microsoft Teams and Teams Live Events - Microsoft Community Hub</a> and communicated in MC678003 (Updated) Microsoft Teams Live Event Retirement (updated May 2024).\n</p><p>We have not set a new retirement date for TLE, which we will continue to maintain while we work on closing the <a href=\"https://learn.microsoft.com/microsoftteams/plan-town-halls#live-events-and-premium-town-halls\" target=\"_blank\">remaining major feature gaps</a> between TLE and Teams town hall. Also, the full retirement of classic Teams as described in <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability\" target=\"_blank\">End of availability for classic Teams client - Microsoft Teams | Microsoft Learn</a> will not affect TLE scheduling, even though TLE scheduling currently uses classic Teams. We will move TLE scheduling from classic Teams on the web and rebuild it natively in Teams 2.1. We expect to complete this work by early December 2024. As a reminder, even with the extended life of TLE, all major feature updates will be reserved for Teams town hall. We still encourage customers to move to town hall as soon are you are unblocked in terms of feature parity.\n</p><p>As the timelines for the features become clear, we will also update the <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=\" target=\"_blank\" style=\"\">Microsoft 365 Roadmap</a> with timelines for each gap-closing feature we plan to release. Please keep an eye on the roadmap for updates on these features.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message provides FAQs about Microsoft Teams town halls and Teams Live Events, clarifying that Teams Live Events will not retire this year and no new retirement date is set. It details the maintenance of TLE while addressing feature gaps with town halls and the transition of TLE scheduling to Teams 2.1 by December 2024. Major updates will focus on town halls, and the Microsoft 365 Roadmap will reflect feature releases."
    }
  ],
  "EndDateTime": "2024-11-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC892643",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-18T23:55:38.737Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-18T23:55:02Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: FAQs about town halls and Teams Live Events",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
