{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, Microsoft Viva Engage users go to different locations in the application for different creation types such as a post, a community, and more. </p><p>After this rollout, a Viva Engage user will be able to create the different types of content they are licensed for with one <i>Create new</i>&nbsp;button. This new button eases the process of creation and helps users quickly discover the various creation options they are licensed to use. This feature is available in Viva Engage for Windows desktop, Viva Engage for the web, as well as the Viva Engage app in Microsoft Outlook for Windows desktop and iOS/Android and Microsoft Teams for Windows desktop and iOS/Android.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=416449\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">416449</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early October 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The new <i>Create new</i> button is in the top left area of the Engage app (below the user’s own profile) and is always visible as the user visits different pages in the application. Users will be able to create only those content types they were licensed to create before the rollout.\n</p><p>With the <i>Create new</i> button, a user with all permissions and a Viva Engage premium license would be able to create a new:\n</p><ul><li>Post (discussion, question, praise, poll, article)\n</li><li>Community\n</li><li>Event\n</li><li>Campaign \n</li></ul><p>Other users will see a reduced set of creation options based on their existing license and permissions.\n</p><p>The <i>Create new</i> button in the left menu under the profile of a user who is licensed to create all content types (shown in the drop-down menu):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oYXs?ver=6766\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The <i>Create new</i> button for a user who is only licensed to create posts. This button has no drop-down menu.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p477?ver=0ba7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>Learn more about the nuances of licensing and permissions for Viva Engage and for each content type:</p><ul><li><a href=\"https://learn.microsoft.com/en-us/viva/engage/setup\" target=\"_blank\">Set up Viva Engage | Microsoft Learn</a></li><li>Posts:&nbsp;<a href=\"https://support.microsoft.com/topic/write-and-schedule-posts-articles-and-announcements-in-viva-engage-dc806ad9-73bb-49ae-9c68-d800fd902649\" target=\"_blank\">Write and schedule posts, articles, and announcements in Viva Engage - Microsoft Support</a>\n</li><li>Communities:&nbsp;<a href=\"https://support.microsoft.com/office/create-a-community-in-viva-engage-56aaf591-1fbc-4160-ba26-0c4723c23fd6\" target=\"_blank\">Create a community in Viva Engage - Microsoft Support</a>\n</li><li>Campaigns:&nbsp;<a href=\"https://learn.microsoft.com/viva/engage/campaigns\" target=\"_blank\">Set up official campaigns in Viva Engage | Microsoft Learn</a>\n</li><li>Events:&nbsp;<a href=\"https://learn.microsoft.com/viva/engage/campaigns\" target=\"_blank\">Organize a Viva Engage live event | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "416449"
    },
    {
      "Name": "Summary",
      "Value": "The new \"Create new\" button in Microsoft Viva Engage allows users to easily create posts, communities, events, and campaigns from one central location. Rolling out in early October 2024, it simplifies content creation based on users' licenses and permissions. This feature will be on by default, requiring no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-02-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC891234",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-16T23:23:08.727Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-16T23:22:49Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: Create posts, communities, etc. with the new centralized \"Create new\" button",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
