{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 26, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Viva: Pulse admins will be able to copy and share links to Pulse templates from the template management page or from the template. For example, as a Pulse admin, I can copy a link for a template I’ve created and share it to all users in my company so they can also use or edit a template to create and send a Pulse.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late October 2024 (previously mid-September) and expect to complete by late November 2024 (previously early October).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, it is not possible for Pulse admins to copy and share a link to a Pulse template. Users must discover templates for themselves in the Pulse app. If they can find a template created by a Pulse admin, they can use the template.\n</p><p>After this rollout, Pulse admins can copy template links from the <i>Template management</i> section on the <i>Customize templates and questions</i> page or from the template and share it to all users. Users who open a shared template link will go to the customization page for that template.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p78k?ver=e587\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n<br></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>Review and assess the impact on your organization. Share this communication with all Viva pulse admins in your organization.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/manage-available-surveys-and-questions\" target=\"_blank\">Manage available surveys and questions | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva will soon allow Pulse admins to share links to Pulse templates. The rollout begins late October 2024 and completes by late November 2024. This update enables easier template sharing and use within organizations. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-01-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC891237",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-07T22:29:51.287Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-16T23:27:06Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Pulse admins can share links to Pulse templates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
