{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Anonymous users (guests) who join Microsoft Teams meetings in the Chrome web browser will soon experience performance improvements.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=401116\" target=\"_blank\">401116</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early November and expect to complete by mid-November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late-November 2024.\n</p><p>General Availability (GCC, GCC High and DoD): We will begin rolling out early January 2025 and expect to complete by late January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, anonymous users (guests) may experience longer wait times when attempting to join a Teams meeting.\n</p><p>After this rollout, anonymous users (guests) will be able to join meetings faster, even on low-end devices.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may want to update your internal documentation to inform your users about this improvement. However, because the improvement is for external users and does not change the look of Teams, you can skip this step./p&gt;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401116"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will enhance guest performance in Chrome, starting early November 2024, with full rollout by late January 2025. This update, detailed on the Microsoft 365 Roadmap ID 401116, will allow faster meeting joins for guests, especially on low-end devices. Organizations may update internal documentation as needed."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC894581",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-21T00:09:20.19Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-21T00:09:07Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Performance improvements for meetings in Chrome web browser for guests",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
