{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 6, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are excited to announce two new features in the Teams Store that will help users discover and adopt apps in Microsoft Teams. These enhancements are designed to streamline how users find and engage with apps in Teams. This message applies to Teams on the web and Teams for Windows and Mac desktops.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early November 2024 (previously late October) and expect to complete by mid-November 2024 (previously mid-November).</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 (previously mid-October) and expect to complete by mid-January 2025 (previously late November).</p><p><b>How this will affect your organization:</b></p><p>Before this rollout: Users do not have good visibility into the apps that are preinstalled by admins, and many apps are lost in the three-dot menu on the left side of Teams. We provide recommendations for apps that are popular in a user's tenant. In large tenants, these recommendations are not as helpful, because they are not personalized for each user.\n</p><p>After this rollout, the key updates to the Teams Store in the left of Teams will be:\n</p><ol><li><i>Added by your org: </i>You can preinstall a curated collection of apps through policy settings in the Teams admin center. This collection will appear in a dedicated section of the Teams Store called <i>Added by your org</i> to help ensure that any app installed through the Teams admin center or Graph APIs is easily accessible users, for better visibility and usage of key tools. Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/install-teams-apps\" target=\"_blank\">Preinstall Teams apps for your org users - Microsoft Teams | Microsoft Learn</a>. Note: The <i>Added by your org</i> section will not appear if admins take no action.\n</li><li><i>Trending with your peers:</i> Personalized app recommendations will appear to users in a dedicated section of the Teams Store based on the apps used by their frequent collaborators, making it easier for users to discover apps relevant to their daily workflows.\n</li></ol><p>\n</p><p>Admins can configure the collection of apps in Teams admin center &gt; Tea<i>ms apps &gt; Setup policies &gt; App setup policies &gt; Global &gt; Installed apps:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/629d8daa-209e-422e-8a2b-2bcf0b65efb3\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>The user view of <i>Added by your org</i> in the Teams Store:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1762a835-f35b-4013-b5d3-e40ce6fa6b2a\" style=\"width: 400px;\" alt=\"user view\">\n</p><p>The user view of <i>Trending with your peers</i> in the Teams store.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e09925f8-0b67-4ee0-af3e-28db335650f3\" style=\"width: 400px;\" alt=\"user view\">\n</p><p>These features are on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Review the apps currently preinstalled through policy settings in the Teams admin center. Ensure that critical apps are installed and available for discovery in the new Added by your org collection in the Teams Store. You do not need to take any action for the <i>Trending with your peers</i> section in the Teams Store.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing two new features to enhance app discovery and adoption. The rollout timeline has been updated, with Targeted Release starting early November 2024 and General Availability beginning mid-November 2024. The updates include a dedicated section for organization-added apps and personalized app recommendations based on user collaboration. These features will be on by default, and admins should review preinstalled apps for visibility in the new Teams Store sections. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-02-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC898393",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-06T23:09:02.717Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-26T00:43:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New features to improve user app adoption",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
