{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 19, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Customers will see a new design for reactions in conversation cards across Microsoft Viva Engage web, Microsoft Teams and Outlook apps, and interactive emails in Outlook Web app and new Outlook for Windows.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=416644\" target=\"_blank\">416644</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early October 2024 and expect to complete by late June 2025 (previously late January).</p><p><b>How this will affect your organization:</b><br></p><p>Engage conversations will have a new design to show reactions across threadstarters, comments, and replies. The redesign brings a more interactive style, showing users’ reactions as clickable pills like what’s seen in other Microsoft 365 applications.\n</p><p>There are no changes to the number of icons available. The change will first show in Engage web (browser), Teams and Outlook apps, and interactive emails in Outlook Web app and new Outlook. In the future, we will launch in other surfaces, including the Engage iOS and Android apps.\n</p><p>Users will also see a dedicated copy link button and streamlined share button in threadstarters.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/cc0bbfc2-4c18-4523-b383-65cb093d0f71\" style=\"width: 450px;\"><br></p><p> \n</p><p>There are no changes to the core reactions capabilities, nor does the new design affect any data handling. This redesign is solely focused on the end-user experience.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "416644"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is introducing a new reactions design in conversation cards, rolling out from early October 2024 to late June 2025. This update will appear in Viva Engage web, Microsoft Teams, Outlook apps, and interactive emails, with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-08-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC892641",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-19T16:07:15.167Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-18T23:54:24Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva: A new reactions design in Viva Engage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
