{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With voice isolation in Microsoft Teams, you can enjoy clear and uninterrupted calls or meetings, no matter where you are. Voice isolation is an AI-based advanced noise suppression feature that eliminates unwanted background noise, including other human voices. The technology recognizes your voice profile and ensures only your voice is transmitted. Voice isolation can be enabled for calls and meetings. With this rollout, voice isolation will be available on Teams for macOS desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412359\" target=\"_blank\">412359</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early October 2024 and expect to complete by mid-October 2024.\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-October 2024 and expect to complete by late October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, Teams users on macOS desktops are not able to access the Teams voice isolation feature.\n</p><p>After this rollout, to use this feature, admins must enable the <code>enrollUserOverride</code> policy and the Voice isolation feature policy in the Teams admin center. Users will need to enroll their voice profile in Teams Settings on the <i>Recognition</i> tab to enable the voice isolation feature to have better audio input quality.\n</p><p>To disable this feature for your organization, use <code>Microsoft </code>PowerShell: <code>Set-CsTeamsMeetingPolicy</code>\n</p><p>This feature is on by default and available for admins to enable it.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Make sure to enable the <code>enrollUserOverride</code> policy for Voice and Face profile enrollment. Users can begin enrolling their <i>Recognition</i> profile now so they can use the voice isolation on macOS as soon as it is rolled out to your tenant.</p><p>These support articles and resources will help address any questions you or your users may have about the rollout:\n</p><ul><li><a href=\"https://support.microsoft.com/office/voice-isolation-in-microsoft-teams-calls-and-meetings-a9756ea9-4cec-44c4-aefb-6f5d17c89427\" target=\"_blank\">Voice isolation in Microsoft Teams calls and meetings - Microsoft Support</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/voice-isolation\" target=\"_blank\">Manage voice isolation for your users' Microsoft Teams calls and meetings</a>\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412359"
    },
    {
      "Name": "Summary",
      "Value": "Voice isolation feature for Microsoft Teams will be available on macOS desktops starting early October 2024, enhancing call clarity by suppressing background noise. Admins must enable specific policies for use. Rollout will be automatic, and users can enroll their voice profiles now in preparation."
    },
    {
      "Name": "Platforms",
      "Value": "Mac"
    }
  ],
  "EndDateTime": "2024-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC891240",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-16T23:29:29.623Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-16T23:29:19Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Voice isolation will be available for macOS desktops",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
