{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We have rolled back the Microsoft Loop component feature in Microsoft Word for the web introduced in December 2022 to <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/release-options-in-office-365?view=o365-worldwide#targeted-release\" target=\"_blank\">users in the Targeted release track</a>, as communicated in MC478687<i> Loop components in Word for the web in Targeted release</i> (December 2022).\n</p><p>Users will no longer be able to insert new Loop components in Word for the web from the ribbon. Existing Loop components will function as normal, and pasted Loop components will now appear as links in Word documents. Loop components will continue to be available in all other apps, including the Loop application, which provides access to all Loop components seen in Word for the web and elsewhere.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-loop-components-in-word-for-the-web-645cc20d-5c98-4bdb-b559-380c5a27c5e5\" target=\"_blank\">Use Loop components in Word for the web - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Loop components feature in Microsoft Word for the web, introduced to Targeted Release customers in December 2022, has been retired. Users can no longer insert new Loop components, but existing ones will work as usual. Loop components remain available in other apps and the Loop application."
    }
  ],
  "EndDateTime": "2024-11-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC893617",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-19T23:30:42.39Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-19T23:30:29Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Word: Loop components released to Targeted Release customers have retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
