{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re rolling out new and improved DLP Policy tips in New Outlook to support top DLP predicates &amp; exceptions, all advanced classifiers, and override capabilities.<br></p><p>* Features mentioned above are enabled based on Licenses. Please review license requirements <a href=\"https://learn.microsoft.com/en-us/purview/dlp-ol365-win32-policy-tips#customized-oversharing-dialog\" target=\"_blank\">here</a>.\n</p><p>The number of supported conditions has been updated:\n</p><ul><li>E3 and equivalent licenses: DLP Policy tips on New Outlook for Windows will support following DLP conditions (and corresponding exceptions):\n<ul><li>Content contains OOB/custom sensitive information types\n</li><li>Content is shared from Microsoft 365\n</li></ul></li><li>E5 and equivalent licenses: In addition to the above, DLP Policy tips on New Outlook for Windows will now support a richer set of DLP conditions (and corresponding exceptions), including the following:\n<ul><li>Content contains Sensitivity label  \n</li><li>Sender is \n</li><li>Sender domain is \n</li><li>Sender is member of  \n</li><li>Recipient is  \n</li><li>Recipient domain is \n</li><li>Recipient is a member of  \n</li><li>Subject contains words \n</li></ul></li></ul><p>Additionally, DLP Policy tips now support advanced classifiers like Trainable classifiers, Exact data match (EDM), and Named Entities, as well as an override feature that gives end users the ability to quickly and easily modify or override policies (if allowed in the DLP rule configuration), ensuring that the sensitive data is always protected, while still allowing end users to work efficiently.\n</p><p>For more details, admins can refer documentation <a href=\"https://learn.microsoft.com/purview/dlp-ol365-win32-policy-tips#conditions-that-support-policy-tips-for-outlook-for-microsoft-365-users\" target=\"_blank\">here</a>.\n</p><p>Please note that any existing conditions outside this updated list, which may currently trigger Policy Tips in New Outlook, will stop working after October 18th, 2024.</p><p><b>When this will happen:</b>\n</p><p>We will begin rolling out in late October 2024 and expect to complete rollout by late November 2024.\n</p><p><b>How this will affect your organization:</b> \n</p><p>If you are not using New Outlook this shall not impact you.\n</p><p>If you do not configure the Data Loss Prevention policies to enable policy tips for emails with sensitivity labels, this will not impact you. \n</p><p>If your organization is currently using Data loss prevention policies to enable policy tips and Oversharing pop-up, you will soon see them in New outlook with enhanced experience. \n</p><p><b>What you need to do to prepare:</b>\n</p><p>At this time, there is no action required from you.</p><p>You can access Data Loss Prevention in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal</a>. You can create new DLP policies or leverage the existing ones to use DLP Policy tips as an additional layer of security for sensitive data. \n</p><p>Learn more:  \n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/compliance/dlp-learn-about-dlp?view=o365-worldwide\" target=\"_blank\">Learn about data loss prevention</a> \n</li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/overview-new-outlook\" target=\"_blank\">Learn about New Outlook</a></li></ul><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New Outlook is updating DLP Policy tips to support more conditions and exceptions, particularly for E3 and E5 licenses. Features depend on licenses and include advanced classifiers and override capabilities. Rollout begins late October 2024, with no immediate action required from users. Existing conditions not listed will stop working after October 18th, 2024."
    }
  ],
  "EndDateTime": "2024-12-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC894577",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-21T00:07:06.31Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-21T00:06:50Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Data loss prevention and Oversharing in New Outlook – Supported conditions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
