{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are continuously refining our <a href=\"https://learn.microsoft.com/defender-office-365/step-by-step-guides/defense-in-depth-guide\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">defense-in-depth</a> approach, ensuring optimal protection when intermediaries are involved in your email traffic. We're enhancing the assignment of Bulk Complaint Level (BCL) scores when connectors are utilized, particularly for instances where <a href=\"https://learn.microsoft.com/defender-office-365/email-authentication-about#composite-authentication\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Composite Authentication</a> (CAUTH) is set to None.<br></p><p>We are rolling out a significant update that will result in more accurate BCL scoring for bulk emails. This adjustment ensures that the presence of intermediaries is factored into the scoring, making bulk email filtering more consistent and reflective of the actual sender's reputation. As a result, organizations can expect enhanced email filtering precision, leading to more reliable and effective management of bulk emails.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out early October 2024 and expect to complete by late October 2024.</p><p><b>How this will affect your organization:</b>\n</p><ul><li>Admins using connectors may observe changes in bulk email filtering as the new BCL scoring system provides more accurate reflections of bulk email traffic. This update will automatically be available by default, and admins should expect to see these changes reflected in their filtering logs and reports.\n</li><li>After the rollout, admins can expect to see an increase in the volume of bulk emails reflected in their <a href=\"https://learn.microsoft.com/defender-office-365/reports-email-security#threat-protection-status-report\" target=\"_blank\" style=\"\">Threat Protection Status</a>&nbsp;(TPS) report. Specifically, when viewing data under <i>Email &gt; Spam</i> and breaking down the chart by <i>Detection Technology &gt; Bulk</i>, the updated scoring will provide a clearer insight into bulk email traffic handled by the system.</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>Review your email filtering logs to assess the impact of the updated BCL scoring. Admins should also evaluate any custom rules or configurations in place and make necessary adjustments to optimize filtering based on the new scoring system.\n</p><p>For more details on BCL scoring and how it impacts your email security, see <a href=\"https://learn.microsoft.com/defender-office-365/anti-spam-bulk-complaint-level-bcl-about?view=o365-worldwide\" target=\"_blank\">Bulk complaint level (BCL) in EOP</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Exchange Online is updating bulk email filtering for better accuracy, factoring in intermediaries and enhancing BCL scores, especially when CAUTH is set to None. Rollout begins early October 2024, with completion by late October. Admins should review logs and prepare for changes in bulk email management."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC894576",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-21T00:06:16.283Z",
  "Services": [
    "Exchange Online",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-21T00:05:59Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Exchange Online: Update to bulk email filtering for enhanced accuracy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
