{
  "ActionRequiredByDateTime": "2025-01-10T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 27, 2024: We have updated the content. Thank you for your feedback.</p><p>We're introducing a new policy that gives IT admins enhanced flexibility with distinct settings for voice and face enrollment. This adjustment provides greater control over managing these features, allowing organizations to tailor to their needs. Voice and face biometric enrollment will be enabled by default, enabling voice isolation and speaker recognition in meeting rooms and enhancing intelligent meeting recaps and Microsoft Copilot for meetings.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413708\" target=\"_blank\">413708</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): </p><ul><li>We will begin rolling out the new policy in early October 2024 and expect complete by mid-October 2024.</li><li>The policy will be enabled beginning in early February 2025 (previously early January) and expect to be complete by mid-February 2025 (previously mid-January).</li></ul><p><b>How this will affect your organization:</b>\n</p><p>These changes will provide your organization with increased flexibility in managing voice and face enrollments. By using separate settings, you can customize for your organization's specific needs. The enrollment policy will be enabled by default. Once enabled, these enrollments will activate features like Voice Isolation and enhanced speaker recognition, leading to more efficient and productive meetings.</p><p><b>What you need to do to prepare:</b>\n</p><p>To ensure you have enough time to prepare for this change, you have until mid-January 2025 to configure everything to best suit your needs. If your organization requires keeping face and voice enrollments off, be sure to review the new policy and adjust the settings during this time. This period provides an opportunity to optimize how you manage voice and face data, enhancing your team's control over the process.</p><p>The new csTeamsAIPolicy will replace the current csTeamsMeetingPolicy, introducing two separate settings for face and voice enrollment: EnrollFace and EnrollVoice. Each can be set to Enabled or Disabled.</p><p>To help you get ready, review: </p><ul><li><a href=\"https://learn.microsoft.com/powershell/module/teams/set-csteamsmeetingpolicy?view=teams-ps\" target=\"_blank\">Set-CsTeamsMeetingPolicy</a></li><li><a href=\"https://learn.microsoft.com/powershell/module/teams/get-csteamsaipolicy?view=teams-ps\" target=\"_blank\">Get-CsTeamsAIPolicy</a>&nbsp;</li></ul><p>For more information about voice and face enrollment, visit <a href=\"https://learn.microsoft.com/en-us/microsoftteams/rooms/voice-and-face-recognition\" target=\"_blank\">Overview of voice and face enrollment - Microsoft Teams | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413708"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new policy for voice and face enrollment, defaulting to 'On' for enhanced meeting features. Rollout begins early October 2024, with the policy enabled in February 2025. Admins have until mid-January 2025 to adjust settings. The csTeamsAIPolicy will replace csTeamsMeetingPolicy, offering separate EnrollFace and EnrollVoice settings."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-03-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC892646",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-11-28T00:34:29.91Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-19T00:01:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New policy for voice and face enrollment defaulting to 'On'",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
