{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>If your organization does not use Teams Android Devices you can safely disregard this message.</p><p>Planned Maintenance: Automatic updates for all certified and supported Teams Android Devices to Company Portal version 5.0.6152.0.</p><p>Upcoming Microsoft Infrastructure changes will impact Teams Android Devices running older and out of support firmware and applications. Teams Android Devices (Teams Rooms on Android, Teams Phone, Teams Display, and Teams Panel devices) running Company Portal applications older than 5.0.6061.0 may sign out or be unstable starting July 1, 2025. We recommend ensuring your devices are on 5.0.6152.0 as soon as possible as that is the latest supported version to ensure stability.\n</p><p>Please review your existing Teams Android devices and ensure they are on the latest supported and available firmware and application versions. In Teams Admin Center &gt; Teams Devices you can export your current device inventory using the Excel icon for each device type, this export includes a column for Company Portal version.  If you find devices not on 5.0.6152.0, please update your Teams Android devices to the latest available firmware in Teams Admin Center, you can review manual and automatic update options as explained in <a href=\"https:/learn.microsoft.com/microsoftteams/devices/remote-update\" target=\"_blank\">this link</a>.\n</p><p>Since this Company Portal update is critical to ensure your devices stability, Microsoft will begin accelerated automatic firmware and company portal app only updates to ensure latest release for devices not currently running the latest release.\n</p><p><b>When will these updates happen:</b>\n</p><p>These auto-updates will start rolling out mid-October 2024 and will continue until late December 2024. \n</p><p><b>How this will affect your organization:</b>\n</p><p>This upgrade is required for all certified and supported Teams Android devices including Teams Rooms for Android, Teams phones, Teams panels and Teams displays. \n</p><p>The accelerated auto-updates include firmware, Teams app, and Company Portal app updates, as required to bring the device to Company Portal version 5.0.6152.0. This process may also include multiple updates if the devices are on older versions.\n</p><p>Because these updates will be rolled out at an accelerated pace, the configured update phase timelines (Validation, General, and Final) will not be adhered to. These updates will be scheduled outside of normal business hours at the local time of the device, to help minimize any impact to your organization. The configured maintenance window for the devices will not be adhered to as well.\n</p><p><i>How do I know what firmware update contains Company Portal 5.0.6152.0?</i></p><p>Please review these links which contain the details on the applications bundled into each firmware release:\n</p><ul><li>Teams phones: <a href=\"https://learn.microsoft.com/en-us/microsoftteams/devices/teams-ip-phones#product-release-information-for-teams-phones\" target=\"_blank\">Devices for Teams - Microsoft Teams | Microsoft Learn</a>\n</li><li>Teams Rooms on Android: <a href=\"https://learn.microsoft.com/en-us/microsoftteams/rooms/android-app-firmware\" target=\"_blank\">Teams Rooms on Android app and firmware versions - Microsoft Teams | Microsoft Learn</a>\n</li><li>Teams displays: <a href=\"https://learn.microsoft.com/en-us/microsoftteams/devices/teams-ip-phones#product-release-information-for-teams-displays\" target=\"_blank\">Devices for Teams - Microsoft Teams | Microsoft Learn</a>\n</li><li>Teams panels: <a href=\"https://learn.microsoft.com/en-us/microsoftteams/devices/teams-ip-phones#product-release-information-for-teams-panels\" target=\"_blank\">Devices for Teams - Microsoft Teams | Microsoft Learn</a></li></ul><p><i>What if I don't see a firmware with the Company Portal 5.0.6152.0 app included?</i> </p><p>Microsoft has released the Company Portal app as a direct update in Teams Admin Center for devices which do not have a recent firmware bundle.  This update can be deployed directly in Teams Admin Center and will show as an available update for your devices.\n</p><p><i>I have devices in my organization that are no longer certified and are end of support with Microsoft, will I receive an update for my devices? </i></p><p>Devices that are end of support and end of life will not receive new application updates due to legacy environment considerations and will be impacted by these infrastructure changes. These Teams devices are listed here: <a href=\"https://learn.microsoft.com/microsoftteams/devices/teams-ip-phones#end-of-certification-teams-devices\" target=\"_blank\">Devices for Teams - Microsoft Teams | Microsoft Learn</a>. Please work with your Teams devices OEM to source new certified and supported devices prior to this change occurring. An additional message center post will be released with more details on the impact to these legacy devices.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>The firmware and Company Portal app versions can be <a href=\"https://learn.microsoft.com/microsoftteams/devices/remote-update#manually-update-remote-devices\" target=\"_blank\">updated manually</a> for the impacted devices if you wish to control these updates, please complete your manual updates as soon as possible\n</p><p>For auto-updates, administrators don’t need to do anything to prepare. The changes will take affect automatically.\n</p><p>In case of any issues, feel free to reach out to Microsoft Support. You can also refer to <a href=\"https://learn.microsoft.com/microsoftteams/devices/remote-update\" target=\"_blank\">Update Microsoft Teams devices remotely - Microsoft Teams | Microsoft Learn</a>.</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Automatic updates for Teams Android Devices to Company Portal version 5.0.6152.0 are planned, starting mid-October 2024 until late December 2024. Devices running older versions may be unstable after July 1, 2025. Organizations should ensure devices are updated and check Teams Admin Center for current firmware and application versions. Accelerated updates will occur outside business hours, overriding normal update timelines and maintenance windows. Devices no longer supported will not receive updates. Preparation may include manual updates or allowing automatic updates to proceed."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC898390",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-26T00:41:33.79Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-26T00:40:43Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Planned maintenance for all certified and supported Teams Android Devices to Company Portal version",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
