{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re updating Microsoft Secure Score improvement actions for Microsoft Defender for Identity to ensure a more accurate representation of your security posture.</p><p>As part of this update, we will withdraw this Microsoft Defender for Identity recommendation: Remove Resource Based Constrained Delegation for Microsoft Entra seamless SSO account.</p><p>This rollout is part of our work to refine the recommendations report, to ensure it aligns more accurately with recommended policies and enhances the overall security value.</p><p><b>When this will happen:</b></p><p>(Worldwide, GCC, DoD) We will begin rolling out mid-September 2024 and expect to complete by late September 2024.</p><p><b>How this will affect your organization:</b></p><p>Although we will remove the recommendation from Microsoft Secure Score, your Secure Score will not be affected by this change since the recommendation is always set to Completed status.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is updating Microsoft Secure Score by removing a Defender for Identity recommendation to better reflect security posture. The removal will not affect Secure Scores and requires no admin action. Notification to users and documentation updates are suggested. Rollout will occur mid to late September 2024."
    }
  ],
  "EndDateTime": "2024-11-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC892649",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-19T00:12:37.987Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-19T00:10:00Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender XDR services: Removing Defender for Identity recommendation from Microsoft Secure Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
