{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>SharePoint Embedded Administrators will be able to grant guest applications permission to SharePoint Embedded applications within their tenant using cmdlets in SharePoint Online Management Shell. A guest application is defined as any application within the enterprise applications of the owning tenant.\n</p><ol><li><a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/get-spoapplication?view=sharepoint-ps\" target=\"_blank\">Get-SPOApplication</a> includes changes to view guest application permissions  \n</li><li><a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spoapplicationpermission\" target=\"_blank\">Set-SPOApplicationPermission</a> includes changes to manage guest application permission management</li></ol><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early October 2024 and expect to complete by mid-October 2024.</p><p>General Availability (Worldwide): We will begin rolling out in mid-October 2024 and expect to complete by late October 2024.</p><p> \n</p><p>Current SharePoint admins will need to download the latest version of <a href=\"https://learn.microsoft.com/powershell/sharepoint/sharepoint-online/introduction-sharepoint-online-management-shell?view=sharepoint-ps\" target=\"_blank\">SharePoint PowerShell</a>&nbsp;to access changes to guest application permission management cmdlet changes  \n</p><p><b>How this will affect your organization:</b>\n</p><p>SharePoint admins will now be able to grant guest applications within their tenant permissions to access SharePoint Embedded applications.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Current tenant admins will need to download the latest version of <a href=\"https://learn.microsoft.com/powershell/sharepoint/sharepoint-online/introduction-sharepoint-online-management-shell?view=sharepoint-ps\" target=\"_blank\">SharePoint PowerShell</a> to access changes to guest application permission management.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Admins can soon manage guest app permissions using SharePoint Online Management Shell cmdlets. Updates to Get-SPOApplication and Set-SPOApplicationPermission will facilitate this. Rollout starts early October 2024 for Targeted Release, and mid-October 2024 for General Availability. Admins must download the latest SharePoint PowerShell version to prepare."
    }
  ],
  "EndDateTime": "2024-12-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC897562",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-24T22:41:07Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-24T22:40:20Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Introducing Guest App Permission Management for SharePoint Admins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
