{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 6, 2024: We have updated the rollout timeline below. </p><p>We will not be rolling this out to organizations in GCC High or DoD during the timeline outlined below. We will communicate via Message center when we are ready to proceed. Organizations in GCC High and DoD can safely disregard this message. Thank you for your patience.\n</p><p>\n</p><p>Coming soon for Microsoft Teams: When users join a Teams meeting with their laptop in bring your own device (BYOD) meeting rooms, they will appear in the In-room participant section of the roster, which enables individual identification and meeting intelligence capabilities. As communicated in MC814577 <i>(Updated) Microsoft Teams: Roster grouping for in-room participants through Proximity Join for Teams Rooms on Windows</i> (July 2024), we will launch this same experience in September 2024 for joining a nearby meeting with a Microsoft Teams Room and a companion device.<br></p><p>Unique to BYOD meeting rooms, the roster group will be displayed as <i>Meeting space</i> if the connected device is NOT identified in the Teams Pro Management Portal (PMP). If the device is identified in the PMP, the roster group will display the configured meeting room name.\n</p><p>This message applies to Teams for Windows and Mac desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413711\" target=\"_blank\">413711</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-October 2024 (previously early October) and expect to complete by late October 2024 (previously mid-October).&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out mid-October 2024 and expect to complete by late October 2024.\n</p><p>General Availability (GCC): We will begin rolling out mid-October 2024 and expect to complete by late December (previously late November).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users joining a Teams meeting from a BYOD meeting room will be displayed as an individual participant in the <i>Participants </i>roster. Room node treatments will only be applicable to users joining from a Microsoft Teams Room.\n</p><p>After this rollout, this update will be available by default for all users joining a Teams meeting from a BYOD meeting room. After joining, in-room participants will automatically be grouped under the room node on the Participant roster. The two scenarios in which in-room participants can be ungrouped from the room node are:\n</p><ul><li>Raised hand: We will continue to follow the sequential order of raised hands on the roster. In-room participants who use their companion device to raise their hand will appear on the roster in the order in which they raised their hand.\n</li><li>Role assignment: For changes in roles (presenters and attendees), in-room participants can be broken up and placed in the appropriate category on the roster. (This is an existing feature before this rollout.)\n</li></ul><p>In both scenarios, room information will be listed below participant name.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p2Kg?ver=a20f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413711"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will update participant roster grouping for BYOD meeting rooms, with a rollout starting mid-October 2024. This feature groups in-room participants on the roster, with exceptions for raised hands and role assignments. The update excludes organizations in GCC High and DoD, with a separate communication to follow. Roadmap ID: 413711."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-02-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC892055",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-07T00:42:12.98Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-17T23:31:17Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Participant roster grouping in Teams BYOD meeting rooms",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
