{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 20, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Users with Microsoft Word, Excel, and PowerPoint on Windows desktops and the web will soon have access to an updated version of the Office Add-ins Store in these applications. This store will continue to support users in exploring, installing, and managing Office Add-ins provided by Microsoft and third parties.</p><p>With this new feature, minor users will no longer be permanently blocked from getting Office Add-ins from the Office Add-ins Store.\n</p><p>Learn more: \n</p><ul><li><a href=\"https://support.microsoft.com/office/view-manage-and-install-add-ins-for-excel-powerpoint-and-word-16278816-1948-4028-91e5-76dca5380f8d\" target=\"_blank\">View, manage, and install add-ins for Excel, PowerPoint, and Word - Microsoft Support</a>\n</li><li><a href=\"https://learn.microsoft.com/entra/fundamentals/how-to-manage-user-profile-info\" target=\"_blank\">Understand how to configure the Age Group property in Microsoft Entra admin center</a>\n</li></ul><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early January 2025 (previously mid-December 2024) and expect to complete by late January 2025 (previously early January).</p><p>General Availability (Worldwide):  We will begin rolling out late January 2025 (previously early January) and expect to complete by late February 2025. </p><p><b>How this will affect your organization:</b></p><p>Users will experience a new Office Add-ins Store in Word, Excel, and PowerPoint on both Windows desktops and on the web. Minor users not blocked by tenant administrators will be able to get Office Add-ins from the Office Add-ins Store.\n</p><p>This feature will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>For educational tenant administrators:\n</p><ul><li> If you wish to continue blocking minor students from getting Office Add-ins from the Office Add-ins Store, please ensure the user's <i>License Type</i> is set to student, the <i>Age group</i> property is not set to <i>Adult</i>, and go to Microsoft admin center &gt; <i>Org settings &gt; User owned apps and services</i> to ensure the option <i>Non-adult student</i> is unchecked.\n</li><li>For student users who you want to have access to the Office Add-ins Store, make sure their <i>Age group</i> property is set to <i>Adult</i>.\n</li></ul><p>Educational tenant admins: The last step in Microsoft admin center to blocking minor students from getting Office Add-ins from the Office Add-ins Store:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oQlZ?ver=4e4f\" style=\"width: 400px;\" alt=\"admin settings\"></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Office Add-ins Store in Word, Excel, and PowerPoint is being updated, allowing minor users access unless blocked by tenant administrators. Rollout begins early January 2025, with general availability by late February 2025. Educational tenant administrators should review configurations to manage minor students' access to the store."
    }
  ],
  "EndDateTime": "2025-04-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC894579",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-20T20:58:40.963Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-21T00:07:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Word, Excel, and PowerPoint: Update to Office Add-ins Store policy for minor users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
