{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Viva Insights: To enhance reliability and performance, we are transitioning to a more agile, high-performing API. This change will ensure a more consistent and robust user experience. Users will retain access to all reports but will see some design and content changes.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late September 2024 and expect to complete by late October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>These changes will apply to both default report pages and metric reports:\n</p><ul><li>The <i>New hire onboarding</i> report focuses on a specific group in the organization (new hires). It will adhere to current standards by displaying data only when the number of new hires meets the minimum group size requirement.\n</li><li>Specific rounding rules are applied to time-based metrics to make trends more meaningful and significant. For durations under 1 hour, rounding is to the nearest 15 minutes. For durations over 1 hour, rounding is to the nearest 30 minutes.\n</li></ul><p>Change to metric reports only:\n</p><ul><li>Metric reports will be enhanced to provide a four-week average, aligning with default report time frames. As a result, peer benchmarks, <i>Last week’s snapshot, Inspiration library articles, </i>and <i>Recommended actions</i> will no longer be accessible in the metric reports.\n</li><li>The home page cards for metric reports will be updated to compare metrics to the previous week instead of peer organizations.\n</li></ul><p>Updated metric reports:\n</p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1p76u?ver=5008\" style=\"width: 400px;\" alt=\"admin controls\">\n<p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Review and assess the impact on your organization. We have updated the documentation: <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/leader-reports\" target=\"_blank\">Use Leader reports to uncover key business outcomes | Microsoft Learn</a>\n</p><p>Also, you may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights is updating its metrics and report pages with a new API for better performance, affecting design and content. Changes include new rounding rules for time-based metrics and a shift to a four-week average for metric reports. Rollout starts late September 2024, with completion by late October 2024. Organizations should review the impact and update documentation."
    }
  ],
  "EndDateTime": "2024-12-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC891236",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-16T23:26:43.377Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-16T23:26:31Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Changes to Viva Insights metrics and default report pages for leaders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
