{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Anonymous users (guests) who join Microsoft Teams meetings in the Microsoft Edge for Business web browser will soon experience performance improvements. They will be able to join meetings faster.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=401117\" target=\"_blank\" style=\"\">401117</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early November 2024 and expect to complete by mid-November 2024.</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late-November 2024.</p><p>General Availability (GCC, GCC High, and DoD): We will begin rolling out early January 2025 and expect to complete by late January 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, anonymous users (guests) may experience longer wait times when attempting to join a Teams meeting.</p><p>After this rollout, anonymous users (guests) will be able to join meetings faster, even on low-end devices.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401117"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will enhance guest performance in Edge, enabling faster meeting joins, starting early November 2024 and completing by late January 2025. No admin action is needed for this automatic rollout. This is linked to Microsoft 365 Roadmap ID 401117."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC898391",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-26T00:42:17.643Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-26T00:41:52Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Performance improvements for meetings in Edge web browser for guests",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
