{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams: Write search queries quickly and efficiently with enhanced people query suggestions. This message applies to Teams on Windows and Mac desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413112\" target=\"_blank\">413112</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early October 2024 and expect to complete by mid-October 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-October 2024 and expect to complete by late October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users often recall information in the context of a specific person and write queries based on their past conversations with that person:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oNUN?ver=383b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After this rollout, users will be able to start typing a person's name in the Search bar and get query suggestions that are most relevant to a person they frequently interact with, helping the user recall content related to the person. </p><p>These screenshots provide examples of query suggestions in the search bar for the most common query types.\n</p><p>Left: A person query. Right: A person + keyword query:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oLyB?ver=746b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Search results page after the user selects a suggestion:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1oNUO?ver=73aa\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\nReview your current configuration to determine the impact for your organization.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/search-for-messages-and-more-in-microsoft-teams-4a351520-33f4-42ab-a5ee-5fc0ab88b263\" target=\"_blank\">Search for messages and more in Microsoft Teams - Microsoft Support</a> (will be updated before rollout).</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413112"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon introduce enhanced people query suggestions for more efficient searches, rolling out in October 2024. This feature, which is on by default, will help users recall information related to frequently interacted individuals. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2024-12-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC892054",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-17T23:30:59.543Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-17T23:30:48Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Enhanced query suggestions when searching for people",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
