{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>When using the AppRegNew.aspx page to create Azure ACS (Access Control Service) principals today, you can generate a new client ID (default flow) and secret, but you can also specify the client ID or secret yourselves. Going forward, the option to specify the client ID and secret yourself will be removed. Each created Azure ACS principal will have a unique client ID (a GUID) and a system-generated secret. After the creation of the Azure ACS principal, you’ll be redirected to a page showing the created client ID and secret.<br></p><p><b>How this will affect your organization:</b></p><p>If you used to specify a specific client ID as a way to renew the associated service principal secret then please switch the <a href=\"https://learn.microsoft.com/sharepoint/dev/sp-add-ins/replace-an-expiring-client-secret-in-a-sharepoint-add-in\" target=\"_blank\">recommended model for renewing secrets for Azure ACS service principals</a>.</p><p>We will gradually roll out this change in early October&nbsp;2024, and we expect to complete by early November 2024.&nbsp;</p><p>Reminder: Azure ACS in Microsoft 365 is being retired with a final end date of April 2, 2026. You can learn more via the&nbsp;<a href=\"https://learn.microsoft.com/sharepoint/dev/sp-add-ins/retirement-announcement-for-azure-acs\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">retirement announcement</a> or via MC693863.</p><p><b>What you need to do to prepare:</b></p><p>This change will happen automatically by the specified date. No admin action is required.&nbsp;</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The option to specify client ID and secret when creating Azure ACS principals will be removed. Users must adopt the system-generated client ID and secret. This change will start in early October 2024 and end by early November 2024. No admin action is required for this automatic change. Azure ACS is retiring on April 2, 2026."
    }
  ],
  "EndDateTime": "2026-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC898388",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-26T00:40:21.577Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-26T00:39:37Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Specifying client ID and secret when creating an Azure ACS principal via AppRegNew.aspx will be removed",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
