{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As we continue to invest in a unified and modern Microsoft OneNote experience, we want to remind you that the OneNote for Windows 10 app will reach end of support on <b>October 14, 2025</b>. After this date, the app will no longer receive support, and the app will become read only.\n</p><p>To ensure the best experience moving forward, we strongly recommend switching your users to the <a href=\"https://apps.microsoft.com/detail/xpffzhvgqwwlhb?ocid=pdpshare&amp;hl=en-us&amp;gl=US\" target=\"_blank\">Microsoft OneNote for Windows</a> app as soon as possible. Our team is focusing on enhancing this app, providing a sleek and modern interface and improving security, and releasing new features like Loop components, voice dictation and transcription, ink improvements, a new meeting details experience, integration with the new Microsoft Outlook, and more to align with the evolving needs of our users.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Although OneNote for Windows 10 is supported until October 14, 2025, it is no longer receiving new feature updates, and it does not benefit from improvements to data syncing.\n</p><p>Starting in January 2025, users will start to see notifications in OneNote for Windows 10 about the end of support. These notifications will provide additional information and direct users to resources for a smooth transition.\n</p><p><b>What you need to do to prepare:</b>\n</p><p><i>1. Migration guidance</i>:\n</p><p>We have developed a detailed <a href=\"https://learn.microsoft.com/microsoft-365-apps/deploy/deployment-guide-onenote\" target=\"_blank\">Deployment guide for OneNote</a> that includes best practices of migrating and a sample migration script. This sample script is designed to simplify the migration process for IT admins and to ensure that your users' unsynchronized data is backed up during migration. We believe this migration guidance will significantly help in achieving a successful migration process.\n</p><p><i>2. OneNote migration support in October 2024:</i>\n</p><p>To ensure a smooth transition, we are offering additional support from the OneNote team to help with the migration process for tenants who want to migrate early. The team is only available in the month of October 2024. After that, you will need to rely on the deployment guidance. To engage the OneNote team in October 2024, please provide feedback as usual on this post and include your email address.\n</p><p><i>3. App download restrictions for new users:</i></p><p>Starting November 1, 2024, new users will no longer be able to download OneNote for Windows 10 from the Microsoft Store. Given the app is approaching end of support and we are recommending using OneNote for Windows instead, we’re restricting new users from being able to install OneNote for Windows 10 moving forward. If you currently have the application installed, you will still be able to use it and receive updates until the end of support.\n</p><p>We are committed to supporting you through this transition and ensuring that your migration to OneNote for Windows is as seamless as possible.\n</p><p><i>Learn more\n</i></p><ul><li><a href=\"https://apps.microsoft.com/store/detail/XPFFZHVGQWWLHB?ocid=pdpshare\" target=\"_blank\">Download OneNote for Windows</a> from the Microsoft Store\n</li><li><a href=\"https://support.microsoft.com/office/what-is-happening-to-onenote-for-windows-10-2b453bfe-66bc-4ab2-9118-01e7eb54d2d6#:~:text=We%20recently%20announced%20the%20availability%20of%20the%20OneNote,Windows%2010%20will%20reach%20end-of-support%20in%20Oct%202025.\" target=\"_blank\">What is happening to OneNote for Windows 10 - Microsoft Support</a>\n</li><li><a href=\"https://support.microsoft.com/office/moving-to-onenote-on-windows-4ba7b498-aafc-44b1-8326-a582a6c71196\" target=\"_blank\">Moving to OneNote on Windows - Microsoft Support</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365-apps/deploy/deployment-guide-onenote\" target=\"_blank\">Deployment guide for OneNote - Microsoft 365 Apps | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "OneNote for Windows 10 will end support on October 14, 2025, and users should switch to OneNote for Windows. Migration guidance and support are provided, with additional OneNote team support available in October 2024. New user downloads will be restricted starting November 1, 2024."
    }
  ],
  "EndDateTime": "2025-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC899174",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-09-26T23:23:07.523Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-26T23:14:35Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft OneNote for Windows 10 retires October 14, 2025 (switch your users)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
