{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, when we determine whether a user is entitled to submit feedback for Microsoft Outlook, we only look at the feedback policy for a user's primary account (also known as the global account). This message applies to new Outlook on Windows desktop and Outlook on the web.\n</p><p>After this rollout, we will make the feedback policy check more restrictive, which is more secure. We will base their eligibility on the most feedback restrictive policy value in all of the user's accounts. For example, if any of the user's accounts have feedback disabled by a policy, we will not show the <i>Feedback</i> button in the <i>Help</i> tab of the ribbon in Outlook for any of their accounts.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=416296\" target=\"_blank\">416296</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late September 2024 and expect to complete by late October 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out late October 2024 and expect to complete by late November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>A user with a policy that disables feedback on one of their accounts will lose access to feedback for all their accounts.\n</p><p>After this rollout, this change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/contact-support-and-provide-feedback-in-new-outlook-for-windows-4a4bcc80-c71e-4e44-97c1-d0e62452ef4a\" target=\"_blank\">Contact support and provide feedback in new Outlook for Windows - Microsoft Support</a>\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "416296"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook is enhancing security by making feedback policy checks more restrictive across all user accounts. Eligibility for feedback submission will be based on the most restrictive policy value among a user's accounts. This change will start rolling out in late September 2024 for Targeted Release and in late October 2024 for General Availability. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC892652",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-19T00:15:16.56Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-19T00:14:12Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Adding security to feedback policy checks across all user accounts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
