{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Two new features are coming soon for Microsoft Entra ID users on the New tab page in Microsoft Edge for Android and iOS devices:\n</p><ul><li>Wallpaper. For organizations that do not have <a href=\"https://learn.microsoft.com/microsoft-365/solutions/apps-config-step-1?view=o365-worldwide#add-branding-information\" target=\"_blank\">customized branding information</a>, the default value of the <code>com.microsoft.intune.mam.managedbrowser.NewTabPageLayout.Custom</code> key will change from <code>topsites|newsfeed</code> to <code>topsites|wallpaper|newsfeed</code>. When users open Edge mobile, the Wallpaper will be turned on by default on the New tab page.  \n</li><li>Weather. This rollout will add the new value <code>weather </code>into the <code>com.microsoft.intune.mam.managedbrowser.disabledFeatures</code> key and keep the default value for weather as enabled.  When users open Edge mobile, they will see the weather icon on top left of the New tab page and can select the weather details page.\n</li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out the <b>Wallpaper</b> updates in Microsoft Edge Stable version 129, expected in early October 2024.\n</p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out the <b>Weather</b> updates in Microsoft Edge Stable version 130, expected in late October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, Edge mobile devices in organizations that do not have customized branding information do not display Wallpaper. All Edge mobile users do not have access to Weather on the New tab page.\n</p><p>After this rollout, when branding information is not customized by the admin, users will have the New tab page wallpaper turned on by default. Also, users will see the weather icon in the top left of the New tab page and can select the weather details page.\n</p><p>This change is on by default.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/5a7c31be-0e5c-4fe0-9121-c978361da062\" style=\"width: 377.997px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/mem/intune/apps/manage-microsoft-edge\" target=\"_blank\">Manage Microsoft Edge on iOS and Android with Intune | Microsoft Learn</a>\n</p><p>To customize the Edge mobile New tab page, admins can use the <code>com.microsoft.intune.mam.managedbrowser.NewTabPageLayout.Custom</code> and <code>com.microsoft.intune.mam.managedbrowser.disabledFeatures</code> keys or <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-mobile-policies#edgenewtabpagelayoutcustom\" target=\"_blank\">EdgeNewTabPageLayoutCustom</a> and <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-mobile-policies#edgedisabledfeatures\" target=\"_blank\">EdgeDisabledFeatures</a> mobile device management policies.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Edge Mobile will soon update the New tab page for Microsoft Entra ID users with default Wallpaper and Weather features. Wallpaper will be enabled by default, and a weather icon will be added. Rollouts for these features are expected in early and late October 2024, respectively. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC907533",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-09T23:14:23.06Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-09T23:14:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Edge Mobile: Updated Weather and Wallpaper on the New tab page (Microsoft Entra ID users)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
