{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In July 2024, we communicated in MC816207 that&nbsp;Microsoft Forms supports live data sync to Microsoft Excel with more functionality.\n</p><p>Coming soon: A new data sync solution with higher reliability to sync Forms response data to Microsoft Excel for the web. New Forms created from Microsoft OneDrive and Microsoft SharePoint online after this rollout will use the new data sync solution.\n</p><p><b>When this will happen:</b><br></p><p>General Availability (Worldwide): We will begin rolling out mid-October 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, Forms created from OneDrive and SharePoint Online used the old data sync solution. The Excel file was created automatically when creating the forms, and the Forms data was pushed to Excel file through Graph API.\n</p><p>With this rollout, Forms created from OneDrive and SharePoint Online will use the new data sync solution. The Excel file will not be created automatically. The user can create the Excel file from the Forms result page after responses have been received.\n</p><p><i>Workflow</i></p><p>1. Create a new form from SharePoint Online or OneDrive for business: Select <i>New &gt;&nbsp;Forms survey</i> (before rollout, this was called <i>Forms for Excel</i>).\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c7f3797b-55dd-4857-93fc-a19e55d3579e\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>2. After receiving responses to the form, create an Excel file from the Forms result page to sync the data:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/61789902-e772-4a4e-9eef-23cd9908da42\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>3. The Excel file will be created in the SharePoint folder where the form was created.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/840f39e4-1102-419d-bf54-470bebe9126f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Note: The new data sync can only be triggered in Excel for the web. If users want to receive new Forms response data in the Excel desktop app, open the file in Excel for the web, and then wait for the desktop app file to sync from the web file. (Support for other versions of Excel is in progress.)</p><p>\n</p><p>This feature will be on by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more:&nbsp;<a href=\"https://support.microsoft.com/en-us/office/create-a-form-with-microsoft-forms-4ffb64cc-7d5d-402f-b82e-b1d49418fd9d#PickTab=OneDrive_for_work_or_school\" target=\"_blank\">Create a form with Microsoft Forms - Microsoft Support</a>&nbsp;(will be updated before rollout begins)</p><p><br></p><p><br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Forms will soon introduce a new data sync solution for Excel on the web in SharePoint Online and OneDrive, replacing the old sync method. Rollout starts mid-October 2024 and should complete by mid-November 2024. This feature will be default and requires no admin action before rollout."
    }
  ],
  "EndDateTime": "2025-01-15T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC901820",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-30T23:46:59.867Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business",
    "Microsoft Forms"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-30T23:46:47Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Forms: New data sync solution for Microsoft Excel for the web in Microsoft SharePoint Online and OneDrive",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
