{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With this new capability, Microsoft 365 Mobile app users can open PDF files that are protected with Microsoft Purview Information Protection sensitivity labels and read them using Microsoft 365 Mobile app in read-only mode. Only authorized users will be able to access these PDF files.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Available now.\n</p><p><b>How this will affect your organization:</b>\n</p><p>MIP (Microsoft Information Protection) is an umbrella term for the Information Protection Services provided by Microsoft. Primarily MIP provides Classification, Labelling, and Protection (CLP) capabilities. With this feature, Microsoft 365 Mobile App will allow for previewing MIP encrypted PDF files.\n</p><p>This feature will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may want to notify your users about this new capability and update your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft 365 Mobile app now supports viewing PDFs with Purview Information Protection sensitivity labels in read-only mode, available globally. Organizations should inform users and update training materials accordingly."
    }
  ],
  "EndDateTime": "2024-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC909170",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-11T23:00:03.06Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-11T22:58:02Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft 365 Mobile: View PDFs with Purview Information Protection sensitivity labels on Microsoft 365 Mobile app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
