{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As announced earlier in&nbsp;<span style=\"background-color: rgb(255, 255, 255);\">MC616550 (June '23)</span>, InfoPath Forms Service is being deprecated and will be removed from existing tenants after July 14, 2026. To support this transition, we will prevent the publication of new InfoPath forms in SharePoint Online for tenants with no detected usage of the InfoPath forms service. This proactive action aims to reduce the migration effort for new InfoPath forms in anticipation of the service's retirement.<br></p><p><b>Key Points:</b>\n</p><ul><li>Major: Retirement update\n</li><li>Timeline: After December 20, 2024, Microsoft will prevent the publication of new InfoPath forms for tenants who are not actively using InfoPath services.</li><li>Action: Review and assess impact\n</li></ul><p><b>How this will affect your organization:</b>\n</p><p>After December 20, 2024, InfoPath designers and publishers will no longer be able to publish new forms to SharePoint Online as no active usage of the InfoPath forms service has been detected in your tenant over the past year. Existing published forms will remain unaffected, and end users can continue to fill in these forms in SharePoint Online if needed.</p><p><b>What you need to do to prepare:</b>\n</p><p>As we have detected no usage of the InfoPath forms service in your tenant over the past year, we recommend running the&nbsp;<a href=\"https://aka.ms/assessment/infopath\" target=\"_blank\">Microsoft 365 Assessment tool</a>&nbsp;and using the&nbsp;<a href=\"https://aka.ms/assessment/infopathreport\" target=\"_blank\">Power BI InfoPath Report</a>&nbsp;to confirm this. If active usage is detected, please raise the issue with your support engineer for our further assistance.</p><p>If you need a solution for the form scenario in your organization, we recommend using the modern solutions of&nbsp;<a href=\"https://powerapps.microsoft.com/\" target=\"_blank\">Microsoft Power Apps</a>, <a href=\"https://powerautomate.microsoft.com/\" target=\"_blank\">Microsoft Power Automate</a> or <a href=\"https://forms.office.com/\" target=\"_blank\">Microsoft Forms</a>, and additional details can be found in this <a href=\"https://aka.ms/sp-infopath-update\" target=\"_blank\">blog</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting December 2024, Microsoft will block new InfoPath Forms publication in SharePoint Online for tenants not using the service, as part of the deprecation process ending July 14, 2026. Tenants should review impact, run assessments, and consider modern alternatives like Power Apps, Power Automate, or Microsoft Forms. Existing forms will remain usable."
    },
    {
      "Name": "BlogLink",
      "Value": "https://aka.ms/sp-infopath-update"
    }
  ],
  "EndDateTime": "2025-01-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC909173",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-11T23:17:39.963Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-11T23:00:37Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Publishing new InfoPath Forms in SharePoint Online will not be allowed for inactive tenants in this December",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
