{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: A new <i>Glint and organizational insights</i> Power BI report in the <a href=\"https://learn.microsoft.com/viva/insights/advanced/introduction-to-advanced-insights\" target=\"_blank\">Microsoft Viva advanced insights app</a> and in the Microsoft Viva Glint dashboard that integrates Microsoft Viva Insights data with Viva Glint.\n</p><p>In the advanced insights app, analysts can use the Power BI report template to connect sentiment data from Viva Glint with collaboration data from Viva Insights. This will empower analysts to better understand which behaviors might drive employee sentiment outcomes and take actions to help improve employee sentiment and behavioral metrics.   \n</p><p>On the Viva Glint dashboard, HR users can use collaboration data from Viva Insights to filter and analyze Glint engagement survey results. This will allow HR users to see how different workplace patterns may impact employee engagement, so they can help leaders identify impactful opportunities to improve the employee experience. \n</p><p>This integration will allow HR users and analysts to combine sentiment and collaboration data in the advanced insights app as well as Viva Glint into the rhythm of their business, to better understand their employees' full work experience. Integrating Viva Glint employee survey scores with Viva Insights data helps identify opportunities and strengths to meet organizational goals.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=416075\" target=\"_blank\">416075</a>.\n</p><p><b>When will this happen:</b>\n</p><p>Public Preview: Available now.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by mid-November 2024.\n</p><p><b>How will this affect your organization:</b> \n</p><p>Before this rollout: Before the rollout, tenants have access to the Power BI report in public preview, when the report includes an <i>Overview</i> page.\n</p><p>After the rollout, the Power BI report <i>Overview</i> page will no longer be available. Users will only have access to the detailed <i>Exploration page</i> in Power BI. This rollout has two key features:\n</p><p>1. <i>Viva Insights with Glint Power BI report</i>\n</p><p>Advanced insights app users can access the new Glint and Organizational Insights Power BI Template in Viva Insights. This feature allows you to select a survey question and pair it with a subset of Viva Insights metrics. Attribute filters enable further drill downs to analyze changes in:\n</p><ul><li>Glint question score\n</li><li>Correlation strength\n</li><li>Behavioral trend data\n</li><li>Favorability breakdown against behavioral data\n</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/templates/glint\" target=\"_blank\">Glint and organizational insights report | Microsoft Learn</a>\n</p><p>Sending survey data from Viva Glint to Viva Insights: The Glint admin can send Glint survey data to Viva Insights for exploration in the <i>Glint and organizational insights</i> Power BI Report.\n</p><ul><li>The <i>Viva Insights admin</i> sets up a new import in the advanced insights app. Learn more about how to start the process: <a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/import-survey-glint\" target=\"_blank\">Import survey results from Viva Glint into Viva Insights | Microsoft Learn</a>\n</li><li>The <i>Viva Insights admin </i>contacts the <i>Viva Glint admin</i> to share Viva Glint survey data, and the Viva Glint admin selects specific survey programs and sends the data to Viva Insights. Learn more about this step: <a href=\"https://learn.microsoft.com/viva/glint/setup/insights-integration\" target=\"_blank\">Send Viva Glint survey results to Viva Insights | Microsoft Learn</a>\n</li><li><i>Viva Insights</i> validates and processes the data, so it is ready for use. <a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/import-survey-glint?branch=main#3-data-validation-and-processing\" target=\"_blank\">Learn more about this step</a>.\n</li></ul><p><i>Glint and organizational insights</i> report:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/73061a0c-7452-44f9-9b34-b9f22f33d5d4\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>2. <i>Viva Glint dashboard with Viva Insights data</i>\n</p><p>Viva Glint dashboard users can use Viva Insights metrics as people attribute filters to analyze Glint engagement survey results. On the dashboard, users can see how different behavioral metrics relate to overall engagement. The Viva Glint <i>Heat Map</i> report offers a more detailed view of how different behavioral metrics impact the specific drivers of engagement. Users can filter comments by behavioral metrics to see what people are saying in relation to specific workplace patterns.</p><p>Sending collaboration data from Viva Insights to Viva Glint: After this rollout, the M365 administrator and Viva Glint admin can take these steps to send data from Viva Insights to Viva Glint:</p><ul><li>The <i>Microsoft 365 global admin</i> consents to share Viva Insights data with Viva Glint. Learn more about how to start the process: <a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/export-insights-data-glint\" target=\"_blank\">Export Viva Insights data to Viva Glint | Microsoft Learn</a>\n</li><li>The Viva Glint admin sets up the integration and adds the relevant metrics from Viva Insights. Learn more about this step: <a href=\"https://learn.microsoft.com/viva/glint/setup/insights-to-glint\" target=\"_blank\">Send Viva Insights data to Viva Glint | Microsoft Learn</a>\n</li></ul><p>\n</p><p>Glint with Insights <i>Heat Map</i> report:</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/623a8b3f-bf1c-4f69-92e6-7ef731e2720e\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>The new report is available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><ul><li>Review and assess the impact of sending survey data from Viva Glint to Viva Insights for your organization.\n</li><li>Review and assess the impact of sending collaboration data from Viva Insights to Viva Glint for your organization.\n</li><li>Consider reviewing with your works council and updating your training and documentation as appropriate.\n</li><li>Learn more about the Viva Insights with Glint Power BI report: <a href=\"https://learn.microsoft.com/viva/insights/advanced/analyst/templates/glint\" target=\"_blank\">Glint and organizational insights report | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "416075"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Glint and Viva Insights are integrating to provide sentiment and collaboration data. A new Power BI report will be available in the Viva advanced insights app and Viva Glint dashboard. Public Preview is available now, with full rollout expected by mid-November 2024. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC904541",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-04T07:21:34.707Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-04T07:21:18Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Glint and Viva Insights integration for sentiment and collaboration data",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
