{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 17, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: We will automatically import the folder order from classic Microsoft Outlook for Windows to new Microsoft Outlook for Windows and Outlook for the web. If users have not customized their folder order, the default view will continue to display folders alphabetically in the new Outlook.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=378775\" target=\"_blank\">378775</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late November 2024 (previously early October) and expect to complete by late December 2024 (previously early November).\n</p><p>General Availability (Worldwide): We will begin rolling out January 2025 (previously early November) and expect to complete by early February 2025 (previously early December).</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out early February 2025 (previously early December) and expect to complete by early May 2025 (previously early March).</p><p>\n</p><p><b>How this will affect your organization:</b><br></p><p>Before this rollout: If a user enabled custom folder order in classic Outlook, the custom order is preserved in the new Outlook for Windows and Outlook on the web. This may result in changes to the folder structure for affected users, as the new Outlook supports only alphabetical ordering.\n</p><p>After this rollout: users will see the custom folder order they previously enabled in classic Outlook. Special folders such as<i> Inbox, Drafts, Sent Items,</i> and others will still remain at the top of the folder list, even when the rest of the folders are arranged alphabetically.\n</p><p>This change is on by default.\n</p><p>To change folder order, go to the new Outlook ribbon, and select <i>View &gt; Layout &gt; Folder pane</i>. Choose one of these options:\n</p><ul><li>Order folders A to Z order: This will organize folders alphabetically\n</li><li>Custom order\n</li></ul><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b17eaac5-fed8-4fcc-a1e7-93ea24028c0d\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Users can hover next to each folder name to see the three-dot menu where they can move folders with drag-and-drop or the move up/move down options:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/50d76812-1055-4a6f-a678-eb810463e0a3\" style=\"width: 300px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/change-the-order-of-folders-in-the-folder-pane-f333a1e5-2124-4900-a300-79e9692f085c\" target=\"_blank\" style=\"\">Change the order of folders in the Folder Pane - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New Microsoft Outlook for web and Windows will automatically import folder order from classic Outlook. Rollout starts late November 2024 for Targeted Release and January 2025 for General Availability. Users can customize folder order via the new Outlook ribbon. No admin action required; notify users."
    }
  ],
  "EndDateTime": "2025-06-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC901831",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-27T16:01:15.817Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-30T23:53:50Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for web and Windows: Organize and reorder folders",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
