{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 22, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to the <a href=\"https://purview.microsoft.com/\" target=\"_blank\">Microsoft Purview compliance portal</a>: To assist you in diagnosing issues encountered while using Microsoft Information Protection (MIP) and Data Loss Prevention (DLP), we will release a new experience where you can run diagnostics to help identify the root cause of issues and provide remediation options. Before this rollout, these diagnostics were only available as Microsoft PowerShell cmdlets.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=418566\" target=\"_blank\">418566</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early December 2024 (previously late October) and expect to complete by late December 2024 (previously mid-November).\n</p><p>General Availability (Worldwide): We will begin rolling out mid-February 2025 (previously early January) and expect to complete by late February 2025 (previously mid-January).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, you can troubleshoot issues at <span style=\"background-color: rgb(214, 239, 214);\">Purview compliance portal</span> <i>&gt; Data Loss Prevention &gt; Run diagnostics</i>.\n</p><p>This new feature will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.\n</p><p><a href=\"https://purview.microsoft.com/\" target=\"_blank\" style=\"\"><font color=\"#000000\" style=\"background-color: rgb(214, 239, 214);\">Microsoft Purview compliance portal</font></a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "418566"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Data Loss Prevention diagnostics will soon be available in the Purview compliance portal, with a new experience to troubleshoot issues. The Public Preview rollout is rescheduled to early December 2024, and General Availability will begin mid-February 2025. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC904540",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-23T21:18:09.507Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-04T07:19:56Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Diagnostics now in the Purview compliance portal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
