{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: The ability to open or restart the new Microsoft Outlook for Windows when not connected to the internet.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=414516\" target=\"_blank\">414516</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early October 2024 and expect to complete by late November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before the rollout: A connection to the internet was required to open or restart the new Outlook for Windows.\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required to prepare for this rollout. You may want to notify your users about this change and update any relevant documentation as appropriate.\n</p><p>If you would like to disable the entire set of offline capabilities in the new Outlook, including offline app boot and previously rolled out capabilities as communicated in the more detailed MC798674 (Updated) <i>New Microsoft Outlook for Windows: Offline support for mail actions and compose</i> (published June 2024, updated July 2024), set the Exchange PowerShell <code>Set-OwaMailboxPolicy</code> cmdlet parameter <code>OfflineEnabledWin</code> to False. \n</p><p>We have published this article with more details about offline support in the new Outlook: <a href=\"https://support.microsoft.com/office/work-offline-in-outlook-2460e4a8-16c7-47fc-b204-b1549275aac9#PickTab=New_Outlook\" target=\"_blank\">Work Offline in Outlook</a>.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "414516"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Outlook for Windows will soon allow opening or restarting the app while offline. This feature is part of Microsoft 365 Roadmap ID 414516 and will be available from early October to late November 2024. No action is needed for preparation."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC907098",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-08T22:59:50.11Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-08T22:59:31Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Open or restart while offline",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
