{
  "ActionRequiredByDateTime": "2024-12-31T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As mentioned in MC726113/MC674247,&nbsp;<a href=\"https://blog.google/products/android-enterprise/da-migration/\" target=\"_blank\">Google has deprecated</a> Android device administrator management, continues to remove management capabilities, and no longer provides fixes or improvements. Due to these changes, Intune will be ending support for Android device administrator management on devices with access to <a href=\"https://learn.microsoft.com/mem/intune/apps/manage-without-gms\" target=\"_blank\">Google Mobile Services (GMS)</a> beginning <b>December 31, 2024</b>. Until that time, we will support device administrator management on devices running Android 14 and earlier. For more details, read the blog: <a href=\"https://aka.ms/Intune-Android-DA-blog\" target=\"_blank\">https://aka.ms/Intune-Android-DA-blog</a>.<br></p><p><b>How this will affect your organization:</b></p><p>After Intune ends support for Android device administrator, devices with access to GMS will be impacted in the following ways:</p><ol><li>Users will not be able to enroll devices with Android device administrator.</li><li>Intune will not make changes or updates to Android device administrator management, such as bug fixes, security fixes, or fixes to address changes in new Android versions.</li><li>Intune technical support will no longer support these devices.</li></ol><p><b>What you need to do to prepare:</b></p><p>Stop enrolling devices into Android device administrator and migrate impacted devices to other management methods. You can check your Intune reporting to see which devices or users may be affected. Go to <b>Devices</b> &gt; <b>All devices</b> and filter the OS column to <b>Android (device administrator)</b> to see the list of devices. \n</p><p>Read the blog, <a href=\"https://aka.ms/Intune-Android-DA-blog\" target=\"_blank\">Microsoft Intune ending support for Android device administrator on devices with GMS in December 2024</a>, for our recommended alternative Android device management methods and information about the impact to devices without access to GMS.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Intune will end support for Android device administrator on GMS devices after December 31, 2024. Users should stop enrolling devices using this method and migrate to alternative management methods. Details on the impact and preparation steps are available in the Intune blog."
    },
    {
      "Name": "BlogLink",
      "Value": "https://aka.ms/Intune-Android-DA-blog"
    }
  ],
  "EndDateTime": "2025-02-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC902778",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-01T23:10:43.877Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-01T23:10:32Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Intune ending support for Android device administrator on devices with GMS access",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
