{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Places, an AI-powered workplace app for flexible work, will be generally available in Q4 CY24.  Places reimagines flexible work with AI by intelligently coordinating your hybrid team to make the most of in-office days, modernizing how employees connect, and optimizing space management with occupancy and utilization data.&nbsp;&nbsp;<br></p><p>There will be two new service plans for core and premium features: </p><ul><li>Places Core (PLACES_CORE)</li><li>Places Enhanced (Microsoft Places Premium) (PLACES_ENHANCED)</li></ul><p> As an existing customer, you will see an additional service plan as part of your Office 365 subscription: Places Core.  This service plan includes all core features such as setting up and updating location plans, viewing collaborators’ location plans, accessing peek card experiences, scheduling in person meetings, managing hybrid RSVP, and workplace presence related capabilities.<br></p><p>\n</p><p>If you have Teams Premium, you will have Places Enhanced premium features like Places Finder, intelligent booking, Places Explorer, Places Space Analytics, and auto-release policies.&nbsp; &nbsp;</p><p>We will be backfilling these service plans into the following SKUs below. \n</p><p>\n</p><p>List of SKUs for Places Core:&nbsp;<br></p><ul><li>Microsoft 365 Business Basic&nbsp;<br></li><li>Microsoft 365 Business Standard&nbsp;<br></li><li>Microsoft 365 Business Premium&nbsp;<br></li><li>Microsoft 365 or Office 365 E1, E3, E5&nbsp;<br></li><li>Microsoft 365 or Office 365 F3&nbsp;<br></li></ul><p>List of SKUs for additional Teams-specific features in Places Core:&nbsp;<br></p><ul><li>Microsoft Teams Essentials&nbsp;<br></li><li>Microsoft Teams Enterprise&nbsp;<br></li><li>Microsoft Teams EEA&nbsp;<br></li></ul><p>List of SKUs for Places Enhanced:&nbsp;<br></p><ul><li>Microsoft Teams Premium Introductory Pricing </li></ul><p>We will begin rolling out both service plans in mid- to late-November for all platforms. Once the Places core service plan is deployed to your organization, core features will become available within your Office 365 subscription with basic set up and onboarding buildings to Places directory. Enhanced experiences will require additional deployment planning.&nbsp; &nbsp; &nbsp;</p><p>Learn about Microsoft Places and the value that Places delivers for flexible work. Participate in our public preview and begin conversations with your IT Admin, relevant BDMs (RE&amp;F) and leadership teams to understand how they are implementing hybrid work policies and managing occupancy &amp; utilization challenges today.  Start to gather workplace locations, existing floor plans, etc. to get ready for onboarding plans.<br></p><p>\n</p><p>Learn more:<br></p><p>\n</p><ul><li><a href=\"https://www.microsoft.com/microsoft-places\" target=\"_blank\">Microsoft Places&nbsp;</a></li><li><a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2024/05/13/ai-brings-new-life-to-flexible-work-with-microsoft-places/\" target=\"_blank\">Microsoft Places: Using AI for flexible work | Microsoft 365 Blog&nbsp;</a><br></li><li><a href=\"https://learn.microsoft.com/microsoft-365/places/places-overview\" target=\"_blank\">Microsoft Places overview - Microsoft 365 Places | Microsoft Learn&nbsp;</a><br></li><li><a href=\"https://learn.microsoft.com/microsoft-365/places/deployment-guide-for-places\" target=\"_blank\">Deployment guide for Places - Microsoft 365 Places | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Places, an AI-powered app for flexible work, will be available in Q4 CY24 with core and premium service plans. Existing Office 365 subscribers will receive the core service plan, including basic features for workplace coordination. Teams Premium users will get enhanced features. Deployment begins in November across all platforms."
    }
  ],
  "EndDateTime": "2024-12-02T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC901823",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-30T23:48:22.35Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-30T23:47:44Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Places will be generally available in Q4 CY24",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
