{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Mesh app users on Meta Quest 2, 3, and Pro headsets will be able to use their hands to use the app, move around in event environments, and interact with objects. Motion controllers will continue to be supported, and users can switch between using controllers or their hands while using the app. A tutorial on how to use hand interactions can be found in Menu -&gt; Help -&gt; Hand tutorial in the Quest Mesh app. The tutorial will also play when hand usage is detected for the first time during a meeting or event session in the Mesh app. To use the feature in Mesh, hand tracking on Quest device needs to be turned on via Settings -&gt; Movement settings.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=412360\" target=\"_blank\">412360</a>\n</p><p><b>When this will happen:</b><br></p><p>General Availability (Worldwide): We will begin rolling out early November 2024 and expect to complete by late November 2024.<br></p><p><b>How this will affect your organization:</b>\n</p><p>Microsoft Mesh app users on Quest VR headsets can choose to use their hands instead of controllers, and their experience can feel more natural and expressive.&nbsp;&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Organizers of Mesh events can update directions for events to include info that users on Quest can choose to use their hands instead of controllers.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412360"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Mesh app on Meta Quest headsets will support hand interactions, allowing users to navigate and interact within the app using their hands. A tutorial is available, and hand tracking must be enabled. This feature will roll out in November 2024, and event organizers should update their instructions accordingly. The update is associated with Microsoft 365 Roadmap ID 412360."
    },
    {
      "Name": "Platforms",
      "Value": "Android"
    }
  ],
  "EndDateTime": "2024-12-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC907538",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-09T23:17:11.623Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-09T23:17:02Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Mesh app on Meta Quest headsets supports hand interactions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
