{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 5, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Human Resources and IT departments need a way to track user telemetry and usage to ensure that Microsoft Viva Pulse is being used effectively and has a strong return on investment. They also want to identify any issues related to user adoption that hinder the rollout of Pulse in an organization. With the rollout of the tenant admin dashboard, Pulse admins will be able to visualize usage metrics in their tenant. This rollout will include metrics such as total pulses sent, response rate per pulse, and responses per pulse.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early November 2024 (previously late October) and expect to complete by mid-November 2024 (previously early November).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, the Pulse tenant admin dashboard does not exist, and Pulse admins are not able to visualize and measure their Pulse usage and return on investment.\n</p><p>After this rollout, the tenant admin dashboard's initial release will include these metrics:\n</p><ol><li>Total pulses sent: The number of pulses sent in a specified time period\n</li><li>Response Rate: Response rate per pulse, averaged across all pulses sent in a specified time period\n</li><li>Responses per pulse: Average responses per pulse in a specified time period\n</li></ol><p>The tenant admin dashboard will be on by default.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/cd0d91d2-33dc-4f78-88db-49d8329f52d7\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>As a Pulse admin, to open the tenant admin dashboard, go to Viva Pulse on the app or on the web, and from the homepage select <i>Usage Dashboard</i>. The dashboard will help HR and IT their Pulse understand their usage and present ways to increase adoption and engagement.\n</p><p>As a Pulse admin, you can manage the new dashboard in the Viva Pulse admin center <i>&gt; Manage &gt;</i> <i>Usage dashboard</i> tab. Learn more:\n</p><ul><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/set-up-in-app-pulse-experience\" target=\"_blank\">Set up the in-app Viva Pulse experience | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/tenant-admin-dashboard\" target=\"_blank\">View usage metrics with the tenant admin dashboard | Microsoft Learn</a>\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse introduces a new tenant admin dashboard for Pulse admins, providing usage metrics to track effectiveness and ROI. The rollout, now scheduled for early to mid-November 2024, will feature metrics like total pulses sent and response rates. The dashboard will be enabled by default. Admins should review configurations and update documentation."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC907535",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-05T23:33:35.753Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-09T23:15:14Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse: New Pulse tenant admin dashboard for users with Pulse admin access",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
