{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Viva Insights leader experiences will stop supporting the Business Leader role in January 2025.\n</p><p>Removing support for the Business Leader role within Viva Insights allows for clearer deployment of roles and admin management of roles. Manager, Analyst, and Delegate roles will remain in their current state.\n</p><p>Learn more about <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/user-roles\" target=\"_blank\">roles in Viva Insights</a>.\n</p><p><b>When this will happen:</b>\n</p><p>The Viva Insights Business Leader role removal will occur throughout January 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Those with current Viva Insights Business Leader roles can still access leader experiences if someone with a Manager role assigns them as a delegate to enable access to their organizational insights. Learn more about how to <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/delegate-access\" target=\"_blank\">delegate access to organizational insights and Copilot Dashboard</a>.\n</p><p>Once the Viva Insights Business Leader role is removed, the user’s ability to see the entire company, referred to interchangeably as the “your company” or “myorg” view, will no longer be supported. Should a user need \"whole company\" view access, the top leader in your organization can assign that user delegate access to see the entire company.</p><p><b>What you need to do to prepare:</b>\n</p><p>For those with Viva Insights Business Leader roles within the organization, ensure that someone with a Manager role assigns them as a delegate if they wish to maintain access.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In January 2025, Microsoft Viva Insights will discontinue the Business Leader role, maintaining Manager, Analyst, and Delegate roles. Affected users can retain access through delegation by a Manager. The \"whole company\" view will also be removed, but can be accessed via top leader delegation. Preparation involves assigning affected users as delegates."
    }
  ],
  "EndDateTime": "2025-10-23T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC903633",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-02T23:44:01.42Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-02T23:43:43Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Viva Insights: Business Leader role removal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
