{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: New pages in the Microsoft admin center for Microsoft Search analytics:\n</p><ul><li>A new <i>Query analytics</i> page will display how queries are distributed, how frequently users interact with various kinds of entities in search outcomes, and the 10 most common search terms that need intervention.\n</li><li>A new <i>Connection analytics</i> page will track metrics such as overall unique users and weekly returning users for all Microsoft Graph connections and provide detailed insights into connection-specific usage. The metrics also will show the top search keywords for each specific connector.</li></ul><p>\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early October 2024 and expect to complete by mid-October 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Admins have access to limited metrics for queries and connectors in Search.\n</p><p>After this rollout, admins can learn how to access the new pages and more at:\n</p><ul><li>Query analytics: <a href=\"https://learn.microsoft.com/microsoftsearch/queries-usage-reports\" target=\"_blank\">Microsoft Search Usage Report – Queries | Microsoft Learn</a>\n</li><li>Connection analytics: <a href=\"https://learn.microsoft.com/microsoftsearch/connection-analytics-reports\" target=\"_blank\">Microsoft Search Usage Report – Connection analytics | Microsoft Learn</a>\n</li></ul><p>This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft 365 admin center will introduce new Microsoft Search analytics pages for query distribution, user interactions, and Microsoft Graph connections. The rollout begins early October 2024 and completes by mid-October 2024, with no admin action required beforehand. Admins can access detailed information and prepare by reviewing current configurations."
    }
  ],
  "EndDateTime": "2024-12-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC906492",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-07T23:01:34.46Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-07T23:01:16Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center: New Microsoft Search analytics for queries and Microsoft Graph connections",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
