{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring the Revoke-SPOUserSession PowerShell cmdlet for Microsoft SharePoint Online (SPO),  as part of our ongoing efforts to enhance security and streamline scope and permissions for our users. Instead, please use the Revoke-MgUserSignInSession, where we will continue to invest resources.</p><p>\n</p><p><b>When this will happen:</b></p><p>We will begin rolling this out in early November 2024 and expect to complete by mid-November 2024.</p><p><b>How this will affect your organization:</b><br></p><p>\n</p><p>Our telemetry indicates that only a few organizations are active users of the Revoke-SPOUserSession cmdlet for their user management needs. If your organization is currently using this cmdlet, transition to utilizing ‘Revoke-MgUserSignInSession’.&nbsp;</p><p>After the retirement, requests using the Revoke SPOUserSession cmdlet will be blocked with an error message similar to:&nbsp;<br></p><p>“This cmdlet has been deprecated and replaced by Microsoft graph cmdlet ‘Revoke-MgUserSignInSession’ as described in: <a href=\"https://learn.microsoft.com/en-us/powershell/module/microsoft.graph.users.actions/revoke-mgusersigninsession?view=graph-powershell-1.0\" target=\"_blank\">Revoke-MgUserSignInSession</a></p><p><b>What you need to do to prepare:</b> \n</p><p>\n</p><p>Please immediately begin transitioning from using the Revoke-SPOUserSession cmdlet. To avoid unexpected impact, also ensure none of your workflows are calling this cmdlet. Instead, please use the Revoke-MgUserSignInSession, &lt;<a href=\"https://learn.microsoft.com/powershell/module/microsoft.graph.users.actions/revoke-mgusersigninsession?view=graph-powershell-1.0\" target=\"_blank\">Revoke-MgUserSignInSession</a>&gt;&nbsp;where we will continue to invest resources.<br></p><p>Additional Information:</p><p><a href=\"https://learn.microsoft.com/entra/identity/users/users-revoke-access\" target=\"_blank\">Revoke user access in Microsoft Entra ID</a></p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Revoke-SPOUserSession cmdlet for SharePoint Online is retiring in November 2024. Users should transition to using Revoke-MgUserSignInSession. The rollout starts early November and finishes by mid-November. After retirement, attempts to use the old cmdlet will result in an error directing to the new cmdlet."
    }
  ],
  "EndDateTime": "2024-12-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC903785",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-03T05:26:09.563Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-03T05:25:50Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft SharePoint: “Revoke SPOUserSession” retires starting November, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
