{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The cloud.microsoft domain was <a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-blog/introducing-cloud-microsoft-a-unified-domain-for-microsoft-365/ba-p/3804961\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">provisioned in early 2023</a> to provide a unified, trusted, and dedicated DNS domain space to host Microsoft’s first-party authenticated SaaS products and experiences. This post is to inform admins that the following Microsoft products and scenarios are now available at the cloud.microsoft domain, in parallel with the previous domains.<br></p><ul><li>Microsoft 365 Copilot Business Chat (<a href=\"https://m365.cloud.microsoft/chat\" target=\"_blank\">https://m365.cloud.microsoft/chat</a>)\n</li><li>Microsoft OneNote (<a href=\"https://onenote.cloud.microsoft/\" target=\"_blank\">https://onenote.cloud.microsoft/</a>)\n</li></ul><p>A full list of product experiences already being delivered on this domain can be found here: <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/cloud-microsoft-domain?view=o365-worldwide\" target=\"_blank\">Unified cloud.microsoft domain for Microsoft 365 apps - Microsoft 365 Enterprise | Microsoft Learn</a>.</p><p><b>When this will happen:</b></p><p>The services above are already available on cloud.microsoft, in parallel to their previous domains. You can expect the previous domains to be redirected to cloud.microsoft in the coming months.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><ul><li>The cloud.microsoft domain has been a part of standard <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/urls-and-ip-address-ranges\" target=\"_blank\">Microsoft network guidance on domains and service endpoints</a> since April 2023. If you are currently following this guidance, <i>this change should not impact users in your organization using the above applications under the new domain.\n</i></li><li>Users will be redirected to applications under cloud.microsoft domains gradually and automatically. No specific user action is required. Links to the previous domains are backwards compatible and continue to be supported. Users may notice that the new application domains are lacking the “.com” extension.  This is by design, as “.microsoft” is Microsoft’s own top-level domain – and this exclusivity allows for additional security and protection against spoofing.</li></ul><p><b>What you need to do to prepare:</b><br></p><ul><li>Educate users to recognize and expect cloud.microsoft as a key domain for Microsoft cloud experiences. You can refer them to <a href=\"https://support.microsoft.com/en-us/office/what-is-cloud-microsoft-7ba4c8b9-d062-4444-84a5-fca6c3006d2b\" target=\"_blank\">What is cloud.microsoft? - Microsoft Support</a> for more information.\n</li><li>If your organizational websites, tools, or other materials reference the old URL, those links will be automatically redirected. However, it would be good practice to update those assets to avoid user confusion.\n</li><li>Partner with developers of in-house Teams apps - including those that run on Outlook and Microsoft 365 - to take the actions described in <a href=\"https://devblogs.microsoft.com/microsoft365dev/action-required-ensure-your-microsoft-teams-apps-are-ready-for-upcoming-domain-changes/\" target=\"_blank\">Action required: ensure your Microsoft Teams apps are ready for upcoming domain changes</a> so the apps continue to function on the new domain. \n</li><li>Admins should ensure that connections to *.cloud.microsoft are not blocked from their clients and enterprise networks. This should require no action if standard <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/urls-and-ip-address-ranges\" target=\"_blank\">Microsoft network guidance on domains and service endpoints</a> is being followed.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details the transition of Microsoft products to the cloud.microsoft domain by September 2024, with some services already available. It advises admins to educate users, update organizational materials, ensure in-house apps are compatible, and verify network connections to *.cloud.microsoft are unblocked."
    }
  ],
  "EndDateTime": "2025-09-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC901821",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-09-30T23:47:26.933Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-30T23:47:15Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Product transitions to the cloud.microsoft domain – September 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
