{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to on-demand indexes used to support SharePoint and OneDrive Search using Application Permissions.  On/Starting November 1, 2024, if an on-demand index has not been queried in 100 days, the index will be decommissioned.<br></p><p>App-only permissioned requests (<a href=\"https://learn.microsoft.com/graph/search-concept-searchall?view=graph-rest-1.0\" target=\"_blank\">Search content with application permissions - Microsoft Graph | Microsoft Learn</a>) may be created by custom applications using public Search APIs such as Microsoft Search Graph API or SharePoint Search REST API.  This change will NOT affect normal user or delegated permissioned Search traffic from Enterprise Search endpoints (e.g., SharePoint, Teams, Outlook, Office.com, Bing@work, etc.), search-based web parts, or custom apps using the signed-in user’s permissions.</p><p><b>When this will happen:</b></p><p>Beginning November 1, 2024</p><p><b>How this will affect your organization:</b>\n</p><p>Searching using Application Permissions is a latency expensive option. To make the process more efficient, when you run the initial search request and request private content, an on-demand index is provisioned to serve “private” results.  The time required to build the index depends on the number of items in your users’ OneDrive and SharePoint.  For a medium-to-large tenant, this may take days to a week to complete.  Very large tenants will take longer.  While the index is provisioning, search requests will only return shared and public content.  Once the new index is complete, private and shared content will be returned.  If no additional search requests for private content are sent within 100 days, the private index will be decommissioned.  If needed again, a subsequent search request for private content will rebuild the index.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>If you have applications which run infrequently (e.g. every four months) and use Search with Application Permissions, plan for time to allow the on-demand index to rebuild. \n</p><p>Please click Additional Information to learn more.\n</p><p><a href=\"https://learn.microsoft.com/graph/search-concept-searchall?view=graph-rest-1.0\" target=\"_blank\">Search content with application permissions - Microsoft Graph | Microsoft Learn</a>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting November 1, 2024, on-demand indexes for SharePoint and OneDrive Search using Application Permissions will be decommissioned if not queried in 100 days. This change does not affect normal user or delegated permissioned Search traffic. Organizations should plan for potential index rebuild time for infrequent application searches."
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC903620",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-02T23:36:07.637Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-02T23:35:53Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "On-demand Index Life Cycle Change for SharePoint and OneDrive Search and Application Permission Based Requests",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
