{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams. The New Calendar app aims to provide a single, modern, intelligent, and coherent calendar for both Microsoft Teams and Microsoft Outlook users. This new opt-in experience will be available in Teams, allowing users to toggle to the New Calendar interface. This message applies to Teams on Windows and Mac desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415415\" target=\"_blank\">415415</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-November 2024 and expect to complete by late November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 and complete by the late January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>To try the New Calendar, go to Calendar app in Teams and select the <i>New calendar</i> toggle in the top right of the Calendar.\n</p><p>With the New Calendar, you can experience:\n</p><ul><li>Advanced calendar surface features: A new command bar has been introduced in Teams, which adapts to the user experience by right-aligning primary actions and tucking in all the functionalities. Users can now experience new capability to <i>Meet Now</i> and <i>Join with ID and </i>new features such as filters, month view, split view, customizable time scales, saved views, sharing options, printing capabilities, and personalized calendar settings.\n</li><li>Enhanced meeting creation: Create meetings quickly from the calendar's quick view or the new scheduling form, with improved options and a refreshed look.\n</li><li>Peak view experience: Access meeting artifacts directly from the calendar, including a recap of completed meetings.\n</li><li>Weather integration: View weather information for your current location in the calendar.\n</li><li>Work plan integration: Specify work locations and check for teammates' availability in the office with the integration of Microsoft Places.\n</li><li>Place Finder: Use Place Finder to switch between floors and view different room capabilities when creating new events.\n</li><li>Pop-out experience: Right-click the <i>Calendar</i> icon to pop out the calendar for more efficient multitasking.\n</li></ul><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "415415"
    },
    {
      "Name": "Summary",
      "Value": "The New Calendar app, integrating Microsoft Teams and Outlook, will start rolling out in mid-November 2024 for Targeted Release and in mid-January 2025 for General Availability. Users can opt-in to try advanced features for scheduling, meeting creation, and multitasking with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC908116",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-10T22:49:47.89Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-10T22:49:34Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: New calendar experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
