{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout: Microsoft Defender for Office 365 | <a href=\"https://learn.microsoft.com/defender-xdr/microsoft-secure-score\" target=\"_blank\">Microsoft Secure Score</a>&nbsp;triggers the recommendation <i>Ensure Spam confidence level (SCL) is configured in mail transport rules with specific domains</i> in organizations with transport rules that use condition on sender domains even when not explicitly using SetSCL. The intent of the recommendation is to only flag rules that bypass spam filtering by setting SCL to -1.</p><p>After this rollout, this recommendation will only appear if the organization has transport rule specifically set SCL to -1. The recommendation will not appear when using rules that do not set SCL (where SCL is null).\n</p><p></p><b>When this will happen:</b>\n<p></p><p>General Availability (Worldwide, GCC): We will begin rolling out early November 2024 and expect to complete by early December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, the Secure Score for your organization should be automatically fixed. For some organizations, the rollout may result in a slight increase in the Secure Score because the recommendation might not be generated.\n</p><p>Click path: Go to Defender &gt; <i>Exposure management &gt; Secure Score &gt; Recommended actions &gt; Ensure Spam confidence level (SCL) is configured in mail transport rules with specific domains</i>\n</p><p>This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Secure Score recommendation for Spam confidence level (SCL) in Microsoft Defender for Office 365 will be updated. Post-update, the recommendation will only trigger if a transport rule explicitly sets SCL to -1. The rollout will start in early November 2024 and complete by early December 2024, potentially increasing the Secure Score for some organizations. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC906488",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-07T22:52:31.153Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-07T22:52:15Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Microsoft Secure Score recommendation update for Spam confidence level",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
