{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 17, 2024: We have updated the content. Thank you for your patience.</p><p>We're making an update to the behavior of email notification in Project for the web. When a project or roadmap is shared with a Microsoft 365 group, only if the group has 50 or less members will an email notification be sent to each member of the group notifying them a plan or roadmap has been shared with them.<br></p><p>If the group has more than 50 members then group members will not receive an email notification when a project or roadmap is shared with the group.&nbsp;</p><p>Individual notification settings will continue to be respected when these emails are sent.</p><p><b>When this will happen:</b></p><p>General Availability: We will begin rolling out mid-November 2024 and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>For users of Project for the web if a project or roadmap is shared with a group has 50 or less members in it, an email notification is sent to each member informing them the project or roadmap was shared with them. For groups with more than 50 members, an email is not sent when a project or roadmap is shared with the group.</p><p><b>What you need to do to prepare:</b>\n</p><p>Update any business documentation or processes which will be impacted by this change.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Project for the Web is updating email notifications. Groups with 50 or fewer members will receive individual emails when a project or roadmap is shared. Groups with over 50 members will not receive these emails. Rollout starts mid-November 2024, with completion by late November 2024. Organizations should update relevant documentation and processes."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC908110",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-17T23:28:27.003Z",
  "Services": [
    "Project for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-10T22:47:21Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Project for the Web Email Notification Update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
