{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire the <a href=\"https://support.microsoft.com/office/research-a-paper-in-word-4e3628f2-00bc-4896-b314-2813e6cf8dde\" target=\"_blank\">Researcher</a> feature in Microsoft Word starting January 2025. After Researcher retires, Researcher will not appear on the ribbon in Word and Researcher will no longer be supported. This message applies to Word for Windows desktops and Word for Mac desktops. Researcher was never available in the other Word platforms (Word for the web or Word for Android/iOS).\n</p><p>Microsoft is committed to improving your Microsoft 365 subscription. As a result, we occasionally remove features and benefits that duplicate equivalent offerings that are available to subscribers. Microsoft Copilot is a good alternative to Researcher.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late December 2024 and expect to complete by early January 2025.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Researcher feature in Microsoft Word will be retired starting late December 2024, with full retirement by January 2025. This affects Word for Windows and Mac desktops. Microsoft suggests using Copilot as an alternative. Users should be informed and documentation updated accordingly."
    }
  ],
  "EndDateTime": "2025-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC901824",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-09-30T23:49:20.003Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-09-30T23:48:41Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Microsoft Word: Researcher feature will retire starting late December 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
