{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 8, 2024: We have updated the rollout timeline below. Thank you for your patience.\n</p><p><br></p><p>Coming soon to Microsoft Exchange Online: A significant rollout that introduces two new subfields under <code>AppAccessContext</code> for improved field consistency and enhanced telemetry in other Exchange APIs:  \n</p><ul><li><code>ClientAppId</code>\n</li><li><code>APIId</code>\n</li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early November 2024 (previously late October) and expect to complete by mid-November 2024.\n</p><p>General Availability (GCC, GCC High): We will begin rolling out late November 2024 and expect to complete by late November 2024.<br></p><p>General Availability (DoD): We will begin rolling out early December 2024 and expect to complete by early December 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>Before this rollout: The <code>ClientAppId</code> and <code>AppAccessContext</code> fields exist across previous schemas outside of the Microsoft Exchange Web Service (EWS) schema.\n</p><p>After this rollout: The <code>AppAccessContext</code> field, which serves a similar purpose to the <code>ClientAppId</code> field, will be in EWS schema with two new subfields: <code>ClientAppId</code> and <code>APIId</code>. This update is on by default. The <code>ClientAppId</code> field and the <code>ClientAppId</code> subfield under the <code>AppAccessContext</code> field will both be populated more consistently and robustly with a new fallback.\n</p><p><i>Field definitions\n</i></p><ul><li><code>AppAccessContext</code>: Used to provide additional information about the application context in which an event or action occurs. This field helps in tracking and auditing purposes by identifying the specific application or service involved in each operation.\n<ul><li><code>ClientAppId</code>: The original field used to identify the application that initiated a particular action or event. After this rollout, this subfield will have a new fallback to enhance capabilities.\n</li><li><code>APIId</code>: Used to uniquely identify an API endpoint or service. This subfield is particularly useful in scenarios where admins need to filter or track activities specific to certain APIs, such as the Microsoft Exchange Web Service (EWS).\n</li></ul></li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>After the rollout, we recommend admins review and update your workflows to accommodate both the <code>ClientAppId</code>and <code>AppAccessContext</code> fields. This will ensure that your operations continue seamlessly and leverage the new features effectively.\n</p><p><i>Accessing and using the new fields\n</i></p><ol><li><i>Navigate to the admin center:</i> Start by logging into the Microsoft 365 admin center.\n</li><li><i>Access the audit logs:</i> Go to the section where audit logs are managed. This is typically found under the <i>Security &amp; Compliance</i> section or the <i>Microsoft Purview</i> section.\n</li><li><i>Search for relevant logs:</i> Use the search to filter logs that include the <code>AppAccessContext</code> and <code>ClientAppId</code> fields. You may need to specify the event types or actions that involve these fields.\n</li><li><i>View and analyze logs:</i> After the logs are filtered, you can view the details, which will include the <code>AppAccessContext</code> and <code>ClientAppId</code> fields. These fields provide additional information about the application context and the client application involved in each operation.\n</li></ol><p><i>Learn more</i>\n</p><ul><li>The <a href=\"https://learn.microsoft.com/office/office-365-management-api/office-365-management-activity-api-schema#exchange-mailbox-schema\" target=\"_blank\">Engage Mailbox schema</a> section in <a href=\"https://learn.microsoft.com/office/office-365-management-api/office-365-management-activity-api-schema\" target=\"_blank\">Office 365 Management Activity API schema | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/exchange/policy-and-compliance/mailbox-audit-logging/mailbox-audit-logging?view=exchserver-2019\" target=\"_blank\">Mailbox audit logging in Exchange Server | Microsoft Learn</a>\n</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange Online is rolling out new subfields 'ClientAppId' and 'APIId' under 'AppAccessContext' for better telemetry in Exchange APIs. Rollout begins early November 2024, with automatic updates and no required admin action. Post-rollout, admins should update workflows to accommodate these fields."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC909164",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-11-08T23:27:39.427Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-11T22:54:19Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online: New fields for Exchange mailbox schema",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
