{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 8, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Administrators can now use the <a href=\"https://learn.microsoft.com/powershell/sharepoint/sharepoint-online/introduction-sharepoint-online-management-shell\" target=\"_blank\">Microsoft SharePoint Online Management Shell</a> to disable the user presence feature in the Microsoft OneDrive and SharePoint file viewer on a per-site collection basis.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=419814\" target=\"_blank\">419814</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late October 2024 and expect to complete by mid-January (previously December).</p><p><b>How this will affect your organization:</b><br></p><p>Before this rollout: When previewing a file in the OneDrive and SharePoint file viewer, users can see the presence of other users who have the file open. This behavior will not change by default.\n</p><p>After this rollout, if desired, SharePoint admins can use the SharePoint Online Management Shell to disable the presence feature for a given site collection. This can be done by updating to the latest version of the SharePoint Online Management Shell and running <code>Set-SPOSite -HidePeoplePreviewingFiles $true</code> along with a list of valid site identifiers. Learn more: <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-sposite?view=sharepoint-ps\" target=\"_blank\">Set-SPOSite (Microsoft.Online.SharePoint.PowerShell) | Microsoft Learn</a>.\n</p><p>By default, this feature is available for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation if you choose to enable this feature.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft has updated the rollout timeline for disabling user presence in OneDrive and SharePoint file viewers, now completing by mid-January 2025. Admins can use the SharePoint Online Management Shell to disable this feature per site collection. The feature is optional and requires no action before rollout."
    }
  ],
  "EndDateTime": "2025-02-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC906496",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-08T23:47:24.703Z",
  "Services": [
    "SharePoint Online",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-07T23:01:51Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive and Microsoft SharePoint: New setting to disable presence in the file viewer",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
