{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of our ongoing commitment to providing a more integrated and seamless experience for our customers, we are pleased to announce a new URL for the Microsoft Exchange admin center (EAC): <a href=\"https://admin.cloud.microsoft/exchange\" target=\"_blank\">https://admin.cloud.microsoft/exchange</a>. The existing URL (<a href=\"https://admin.exchange.microsoft.com\" target=\"_blank\">https://admin.exchange.microsoft.com</a>) will remain active, allowing you to use either URL for accessing the EAC.\n</p><p>Starting late October 2024, all requests to the old URL will be redirected to the new URL. We expect to complete full redirection by late December 2024, and the old URL will remain active. In the future, we will communicate the timeline to retire the old URL.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): The new URL is available now. We will begin rolling out the redirection from the old URL to the new one in late October 2024 and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The EAC will continue to be accessible with both URLs. During and after the migration to the new URL, you may notice the new URL in your browser's address bar, even if you initially accessed the old URL.\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We expect no major impact to how customers use the EAC. If your organization requires URLs to be whitelisted for network access, please ensure the new URL is whitelisted. Also, to ensure a smooth transition, we recommend updating bookmarks, scripts, and documentation to the new URL.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Exchange admin center (EAC) has a new URL available now, with redirection from the old URL starting late October 2024 and completing by late December 2024. Both URLs will work until further notice. Organizations should whitelist the new URL and update bookmarks and documentation. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC907101",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-08T23:01:50.77Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-08T23:01:36Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange admin center: New URL",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
