{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Graph connectors enable you to index enterprise content in third-party systems for knowledge extension in Microsoft 365 Copilot. Microsoft offers a wide range of free connectors for products like ServiceNow, Jira, Confluence, Salesforce, File shares etc. \n</p><p>We are announcing early preview (space limited) of new connectors for the following systems – \n</p><ul><li>GitHub (repositories)\n</li><li><a href=\"https://learn.microsoft.com/microsoftsearch/google-drive-connector\" target=\"_blank\">Google Drive</a> (files)\n</li><li>Jira Data Center (issues)\n</li><li><a href=\"https://learn.microsoft.com/microsoftsearch/postgresql-connector\" target=\"_blank\">PostgreSQL</a> (records)\n</li><li>Salesforce (knowledge base articles)\n</li><li>Stack Overflow (QnA)\n</li><li><a href=\"https://learn.microsoft.com/microsoftsearch/wordpress-onprem-connector\" target=\"_blank\">WordPress</a> (webpages)\n</li><li><a href=\"https://learn.microsoft.com/microsoftsearch/zendesk-help-center-connector\" target=\"_blank\">Zendesk</a> (help center articles)\n</li><li>Zoom (meeting transcripts)</li></ul><p><b>When will this happen:</b></p><p>Early Preview (limited slots only): We will begin rolling out from early October 2024 and complete by mid-November 2024.\n</p><p>Targeted Release: We will begin rollout in mid-November 2024 and expect to complete by end of December 2024.</p><p><b>What you need to do to prepare:</b></p><p>If you would like to try out the preview of new connectors, sign-up for preview. The form to sign up is available in our documentation page (hyperlinks available in list above). Alternatively, you may drop us an email with the connectors you wish to preview at <a href=\"mailto:MicrosoftGraphConnectorsFeedback@service.microsoft.com\" target=\"_blank\">MicrosoftGraphConnectorsFeedback@service.microsoft.com</a>.</p><p>Our team will reach out to you to discuss your requirements and will share relevant documentation and next steps. Please note that slots are limited, and we may not be able to accommodate all customers during preview.</p><p>\n</p><p><b>How this will affect your organization:</b></p><p>Upon configuration of Graph connectors, your end users will be able to prompt Copilot to ask queries about the indexed content. Your end users will also be able to search for the content in any of the Microsoft Search clients like SharePoint, Bing, Microsoft 365 (Office) app etc.</p><p>To learn more about Microsoft Graph connectors, please visit our official documentation at <a href=\"https://aka.ms/graphconnectors\" target=\"_blank\">Microsoft Graph connectors overview for Microsoft Search</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot introduces an early preview of new Graph connectors, including GitHub, Google Drive, and others, with limited availability starting from October 2024. Sign-ups for the preview are open via a form or email. These connectors allow indexing of third-party content, enhancing search capabilities across Microsoft Search clients."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC906499",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-15T16:26:59.057Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-07T23:04:08Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Preview new Graph connectors for Microsoft 365 Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
