{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to new Microsoft Outlook for Windows desktops: This feature will allow people who use the Microsoft Windows Narrator screen reader tool to have emails automatically read aloud to them after pressing <i>Enter</i> to open an email.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413429\" target=\"_blank\">413429</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early November 2024 and expect to complete by late November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, people who used Windows Narrator do not have the option to open a new email in new Outlook for Windows and have the email automatically read aloud by the screen reader.\n</p><p>This option is on by default and available to Windows Narrator users.\n</p><p>To use this feature with the new Outlook:\n</p><ol><li>Turn on <i>Narrator</i> in a Windows computer with Ctrl+Windows Key+Enter</li><li>Open the new Outlook\n</li><li>Select <i>Enter</i> to open an email in the message list\n</li><li>Listen to the message body being automatically read aloud by <i>Narrator</i>.\n</li></ol><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413429"
    },
    {
      "Name": "Summary",
      "Value": "The new Outlook for Windows will soon feature auto-reading of emails with Windows Narrator, starting early November 2024. This will be on by default for Narrator users, requiring no admin action prior to rollout. Organizations should review configurations and inform users about the update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-02-21T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC908113",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-10T22:48:20.58Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-10T22:48:04Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Outlook for Windows: Auto-reading emails with Microsoft Windows Narrator",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
