{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to our billing periods for products purchased per seat. This will only impact you if you are a new customer or an existing customer whose invoices begin with “G”.</p><p>In late October 2024, we’ll be expanding the changes  rolled out to Asia  Pacific earlier this year to the rest of the world. You'll get your invoice for any new subscription purchases the day after the start date of your subscription, rather than in the following month on a set date. Subscriptions with recurring billing (monthly or annually) will have subsequent invoices the day after the subscription's anniversary date.&nbsp;</p><p>During this transition to the new billing, you may see two invoices for the same subscription in the same month. These invoices are for different charge dates as billing moves from billing in arrears to billing upfront. The charge dates can be found in the “Charge details” on the second page of your invoice.</p><p>For new subscriptions, if you purchase subscriptions on multiple days in a month (not adding to existing subscriptions), you will get multiple invoices in a month.&nbsp;</p><p>Please note: “The billing period” is found on the first page of the invoices and is the time frame where charges that appear on the invoice accrue. For new subscription purchases and renewals, each invoice represents a single day of purchases, so the billing period will be a single day. For changes to existing subscriptions, the billing period will be for the prior month.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>If your invoices start with \"G\", your organization will be impacted by this change.</p><p><b>What you need to do to prepare:</b></p><p>When this change takes effect, you may receive two invoices in the same month when the subscription renews or if the subscription was purchased after July 9th and is billed monthly.</p><p>You'll see notices through the purchase process if your purchase is switching to the new billing timing. You can check your billing timing for all your subscriptions under “Your products.” If you don’t see the “Next invoice available” column in Your products, use the column chooser to add it.&nbsp;</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Billing periods for products per seat are changing. New customers or those with invoices starting with \"G\" will be affected. Invoices will now be issued the day after the subscription start date or anniversary. Transition may cause two invoices in one month. Preparation involves checking billing timing under \"Your products.\""
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC907107",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-08T23:04:14.833Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-08T23:03:47Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "We're making some changes to our billing periods for products purchased per seat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
