{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Teams is making updates to its macOS keyboard shortcuts to follow macOS HIG policy.<br></p><p>&nbsp;<b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late October 2024 and expect to complete by the beginning of November 2024.</p><p>General Availability (Worldwide): We will begin rolling out at the beginning of November 2024 and expect to complete by mid-November 2024.</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out mid-November 2024 and expect to complete by mid-December 2024.</p><p><b>How this will affect your organization:</b><br></p><p>All Mac users will have many of their Teams shortcuts updated to remove the \"Options\" and \"Control\" shortcuts from the list. This allows Mac users to use keyboard shortcuts without any collusions with existing macOS shortcuts. The new shortcut lay out will be available for users after an update to the latest version of Teams (the specific version number will be provided in an update to this post).</p><p>Details on the updated layout will be available prior to the rollout in the “Keyboard shortcuts” modal window accessible from the ellipsis (...) menu next to user's avatar, or in <a href=\"https://support.microsoft.com/office/keyboard-shortcuts-for-microsoft-teams-2e8e2a70-e8d8-4a19-949b-4c36dd5292d2?redirectSourcePath=%252fen-us%252farticle%252fMicrosoft-Teams-keyboard-shortcuts-c796cc2e-249a-4ec3-9cd7-00766905aa56\" target=\"_blank\">Keyboard shortcuts for Microsoft Teams - Microsoft Support</a>&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>The update of macOS keyboard shortcuts will be automatic when users receive an update to the specific build with this functionality. No admin action is required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating macOS keyboard shortcuts to align with macOS HIG policy, with rollouts starting late October 2024 and completing by mid-December 2024. The update will remove \"Options\" and \"Control\" shortcuts to avoid conflicts with macOS shortcuts. Details will be available in Teams and on Microsoft Support. No admin action is required."
    }
  ],
  "EndDateTime": "2025-01-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC903634",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-02T23:44:52.757Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-02T23:44:38Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Update to macOS keyboard shortcuts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
