{
  "ActionRequiredByDateTime": "2024-11-03T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Microsoft Defender for Endpoint will modify the InitiatingProcessFolderPath column across all relevant Advanced Hunting tables to include the initiating process file name. This message applies to Windows activity only.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will roll out to all Microsoft Defender for Endpoint customers on November 4, 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, the InitiatingProcessFolderPath column is inconsistent across action types. Some columns include the file name, and other columns do not include the file name.\n</p><p>After the rollout, all Microsoft Defender for Endpoint action types across all tables will report the full path including the file name of the initiating process in the InitiatingProcessFolderPath column.\n</p><p>Consider the following example to be the new normal, InitiatingProcessFolderPath == c:\\temp\\<b>file.exe</b></p><p>An example of a possible current implementation that will be retired with this change: InitiatingProcessFolderPath == c:\\temp\\\n</p><p>Custom detection rules and queries considering the InitiatingProcessFolderPath may be affected.\n</p><p>If you know your custom detection rules or Advanced Hunting queries include this column, please modify them to consider the new convention:</p><ul><li>To modify your custom detection rules, go to the Defender portal &gt;<i> Investigation &amp; response &gt; Hunting &gt; Custom detection rules</i>\n</li><li>To modify other Advanced Hunting queries, go to the Defender portal &gt; <i>Investigation &amp; response &gt; Hunting &gt; Advanced hunting</i>\n</li></ul><p>To learn more, go to the <i>Shema reference</i> button in the top right of the <i>Advanced hunting</i> page.\n</p><p> This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Before November 4, 2024, map your affected custom detection rules and KQL functions and prepare a fix. Where possible, we recommend updating your queries before the release.</p><p>This rollout will happen automatically by the specified date. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Endpoint will update the InitiatingProcessFolderPath to include file names in all tables, affecting Windows activity. This change will be globally available on November 4, 2024, requiring updates to custom detection rules and queries."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC906487",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-07T22:51:50.613Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-07T22:51:32Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender XDR: InitiatingProcessFolderPath changes to include file names",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
