{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: The Project Studio environment will be a beautiful new environment for immersive meetings in Teams and for Microsoft Mesh events, designed for synchronous teamwork and productivity, and optimized for small group collaboration. This message applies to Mesh events on Windows desktops, Mac desktops (for TAP users), and on Meta Quest headsets.\n</p><p>This message is associated with Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412076\" target=\"_blank\">412076</a>\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early November 2024 and expect to complete by mid-November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, event organizers will have one new environment (Project Studio) to use in Mesh events. Event organizers will be able to create events using the Project Studio environment via the Mesh Portal. These changes are on by default.</p><p>Users can access the Project Studio environment in the Mesh Portal on the web at <i>Events &gt; Create event &gt; Start from scratch:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/31732f93-6495-498b-8146-b2b36ba4b52b\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Project Studio will appear next to <i>Workshop, Oasis, </i>and<i> Meadow</i> in <i>Start from scratch</i> during event creation:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/81495fbd-ef7d-401b-8679-6dc8a4220a2f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>In the Mesh standalone app, the Project Studio environment will look like this during an event:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c939f0f6-d00c-4b00-b11b-374380312187\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This is a view of the entire Project Studio environment:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b93f3909-4dc4-4409-b09d-373a3986056e\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><ul></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412076"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new Project Studio environment for immersive meetings and Microsoft Mesh events, optimized for small group collaboration. Rolling out starts in early November 2024, with general availability by late December 2024. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC913444",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-18T22:41:23.827Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-18T22:41:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New collaborative environment in Microsoft Mesh",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
