{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams Exploratory Trial will be available to eligible users on mobile devices&nbsp;</p><p>The Teams Exploratory trial license allows users in your organization to explore the full features of Microsoft Teams for free for up to <b>6 months</b>, if they are eligible. This update brings mobile experience at par with Desktop wherein users trying to sign up for Exploratory on mobile devices will not receive errors.&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early/mid-November 2024 and expect to complete by mid/late November 2024.&nbsp;</p><p><b>How this will affect your organization:</b></p><p>With this change, users on mobile devices can sign-up for the Microsoft Teams Exploratory trial license. Once the eligible users sign into Teams on the iOS or Android app, we will prompt them to try out Teams for free. Users will be presented with the terms and conditions. Upon accepting, they will be assigned a trial license.&nbsp;</p><p>Who’s eligible?&nbsp;</p><ul><li>Users must have a managed Microsoft Entra domain email address and belong to a tenant with a paid subscription but without an active Teams license. More information on eligibility can be found here: <a href=\"https://learn.microsoft.com/en-us/microsoftteams/teams-exploratory\" target=\"_blank\">Manage the Microsoft Teams Exploratory experience - Microsoft Teams</a></li></ul><p>What features are included?&nbsp;</p><ul><li>The trial includes access to Teams chat and channels for 1:1 and group conversations, video calls/meetings with people in your org and any external partners or customers, file storage (OneDrive for Business by default), Power Automate, Microsoft Viva Insights, Microsoft Forms, Planner, Stream, SharePoint Online, and more.&nbsp;</li></ul><p>What happens when a user’s trial license expires?&nbsp;</p><ul><li>Users will have a 30-day grace period after the trial end date to still access Teams. After that, their access to Teams will be revoked and users will not be able to sign in or access chats. You can find more information here on how to upgrade users: <a href=\"https://learn.microsoft.com/en-us/microsoftteams/upgrade-from-teams-exploratory\" target=\"_blank\">Upgrade from the Teams Exploratory trial - Microsoft Teams | Microsoft Learn&nbsp;</a></li></ul><p><b>What you need to do to prepare:</b>&nbsp;</p><p>If your organization has already taken steps to disable self-service trials those setting will be honored.</p><p>How can you disable Exploratory self-service trial for your organization?&nbsp;</p><ul><li>You can enable or disable Exploratory from self-service purchases and trials for users in your organization. The MSCommerce PowerShell module includes a PolicyID parameter value for AllowSelfServicePurchase that lets you control whether users in your organization can make purchases or start trials for Exploratory (ProductId: CFQ7TTC0J1FV). More information can be found here:<a href=\"https://learn.microsoft.com/en-us/microsoft-365/commerce/subscriptions/manage-self-service-purchases-admins?view=o365-worldwide\" target=\"_blank\"> Manage self-service purchases and trials (for admins)</a> | <a href=\"https://learn.microsoft.com/en-us/microsoft-365/commerce/subscriptions/allowselfservicepurchase-powershell?view=o365-worldwide\" target=\"_blank\">Microsoft Learn; Use AllowSelfServicePurchase for the MSCommerce PowerShell module | Microsoft Learn</a>&nbsp;</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Eligible users can sign up for the Teams Exploratory trial on mobile, allowing full Teams features for free for up to 6 months. Rollout begins early/mid-November 2024. Users need a managed domain email and no active Teams license. Post-trial, a 30-day grace period is provided before access is revoked."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC915487",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-21T23:23:01.877Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-21T23:22:27Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Eligible users can now signup for Teams Exploratory on MOBILE",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
