{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to the Microsoft Purview AI Hub: We will update the left navigation to include sections for <i>Overview, Recommendations, Reports, Policies, </i>and <i>Activity Explorer.</i>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415451\" target=\"_blank\">415451</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-October 2024 and expect to complete by mid-October 2024. \n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by mid-November 2024. \n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Microsoft Purview includes <i>Analytics, Policies, </i>and <i>Activity Explorer </i>pages.\n</p><p>After this rollout, Microsoft Purview AI Hub will include:</p><ul><li>The new <i>Overview </i>page will include getting started steps, recommendation cards to help improve your AI data security, analytics cards, and links to documentation.</li><li>The new <i>Recommendations </i>page will include the list of recommendations provided by Microsoft and their completion status.</li><li>The<i> </i>new <i>Reports </i>page (formerly <i>Analytics</i>) will include analytics charts grouped by activity, user, and data.</li><li>The<i> </i>updated <i>Policies </i>page will include a list of policies created by AI Hub with a link to edit the policies within their respective solutions.\n</li><li>The<i> </i>updated <i>Activity Explorer</i> page will include events generated by the policies created through Microsoft Purview AI Hub.\n</li></ul><p>This change will be on by default.\n</p><p>New <i>Overview </i>page\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2a523fd8-19e1-49b0-984b-4832fafeafb7\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>New <i>Recommendations </i>page:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/8df50850-d38e-43e8-b8b8-7a309b1149db\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>New <i>Reports </i>page:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/92524e21-d8f2-463a-a207-a39d5903fd9f\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Get ready for this change by reviewing the Microsoft Purview AI Hub documentation:</p><ul><li><a href=\"https://go.microsoft.com/fwlink/?linkid=2249294\" target=\"_blank\">Microsoft Purview AI Hub provides insights, policies, and controls for AI apps</a>\n</li><li><a href=\"https://go.microsoft.com/fwlink/?linkid=2284905\" target=\"_blank\">Considerations for Microsoft Purview AI Hub and data security and compliance protections for Microsoft Copilot</a>\n</li><li><a href=\"https://go.microsoft.com/fwlink/?linkid=2276967\" target=\"_blank\">Permissions for Microsoft Purview AI Hub</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "415451"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Purview AI Hub will soon be updated with new sections for Overview, Recommendations, Reports, and Policies, as well as an improved Activity Explorer. These changes will start rolling out in mid-October 2024 and are associated with Microsoft 365 Roadmap ID 415451. The update will be on by default with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC910998",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-14T23:05:13.097Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-14T23:04:21Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview AI Hub: Enhancements to Overview, Recommendations, Reports, and Policies pages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
