{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With this feature, sensitive data in files that are stored in network shares and mapped network drives will be protected by Data Loss Prevention (DLP) policies across Mac endpoints.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=410397\" target=\"_blank\">410397</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early February 2025 and expect to complete by mid-February 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out early March 2025 and expect to complete by mid-March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, you can configure DLP policies to prevent your users from taking egress actions such as copy to USB, copy to clipboard, and more for sensitive files stored on network shares. This brings protection for sensitive content on files in network shares with the same protection behavior as a file on mounted hard drive. You will also an alert once any policy is matched against such actions. You can also configure exclusions for certain network shares if you desire.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Get started with Data Loss Prevention in the <a href=\"https://purview.microsoft.com/\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/compliance/dlp-configure-endpoint-settings?view=o365-worldwide#network-share-coverage-and-exclusions-preview\" target=\"_blank\">Configure endpoint DLP settings | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410397"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is introducing a Data Loss Prevention feature for Mac endpoints, protecting sensitive data on network shares and mapped drives. Public Preview starts early February 2025, with General Availability in early March 2025. Organizations can configure DLP policies and exclusions via Microsoft Purview."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC911624",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-15T23:43:53.45Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-15T23:43:13Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: ​Network share coverage and exclusion support on Mac endpoints​",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
