{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 20, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The Shifts Graph APIs will transition from beta to production. This change brings enhanced stability and reliability to the APIs, ensuring a seamless experience for developers and users.<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422813\" target=\"_blank\">422813</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide and GCC): We will begin rolling out mid-February 2025 (previously mid-January) and expect to complete by late February 2025 (previously late January).</p><p><b>How this will affect your organization:</b></p><p>You may continue using the API endpoints in beta. However, we recommend migrating to the production endpoints.</p><p>To refer to a list of all production (v1.0) APIs, go to the following page and navigate to <i>Teamwork and communications</i> &gt; <i>Shift management</i>: <a href=\"https://learn.microsoft.com/graph/api/overview?view=graph-rest-1.0\" target=\"_blank\">Microsoft Graph REST API v1.0 endpoint reference - Microsoft Graph v1.0 | Microsoft Learn</a></p><p>This update is available by default.</p><p>\n</p><p><b>What you need to do to prepare:</b></p><p>To update Microsoft Graph APIs from beta to production, change your API calls from the beta endpoint to the v1.0 endpoint and thoroughly test your application to ensure compatibility. Check for any differences between the versions, and update any documentation accordingly.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422813"
    },
    {
      "Name": "Summary",
      "Value": "The Shifts Graph APIs for Microsoft Teams are moving from beta to production, enhancing stability and reliability. Rollout starts mid-February 2025 and ends late February 2025. Organizations should migrate to the production endpoints and update their API calls from beta to v1.0. This update is associated with Microsoft 365 Roadmap ID 422813."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC916866",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-28T18:47:18.923Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-23T18:20:13Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Shifts Graph APIs in beta moved to production (v1.0)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
