{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In early November 2024, we’re releasing the <i>Allow web search in Copilot</i> policy to offer more ways for you to manage web search in Microsoft 365 Copilot and Microsoft Copilot. This includes the ability to manage web search separately from other optional connected experiences (OCE) for Microsoft 365. \n</p><p>Allowing Copilot to reference web content via web search improves the quality of Copilot responses by grounding them in the latest information from the web via the Bing search service. <a href=\"https://learn.microsoft.com/copilot/privacy-and-protections#privacy-and-security-of-generated-search-queries\" target=\"_blank\">Learn more about web search queries</a>.</p><p><b>When this will happen:</b><br></p><p>General Availability: We will begin rolling out the <i>Allow web search in Copilot </i>policy in early November 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b><br></p><p>With the <i>Allow web search in Copilot</i> policy, you will be able to manage web search in Microsoft 365 Copilot and Microsoft Copilot separately from how you manage other optional connected experiences (OCE). Both the <i>Allow web search in Copilot</i> policy and the OCE policy can be managed at the user/group-level.</p><p>You will be able to manage the <i>Allow web search in Copilot </i>policy from Microsoft 365 Apps admin center at config.office.com when the policy becomes available in early November.</p><p>If the <i>Allow web search in Copilot policy </i>is not configured, web search in Microsoft 365 Copilot and Microsoft Copilot will be determined by your existing OCE policy setting. Refer to the <a href=\"https://learn.microsoft.com/microsoft-365-apps/privacy/optional-connected-experiences#how-to-determine-if-your-admin-has-given-you-the-ability-to-use-optional-connected-experiences\" target=\"_blank\">Allow the use of additional optional connected experiences in Office policy</a> to confirm your OCE policy settings. If neither the <i>Allow web search in Copilot</i> policy nor the OCE policy is configured, web search will be available in Microsoft 365 Copilot and Microsoft Copilot.&nbsp;</p><p>If the <i>Allow web search in Copilot</i> policy is configured <b>Enabled</b>, you have three settings to configure web search in Copilot separately from your desired OCE policy setting:\n</p><ul><li>Enabled web search in Microsoft 365 Copilot and Microsoft Copilot\n</li><li>Disabled web search in Microsoft 365 Copilot and Microsoft Copilot.\n</li><li>Disabled in Microsoft 365 Copilot Work mode, Enabled in Microsoft 365 Copilot Web mode/Microsoft Copilot\n</li></ul><p>Note: If web search is enabled for Work mode in Microsoft 365 Copilot, users will have the option to disable it from the plug-ins menu. The option is not available for Web mode in Microsoft 365 Copilot.\n</p><p>Both the OCE policy and the <i>Allow web search in Copilot</i> policy can be <a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy#steps-for-creating-a-policy-configuration\" target=\"_blank\">managed for groups of users</a>. If you want to separately manage groups of users, such as managing your Microsoft 365 Copilot users separately from your Microsoft Copilot users, you can create groups for each and apply the policies.</p><p><b>What you need to do to prepare:</b></p><p>Allowing Copilot to reference web content via web search improves the quality of Copilot responses by grounding them in the latest information from the web via the Bing search service. The <i>Allow web search in Copilot</i> policy is not configured by default when it becomes available in early November 2024. No action is needed if you wish to continue with your current settings--this will be the case for most customers who are already using web search in Copilot.</p><p>Once available, the <i>Allow web search in Copilot</i> policy will let you manage web search in Microsoft 365 Copilot and Microsoft Copilot separately from how you manage the OCE policy. If you had previously managed the OCE policy to enable or disable web search, consider how you want to manage the OCE policy and the <i>Allow web search in Copilot</i> policy separately to achieve your desired scenario once the new policy is available in early November.\n</p><p>Once you choose your desired setting using the <i>Allow web search in Copilot</i>&nbsp;policy, the setting will take effect in your environment within 24 – 48 hours.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "In November 2024, Microsoft will introduce the \"Allow web search in Copilot\" policy, enabling separate management of web searches in Microsoft 365 Copilot from other optional connected experiences. This policy allows for improved Copilot responses using Bing search service and can be configured at the user/group level."
    }
  ],
  "EndDateTime": "2024-12-23T22:56:00Z",
  "HasAttachments": false,
  "Id": "MC910984",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-14T22:57:06.61Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-14T22:56:39Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Manage web searches in Copilot separately from optional connected experiences with new policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
