{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Teams: When users or admins configure Microsoft Edge as the browser to open web links in Teams, then links in Teams chat will be open in Edge, and Edge launches in the profile that matches the authenticated profile. Users will benefit from a seamless browsing experience that integrates their identity and user data across Microsoft apps.&amp;\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=414521\" target=\"_blank\">414521</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late October 2024 and expect to complete by late February 2025 (previously late January).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users are asked to reauthenticate links in the browser, which slows down users.\n</p><p>By default, there are no changes.\n</p><p>By default, the feature will be on with setting <i>System default browser</i> and Teams links will open in the system's default browser. System default browser refers to the default browser specified on the user's Mac device.\n</p><p>Admins can control the settings and availability of this feature (and override user settings) by policy in the Microsoft 365 Apps admin center:\n</p><ul><li>If this policy is enabled, admins can go to <i>Choose which browser opens web links</i> and select <i>Microsoft Edge</i>.\n</li><li>If this policy is disabled or not configured, web links will open in the system default browser.\n</li></ul><p>How admins update the policy in the Microsoft 365 Apps admin center:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2ac6d507-0942-490b-b5da-3de8de8e90e8\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>After admins configure the policy to open links with Edge in Teams, this banner displays to users:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f6248d99-fd9f-4265-8bdd-a1afaf697275\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>How users update the browser settings in Teams:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/6a1bfb4c-d8f2-4c01-a409-20d29fe957db\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins and users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "414521"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon open links in Microsoft Edge on MacOS, matching the authenticated profile for a seamless experience. Rollout starts late October 2024 and completes by late February 2025. Admins can control this feature via policy. No immediate action required, but review configurations and notify users."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-04-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC910981",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-20T18:53:18.33Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-14T22:55:56Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Microsoft Edge links on MacOS will seamlessly open",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
