{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire the <i>Monitor </i>action in the <i>Safe attachments</i> policy in Microsoft Exchange Online Protection (Microsoft Defender for Office 365) starting late February 2025 and ending by late May 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>A <i>Safe attachments</i> policy provides an additional layer of protection against malicious content (attachments) in emails by analyzing attachment content and behavior in a sandbox environment. This policy provides four actions: <i>Off, Monitor, Block, </i>and <i>Dynamic delivery.</i> We made the <i>Monitor </i>action available for customers who wanted a <i>Safe attachments</i> policy to process attachments, deliver the emails (without blocking malicious attachments), and track what happened with attachments identified as malicious.  Customers used <a href=\"https://learn.microsoft.com/en-us/defender-office-365/try-microsoft-defender-for-office-365?view=o365-worldwide#reports-for-your-evaluation-or-trial-of-defender-for-office-365\" target=\"_blank\">reports </a>to see detections from the <i>Monitor </i>action in the policy.\n</p><p>As part of this retirement, if your organization has <i>Safe attachments</i> policies set to the <i>Monitor </i>action, we will automatically change the action in from <i>Monitor </i>to <i>Block.</i> We will not change the policy's recipients, status, or priority. After retirement, the <i>Monitor </i>option will not be available in the Safe Attachments policy page in the Defender security portal or the corresponding Microsoft PowerShell cmdlet.\n</p><p>Before retirement, you can find the <i>Monitor </i>action in Defender &gt; <i>Email &amp; collaboration &gt; Policies &amp; rules &gt; Threat policies &gt; Safe attachments &gt;</i> choose a policy or create a new policy &gt;<i> Edit settings</i> (or <i>Settings </i>if creating a new policy). We will also retire <i>Redirect messages with detected attachments</i>, because this option only supports the Monitor action):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qpgJ?ver=b4ab\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>After the retirement, the only actions in the Safe attachments policy will be <i>Off, Block, </i>and <i>Dynamic delivery.</i>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Before the retirement, review your <i>Safe attachments</i> policies and take appropriate action if your organization has <i>Safe attachments policies</i> set to the <i>Monitor </i>action. We recommend changing the action from <i>Monitor </i>to <i>Block</i>.\n</p><p>Alternatively, if you still need to run Safe attachment policy in audit mode, we recommend using <a href=\"https://security.microsoft.com/atpEvaluation\" target=\"_blank\">Evaluation mode</a>. <a href=\"https://learn.microsoft.com/defender-office-365/try-microsoft-defender-for-office-365?view=o365-worldwide#set-up-an-evaluation-or-trial-in-audit-mode\" target=\"_blank\">Learn more about Evaluation mode</a>.\n</p><p>You can also review <a href=\"https://learn.microsoft.com/defender-office-365/try-microsoft-defender-for-office-365?view=o365-worldwide#set-up-an-evaluation-or-trial-in-audit-mode\" target=\"_blank\">detections by Evaluation mode policies</a> using the <a href=\"https://learn.microsoft.com/defender-office-365/try-microsoft-defender-for-office-365?view=o365-worldwide#reports-for-your-evaluation-or-trial-of-defender-for-office-365\" target=\"_blank\">Threat Protection Status report</a>.\n</p><p>Learn more: The <a href=\"https://learn.microsoft.com/defender-office-365/safe-attachments-about#safe-attachments-policy-settings\" target=\"_blank\">Safe Attachment policy settings</a> section of <a href=\"https://learn.microsoft.com/defender-office-365/safe-attachments-about#safe-attachments-policy-settings\" target=\"_blank\">Safe Attachments - Microsoft Defender for Office 365 | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The 'Monitor' action in Microsoft Exchange Online Protection's Safe attachments policy will be retired between February and May 2025. Organizations with policies set to 'Monitor' will be automatically switched to 'Block'. Users should review and adjust their Safe attachments policies accordingly."
    }
  ],
  "EndDateTime": "2025-07-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC918563",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-25T22:54:13.213Z",
  "Services": [
    "Exchange Online",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-25T22:53:43Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Exchange Online Protection (Defender for Office 365): Monitor action in Safe attachments policy will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
