{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, the use of third-party providers as part of the Microsoft SharePoint eSignature pay-as-you-go platform is limited to regions supported by the native Microsoft SharePoint eSignature.\n</p><p>With this rollout, customers across the globe will be able to use third-party providers, wherever they are supported. Users will no longer be required to enable native SharePoint eSignature as a prerequisite for enabling either Docusign or Adobe Acrobat Sign. Pay-as-you-go must be set up to enable SharePoint eSignature, but Microsoft will not charge customers for using third-party providers.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421194\" target=\"_blank\">421194</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early November 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, admins can enable a third-party provider without enabling native SharePoint eSignature, and vice versa.\n</p><p>Microsoft 365 users who have licenses with Adobe Acrobat Sign or Docusign will be able to initiate eSignature requests with these providers from SharePoint.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins need to enable the feature in the Microsoft admin center at <i>Setup &gt; Automate content with Syntex&gt; Go to Syntex &gt; eSignature</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1d1ae1bb-e468-43d9-8a8e-d1b02b6ddd17\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/89bb3280-80dc-408a-a528-7869aa4bd3f1\" style=\"width: 400px;\" alt=\"admin controls\">\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421194"
    },
    {
      "Name": "Summary",
      "Value": "The message details the global rollout of Microsoft SharePoint eSignature integration with Adobe Acrobat Sign and Docusign, eliminating the need for native SharePoint eSignature activation. It will begin in early November 2024 and complete by mid-November. Admins must enable this feature in the Microsoft admin center. The rollout is associated with Microsoft 365 Roadmap ID 421194."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC910979",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-14T22:55:00.22Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-14T22:54:42Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft SharePoint eSignature: Adobe Acrobat Sign and Docusign integration will roll out globally",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
