{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 11, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Viva Engage (Yammer): We will update the audit log schema to include parameters that uniquely identify both the user performing an action (actor) and the user/object affected by that action (target).\n</p><p>After this rollout:\n</p><ul><li>The actor will be identified by their unique Microsoft Entra ID <code>ObjectId</code>, stored in the <code>UserKey</code> field.\n</li><li>The target will be identified by a new parameter <code>TargetObjectId</code> that will also store the target's Entra ID <code>ObjectId</code>.\n</li><li>To improve transparency on changes to admin roles and other key scenarios, a new <code>ModifiedProperties</code> parameter will capture both the old and new values of modified fields.\n</li></ul><p>\n</p><p>These new parameters will be available for users with an E3 license.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-December 2024 (previously late November) and expected to complete by late December 2024 (previously mid-January 2025).</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, for admins querying audit logs in the Microsoft Purview compliance portal (<a href=\"https://sip.compliance.microsoft.com/homepage\" target=\"_blank\">Microsoft Purview compliance portal </a><i>&gt; System &gt; Audit</i>), the <code>UserKey</code> will represent the Entra ID <code>ObjectId</code> of the actor. If you are using Microsoft PowerShell commands or custom scripts, please ensure that you are retrieving the correct value for <code>UserKey</code> to identify the actor. Also, ensure any scripts that need to identify the target are using <code>TargetObjectId</code>.\n</p><p>Before the rollout, <code>UserKey</code> was populated with the target user's Passport ID, so existing queries using this parameter may need to be updated. No Entra ID <code>ObjectId</code> was available to uniquely identify users (actor and target).\n</p><p>After the rollout: The UserKey will be mapped to the Entra ID ObjectId of the user performing the action. The new <code>TargetObjectId</code> parameter will capture the Entra ID ObjectId of the user affected by the action, and the <code>ModifiedProperties</code> field will hold the old and new values for any modified fields.\n</p><p><i>Field changes</i>\n</p>\n<table>\n<tbody>\n<tr>\n<th>Name</th>\n<th>Mandatory (Yes/no)</th>\n<th>Old mapping</th>\n<th>New mapping</th>\n</tr>\n<tr>\n<td><code>UserKey</code></td>\n<td>Yes</td>\n<td>Passport ID of the user</td>\n<td>Entra ID ObjectId of the actor</td>\n</tr>\n</tbody>\n</table>\n<p></p><i>New fields</i><table>\n<tbody>\n<tr>\n<th>Name</th>\n<th>Mandatory (Yes/no)</th>\n<th>Mapping and description</th>\n</tr>\n<tr>\n<td><code>TargetObjectId</code></td>\n<td>No</td>\n<td>Entra ID <code>ObjectId</code> of the target user. Blank if not applicable.</td>\n</tr>\n<tr>\n<td><code>ModifiedProperties</code></td>\n<td>No</td>\n<td>Captures the old and new values of any modified fields during an operation. This is particularly relevant for admin events, such as adding a user as an admin or removing someone from an admin role.</td>\n</tr>\n</tbody>\n</table>\n<p></p><p>As we apply these changes to the Viva Engage (Yammer) workload audit logs, the <code>UserKey</code> field will be updated immediately to reflect the Entra ID <code>ObjectId</code> of the actor in all audit logs. The new fields <code>TargetObjectId</code> and <code>ModifiedProperties</code> will only be populated for admin-specific audit logs and events. These include actions such as promoting or demoting users to Corporate Communicator, Network Admin, Verified Admin, Yammer Admin roles, as well as enabling or disabling Leadership Corner and setting or updating custom usage policies.\n</p><p>This change will be on for admins who have already enabled it. For everyone else, this change will be off by default and available for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To ensure a smooth transition, we recommend notifying your users about this update and updating any relevant documentation to incorporate these changes.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/audit-search?view=o365-worldwide&amp;tabs=microsoft-purview-portal\" target=\"_blank\">Search the audit log | Microsoft Learn</a>\n</p><p><a href=\"https://learn.microsoft.com/viva/engage/track-engage-events#view-the-audit-sign-in-the-microsoft-365-security--compliance-portal\" target=\"_blank\">Track Viva Engage events in the Microsoft 365 audit log and with the Management Activity API | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Viva Engage (Yammer) audit log schema will be updated to include unique identifiers for both the user performing an action and the user/object affected. New parameters and field changes will enhance transparency and tracking capabilities. Rollout will begin mid-December 2024 and complete by late December 2024."
    }
  ],
  "EndDateTime": "2025-02-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC917742",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-11T19:56:20.183Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-24T22:54:44Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage (Yammer): Enhanced audit log schema",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
