{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are launching Microsoft 365 Copilot in Microsoft Viva Amplify to enhance your authoring experience with AI. Copilot is available in the Campaign Brief authoring canvas and the Publication authoring canvas in Viva Amplify.\n</p><p>A Microsoft 365 Copilot license is not required to use this new feature. If a customer has a Viva Amplify license through Microsoft Viva Suite, Microsoft Viva Communications and Communities, or another Viva license, the user can use Copilot in Viva Amplify. <b>NOTE:</b> A customer that has a Viva Amplify license but does not have a Microsoft 365 Copilot license will not have access to Copilot on Microsoft SharePoint pages.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=411300\" target=\"_blank\">411300</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Available now.\n</p><p><b>How this will affect your organization:</b>\n</p><p>With our Copilot editor experience, by selecting the rewrite capability, Copilot will suggest different ways to rewrite your content, providing options that vary in style, structure, and emphasis.\n</p><p>Adjust length: Copilot allows you to shorten or expand your content based on your needs. You can tailor your text to meet word counts without compromising quality.\n</p><p>Tone: Copilot helps you shift the tone of your writing. Viva Amplify Copilot rich text editor (RTE) supports the following tones:\n</p><ul><li>Casual\n</li><li>Professional\n</li><li>Enthusiastic\n</li><li>Engaging\n</li><li>Creative\n</li></ul><p>This feature is available by default for all Viva Amplify users in the web/desktop experience. Please note that Amplify on Mobile iOS and Android applications is currently out of scope.\n</p><p>Disabling Copilot only exists at the tenant level. <b>Note:</b> A new setting in the Microsoft admin center to better manage Copilot at the tenant level will be available as part of a future release.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "411300"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot is now available in Viva Amplify to improve authoring with AI. It's accessible without a Copilot license if you have a Viva Amplify license. Copilot offers rewriting, length adjustment, and tone setting features but is not available on SharePoint or mobile apps. No admin action is needed for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC912180",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-16T23:58:28.593Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-16T23:57:59Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva: Microsoft 365 Copilot in Microsoft Viva Amplify",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
