{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams: A new feature to enhance the security in external collaboration. If your company allows external domains to contact your users in Teams, we will identify if an external user is impersonating a brand commonly targeted by phishing attacks during their initial contact with your user through Teams Chat. If we detect potential impersonation, we will show a high-risk alert to the user, notifying them to check for suspicious name/email and proceed with caution.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421190\" target=\"_blank\">421190</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late October 2024 and expect to complete by late October 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: For organizations that have enabled Teams external access, user can receive messages from any user from external domain. Teams does not scan the sender for impersonation risks. When a user receives a chat invitation, the user can accept, or block, or preview the message. <b>Note:</b> Previewing the message does not put the organization at risk.&nbsp;</p><p>After this rollout: If your organization enables Teams external access, we will check for potential impersonation activity when your user receives a message from an external sender for the first time. Your users will see a high-risk warning in the Accept/Block flow if we think there is potential impersonation risk, and users must preview the message before they can choose to Accept or block. If users choose to accept, we will prompt them again with potential risk before proceeding with Accept.\n</p><p>This security check will be done automatically. No admin configuration is required. Admins can check the audit log for impersonation attempts detected.\n</p><p>Teams detects an impersonation attempt in chat. In this case, the sender claims to be associated with Microsoft, but is not coming from a legitimate Microsoft domain: \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qnia?ver=1f83\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>When a user selects <i>Preview their messages</i>&nbsp;in the first screen, and then selects <i>Accept,</i> the user is alerted again to the potential for risk in this screen: \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qcPK?ver=f91e\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>This feature will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to update any relevant documentation. We recommend that you educate your users on what the new high-risk Accept/Block screen means and remind users to proceed with caution.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421190"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"421190\":[{\"RoadmapId\":421190,\"Platform\":\"Mac\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-10-14T23:13:17.9543419Z\",\"LatestRing\":null},{\"RoadmapId\":421190,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-10-14T23:13:17.9543422Z\",\"LatestRing\":null},{\"RoadmapId\":421190,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-10-14T23:13:17.9543423Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a new security feature to alert users of potential brand impersonation in Teams Chat, particularly during initial contact from external domains. This feature will be automatically enabled, with rollout phases starting late October 2024 for Targeted Release and mid-November 2024 for General Availability. No admin configuration is needed, and users will be prompted with high-risk warnings when impersonation is detected."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC910976",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-14T22:53:15.573Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-14T22:52:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Brand impersonation protection for Teams Chat",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
