{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon in Microsoft Viva Engage Communities: Community settings for the <i>Community Resources</i> module and the <i>Files </i>tab.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late October 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, community admins will have the ability to enable or disable the <i>Community Resources</i> module and the <i>Files </i>tab in community settings. Two new toggles on the <i>Settings </i>page will allow admins to control the visibility of these features.\n</p><p>By default, both the module and the tab are turned on, making them visible to members. Admins can easily hide them by switching off the corresponding toggles. These changes can be made at any time without affecting existing data, giving admins more flexibility to tailor the community experience based on the relevance of these features.\n</p><p>Before this rollout: The settings did not exist, so community admins did not have the ability to hide or unhide <i>Community Resources</i> and the <i>Files </i>tab in Viva Engage Communities.\n</p><p>The new toggles are off by default.\n</p><p>To access the Community settings page, go to a community page and select Settings from the three-dot menu in the top right:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qph0?ver=7e29\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>The <i>Community settings</i> page will have two new toggles to hide/unhide the <i>Community Resources</i> module and the <i>Files </i>tab:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qrSc?ver=86fe\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/manage-a-community-in-viva-engage-3e75fbe9-1b3e-48b5-8e4b-af2716b7873a\" target=\"_blank\">Manage a community in Viva Engage - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will introduce community settings for the Community Resources module and Files tab, with a rollout starting late October 2024 and completing by mid-November 2024. Community admins will gain control over the visibility of these features with new toggles. Default settings will have both features visible."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC917752",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-24T23:01:21.357Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-24T23:00:22Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Community settings for Community Resources and Files tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
