{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated October 16, 2024: We have updated the content. Thank you for your patience.</p><p>In Exchange Online PowerShell (EXO) V3.0, we introduced the <code>Connect-ExchangeOnline</code> cmdlet to connect to the Microsoft Exchange Online environment through Microsoft PowerShell, which loads the help file by default. This help file is required for running the <code>Get-Help</code> cmdlet. However, not many customers used the <code>Get-Help</code> cmdlet. In EXO V3.3, we added the <code>-SkipLoadingCmdletHelp</code> parameter. When <code>-SkipLoadingCmdletHelp</code> is used with <code>Connect-ExchangeOnline</code>, help files do not load the on the customer system, which saves resources. \n</p><p>However, starting with EXO V3.7, we are changing this default behavior. The Help file will not be loaded by default, and a new parameter <code>-LoadCmdletHelp</code> will be required to load the cmdlet help and use the <code>Get-Help</code> cmdlet. To avoid breaking existing scripts, the <code>-SkipLoadingCmdletHelp</code> parameter will continue exist, but will not function.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): The changes will be available in EXO V3.7 (the next release of our EXO V3 module) in early November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Starting with EXO V3.7, if you want to use the <code>Get-Help</code> cmdlet, you will have to use the parameter <code>-LoadCmdletHelp</code> along with <code>Connect-ExchangeOnline</code>.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This message only applies to customers who upgrade their EXO module version to 3.7.0. Earlier versions will not be affected by these changes.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/powershell/exchange/connect-to-exchange-online-powershell?view=exchange-ps\" target=\"_blank\">Connect-ExchangeOnline (ExchangePowerShell) | Microsoft Learn</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/powershell/module/microsoft.powershell.core/get-help?view=powershell-7.4\" target=\"_blank\">Get-Help (Microsoft.PowerShell.Core) - PowerShell | Microsoft Learn</a>\n</li><li>Download an EXO module from <a href=\"https://www.powershellgallery.com/packages/ExchangeOnlineManagement/3.6.0\" target=\"_blank\">PowerShell Gallery | ExchangeOnlineManagement 3.6.0</a>.</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details changes in Microsoft Exchange Online PowerShell V3.7, where the Help file will not load by default, and a new parameter '-LoadCmdletHelp' will be needed to use 'Get-Help'. This update will be globally available in early November 2024. Users must update documentation accordingly."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC910986",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-16T23:29:53.683Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-14T22:58:03Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange Online: Optional Help file parameter in Microsoft PowerShell will change",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
