{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 6, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft 365 Copilot Business Chat (BizChat): Users will be able to use CIQ to ground their Copilot prompts with third-party data from their Microsoft Graph Connectors.\n</p><p><a href=\"https://support.microsoft.com/topic/using-context-iq-to-refer-to-specific-files-people-and-more-in-microsoft-365-copilot-272ac2c1-c5f7-49c9-8a42-2a8a87846fa0\" target=\"_blank\">Context IQ (CIQ)</a> is a set of AI capabilities from Microsoft that allows users to search for, select, and insert relevant enterprise or personal data directly into their prompts or conversations. This capability helps users to “ground” or anchor their prompts in specific, contextually relevant data, making responses more accurate, specific, and useful.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413111\" target=\"_blank\">413111</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late March 2025 (previously late February) and expect to complete by early April 2025 (previously early March).</p><p><b>How this will affect your organization:</b>\n</p><p>No impact for the tenant admin. End users will see a new Other tab in CIQ to add their third-party data from any MS Graph Connectors that are enabled.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/9cac0038-f078-4811-8a05-bbc86ea94869\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/topic/using-context-iq-to-refer-to-specific-files-people-and-more-in-microsoft-365-copilot-272ac2c1-c5f7-49c9-8a42-2a8a87846fa0\" target=\"_blank\">Using Context IQ to refer to specific files, people, and more in Microsoft 365 Copilot - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413708"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Teams policy, effective mid-March 2025, will enable voice and face enrollment by default, offering enhanced meeting features. Admins should configure settings now using new PowerShell cmdlets and inform users of changes. Microsoft 365 Copilot license is required for full functionality."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-04-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC912707",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-06T20:05:34.117Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-17T23:34:26Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New policy for voice and face enrollment will default to \"On\" (configure now)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
