{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to new Outlook for Windows: Apps and <a href=\"https://support.microsoft.com/office/use-add-ins-in-outlook-1ee261f9-49bf-4ba6-b3e2-2ba7bcab64c8\" target=\"_blank\">add-ins</a> will be supported for all accounts added to new Outlook, and the user's view of these apps and add-ins will dynamically change to the active identity.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412936\" target=\"_blank\">412936</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late October 2024 and expect to complete by late October 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out late November 2024 and expect to complete by mid-December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, new Outlook for Windows supports apps and add-ins for the user's primary account only. Users currently see no add-ins for secondary accounts.\n</p><p>After this rollout, available add-ins and modules in Outlook will dynamically change to reflect what is available in the context of a selected message or user account.\n</p><p>Admins will no longer need to ensure an account is marked primary for add-ins to function. Users will not lose any functionality with this change, but additional add ins available to the account may appear in non-primary account contexts.\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412936"
    },
    {
      "Name": "Summary",
      "Value": "New Outlook for Windows will soon support apps and add-ins for all accounts, with a dynamic interface reflecting the active account. Rollouts start late October 2024 for Targeted Release and late November 2024 for General Availability. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC911623",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-15T23:42:54.873Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-15T23:42:37Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Outlook for Windows: Multi-account support for add-Ins and apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
