{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">Updated December 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">We're changing the way Outlook for iOS authenticates users with the Authenticator mobile app integration to match Outlook for Android. Currently in Outlook for iOS users are required to tap a button called \"Open Authenticator\" to initiate the Authenticator app authentication flow. In Outlook for Android this flow opens automatically without requiring the user to tap a button. We will now be matching that behavior in iOS so the user no longer has to tap the \"Open Authenticator\" button.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out this change in early January 2024 (previously late November) and expect to complete by late January (previously mid-December).</p><p><b>How this will affect your organization:</b></p><p>You are receiving this message because our reporting indicates your organization may be using Outlook for iOS. To see how many users are currently using Outlook for iOS there are report instructions here:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/admin/activity-reports/email-apps-usage-ww?view=o365-worldwide\" target=\"_blank\">Microsoft 365 Reports in the admin center - Email apps usage</a></p><p>Users will no longer need to tap the \"Open Authenticator\" button to initiate Authenticator app based mobile authentication, when this change is implemented.</p><p><b>What you need to do to prepare:</b></p><p>When this change takes effect, users and admins will not need to do anything for your organization to take advantage of this behavior.</p><p>Information about device enrollment with Intune for iOS can be found here:&nbsp;<a href=\"https://learn.microsoft.com/mem/intune/enrollment/ios-device-enrollment\" target=\"_blank\">Overview of Apple device enrollment in Microsoft Intune</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook for iOS will update its authentication to auto-open the Authenticator app, aligning with Android's behavior. The rollout begins in early January 2024, with completion expected by late January. Organizations using Outlook for iOS don't need to take action to implement this change."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC916297",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-11T01:16:42.98Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-23T00:21:32Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Outlook for iOS to match Android Authenticator Auto Open Behavior",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
