{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">We're making a change to how emails are sent for customers that use list or document library rules, which can be created from the Automate dropdown. Users can specify an automated email based on when a change occurs, a new file or item is added, a file or item is deleted, and file or item metadata conditions. To align system generated emails with best practices, these emails will now come from the no-reply@sharepointonline.com email address with the display name \"SharePoint Online\".</p><p>\n</p><p>Previously, these emails would be sent on behalf of the user that made a file or item update.</p><p><b>When will this happen:</b></p><p>Available now</p><p><b>How this will affect your organization:</b><br></p><p>Your users may notice the change in email address and display name for certain business processes and workflows that rely on automated emails from SharePoint list or document libraries.</p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required, existing rules will continue to operate. If you have any email policies or workflows based on a specific sender, those will need to include the no-reply@sharepointonline.com address.</p><p>For additional information review:&nbsp;<a href=\"https://support.microsoft.com/office/create-a-rule-to-automate-a-list-or-library-151ea008-7fa6-409b-b0bd-b04a3b3cacd5\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Create a rule to automate a list or library - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint list and library rules' automated emails will now be sent from no-reply@sharepointonline.com with the display name \"SharePoint Online.\" This change is effective immediately and requires no action, but email policies and workflows might need updating to include this new address."
    }
  ],
  "EndDateTime": "2024-11-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC915497",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-21T23:34:48.7Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-21T23:34:32Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "SharePoint list and library rules will send from the no-reply@sharepointonline.com email address",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
