{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 13, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In Microsoft Defender XDR, on the <i>Settings &gt; Identities</i> page, we will retire the <i>Alert notifications</i> page starting mid-January 2025 (previously mid-November). We expect to complete by mid-January 2025 (previously mid-November).</p><p><b>How this will affect your organization:</b>\n</p><p>As an alternative, please use the <a href=\"https://learn.microsoft.com/defender-xdr/m365d-notifications-incidents\" target=\"_blank\">Incident email notifications</a> page in Microsoft Defender XDR settings to create and manage all new and existing notification rules. This update will help streamline and enhance your notification experience in the Defender XDR portal.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To ensure uninterrupted notifications, it is essential to transfer all existing notification settings to the Email Notifications page under Defender XDR settings. Please note that if incidents notifications are not set up through the XDR page, you will no longer receive alerts emails notifications after the deprecation date.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/defender-xdr/m365d-notifications-incidents\" target=\"_blank\">Get incident notifications by email in Microsoft Defender XDR - Microsoft Defender XDR | Microsoft Learn</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The \"Alert notifications\" feature in Microsoft Defender for Identity will be retired starting mid-January 2025, with a new rollout timeline updated on November 13, 2024. Users should transition to using the Incident email notifications in Microsoft Defender XDR to manage notification rules."
    }
  ],
  "EndDateTime": "2025-02-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC912708",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-11-13T18:30:25.813Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-17T23:35:02Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Defender for Identity: \"Alert notifications\" feature will retire starting in November 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
