{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 20, 2024: We have updated the content. Thank you for your patience.</p><p>A new <code>csTeamsAIPolicy</code> policy for Microsoft Teams (available now via Microsoft PowerShell and taking effect in mid-February 2025) will give IT admins more control over voice and face enrollment settings, allowing organizations to manage these features based on their needs. After rollout, voice and face profile enrollment <b>will be enabled by default</b>, and users can benefit from voice isolation, speaker recognition, and attribution in meeting rooms, resulting in smarter meeting recaps and enhanced functionality for Microsoft 365 Copilot in meetings. To access Copilot features, a Microsoft 365 Copilot license is required. This message applies to Teams for Windows desktop and Mac desktop.\n</p><p>NOTE: Microsoft doesn't use the voice and face profiles of users to train any models or for any other purposes other than providing the voice and face enrollment feature in Microsoft Teams.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413708\" target=\"_blank\">413708</a>.\n</p><p><b>When this will happen:</b></p><p>The new Microsoft PowerShell cmdlets are available now for admins to configure, to ensure a smooth transition.</p><p>\n</p><p>General Availability (Worldwide, GCC): The new Microsoft PowerShell cmdlets are available now for preparation and to ensure a smooth transition. The policy takes effect starting in mid-February 2025 (previously early February) and is expected to be fully in effect by late February 2025 (previously mid-February).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, the current policy <code>csTeamsMeetingPolicy</code> has a single setting, <code>EnrollUserOverride</code>, that allows the administrator to enable or disable the enrollment of both face and voice profile of users.\n</p><p>After this rollout, the new <code>csTeamsAIPolicy</code> will replace the existing enrollment setting in <code>csTeamsMeetingPolicy</code>. The new <code>csTeamsAIPolicy</code> has two settings, <code>EnrollFace</code> and <code>EnrollVoice</code>, that will be set to <code>Enabled </code>by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>\nThis rollout will happen automatically by the specified date. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n\n</p><p>If your organization prefers to disable voice and face enrollments, review and update your settings before mid-January 2025. To help you get started, review:\n</p><ul><li><a href=\"https://learn.microsoft.com/powershell/module/teams/set-csteamsaipolicy?view=teams-ps\" target=\"_blank\">Set-CsTeamsAIPolicy (MicrosoftTeamsPowerShell) | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/powershell/module/teams/get-csteamsaipolicy?view=teams-ps\" target=\"_blank\">Get-CsTeamsAIPolicy (MicrosoftTeamsPowerShell) | Microsoft Learn</a>\n</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/rooms/voice-and-face-recognition\" target=\"_blank\">Overview of voice and face enrollment - Microsoft Teams | Microsoft Learn</a></p><p>If your organization prefers to disable voice and face enrollments, review and update your settings before mid-February 2025.\n</p><p>Important: The EnrollUserOverride setting can be assigned globally, directly to users, or to groups  in PowerShell. \n</p><p>Admins must ensure that changes are applied consistently across all these locations to avoid unintended configurations.</p><p> \n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413708"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Teams policy, effective mid-February 2025, will enable voice and face enrollment by default, offering enhanced meeting features. Admins should configure settings now using new PowerShell cmdlets and inform users of changes. Microsoft 365 Copilot license is required for full functionality."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-03-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC912707",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-20T23:19:30.86Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-17T23:34:26Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New policy for voice and face enrollment will default to \"On\" (configure now)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
