{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are introducing updates that provide capabilities for managing custom fonts for Microsoft SharePoint and Microsoft Viva Connections. This includes the ability to hide the <i>From Microsoft</i> font packages from <i>Change the look, </i>the ability to apply a font package in your site templates, and updated availability for the <i>From Microsoft</i> font packages.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420933\" target=\"_blank\">420933</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-October 2024 and expect to complete by early November 2024\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early November 2024 and expect to complete by late February 2025 (previously late January).</p><p><b>How this will affect your organization:</b>\n</p><p>This rollout will include new Microsoft PowerShell commands that will allow you to get information about the <i>From Microsoft</i> font packages and the ability to hide these font packages if desired. More details for these commands will be available in our&nbsp;PowerShell documentation. We will also provide an update to add an additional site script action that will allow developers and administrators to include and apply font packages as a part of a site template.\n</p><p>Sample action details: \n</p><p><code>{\n</code>\n</p><p><code>\"verb\": \"applyFontPackage\",</code>\n</p><p><code>\"fontPackageTitle\": \"Amasis MT\",</code>\n</p><p><code>\"fontPackageId\": \"1e7a7803-045d-44df-9c7a-d2f2f8562e51\",</code>\n</p><p><code>\"fontPackageStore\": \"OutOfBox\"\n</code>\n</p><p><code>}</code>\n</p><p>\n</p><p>\n</p><p>This rollout will also include a change to allow tenants that meet the requirements for custom fonts to discover the feature without needing to activate the SharePoint brand center.  For tenants that are currently using the Organization Assets Library functionality with Public content delivery network (CDN), these organizations will see <i>Fonts </i>and the <i>From Microsoft</i> font packages in <i>Change the look</i> without any additional actions.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p><a href=\"https://learn.microsoft.com/powershell/sharepoint/sharepoint-online/connect-sharepoint-online\" target=\"_blank\">Get started with the SharePoint Online Management Shell | Microsoft Learn</a> (will be updated)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420933"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is updating SharePoint and Viva Connections with new font management capabilities, including hiding Microsoft font packages, applying font packages in site templates, and new PowerShell commands. Rollout begins mid-October 2024, completing by late February 2025. No admin action is required, but user notification and documentation updates are recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC915485",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-20T18:56:28.53Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-21T23:20:05Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint: Updates to font management capabilities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
