{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Version 5.0 of the Quality of Experience Report (QER) for the Microsoft Teams Call Quality Dashboard (CQD) in Microsoft Power BI has reached General Availability and is live on the <a href=\"https://www.microsoft.com/download/details.aspx?id=102291\" target=\"_blank\">Microsoft downloads website</a> for tenant admins and IT pros to start using today.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Available now.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The biggest highlight of version 5.0 is the inclusion of the new <a href=\"https://learn.microsoft.com/microsoftteams/cqd-intelligent-media-quality-classifiers\" target=\"_blank\">Intelligent media quality classifiers</a>, enabling IT admins to narrow the scope of their investigations by helping to identify possible root cause(s) for media quality degradation. We have also updated the design to provide a cleaner experience and to visually align the report with Teams and the Teams admin center. Also, a new feedback submission feature allows customers to submit feedback directly to the CQD Product Group through the Power BI report.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>We recommend reviewing the <a href=\"https://learn.microsoft.com/microsoftteams/cqd-power-bi-query-templates\" target=\"_blank\">latest documentation</a> on using Call Quality Dashboard with Power BI reporting templates. For first-time users, please review how to the <a href=\"https://learn.microsoft.com/microsoftteams/cqd-power-bi-connector\" target=\"_blank\">instructions for installing and configuring the Microsoft Call Quality Connector for Power BI Desktop</a> to ensure you can use the QER and other available templates for CQD.\n</p><p><i>Learn more</i>\n</p><ul><li> <a href=\"https://learn.microsoft.com/microsoftteams/cqd-power-bi-query-templates\" target=\"_blank\">Use Power BI to analyze CQD data for Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/cqd-power-bi-connector\" target=\"_blank\">Install Power BI Connector to use CQD query templates - Microsoft Teams | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Quality of Experience Report v5.0 for Microsoft Teams Call Quality Dashboard in Power BI is now generally available, featuring new intelligent media quality classifiers and an updated design. IT admins should review the latest documentation and ensure proper setup to utilize the new features."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC912706",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-17T23:34:03.27Z",
  "Services": [
    "Power BI",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-17T23:33:54Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Quality of Experience Report v5.0 for Microsoft Power BI",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
