{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "The Microsoft Purview compliance portal is being updated to introduce a new schema to track Power Apps and Power Platform Connector activities. Beginning in October 2024, both activities will start being logged under the PowerPlatformAdministratorActivity activity type.<br><br>\n<b>How does this affect me?</b><br>\nPower Apps and Power Platform Connector activities will continue to be logged under both the new and current activity types until December 2024. Beginning in January 2025, these activities will only be logged under the new activity type. Any automation that is currently ingesting audit logs from PowerAppsApp and PowerAppsResource activity types will no longer work in January 2025.<br><br>\n<b>What action do I need to take?</b><br>\nPlease update any internal systems that utilize the current activity types to the new PowerPlatformAdministratorActivity type to avoid any disruption to your service. Please review the <a href=\"https://aka.ms/ADO8672\" target=\"_blank\">Power Apps activity logging</a> documentation for more information on this new schema.<br><br>\nAdditionally, we recommend that customers using Microsoft Sentinel update to the latest Microsoft Sentinel solution for the Microsoft Power Platform. For additional information, please refer to this documentation: <a href=\"https://aka.ms/ADO8672-1\" target=\"_blank\">Sentinel solution for Microsoft Power Platform overview</a>.",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-11-16T20:27:17Z",
  "HasAttachments": false,
  "Id": "MC912045",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-16T20:28:11.507Z",
  "Services": [
    "Power Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-16T20:27:17Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Microsoft Purview - Information about schema updates for Microsoft Power Apps activities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
