{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of ongoing improvements to bulk email filtering in Microsoft Defender for Office | Exchange Online Protection, we are refining our detection capabilities by <i>recalibrating and redistributing bulk senders </i>across different bulk complaint levels (BCL). This would automatically make the current bulk thresholds slightly more aggressive. As a consequence, we are updating bulk threshold for standard preset policy to 7 from current value of 6. In response to general customer feedback around receiving more bulk email, we are keeping current default BCL threshold of 7 in default policy as is. Here’s what’s changing:\n</p><ul><li><i>Redistribution for aggressive filtering: </i>The new BCL distribution makes higher levels as aggressive as lower levels in previous version, enabling more precise targeting of unwanted bulk emails.\n</li><li><i>Updated BCL recommendations: </i>The new recommended settings are 7 for default and standard, and 5 for strict to improve control over bulk filtering (replacing the previous levels of 7, 6, and 5).\n</li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-October 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b></p><p>Higher BCL levels are now more aggressive, reaching filtering precision similar to lower levels in the previous version.\n</p><p>If false positives occur, we recommend adjusting thresholds to higher BCL levels (including above default) and experimenting to find the right balance for your organization.\n</p><p>This feature is on by default, and admins can adjust their bulk threshold based on tenant preference.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins should review and adjust their BCL settings using the <a href=\"https://learn.microsoft.com/defender-office-365/anti-spam-bulk-senders-insight\" target=\"_blank\">bulk senders insight tool</a> to align with the new recommendations, optimizing bulk filtering accordingly and managing false positives and false negatives. During and after the rollout, monitor email flows to assess the impact on bulk email management. If any false positives occur, test and experiment with higher BCL levels to ensure the updated thresholds effectively meet your organization’s filtering requirements.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/defender-office-365/anti-spam-bulk-complaint-level-bcl-about\" target=\"_blank\">Bulk complaint level values - Microsoft Defender for Office 365 | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange is enhancing bulk email filtering with recalibrated bulk sender distribution across different bulk complaint levels (BCL). New BCL recommendations are 7 for default and standard, and 5 for strict policies. Rollout starts mid-October 2024, with completion by mid-November 2024. Admins should adjust BCL settings accordingly."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC913443",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-18T22:40:49.997Z",
  "Services": [
    "Exchange Online",
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-18T22:40:35Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Exchange: Improved bulk detection and updated bulk complaint level recommendations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
