{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 14, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Purview | Insider Risk Management indicators that detect activity in cloud storage apps (Box, Dropbox, Google Drive), cloud services (AWS, Azure), and Microsoft Fabric (Power BI) will transition from a free Public Preview <b>as communicated in MC716005 <i>(Updated) Microsoft Purview | Insider Risk Management: Public preview of multicloud support</i> (updated March 2024)</b> to a pay-as-you-go pricing model in Public Preview.\n<b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out in early January 2025 (previously early November) and expect to complete by late January 2025 (previously early November).\n</p><p>We will update this message when we know the plan for General Availability.\n</p><p><b>How this will affect your organization:</b>\n</p><p>To continue using indicators for cloud storage apps (Box, Dropbox, Google Drive), cloud services (AWS, Azure), and Microsoft Fabric (Power BI), please link an Azure subscription to Microsoft Purview to enable billing. Starting January 6, 2025 (previously November 1), you will be billed based on the number of user activities processed by Microsoft Insider Risk Management for these indicators.\n</p><p>Insider Risk Management indicators transitioning to a pay-as-you-go pricing model:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/3267274b-cac4-442d-b59f-24d7fffeda79\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Microsoft Purview admins with appropriate permissions can enable the pay-as-you-go features from Microsoft Purview by taking a few steps. To learn more: <a href=\"https://go.microsoft.com/fwlink/?linkid=2285100\" target=\"_blank\">Enable Microsoft Purview PAY-AS-YOU-GO features</a>.\n</p><p>Insider risk admins with appropriate permissions can opt in to these indicators in the <a href=\"https://purview.microsoft.com/informationprotection/purviewmipoverview\" target=\"_blank\">new Microsoft Purview portal</a> at Insider Risk Management settings.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/purview-billing-models\" target=\"_blank\">Learn about Microsoft Purview billing models | Microsoft Learn</a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Purview | Insider Risk Management indicators for cloud storage apps, cloud services, and Microsoft Fabric will switch to a pay-as-you-go model in January 2025. Organizations must link an Azure subscription for billing and can opt-in via the new Microsoft Purview portal. Rollout updates and preparation steps are provided."
    }
  ],
  "EndDateTime": "2025-06-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC917743",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-14T20:28:00.463Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-24T22:55:54Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Purview | Insider Risk Management: New pay-as-you-go model for cloud storage apps, cloud services, and Microsoft Fabric",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
