{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 18, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>As an extension to the previous communication MC757613 <i>(Updated) Microsoft SharePoint: Add approvals to any SharePoint list</i> (originally sent March 2024, updated August 2024), we will soon add approvals to document libraries in Microsoft SharePoint Online.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420336\" target=\"_blank\">420336</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early January 2025 (previously early December) and expect to complete by early March 2025 (previously late January).</p><p>General Availability (Worldwide, GCC): We will begin rolling out early March 2025 (early January) and expect to complete by late March 2025 (late January).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Users are not able to add approvals to document libraries in SharePoint Online. \n</p><p>After this rollout, users will be able to configure approvals by going to the <i>Automate</i> dropdown menu from the command bar in SharePoint Online document libraries and then selecting the <i>Configure Approvals</i> option to enable and disable approvals on the library. Note: When editing files, any in-flight approvals will be cancelled if changes are saved. To discourage edits of in-progress approvals, files will open in view-only mode in Microsoft Word, Excel, and PowerPoint for the web, and the same Windows desktop applications will show that the document is <i>Marked as final.\n</i></p><p>After approvals are enabled, a user can create a file and submit it for approval. By creating an approval request and specifying the approver, the request will appear in the <i>Approvals</i> app in Microsoft Teams or can be approved directly in the library in SharePoint. Once approved, the file metadata is updated.\n</p><p>Note: Disabling approvals will only hide the relevant columns. In-progress approvals will still be actionable in Teams. At any time, you can manually add approvals columns back into your views.\n</p><p>Configure approvals in SharePoint Online:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1pGUi?ver=8b9c\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Enable configured approvals:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1pBcR?ver=bb9c\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Approvals column:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1pN1V?ver=8469\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Disable configured approvals:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1pGT9?ver=b040\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This feature is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>Inform your users of the new <i>Approvals</i> functionality for libraries and lists. Share the support documentation <a href=\"https://support.microsoft.com/office/approvals-in-lists-2bd0954d-5797-4be3-b78a-846f26338e17\" target=\"_blank\">Approvals in lists</a>, which will be updated before this rollout begins to include library support.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420336"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint will soon add an approvals feature to document libraries, with a rollout timeline updated to begin in January 2025 and complete by March 2025. This feature allows users to configure and manage approvals directly in SharePoint Online libraries and Microsoft Teams. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC912181",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-18T22:02:25.477Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-16T23:58:51Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: Add approvals to any document library",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
