{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p></p><p>Starting in early November 2024, Microsoft Copilot in Edge will once again support page summarization, which lets users summarize an open webpage or PDF in the Edge sidebar. Page summarization will also include contextual prompt suggestions to help users ask relevant questions about open pages in Edge. Page summarization will be available for Microsoft Copilot users when signed in with a Microsoft Entra account and for Microsoft 365 Copilot users when using web mode. Learn more about the <a href=\"https://learn.microsoft.com/copilot/overview#whats-the-difference-between-microsoft--and-microsoft-365-\" target=\"_blank\">difference between Microsoft Copilot and Microsoft 365 Copilot</a>. Page summarization and contextual prompt suggestions will be accessible for users when using Copilot through the Edge side pane.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early November 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Page summarization has been unavailable since the updates to Microsoft Copilot in mid-September 2024 but will roll out again in early November 2024.&nbsp;</p><p>After this rollout, Copilot may have access to a user’s page context when they are sending contextual prompts to Copilot in Edge or if they are using Copilot in Edge alongside an open webpage or PDF.\n</p><p>The page summarization feature will be available by default when it rolls out in early November. It can also be configured by admins.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>The <a href=\"https://learn.microsoft.com/deployedge/microsoft-edge-policies#edgeentracopilotpagecontext\" target=\"_blank\">EdgeEntraCopilotPageContext</a> policy is available now for you to manage whether your users have access to page context while using Copilot in Edge. The policy will take effect after page summarization is available. If the policy is not configured, users can enable or disable Copilot’s access to page context in their Copilot settings.\n</p><p>The Copilot feature in the Edge side pane:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qcP7?ver=07aa\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This rollout will happen automatically by the specified date. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more\n</p><ul><li>The section called <a href=\"https://learn.microsoft.com/copilot/overview#whats-the-difference-between-microsoft--and-microsoft-365-\" target=\"_blank\">What’s the difference between Microsoft Copilot and Microsoft 365 Copilot?</a> in Overview of Copilot | Microsoft Learn\n</li><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/enterprise-data-protection\" target=\"_blank\">Enterprise data protection in Microsoft 365 Copilot and Microsoft Copilot | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting early November 2024, Microsoft Copilot in Edge will reintroduce page summarization and contextual prompt suggestions, available for users signed in with a Microsoft Entra account or using Microsoft 365 Copilot in web mode. Rollout will be automatic, and admins can configure the feature."
    }
  ],
  "EndDateTime": "2025-01-11T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC912175",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-16T23:53:51.55Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-16T23:53:13Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot in Edge will support page summarization and user prompt suggestions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
