{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Improving interop between the new Microsoft Teams client and Skype for business<br></p><p>Currently when making or receiving a call in the new Microsoft Teams client while an existing Skype for Business (SfB) call is ongoing, the call in Skype for Business does not automatically go on hold. The reverse scenario has the same problem.&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-October 2024 and expect to complete by late October 2024.<br></p><p>General Availability (GCC): We will begin rolling out mid-October 2024 and expect to complete by late October 2024.<br></p><p>General Availability (GCC High):&nbsp; early November 2024 and expect to complete by mid-November 2024.\n</p><p>General Availability (DoD): We will begin rolling out mid-November 2024 and expect to complete by late November 2024.</p><p><b>How this affects your organization:</b></p><p>We have addressed this issue so that when the user is on a call in SfB and answers a call in Microsoft Teams the SfB call will go on hold.  Similarly, if they are on a call in Teams and answer a call in SfB the Teams call will go on hold. The user must be using the new Microsoft Teams client version 24261.1100.3128.2662 or greater.</p><p>\n</p><p><b>What you can do to prepare:</b></p><p>Once this feature is available it must be enabled following the steps below.  \n</p><p>\n</p>\n<p></p>\n<ul><li>The group policy registry key \"Computer\\HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Office\\16.0\\Lync\\Enable21Interop\", DWORDis set to \"0x01\"<br></li><li>The group policy registry key \"Computer\\HKEY_CURRENT_USER\\Software\\Microsoft\\Office\\16.0\\Lync\\EnableIPCForHoldResume\", DWORDis set to \"0x01\"</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Call hold synchronization between Microsoft Teams and Skype for Business is improving. When a call is active in one service and another call is answered in the other, the ongoing call will be placed on hold. This feature requires the new Microsoft Teams client version 24261.1100.3128.2662 or greater and will roll out worldwide from mid to late October 2024, with specific dates for GCC, GCC High, and DoD. Organizations must enable this feature by adjusting group policy registry keys."
    }
  ],
  "EndDateTime": "2025-01-06T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC916294",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-26T00:56:18.337Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-23T00:19:31Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Teams and Skype for Business Call Hold Synchronization",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
