{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Viva Engage: Enhancements to the page header for a more streamlined and optimized experience. The header will display more relevant content and highlight key actions, such as <i>Join</i>. Also, we have slightly reduced the size of the icon or avatar size to minimize overlap with background images, enhancing overall visibility and user interaction.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422731\" target=\"_blank\">422731</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early November 2024 and expect to complete by late November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The dimensions of the page headers, including height and width, remain unchanged. However, we have expanded the image area to offer community administrators greater flexibility in customizing this space. The new image dimensions are 700x262 pixels (or 1400x524), and the avatar size has been updated to 72x72 pixels, maintaining a square shape.\n</p><p>Comparison of the previous header (left) and the enhanced version (right):\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/9dcc107c-507d-4d88-965a-434b0c6fdd6f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>These changes will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Please inform community administrators and users of the updated image and avatar dimensions to ensure proper fit in the page header.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422731"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is updating its page header to be more streamlined, with relevant content and highlighted key actions. Icon/avatar sizes are reduced to minimize overlap. Rollout begins early November 2024, with new image dimensions provided for community administrators. No admin action required before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC913436",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-18T22:38:59.29Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-18T22:38:39Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: Page header enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
