{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft SharePoint Online: Content export for SharePoint Embedded (SPE) containers. As an admin, you can now add guest app permissions to enable third-party tools to operate on SPE content. Please review MC897562 <i>Introducing Guest App Permission Management for SharePoint Admins</i> (September 2024) for the timeline for releasing guest app permissions and how to enable guest access.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-October 2024 and expect to complete by mid-October 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out in mid-October 2024 and expect to complete by late October 2024.\n</p><p><b>How this will affect your organization</b>\n</p><p>Before this rollout: It is not possible for admins to export Loop content from SPE containers.\n</p><p><i>After this rollout</i></p><ul><li>This change enables you to perform compliance or governance workflows using third-party tools on your organization's data.\n</li><li>After you add guest app permissions in your tenant, you can export and use Microsoft Purview eDiscovery on Copilot Pages and any Loop content from Loop workspaces stored in SPE containers using the Purview tool or the Microsoft Graph API.\n</li><li>Microsoft introduced Copilot Pages in September 2024, a dynamic canvas for team collaboration in Microsoft 365 Copilot. These pages are stored in SPE containers. A Microsoft 365 Copilot license is required to use this feature.\n</li><li>No change after this rollout: We will continue to support the offline export of Loop content (Pages and components) through the eDiscovery (Premium) workflow using the Microsoft Purview tool and through a third-party graph API. The export can be requested in the original .loop format (or .html format, which can be viewed offline).\n</li><li>The export and eDiscovery review flows will <b>continue to be available</b> for Microsoft Loop components created in Teams, Outlook, and Word for the web and <b>now includes</b> content in SPE, such as Copilot Pages. We have built on existing functionality.\n</li></ul><p>The new feature will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-compliance-summary?view=o365-worldwide\" target=\"_blank\">Summary of compliance capabilities for Loop experiences | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/ediscovery-overview\" target=\"_blank\">Overview of the eDiscovery (Premium) solution in Microsoft Purview | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint Online will soon allow admins to export content from SharePoint Embedded containers, including Microsoft Loop, using third-party tools with guest app permissions. Rollout begins mid-October 2024, with full availability expected by late October 2024. This update requires no admin action before rollout."
    }
  ],
  "EndDateTime": "2024-12-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC911622",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-15T23:42:17.673Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-15T23:42:02Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint: Export content (including Microsoft Loop) stored in SharePoint Embedded (SPE) containers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
