{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 14, 2025: We have updated the content. Thank you for your patience.</p><p>The admin toggle for Name Pronunciation is rolling out to Production starting this week. Admins will be required to configure in the admin center to avoid loss of data. Instructions to configure are in this<a href=\"https://learn.microsoft.com/microsoftteams/name-pronunciation\" target=\"_blank\"> support article.</a> Please expect the admin toggle in the admin center starting the week of April 14th through April 18th, 2025.</p><p>&nbsp;We will be shipping to preview without the admin toggle however an admin toggle will be available before general availability. If there are concerns or your organisation wants to opt out, please raise an incident to address this.&nbsp;</p><p>Coming soon to Microsoft Outlook and Microsoft Teams: A name pronunciation feature on the profile card in Microsoft Teams and Microsoft Outlook. This new feature helps promote diversity by giving working colleagues relevant information about each other. Names are a crucial part of a person’s identity. The incorrect pronunciation of a person’s name can lead to anxiety and offense in some cases. Correctly pronouncing a person’s name helps to create an inclusive environment.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420329\" target=\"_blank\">420329</a>.\n</p><p>Pronunciation data is stored in each user's mailbox until the user deletes the recording. Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/m365-dr-workload-exo?view=o365-worldwide#how-can-i-determine-customer-data-location\" target=\"_blank\">Data Residency for Exchange Online - Microsoft 365 Enterprise | Microsoft Learn</a>\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, new Outlook for Windows desktop, and new Outlook for web.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-November 2024 and expect to complete by late November 2024.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late March 2025 (previously mid-January) and expect to complete by late April 2025 (previously mid-February).</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users can record and share the correct pronunciation of their name on their profile card. With a click, users can play and listen to name pronunciations recorded by their colleagues.\n</p><p>To open a profile card in Outlook, double-click a name in the <i>To </i>or <i>From</i> field in any sent or received email.\n</p><p>To open your profile card in Teams, select your profile photo in the upper right corner of the screen, and then select your name.\n</p><p>To listen to a colleague's recorded pronunciation, select the speaker icon on their profile card:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d45e28e7-82bc-4050-ae6a-24bf036228e0\" style=\"width:400px;\" alt=\"user controls\">\n</p><p>To record the pronunciation of a name, open your profile card in Outlook or Teams, and select the microphone icon:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f17d5e3c-54ff-4c29-8ee1-9cbe5535ae56\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/575bd9d8-7b01-446a-bc87-793938aff750\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This feature is off by default. As an admin, you can enable the feature in Microsoft Graph using these instructions: <a href=\"https://learn.microsoft.com/graph/api/resources/namepronunciationsettings?view=graph-rest-beta\" target=\"_blank\">namePronunciationSettings resource type - Microsoft Graph beta | Microsoft Learn</a>\n</p><p>Before rollout, we will update this post with revised documentation.\n</p><p>You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420329"
    },
    {
      "Name": "Summary",
      "Value": "Name pronunciation on the profile card is coming to Microsoft Teams and Outlook. Admins need to configure the feature to avoid data loss, with instructions provided in the support article. The rollout starts mid-November 2024 for targeted release and late March 2025 for general availability. Users can record and listen to name pronunciations."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC917748",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-14T19:50:39.017Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-24T22:59:10Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams and Microsoft Outlook: Name pronunciation on the profile card",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
