{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With the ever-increasing sophistication of cyber attacks, the increasing use of cloud-based services, and the proliferation of mobile devices, it’s essential that organizations secure access for both human and non-human identities to all on-premises and cloud resources, while continuously working to improve their security posture.\n</p><p>We're excited to share the Microsoft Entra feature release information for July–September 2024, along with third-quarter change announcements. This quarter’s updates include general availability releases for Entra ID and important change announcements on the retirement of Microsoft Azure AD Graph; enhancing the security of Apple devices in the enterprise with hardware-bound device identity; MFA enforcement on Microsoft Entra admin center, Azure portal, and Microsoft&nbsp;Intune admin center; and many more.\n</p><p>Please refer to the <a href=\"https://techcommunity.microsoft.com/t5/microsoft-entra-blog/what-s-new-in-microsoft-entra-september-2024/ba-p/4253153\" target=\"_blank\">summary of the September 2024 product updates</a>. We also communicate these updates through <a href=\"https://aka.ms/entra/whatsnew\" target=\"_blank\">What's new in Microsoft Entra ID</a>, email, and the release notes.\n</p><p>Note: The product update summary is organized by Microsoft Entra products, so you can quickly scan what’s relevant for your deployment.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/entra/fundamentals/whats-new#september-2024\" target=\"_blank\">What's new in Microsoft Entra ID?</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The September 2024 Microsoft Entra update includes general availability releases, retirement of Azure AD Graph, security enhancements for Apple devices, MFA enforcement, and more. Details are communicated via blog, email, and release notes, organized by product for easy reference."
    }
  ],
  "EndDateTime": "2024-11-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC910988",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-14T23:00:29.89Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-14T23:00:00Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "What's new in Microsoft Entra - September 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
