{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 21, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>With this feature, sensitive data in files that are stored in network shares and mapped network drives will be protected by Data Loss Prevention (DLP) policies across Mac endpoints.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=410397\" target=\"_blank\">410397</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early March 2025 (previously early February) and expect to complete by mid-March 2025 (previously mid-February).\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 (previously early March) and expect to complete by mid-April 2025 (previously mid-March).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, you can configure DLP policies to prevent your users from taking egress actions such as copy to USB, copy to clipboard, and more for sensitive files stored on network shares. This brings protection for sensitive content on files in network shares with the same protection behavior as a file on mounted hard drive. You will also an alert once any policy is matched against such actions. You can also configure exclusions for certain network shares if you desire.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Get started with Data Loss Prevention in the <a href=\"https://purview.microsoft.com/\" target=\"_blank\">Microsoft Purview compliance portal</a>.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/compliance/dlp-configure-endpoint-settings?view=o365-worldwide#network-share-coverage-and-exclusions-preview\" target=\"_blank\">Configure endpoint DLP settings | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "410397"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Data Loss Prevention will now protect sensitive data in network shares and mapped network drives on Mac endpoints. The rollout timeline has been updated: Public Preview in early March 2025 and General Availability in early April 2025. Configure DLP policies and exclusions via the Microsoft Purview compliance portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC911624",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-21T17:14:03.397Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-15T23:43:13Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: ​Network share coverage and exclusion support on Mac endpoints​",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
