{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 17, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Teams: Anonymous unauthenticated users will be able to join watermarked meetings and have access to all meeting content, including video. This message applies to Teams on Windows desktop, Teams on the web, Teams for Android/iOS, and Teams Rooms.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 (previously early December) and expect to complete by late March 2025 (previously late December).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Unauthenticated users who join a watermarked meeting can hear the meeting audio only.\n</p><p>After this rollout:\n</p><ul><li>Admins: The watermark policy in the Teams admin center will remain the same as it is now, because anonymous guest support will not be tied to a policy.\n</li><li>Users: Anonymous users can join as before the rollout. They will see a watermark of their guest name they entered on the pre-join screen and will be able to access all meeting content.\n</li></ul><p>An anonymous user will be asked to enter their name on the pre-join screen:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qnQr?ver=c094\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After the anonymous user joins the meeting, they see the name they entered on the pre-join screen as the watermark:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qiPi?ver=d661\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This feature will be on by default. If you do not want guest name as the watermark for anonymous users, you can run a Microsoft PowerShell script for these guests to have access to audio only in meetings.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/MicrosoftTeams/watermark-meeting-content-video\" target=\"_blank\">Require a watermark for sensitive Teams meetings - Microsoft Teams | Microsoft Learn</a>&nbsp;(will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a watermark feature for anonymous meeting join, with a rollout starting mid-March 2025. Unauthenticated users will see their entered name as a watermark and access all meeting content. Admins' watermark policies remain unchanged, while users will experience enhanced access. Preparation involves a default-on feature, with an option to restrict unauthenticated users to audio only via PowerShell script."
    }
  ],
  "EndDateTime": "2025-04-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC918575",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-17T19:35:15.943Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-25T23:07:43Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Watermark for anonymous meeting join",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
