{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>You are receiving this message because our reporting indicates you may be using new Microsoft Outlook for Windows in your organization.\n</p><p>Coming soon for new Outlook for Windows: an updated <a href=\"https://support.microsoft.com/windows/people-app-help-144c4373-fa32-da81-f8b4-ee87589c509c\" target=\"_blank\">People Hub</a> with a modern contact management experience that will retrieve and display high-quality, complete, coherent, and up-to-date information about the people that matter the most to you.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=413114\" target=\"_blank\">413114</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by end of January 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late February 2025 and expect to complete by mid-March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: The People Hub can contain multiple entries for the same contact and organizational profile information may not be included.\n</p><p>After this rollout: The People Hub will contain a unified view of a person with profile enriched contacts and auto-hidden duplicates. To access the People Hub, select the <i>People</i> icon from the left side of the new Outlook for Windows.\n</p><p>As part of the new contact management experience, your contacts will automatically be enriched with profile information from your organization's directory and other sources. We have updated the profile card with a new<i> Manage sources</i> feature where a user can manage links to the contact sources:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/452846d2-a6a4-4200-b551-289fa22ad5ec\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After a user selects <i>Manage sources,</i> the user can manually <i>Unlink</i> contact sources, <i>Edit </i>contact sources that are not from their organization, and manage sources.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/31846ff3-7a13-4253-9218-157d23f2db23\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Also, to improve the contact management experience, contacts that are exact duplicates will be automatically hidden.\n</p><p>These changes will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>After the feature is rolled out, please ensure that you are using new Outlook for Windows to get access to the updated People Hub.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/add-find-edit-or-delete-a-contact-in-outlook-e1dc4548-3bd6-4644-aecd-47b5728f7b0d\" target=\"_blank\">Add, find, edit, or delete a contact in Outlook - Microsoft Support</a> (will be updated when rollout begins)</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "413114"
    },
    {
      "Name": "Summary",
      "Value": "The new Outlook for Windows will soon update the People Hub, offering a modern contact management experience with enriched profiles and auto-hidden duplicate contacts. Rollouts start mid-January 2025 for Targeted Release and late February 2025 for General Availability. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC927963",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-07T23:45:05.7Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-07T23:44:54Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows: People Hub improvements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
