{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making it easier for users to access the Microsoft Places app. This app is accessible <a href=\"https://aka.ms/places\" target=\"_blank\">on the web</a>, or as an app inside Teams, Outlook and the Microsoft 365 app.</p><p>The Microsoft Places app helps users coordinate their in-office days with colleagues.  When work location is shared from OWA or the new Outlook Calendar, users will see others' work locations and can decide the best days to be in the office for in-person collaboration.\n</p><p>Users with Teams Premium will have access to additional features in the Microsoft Places app:\n</p><ul><li>Team Guidance for leaders to communicate which days their team should plan to be in the office and what the priorities are for each in-office day. Providing a purpose for team days in the office gives you another reason to come into the office.  Team Guidance will be ON for all Teams Premium users.  Admins can selectively turn off this feature following these <a href=\"https://learn.microsoft.com/microsoft-365/places/powershell/set-placessettings\" target=\"_blank\">instructions</a>. \n</li><li>Places Explorer to discover what's happening in the office, who's in the office, and find places like services and amenities.  Admins will need to <a href=\"https://learn.microsoft.com/microsoft-365/places/get-started/quick-setup-buildings-floors\" target=\"_blank\">configure buildings and floors</a> for Places Explorer to show building details.\n</li></ul><p>\n</p>\n<p></p>\n<p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early December 2024 and complete by mid-December 2024.</p><p><b>How this will affect your organization:</b></p><p>With this change, the Places app will be accessible by default for all users by navigating to this <a href=\"https://aka.ms/places\" target=\"_blank\" style=\"\">URL</a>, but you need to take action to make it easier to discover inside Teams,&nbsp; Outlook and the Microsoft 365 app. To improve the user experience, admins can <a href=\"https://learn.microsoft.com/microsoftteams/teams-app-setup-policies#add-apps-to-your-teams-client\" target=\"_blank\" style=\"\">set up policies</a> to pin the Places app for your users.</p><p><b>What you need to do to prepare:</b></p><p>If you were part of the Microsoft Places Preview and followed the <a href=\"https://learn.microsoft.com/microsoft-365/places/deployment-guide-for-places\" target=\"_blank\">onboarding instruction</a>, access to the Places app is likely restricted to users in the 'PlacesUsers' Security Group. You need to take action to broaden access to other users in your tenant, as described <a href=\"https://learn.microsoft.com/en-us/microsoft-365/places/powershell/set-placessettings#-enableplaceswebapp\" target=\"_blank\">here</a>.&nbsp;</p><p>If you were not part of the Preview and want to restrict access to the Places app, you can do so today by using PowerShell:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/places/powershell/set-placessettings#-enableplaceswebapp\" target=\"_blank\">Set-PlacesSettings - Feature Parameters</a>. Access restriction will apply to the app on the web and inside Teams, Outlook and Microsoft 365 app.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Places app will be enabled by default, facilitating users to coordinate in-office days with colleagues. It's accessible via web, Teams, Outlook, and Microsoft 365 app, with additional features for Teams Premium users. Rollout starts early December 2024. Admins should set up policies and configure access."
    }
  ],
  "EndDateTime": "2025-01-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC922620",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-10-31T22:57:38.56Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T22:57:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Places app ON by default",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
