{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 19, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Loop – Common Admin Management Tasks Enabled for all new Loop workspaces, and then all existing Loop workspaces.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421613\" target=\"_blank\">421613</a></p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out late January 2025 (previously late December) and expect to complete by late April 2025 (previously late March).</p><p><b>How this will affect your organization:</b></p><p>Admins can manage membership, ownership, deletion, and restoration of Loop workspaces in the SharePoint Embedded admin center or PowerShell. </p><p>Changes to membership, ownership, and container deletions, and restorations made to Loop workspaces created <b>after</b> December 2024 will be visible in the Loop experience beginning in December 2024.</p><p>Changes to membership, ownership, and container deletions, and restorations made to Loop workspaces created <b>before</b> December 2024 will be visible in the Loop experience by March 2025.</p><p>You can read more about the existing admin capabilities:</p><ul><li><a href=\"https://learn.microsoft.com/sharepoint/dev/embedded/concepts/admin-exp/consuming-tenant-admin/ctaux\" target=\"_blank\">Manage SharePoint Embedded containers in SharePoint Admin Center</a></li><li><a href=\"https://learn.microsoft.com/sharepoint/dev/embedded/concepts/admin-exp/consuming-tenant-admin/ctapowershell\" target=\"_blank\">SharePoint Embedded container management in PowerShell</a></li></ul><p><b>What you need to do to prepare:</b>\n</p><p>There is nothing you need to do to prepare. When the feature rolls out, the functionality will become available in your tenant.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421613"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Loop's common admin management tasks will be enabled for all new and existing workspaces, with a rollout starting in late January 2025 and ending in April 2025. Admins will manage Loop workspaces via SharePoint Embedded admin center or PowerShell, with changes visible in Loop experience from December 2024 for new workspaces and by March 2025 for existing ones. No preparation is needed for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC929029",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-19T22:43:01.4Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-08T23:25:30Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Loop – Common Admin Management Tasks Enabled for all Loop workspaces",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
