{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Teams and Microsoft Places: New ways for users to check in to meeting rooms and prevent rooms from automatically releasing. After this rollout, customers will be able to check in through Teams Chat and email for all enabled rooms. The pre-rollout options to check in through Teams panels or Teams Rooms will continue.\n</p><p>This message is related to MC922620 <i>Microsoft Places app ON by default</i> (October 2024)\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-November 2024 and expect to complete by late November 2024 (previously late November).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users are able to check in and auto-release rooms through these options:\n</p><ul><li>An attendee can check in through a Teams panel.\n</li><li>An attendee can check in by joining a meeting through Microsoft Teams Rooms.\n</li></ul><p>After this rollout, check in and auto-release will need Teams panels on Teams app version 1449/1.0.97.2024061108 or higher. Users can choose from these three options to check in to a room:\n</p><ul><li>An attendee can check in through a Teams panel. (Same as before the rollout)\n</li><li>An attendee can check in by joining a meeting through Microsoft Teams Rooms. (Same as before the rollout)\n</li><li>The organizer or an attendee can check in through Teams Chat. (New)\n</li></ul><p>Any rooms that currently have auto-release and check-in enabled through Teams panels will automatically receive these additional check-in options without any extra setup required.</p><p>Please note: Check-in and auto-release is off by default. Once it is enabled, the following entry points are on by default:</p><p>Check in through Teams Panel:</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/05e01a4c-4320-4625-a3d8-78f5f5ae7297\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Check in through Microsoft Teams Rooms:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7dc0f770-f5f3-4569-920f-7f72fab27f50\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Left: Check in through Teams Chat at the start of the meeting. Right: Check in is successful:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/739da9a0-5468-460b-b293-609d67979bff\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Check in through email for in person meetings:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/143d9c9a-2ef8-4e9e-b37c-16a719d35a67\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>For all check in options, users will see that the room has been released in Chat:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/11944f25-0331-4026-be9c-8f43fd55d15f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>Note:</b> Auto-release and check in does not currently support or automatically release the room for in-person meetings and non-Teams online meetings such as Zoom or Webex. These features will come soon.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Lean more: <a href=\"https://learn.microsoft.com/microsoft-365/places/enable-auto-release\" target=\"_blank\">Enabling Auto Release for your rooms - Microsoft 365 Places | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details an update for Microsoft 365 app, introducing auto release and check-in features for Microsoft Places, with a rollout starting mid-November 2024. Users will have new check-in options through Teams Chat and email, alongside existing methods. The update is related to MC922620 and will be ON by default."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC925999",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-12T18:27:03.99Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-05T17:44:50Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft 365 app: Auto release and check-in for Microsoft Places",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
