{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 22, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>With this rollout, we are delivering automatic location updates with building details on <a href=\"https://learn.microsoft.com/en-us/microsoftteams/rooms/bookable-desks\" target=\"_blank\">bookable desks</a> and <a href=\"https://learn.microsoft.com/en-us/microsoftteams/rooms/bring-your-own-device\" target=\"_blank\">bring your own device (BYOD) rooms</a> to make it easier for users to keep their workplace presence up to date and connect with others in the office.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422807\" target=\"_blank\" style=\"\">422807</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early January 2025 (previously early December) and expect to complete by mid-January 2025 (previously mid-December).\n</p><p>General Availability (Worldwide): We will begin rolling out early mid-January 2025 (previously early January) and expect to complete by late January 2025 (previously mid-January).</p><p><b>How this will affect your organization:</b>\n</p><p><a href=\"https://learn.microsoft.com/microsoftteams/rooms/bookable-desks\" target=\"_blank\">Bookable desks</a> refers to unassigned seats in the office that are equipped with devices such as monitors or other peripherals. To set up bookable desks, admins must associate these devices to a workspace account through the Teams Rooms Pro Management portal. Similarly, to set up <a href=\"https://learn.microsoft.com/microsoftteams/rooms/bring-your-own-device\" target=\"_blank\">BYOD rooms</a> (rooms without Microsoft Teams Rooms that are equipped with devices such as a speaker puck or other peripherals), admins must associate these devices to a room account through the Teams Rooms Pro Management portal. Finally, in order for a user’s work location to be updated to a specific building, an admin must onboard their buildings<a href=\"https://learn.microsoft.com/en-us/microsoft-365/places/get-started/quick-setup-buildings-floors?branch=main\" target=\"_blank\">&nbsp;</a>and parent the workspace or room resource account to the buildings.</p><p>After these steps are complete, admins have the <a href=\"https://learn.microsoft.com/en-us/powershell/module/teams/new-csteamsworklocationdetectionpolicy?view=teams-ps\" target=\"_blank\">option to opt-in</a> for automatic location updates. This can be enabled at a tenant level or for a specific user group. Once admins have enabled this feature, users will have the opportunity to opt-in. They can do so in Teams under <i>Settings &gt; Privacy</i>. After users have opted-in, their work location will automatically update to a specific building when they connect to a bookable desk or BYOD room. Note that if a workspace or room resource account does not have a building, the user's work location will automatically update to “In the office” upon plug-in rather than update to the specific building</p><p>To facilitate discovery of this feature, after tenant opt-in, the following banner will be shown the first time a user plugs into a bookable desk or BYOD room.</p><p><span style=\"background-color: rgb(255, 255, 0);\"> \n</span></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/be3a63d0-1058-4050-8164-a97cfc72fb47\" style=\"width: 550px;\"><br></p><p>Once a user enables automatic location updates, the following banner will be displayed only once for the user’s convenience and confirmation that the location update was successful on their first subsequent plug-in to bookable desks or BYOD room.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/8f79a81e-12b8-40bf-a935-c730b7c0c832\" style=\"width: 550px;\"><span style=\"background-color: rgb(255, 255, 0);\"><br></span></p><p><span style=\"background-color: rgb(255, 255, 0);\"> \n</span></p><p><b>What you need to do to prepare:</b>\n</p><p>To prepare for this feature, we strongly recommend communicating this new feature to your users and admin team and sharing instructions if needed. Please note that if an admin or user had previously opted in when the automatic work location detection only updated to “In the office” (MC808158), there is no additional setting to enable for one’s work location be automatically updated with building information. The same setting will carry over.</p><p>For more information about sharing location, visit<a href=\"https://learn.microsoft.com/microsoftteams/user-work-location-in-teams#user-settings-to-edit-location-sharing\" target=\"_blank\">&nbsp;User experience with location details in Teams</a>.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422807"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-02-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC921116",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-22T17:54:53.09Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-29T22:48:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Automatic location updates with building details for BYOD rooms and bookable desks",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
