{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In late 2023, Microsoft Entra started leveraging WhatsApp as an alternate channel to deliver multifactor authentication (MFA) one-time passcodes (OTPs) to users in India and Indonesia. We saw improved deliverability, completion rates, and satisfaction when leveraging the channel in both countries. The channel was temporarily disabled in India in early 2024. Starting early December 2024, we will be re-enabling the channel in India and expanding its use to additional countries.&nbsp;&nbsp;</p><p><b>When this will happen:</b>\n</p><p>Starting December 2024, users in India and other countries may start receiving MFA text messages via WhatsApp. Only users that are enabled to receive MFA text messages as an authentication method and already have WhatsApp on their phone will get this experience. If a user with WhatsApp on their device is unreachable or doesn’t have internet connectivity, they will quickly fall back to the regular SMS channel. In addition, users receiving OTPs via WhatsApp for the first time will be notified of the change in behavior via SMS text message.&nbsp;</p><p>The sender agent in WhatsApp where users will see the OTPs will be branded as Microsoft with a verified checkmark.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b5d2a4ec-8705-4526-b501-5df184c2a71c\" style=\"width: 175px;\"><span style=\"background-color: rgb(214, 165, 189);\"><br></span></p><p><b>How this will affect your organization:</b>\n</p><p>If you’re a Microsoft Entra workforce customer and currently leverage the text-message authentication method, we recommend you notify your helpdesk about this upcoming change.\n</p><p>Additionally, if you don’t want your users to receive MFA text messages through WhatsApp, you may <a href=\"https://learn.microsoft.com/entra/identity/authentication/concept-authentication-methods-manage\" target=\"_blank\">disable</a> text messages as an authentication method in your organization. Please note that we highly <a href=\"https://techcommunity.microsoft.com/t5/microsoft-entra-blog/it-s-time-to-hang-up-on-phone-transports-for-authentication/ba-p/1751752\" target=\"_blank\">encourage</a> organizations move to using more modern, secure methods like Microsoft Authenticator and passkeys in favor of telecom and messaging app methods.</p><p>This feature update is available by default.</p><p>\n</p><p>For more information, see <a href=\"https://learn.microsoft.com/en-us/entra/identity/authentication/concept-authentication-phone-options#text-message-verification\" target=\"_blank\">Phone authentication methods in Entra ID</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting December 2024, Microsoft Entra will reintroduce WhatsApp as a channel for delivering MFA OTPs in India, with expansion to more countries. Users with WhatsApp will receive OTPs there, with SMS as a fallback. Organizations can disable this feature or opt for more secure methods like Microsoft Authenticator."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC926195",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-11-06T00:41:51.78Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-06T00:41:43Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Entra ID: Expansion of WhatsApp as an MFA one-time passcode delivery channel",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
