{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Coming soon for new Outlook for Windows and web: Easily access your most-used folders by pinning a <i>Favorites </i>section&nbsp;at the top of the Outlook folder list on the left side of the screen. This feature streamlines navigation, ensuring your important folders are always in easy reach. Before this rollout, users can add a <i>Favorites </i>section that scrolls down when users navigate down the list. After this rollout, users can choose to keep the <i>Favorites </i>section pinned to the top of the list, and only the rest of the folders will scroll.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=401341\" target=\"_blank\">401341</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release:&nbsp; We will begin rolling out mid-November 2024 and expect to complete by mid-December 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-December 2024 and expect to complete by mid-January 2025.\n</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out mid-January 2025 and expect to complete by mid-February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, users can pin or unpin the <i>Favorites </i>section in two ways.\n</p><p>In the <i>Favorites </i>section of the folder list (on the left of the screen), right-click the three-dot menu and select <i>Pin favorites</i> or <i>Unpin favorites:</i>\n</p><p><i><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/92a9e268-4ceb-4de4-a753-0792e2f647a8\" style=\"width: 400px;\" alt=\"user controls\"></i>\n</p><p>On the Outlook ribbon, select the <i>View tab &gt; Folder pane &gt; Favorites &gt; </i>select <i>Pin favorites </i>or <i>Unpin favorites:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1bf4b395-58ce-4001-8606-bc55ec7e9ce9\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be available by default for users to choose to pin and unpin the <i>Favorites </i>section.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-favorites-in-outlook-8913f2d0-b167-48cc-8983-86fa9b0d945f\" target=\"_blank\" style=\"\">Use Favorites in Outlook - Microsoft Support</a> (will be updated before rollout)\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "401341"
    },
    {
      "Name": "Summary",
      "Value": "Outlook for Windows and web will soon allow users to pin a Favorites section at the top of the folder list for easy access. Rollout begins mid-November 2024, with various completion dates for different releases. Users can pin/unpin Favorites via the folder list or Outlook ribbon. No admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC926191",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-06T00:39:25.6Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-06T00:39:10Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows and web: Pin the Favorites section",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
