{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: New security features for Microsoft Loop for organizations that have enabled sensitivity labels (also known as Microsoft Information Protection or MIP).\n</p><p>Before this rollout, Microsoft Loop supports users or admins adding&nbsp;<b>item-level sensitivity labels</b> on all .loop files (including Loop components, Loop pages, and Copilot pages) in the Microsoft Loop app (on the web and for iOS/Android) and new Microsoft Outlook for Windows and Outlook for the web, classic Outlook for Windows, Outlook for Mac, Outlook on Android and iOS.\n</p><p>With this rollout, we will support:</p><ul><li>Sensitivity labels on Loop workspaces at the storage container-level. Note: Sensitivity labels are also known as Microsoft Information Protection (MIP).</li></ul><p>Coming in future rollouts: \n</p><ul><li>Item-level sensitivity labels in Loop components and collaborative meeting notes in Microsoft Teams (on the web, on Windows desktops, and on iOS/Android)\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=111225\" target=\"_blank\">111225</a>.\n</p><p><b>When this will happen:</b>\n</p><p><i>Container-level Sensitivity Labels for Loop workspaces: </i>General Availability (Worldwide): We began rolling out late October 2024 and expect to complete by early November 2024 (Loop app for the web)\n</p><p><i>Container-level Sensitivity Labels for Loop workspaces:</i> General Availability (Worldwide): We will begin rolling out in November 2024 and expect to complete by early December 2024 (Loop apps for iOS/Android)\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, container-level sensitivity labels on Loop workspaces will be available by default.\n</p><p>Admins do not need to do anything to prepare for this rollout. If your tenant has sensitivity labels configured at the item-level for <i>Files</i>, you or your users will be able to apply these labels to all Loop files (including Loop components, Loop pages, and Copilot pages). If your tenant has sensitivity labels enabled for <i>Groups &amp; sites</i>, then you or your users will be able to apply these labels and policies to your Loop workspaces.\n</p><p>Applying a sensitivity label to a Loop workspace:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qrSw?ver=8782\" style=\"width: 400px;\" alt=\"“admin\" controls”=\"\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/purview/sensitivity-labels-loop\" target=\"_blank\">Use sensitivity labels with Microsoft Loop | Microsoft Learn</a></li><li>MC736437 <i>Microsoft Loop: Guest Sharing</i> (March 2024)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "111225"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Loop will soon introduce container-level sensitivity labels, enhancing security features for organizations using Microsoft Information Protection. This update, part of Microsoft 365 Roadmap ID 111225, will roll out between late October and early December 2024, requiring no admin action prior to rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC923176",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-01T18:31:42.937Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-01T18:31:29Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Loop: Sensitivity labels at the container level",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
