{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 11, 2024: We have updated the content. Thank you for your patience.</p><p>When an external network participant is invited to join a Microsoft Viva Engage external network, they receive an invitation email with an option to accept. Before this configuration change, all invited external users receive community conversations and emails, even if their invitation is in a pending or inactive state, allowing them to receive updates without completing registration. An E3/E5 license is required to use this feature.\n</p><p>After this change, pending or inactive users will no longer receive community conversations or emails unless they accept the invitation and complete the registration process. This change prioritizes active engagement, ensuring only registered users access conversation updates and reducing the volume of emails sent to non-registered users. External users who have activated their accounts will receive conversations and community emails.\n</p><p>We will begin rolling out this change early December 2024 and expected to complete by early January 2025. Extensions will not be provided for this configuration change.\n</p><p><b>How this will affect your organization:</b>\n</p><p>For organizations that frequently post in the Viva Engage external network expecting external recipients to engage via email without registering, this adjustment may impact their communication flow. However, we expect this effect to be minimal for most customers.\n</p><p>Pending users will need to actively accept their invitation by selecting the link in the invitation email or manually entering the URL in their browser to complete registration. After the user registers, they will begin to receive community conversations and emails.\n</p><p>An example of an invitation to join a Viva Engage external network:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/351fbd92-57ea-4ac9-8bd2-0568d2d98891\" style=\"width: 400px;\" alt=\"user email\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically by the specified date. No admin action is required. Please notify your users about this change and update relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will update to only send community emails to registered users. Previously, unregistered invited users could receive emails. Starting December 2024, only those who accept the invitation and complete registration will receive updates. Organizations should inform users and update documentation accordingly."
    }
  ],
  "EndDateTime": "2026-02-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC928016",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-12T02:12:31.977Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-08T00:56:21Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Unregistered users in an external network will not receive community emails",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
