{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 11, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Purview compliance portal | Communication Compliance: A notification banner designed to enhance transparency will alert users when keywords embedded in hidden content (such as hyperlinks or encoded strings) trigger a compliance policy match. With this rollout, investigators will be able to quickly recognize that some or all keyword matches are not immediately visible in the main content body, saving time and ensuring a more efficient triage experience.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=417483\" target=\"_blank\">417483</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-November 2024 (previously late October) and expect to complete by late November 2024 (previously early November).\n</p><p>General Availability (Worldwide): We will begin rolling out early January 2024 (previously mid-November) and expect to complete by mid-January 2024 (previously early December).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users and investigators are not notified if policy matches occur for hidden text.\n</p><p>After this rollout, users will be notified if any policy matches in a message are concealed and not readily discernible in the main content.\n</p><p>This feature is available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408533"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance will soon include a notification banner to alert users when hidden content triggers a policy match, enhancing transparency. Rollout updates have been made, with Public Preview and General Availability dates adjusted. This feature will be available by default with no admin action required before the rollout. Microsoft 365 Roadmap ID 417483."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC921117",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-15T00:18:03.32Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-29T22:49:09Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview |Communication Compliance: Customize policies with language-specific trainable classifier conditions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
