{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Starting in November 2024, Microsoft Copilot 365 in Glint will support the summarization of employee survey comments. Copilot in Viva Glint is designed to answer questions about your survey comments, acting as your partner for all comment analysis. It can summarize comments, identify key themes, provide summaries by demographics and items, and highlight actions employees are requesting. A Viva Glint license is required to use this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=324079\" target=\"_blank\">324079</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We began rolling out late June 2024 and expect to complete by late November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late November 2024. \n</p><p><b>How this will affect your organization:</b> \n</p><p>After this rollout, Copilot will have access to employee survey comments in order to analyze and summarize comments. \n</p><p>The content summarization feature must be configured by Glint company admins in the Glint web app. Copilot in Viva Glint defaults to <i>Off </i>for all user roles, including company admins. Every user who should have Copilot enabled needs to be placed into a user role category with that permission.   \n</p><p><b>What you need to do to prepare:</b>\n</p><p><i>The Copilot feature in Viva Glint reports</i>\n</p><p>Log in to the Glint dashboard and select the <i>Copilot</i> button:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1quue?ver=358d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Navigate to <i>Reports i</i>n the top menu bar and use Copilot in Viva Glint for a specific report:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qph3?ver=4b35\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This rollout will happen automatically by the specified date. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation. \n</p><p>Learn more \n</p><ul><li><a href=\"https://learn.microsoft.com/viva/glint/copilot/copilot-admin-intro\" target=\"_blank\">Introduction to Microsoft 365 Copilot in Viva Glint (preview) | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/copilot/deployment-permissions\" target=\"_blank\">Deployment and administrator setup for Microsoft 365 Copilot in Viva Glint (preview) | Microsoft Learn</a> \n</li><li><a href=\"https://learn.microsoft.com/viva/glint/copilot/admin-enable\" target=\"_blank\">Administrator enablement for Microsoft 365 Copilot in Viva Glint (preview) | Microsoft Learn</a> \n</li><li><a href=\"https://learn.microsoft.com/viva/glint/setup/copilot-privacy\" target=\"_blank\">Data, privacy, and security compliance for Microsoft 365 Copilot in Viva Glint (preview) | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/glint/setup/copilot-managers\" target=\"_blank\">How managers use Microsoft 365 Copilot in Viva Glint | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/glint/setup/copilot-faqs\" target=\"_blank\">Microsoft 365 Copilot in Viva Glint-FAQs (preview) | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "324079"
    },
    {
      "Name": "Summary",
      "Value": "Starting November 2024, Microsoft Copilot 365 in Viva Glint will summarize employee survey comments, identify themes, and suggest actions. It requires a Viva Glint license and admin configuration. Public Preview begins June 2024, with General Availability in November 2024. Roadmap ID: 324079."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC922629",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-31T23:06:55.7Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T23:06:46Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot 365 in Viva Glint will support the summarization of employee survey comments",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
