{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We previously announced the release of a feature in Teams via a Message Center post: MC792605 - <i>Microsoft Teams: Auto-create Microsoft Loop workspaces to share meeting content</i>. We shared that Teams meeting organizers of recurring meetings will be prompted in chat to create a Loop workspace after their meeting is completed. The feature helps users gather shared meeting content into a Loop workspace.</p><p>In response to your feedback, we are improving the ability for you to control this feature through Microsoft 365 Cloud Policy.</p><p><b>When this will happen:</b></p><p>Available now.</p><p><b>How this affects your organization:</b></p><p>We are now responding to feedback from you, and the button to create a Loop workspace from Teams meeting chat will not be visible if the Loop workspace creation is disabled on your tenant. This is done by setting the Microsoft 365 Cloud Policy \"Create and view Loop workspaces in Loop\" to \"disabled\".</p><p><b>What you need to do to prepare:</b></p><p>Review your current configuration and make changes as appropriate for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details an update to Microsoft Teams, respecting Cloud Policy settings for the 'Auto-create Loop workspaces for Teams meetings' feature, now allowing control through Microsoft 365 Cloud Policy. It is available now, and organizations are advised to review their configurations."
    }
  ],
  "EndDateTime": "2024-12-16T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC929040",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-08T23:34:44.94Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-08T23:34:21Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Fix to respect Cloud Policy settings for Auto-create Loop workspaces for Teams meetings feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
