{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Loop app now provides a personal workspace to all users, which is shared with Copilot Pages. This personal workspace is a user-owned SharePoint Embedded container, one per user. Governance, lifecycle management and compliance processes are similar to that user's OneDrive. The existing Ideas workspace will begin functioning as a shared Loop workspace because it is not a user-owned container.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422727\" target=\"_blank\">422727</a> and <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422729\" target=\"_blank\">422729</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-December 2024 and expect to complete by late January 2025.</p><p><b>How this will affect your organization:</b></p><p>Microsoft 365 Roadmap ID 422727: The personal workspace is a user-owned SharePoint Embedded container and follows similar governance, lifecycle management and compliance processes to the user's OneDrive, details about departure and storage can be found <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-workspaces-storage-permission?view=o365-worldwide#loop-workspace-membership-and-microsoft-365-groups\" target=\"_blank\">here</a>.</p><p>Microsoft 365 Roadmap ID 422729: The existing Ideas workspace, while positioned in the product as a personal workspace, uses the shared Loop workspace infrastructure and is not managed with the user account. As a result, with the arrival of the truly personal workspace, the existing Ideas workspace will begin functioning as a shared Loop workspace in the user's experience.</p><p><b>What you need to do to prepare:</b>\n</p><p>There is nothing you need to do to prepare. These changes will roll to your tenant automatically.</p><p>If you wish to disable the creation of Loop workspaces, you can configure it using the admin policies found <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-components-configuration?view=o365-worldwide\" target=\"_blank\">here</a> and <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-workspaces-configuration?view=o365-worldwide\" target=\"_blank\">here</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422727,422729"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Loop app is introducing a personal workspace for users, akin to a user-owned SharePoint container, with governance and compliance similar to OneDrive. The Ideas workspace will become a shared Loop workspace. Rollout begins mid-December 2024 and ends late January 2025. No action is required for preparation, but workspace creation can be disabled via admin policies."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC929028",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-08T23:25:11.35Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-08T23:25:00Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 app: Microsoft Loop – New personal Loop workspace",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
