{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We announced the launch of Meeting Prep for Financial Services as public preview in Microsoft. We’re proud to be partnering with the London Stock Exchange Group (LSEG) to bring you this new app, designed to revolutionize how investment bankers prepare for meetings.</p><p><b>When this will happen:</b></p><p>Preview: Available now</p><p>General Availability (Worldwide): We will begin rolling out in early December 2024 and expect to complete by mid-December 2024.</p><p><b>How this affects your organization:</b></p><p>Why Meeting Prep?<br></p><p>For investment bankers, being prepared for meetings is crucial. Meeting Prep centralizes all necessary information, ensuring nothing is overlooked, saving time and effort.</p><p>Key features:<br></p><ul><li>Holistic information: Integrates industry-specific data from specialized providers with personalized insights from internal documents, emails, and meeting summaries.</li><li>Comprehensive reports: Generate detailed reports with key highlights, trending topics, financial metrics, analyst ratings, competitor analysis, and management information.</li><li>Real time updates: Refresh data as needed to ensure you have the most current information.<br></li><li>Responsible AI: Transparent sources and feedback options for all AI-generated features.&nbsp;<br></li></ul><p>How it works:&nbsp;<br></p><ol><li>Add Meeting Prep: Open a pre-scheduled meeting and add Meeting Prep from the Teams App marketplace.</li><li>Select the company that you want to create a report for. </li><li>Select the data categories that should be included.</li><li>Create a report to get a comprehensive view, including all the information you need, with AI-generated summaries and insights.</li></ol><p>Licensing requirements in order to use Meeting Prep:<br></p><ul><li>Teams Standard: Microsoft 365 E3 and above OR Microsoft 365 Business basic and above, with Teams.</li><li>LSEG Workspace: To create reports using content from the data provider, users must have a valid LSEG Workspace license. The <a href=\"https://www.lseg.com/content/dam/data-analytics/en_us/documents/support/workspace/service-description.pdf\" target=\"_blank\">LSEG Workspace Service Description</a> provides additional information about workspace licenses. For more information, go to<a href=\"https://www.lseg.com/en/data-analytics/products/workspace\" target=\"_blank\"> LSEG Workspace</a>.&nbsp;</li></ul><p>In addition,&nbsp;Copilot for Microsoft 365 and/or Microsoft Teams Premium: not required for public preview but recommended. For GA,&nbsp;Copilot for Microsoft 365 will be required. With these licenses, users will be able to access summaries of previous meetings, as part of the Suggested content section of the report. To learn more, go to <a href=\"https://www.microsoft.com/microsoft-365/microsoft-copilot\" target=\"_blank\">Microsoft Copilot for Microsoft 365</a>.<br></p><p><b>What you can do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate. For more information on how to set up Meeting Prep, go to <a href=\"https://learn.microsoft.com/dynamics365/industry/financial-services/configure-meeting-prep?toc=%2Findustry%2Ffinancial-services%2Ftoc.json&amp;bc=%2Findustry%2Fbreadcrumb%2Ftoc.json#configure-meeting-prep-in-the-tenant\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Configure Meeting Prep</a>. To learn more, go to <a href=\"http://aka.ms/meeting-prep\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Overview of Meeting Prep for Financial Services (preview)</a>.</p><p><br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Meeting Prep for Financial Services is now in public preview, offering investment bankers a centralized app for meeting preparation. It integrates data from various sources with AI insights and is available now, with general availability starting early December 2024. Licensing includes Microsoft 365 E3/Business Basic and LSEG Workspace."
    }
  ],
  "EndDateTime": "2025-02-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC920310",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-28T22:56:48.907Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-28T22:56:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Introducing Meeting Prep for Financial Services (Preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
