{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 13, 2025: We have updated the timeline. Thank you for your patience.\n</p><p>Manage retention and deletion workflows for user-owned Loop workspaces such as Copilot Pages and the Loop personal workspace when users leave the organization.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421612\" target=\"_blank\">421612</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early August 2025 (previously early June) and expect to complete by late November 2025 (previously late August).</p><p><b>How this will affect your organization:</b></p><p>Once available, admins will be able to manage retention and deletion workflows for user-owned Loop workspaces such as Copilot Pages and the Loop personal workspace when users leave the organization. Updates will include the ability to provide temporary access to other employees or administrators to save important data before deletion policies take effect.</p><p>More details will become available closer to the release date.</p><p><b>What you need to do to prepare:</b></p><p>There is nothing you need to do to prepare. These changes will roll to your tenant automatically.\n</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421612"
    },
    {
      "Name": "Summary",
      "Value": "Starting August 2025, admins can manage retention and deletion workflows for user-owned Microsoft Loop workspaces when users leave, including temporary access for data saving. The rollout will complete by November 2025, with no preparation needed from organizations."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-01-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC929014",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-13T13:30:41.913Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-08T23:19:42Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Loop – Departed User Content Workflows for User-Owned Loop workspaces",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
