{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Cloud update for Microsoft 365 apps will integrate with Microsoft Purview Audit (Standard).\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420932\" target=\"_blank\">420932</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early-November 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Cloud update provides a modern update management solution for Microsoft 365 Apps. Use cloud update to address common servicing needs with features such as custom rollout waves, exclusion windows, pause, and rollback. Cloud update works for organizations of any size, handling compatibility concerns for larger environments and offering simpler controls for smaller businesses.\n</p><p>Changes made to cloud update will be stored in Purview Audit, which allows you as an admin to search and review change history. These logs will be available to Purview Audit (Standard) users.\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b><\n/p><p>For additional information about the Cloud Update service:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/cloud-update\" target=\"_blank\">Overview of cloud update in the Microsoft 365 Apps admin center</a>.\n</p><p>For more information about Purview Audit: <a href=\"https://learn.microsoft.com/purview/audit-solutions-overview\" target=\"_blank\">Learn about auditing solutions in Microsoft Purview</a>.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420932"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 will integrate a new cloud update with Microsoft Purview Audit (Standard), rolling out early to mid-November 2024. This update, which will be on by default, allows admins to manage updates and review change logs in Purview Audit. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC925391",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-04T23:56:29.983Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-04T23:56:14Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft 365: New cloud update logs for Microsoft Purview Audit Standard users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
