{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 10, 2025: We have updated the content. Thank you for your patience.</p><p>Thank you for your engagement with the new chat and channels experience in Teams.\n</p><p>\n</p><p>The new chat and channels experience has been in Public Preview and Targeted Release since November 2024 and was targeted for General Availability starting in late January 2025. Based on requests from customers to have additional time to prepare their organizations for the change, we will be postponing the rollout to General Availability from January to a later date.</p><p>The GA rollout date is updated to starting late March 2025.</p><p>We’ve been listening to user feedback on the pace of work and the challenges of keeping up with conversations, managing messages scattered across different locations, and triaging quickly. To address this, we’ve streamlined the chats, teams, and channels experience to make it easier for users to stay on top of what matters most.\n</p><p>For more details and screenshots, refer to <a href=\"https://www.microsoft.com/microsoft-365/blog/?p=274831\" target=\"_blank\">Microsoft Teams announces out a new chat and channels experience | Microsoft 365 Blog</a>\n</p><p>This message applies to Teams on Windows desktops, Mac desktops, the web, and iOS and Android devices.\n</p><p>This message excludes Education tenants. We will send a future post with an update on the plan for Education tenants.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415249\" target=\"_blank\" style=\"\">415249</a>.</p><p><b>When this will happen:</b></p><p>Public Preview / Targeted Release: We will begin rolling out mid-November 2024 and expect to complete by mid-November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out late March 2025 (previously late January) and expect to complete by early April 2025 (previously early February).</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out mid-June 2025 (previously mid-April) and expect to complete by late June 2025 (previously late April).</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users have separate <i>Chat </i>and <i>Teams </i>views (apps) with no option to unify these views; custom sections of chats and channels were not possible; and there was no view for collecting all personal mentions in one list across chats and channels.\n</p><p>The new experience brings chat, teams, and channels into one place, in <i>Chat</i>, so users can easily navigate between all conversations without switching between contexts. Users start in the combined <i>Chat </i>view but can opt to keep chat separate from teams and channels like before.\n</p><p>In the Chat view, users will see these sections (in order):\n</p><ol><li><i>Favorites </i>containing any previously pinned chats and channels\n</li><li><i>Chats </i>sorted by most recent\n</li><li><i>Teams and channels</i>, organized in same order as in the <i>Teams </i>view\n</li></ol><p>Also, users can create custom sections to organize projects and topics that can include individual, group, and meeting chats, as well as channels. \n</p><p><i>Favorites, Chats, </i>and <i>Teams and channels </i>in one list in Teams for Windows: \n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qdz3?ver=aa52\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>Favorites, Chats, </i>and <i>Teams </i>and <i>channels </i>in one list in Teams for iOS (also available for Android):\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qiPQ?ver=c363\" style=\"width: 250px;\" alt=\"user controls\">\n</p><p>New filters for <i>Unread, Chat, Channels, Meetings</i> and more help users focus on relevant conversation in their list. Filters persist until turned off.\n</p><p>The new @mention view gathers all personal @mentions into one interactive list. Users can quickly access messages with @mentions across chats, channels, and meetings.</p><p>Use /go to: Quickly navigate to your frequently used conversation across your chat and channels with a new keyboard shortcut Ctrl+G (Cmd+G on Mac).</p><p>\n</p><p><i>Customizing the experience</i>\n</p><p>Users can tailor their chat and channels experience in Teams <i>Settings</i>. Users can choose to keep chat, teams, and channels combined in <i>Chat </i>(default) or switch to separate <i>Chat </i>and <i>Teams </i>views. In the combined <i>Chat </i>view, message previews are off by default to simplify the list. Users can turn on message previews in <i>Settings</i>.\n</p><p>When using the separate <i>Chat</i> and <i>Teams </i>views, users can still use the new filters and the @mentions view to triage and organize topics with custom sections.</p><p>\n</p><p><i>Starting the new experience</i>\n</p><p>A self-service guided onboarding flow in Teams will help users discover the new experience and configure it to their preferences. Users who prefer to keep chat and channels separate can easily do so during the onboarding process or later, without IT assistance. \n</p><p>When the new experience is available in your tenant, this screen will display to users:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qg5W?ver=bbc1\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>The Get started button will take users to the new combined chat, teams, and channels experience in Chat, and highlight the location of settings. Users will have the option to defer the new experience up to three times over the course of approximately three days, providing flexibility while also moving an organization to the new experience overall.\n</p><p>This feature is on by default. The new experience has no admin policy. Each user can make choices to optimize for how they work best.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. To help prepare organizations for the new features, product guides for admins and users will be available on the adoption web page <a href=\"https://adoption.microsoft.com/microsoft-teams/new-chat-and-channels-experience\" target=\"_blank\">The new Microsoft Teams chat and channels experience</a> before rollout begins.\n</p><p>For admins who <a href=\"https://support.microsoft.com/office/send-recommended-office-365-and-microsoft-365-training-81df76b4-1fca-430d-918e-b7fe03c3c056\" target=\"_blank\">opt in to emails for recommended Microsoft 365 training</a>, an email for users will summarize the update when released.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "415249"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"415249\":[{\"RoadmapId\":415249,\"Platform\":\"Android\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-10-28T21:13:42.5669792Z\",\"LatestRing\":null},{\"RoadmapId\":415249,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-15T13:22:48.1704446Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":415249,\"Platform\":\"iOS\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-10-28T21:13:42.5669795Z\",\"LatestRing\":null},{\"RoadmapId\":415249,\"Platform\":\"Mac\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-15T13:22:48.1704439Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":415249,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-11-15T13:22:48.1704454Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "The message details Microsoft Teams' updated Chat and Channels experience, now streamlined for ease of use. The General Availability rollout is postponed to late March 2025. This update introduces a unified view for chats, teams, and channels, customizable sections, new filters, and an @mention view. It affects Teams on various platforms but excludes Education tenants. No admin action is required for the update."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC920179",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-01-10T21:52:03.943Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-28T19:23:57Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: The new streamlined Chat and Channels experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
