{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>An updated feature in new Outlook for Windows and web will allow users to categorize individual emails within the conversation view, enhancing organization and tracking.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=416450\" target=\"_blank\">416450</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by mid-December 2024.</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out mid-January 2025 and expect to complete by mid-February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Categories will continue to function as they currently do. This new functionality will allow users to add categories to individual email items when the user is using the conversion view mode, consistent with the functionality from the previous version of Outlook.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "416450"
    },
    {
      "Name": "Summary",
      "Value": "The new Outlook for Windows and web will enable categorizing individual emails in conversation view. This feature, associated with Microsoft 365 Roadmap ID 416450, will roll out from mid-November 2024 to mid-February 2025, requiring no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-03-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC920306",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-28T22:54:20.153Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-28T22:53:59Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Categorize single items in conversation view in new Microsoft Outlook for Windows and web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
