{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As communicated in MC862983, Microsoft Copilot with enterprise data protection is available to users who sign in with an Entra account. Starting early November 2024, Copilot Pages will become available for Microsoft Copilot users when signed in with an Entra account. This feature was previously only available for users with a paid Microsoft 365 Copilot license. Pages will be enabled by default and admin controls are available should you need to control the experience differently within your tenant.<br></p><p>Note: In September 2024, Pages started to roll out for Microsoft 365 Copilot users in Work mode of Business Chat (MC890882). This update will also roll out Pages to Web mode in Business Chat for Microsoft 365 Copilot users.\n</p><p>Note: Copilot Pages will only be available in Microsoft Copilot for users signed in with an Entra account who have an underlying SharePoint license. \n</p><p><b>When this will happen:</b><br></p><p>General Availability (Worldwide): We will begin rolling out Copilot Pages in early November 2024 and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b><br></p><p>Recently, we <a href=\"https://techcommunity.microsoft.com/t5/copilot-for-microsoft-365/copilot-chat-available-in-business-chat/ba-p/4242701\" target=\"_blank\">announced Copilot Pages</a>, a first step in our new design system for knowledge work. Copilot Pages is a dynamic, persistent canvas in Copilot chat designed for multi-player collaboration. With Copilot Pages, you can turn insightful Copilot responses into something durable with a side-by-side page that you can view and edit and, when ready, share with your team to collaborate. \n</p><p>In a multiplayer approach, you can work together as a team to learn from each other’s prompts, and organize complex information. We see collaboration using Copilot Pages as the next great step forward in evolving Copilot from an individual, point-in-time exercise into a collaborative experience. \n</p><p>You can return to a page at any time by clicking the link in chat or the Open Page icon at the top of the associated Copilot session. Additionally, users can view all their pages in the Pages module in Microsoft365.com where they can also collaborate with others. \n</p><p>Created pages are stored in a user-owned SharePoint Embedded container. The container is lifetime-managed with the user account, so like OneDrive, the container and its content are deleted when the user account is deleted.\n</p><p><b>What you need to do to prepare:</b><br></p><p>The feature will be automatically enabled when it rolls out unless you’ve used the following controls to manage the experience. If you wish to change the configuration of the feature, there are two ways to consider based on your needs.\n</p><p>You can use a Cloud Policy setting to prevent users from creating new Copilot pages in Microsoft Copilot, and/or use Conditional Access or Information Barriers policies to block certain users from accessing Copilot pages as needed.\n</p><p>Note: The controls for Copilot pages are the same for both free Microsoft Copilot (when signed in with an Entra account) and the paid Microsoft 365 Copilot license.\n</p><p>More information can be found here: <a href=\"https://techcommunity.microsoft.com/t5/microsoft-365-copilot/copilot-pages-for-it-admins-sep-2024-update/ba-p/4241521\" target=\"_blank\">Copilot pages for IT Admins - Sep 2024 update</a>\n</p><p>Instructions for using the Cloud Policy to enable/disable Copilot pages in your tenant repeated here for ready reference:\n</p><ol><li>Sign in to <a href=\"https://config.office.com/\" target=\"_blank\">https://config.office.com/</a>&nbsp;with your Microsoft 365 admin credentials.\n</li><li>Select <b>Customization </b>from the left pane.\n</li><li>Select <b>Policy Management</b>.\n</li><li>Create a new policy configuration or edit an existing one.\n</li><li>From the <b>Choose the scope </b>dropdown list, choose either <b>All users </b>or select the group for which you want to apply the policy. For more information, See <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-components-configuration?view=o365-worldwide#microsoft-365-groups-for-cloud-policy\" target=\"_blank\">Microsoft 365 Groups for Cloud Policy</a>.\n</li><li>In <b>Configure Settings</b>, choose this setting:\n<ol><li>For <b>Create and view Loop files in Microsoft 365 Copilot Chat</b>:\n<ol><li><b>Enabled:</b> Copilot chat experience is available to the users.\n</li><li><b>Disabled:</b> Copilot chat experience isn't available to the users.\n</li><li><b>Not configured:</b> Copilot chat experience is available to the users.\n</li></ol></li></ol></li><li>Save the policy configuration.\n</li><li>Reassign priority for any security group, if required. (If two or more policy configurations are applicable to the same set of users, the one with the higher priority is applied.)\n</li></ol><p>In case you create a new policy configuration or change the configuration for an existing policy, there can be a delay in the change being reflected as described below:\n</p><ul><li>If there were existing policy configurations prior to the change, then it may take 90 minutes for the change to be reflected.\n</li><li>If there were no policy configurations prior to the change, then it may take 24 hours for the change to be reflected.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Copilot Pages will be available in Microsoft Copilot for users with an Entra account and SharePoint license starting early November 2024. This feature allows for collaborative and persistent workspaces in Copilot chat. It will be enabled by default with admin controls for customization."
    }
  ],
  "EndDateTime": "2025-02-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC920307",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-28T22:55:00.85Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-28T22:54:45Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Copilot Pages coming to Microsoft Copilot",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
