{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As a follow up to our announcement on <a href=\"https://techcommunity.microsoft.com/t5/intune-customer-success/support-tip-windows-device-configuration-policies-migrating-to/ba-p/4189665\" target=\"_blank\">Windows device configuration policies migrating to unified settings platform</a>, expected with Intune’s December (2412) service release, you will not be able to create any new Administrative Templates for Windows devices. Specifically, these are the profiles created by navigating to <b>Devices</b> &gt; <b>Configuration</b> &gt; <b>Create</b> &gt; <b>New policy</b> &gt; <b>Windows 10 and later</b> &gt; <b>Templates</b> in the Microsoft Intune admin center. The same settings found in the Administrative Templates can be configured with the <a href=\"https://learn.microsoft.com/mem/intune/configuration/settings-catalog\" target=\"_blank\">settings catalog</a>.</p><p><b>How this will affect your organization:</b></p><p>After this change, you will not be able to create any new Administrative Templates from the Intune admin center. Existing Administrative templates can still be viewed, updated, or deleted.</p><p><b>Note:</b> While this change does not impact the creation of new Administrative Templates through 'deviceManagement/groupPolicyConfigurations' Microsoft Graph API you should switch to the new '<a href=\"https://learn.microsoft.com/graph/api/intune-deviceconfigv2-devicemanagementconfigurationpolicy-get?view=graph-rest-beta\" target=\"_blank\">deviceManagement/configurationPolicies</a>' API graph endpoint for policy creation as soon as possible.</p><p><b>What you need to do to prepare:</b></p><p>If you are using Administrative Templates, use the settings catalog for configuring new settings going forward. As part of the migration of Windows configuration profiles, the existing Administrative Templates will eventually be migrated automatically. Review the blog for more information: <a href=\"https://techcommunity.microsoft.com/t5/intune-customer-success/support-tip-windows-device-configuration-policies-migrating-to/ba-p/4189665\" target=\"_blank\">Windows device configuration policies migrating to unified settings platform</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Creation of new Administrative Templates for Windows in Microsoft Intune will not be supported after the December (2412) service release. Users should use the settings catalog for new configurations and prepare for automatic migration of existing templates. Existing templates can still be managed."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC925389",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-04T23:54:52.537Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-04T23:54:22Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Plan for Change: Creation of new Administrative Templates configuration profiles for Windows will not be supported",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
