{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the Summarize work orders with Copilot in Outlook feature for Dynamics 365 Field Service. This feature allows you to get a summary of a work order without having to leave Outlook and open the Field service web or mobile apps. This feature will reach general availability on <b>November 18, 2024</b>.<br><br>\n<b>How does this affect me?</b><br>\nThe Dynamics 365 Field Service for Outlook add-in enables Copilot to create a summary that captures all the important information required for service managers and frontline workers to understand the context of a work order. This summary is identical to the summary in both the Field Service web and mobile apps. By default, Copilot provides these summaries based on a predefined list of tables and columns that Microsoft maintains, but administrators can change the summary configuration to meet their business needs.<br><br>\nThe default summary includes the following data fields from work orders and related records:<ul>\n<li>Booking information</li>\n<li>Activity details</li>\n<li>Notes from the work order and bookings</li>\n<li>Work order product details</li>\n<li>Work order service details</li>\n<li>Work order service tasks</li>\n<li>Asset information and work order history</li></ul>\n<b>What do I need to do to prepare?</b><br>\nThis message is for awareness and no action is required.<br><br>\nIf you would like more information on this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/8706\">Summarize work orders with Copilot in Outlook</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-11-30T23:16:37Z",
  "HasAttachments": false,
  "Id": "MC921924",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-30T23:17:40.853Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-30T23:16:37Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Field Service - Summarize work orders with Copilot in Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
