{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are making changes to system generated emails from SharePoint workflows and alerts display names. <i>Note: this is a continuation of MC711021 (January '24).</i></p><p>To align system generated emails with best practices, SharePoint Online workflow and alert emails will be displayed as “SharePoint Online”. There is no change to the underlying sending email address, no-reply@sharepointonline.com. </p><p>If your organization uses the \"Send email notifications from your domain\" feature, the email address will comply with your configured domain.</p><p><b>When this will happen:</b></p><p>We are continuing the rollout and expect complete by late November 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>If your users have Outlook rules or other processes surrounding the email display name only, those will need to be updated accordingly. Existing policies and rules utilizing the email address will not be affected.\n</p><p>Additionally, if you’re calling the \"SendEmail\" API or calling SharePoint workflow or alert services via CSOM or REST API’s those emails will follow the new display convention as well. \n</p><p><b>What you need to do to prepare:</b>\n</p><p>Inform users of the potential change in their workflow and alert processes from SharePoint.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint Online system-generated emails from workflows and alerts will now display \"SharePoint Online\" as the sender name. This change, continuing from January 2024, requires updates to any Outlook rules based solely on the display name. The sending address remains no-reply@sharepointonline.com, and the rollout should complete by late November 2024."
    }
  ],
  "EndDateTime": "2025-02-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC923413",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-01T22:52:21.93Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-01T22:51:51Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "System generated emails from workflows and alerts will now show SharePoint Online as the sender display name",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
