{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>By default, searches conducted from various Microsoft 365 entry points into Microsoft SharePoint Online are not collected in the Microsoft Purview audit log search. You may enable these searches to be collected by following these instructions: <a href=\"https://learn.microsoft.com/purview/audit-get-started#step-4-enable-searchqueryinitiated-events\" target=\"_blank\">Step 4: Enable SearchQueryInitiated events</a> in <a href=\"https://learn.microsoft.com/purview/audit-get-started\" target=\"_blank\">Get started with auditing solutions | Microsoft Learn</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Available now.\n</p><p><b>How this will affect your organization:</b></p><p>To capture searches initiated by users against SharePoint online, you must enable <i>SearchQueryInitiatedSharePoint</i> for each user.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Enable audit log search for SharePoint Online content searches in Microsoft Purview by following the provided instructions. This feature is now generally available and requires enabling 'SearchQueryInitiatedSharePoint' for users. No admin action is needed before the rollout, but reviewing configurations and updating documentation is advised."
    }
  ],
  "EndDateTime": "2024-12-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC920299",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-28T22:49:54.463Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-28T22:49:31Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Purview | Audit: Enable audit log search for content searches that target Microsoft SharePoint Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
