{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 14, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Teams admin center: For the existing <i>Meeting chat</i> control, we will add two new options that allow admins to disable meeting chat before and after a meeting, <i>In-meeting only for everyone and In-meeting only except anonymous users</i>.\n</p><p>This message applies to Teams for Windows desktops and Mac desktops, Teams on the web, and Teams for iOS/Android.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422808\" target=\"_blank\">422808</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early January 2025 (previously early December) and expect to complete by mid-January 2025 (previously mid-December).\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 (previously early January) and expect to complete by late January 2025 (previously mid-January)</p><p>General Availability (GCC, GCC High): We will begin rolling out early February 2025 (previously late January) and expect to complete by mid-February 2025 (previously late January).\n</p><p>General Availability (DoD): We will begin rolling out late early February 2025 (previously late January) and expect to complete by mid-February 2025 (previously early February).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, admins will find the two new options in the Teams admin center &gt; <i>Meetings &gt; Meeting policies &gt; Meeting engagement &gt; Meeting chat.</i>\n</p><p>Admins can select from five <i>Meeting chat</i> options:\n</p><ul><li>On for everyone\n</li><li>On for everyone but anonymous users\n</li><li>Off\n</li><li>In-meeting only for everyone (new)\n</li><li>In-meeting only except anonymous users (new)\n</li></ul><p>Admins can select the <i>In-meeting only</i> options to disable the ability of meeting participants to send messages in the meeting chat before or after the meeting, for meetings organized by specific users in their tenant. When one of the <i>In-meeting only</i> options is selected, participants can read past chat history, but they can only send messages in the meeting chat while the meeting is active.\n</p><p>The new options will be available for admins to configure. This rollout will respect the options selected by admins before the rollout. To use the new options, admins must select one of them.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qrS9?ver=55a5\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/manage-meeting-chat\" target=\"_blank\">Manage chat in Teams meetings - Microsoft Teams | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422808"
    },
    {
      "Name": "Summary",
      "Value": "New Microsoft Teams admin center options will enable admins to disable meeting chat before and after meetings. These options are part of the Microsoft 365 Roadmap ID 422808 and will roll out between January 2025 and February 2025. Admins should review configurations and inform users accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC920298",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-15T19:02:19.033Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-28T22:47:53Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: Admins can disable the ability to send messages in meeting chat before and after a meeting",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
