{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 25, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>The order of folders in Microsoft Outlook mobile will now sync to match the folder order on Outlook web, Mac, and Windows platforms.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422816\" target=\"_blank\">422816</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-April 2025 (previously early March) and expect to complete by mid-May (previously early April)</p><p>Users will now see an updated folder order on their mobile devices that reflects the folder order on Outlook web and desktop platforms. If users want to re-order the folders, they must do so on Outlook for the web, Mac, and Windows devices, as folder re-ordering is currently not supported on mobile devices.&nbsp;</p><p>This feature is on by default and cannot be turned off.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The folder order in Microsoft Outlook mobile will sync with Outlook web, Mac, and Windows platforms. Rollout starts mid-April 2025 and completes by mid-May 2025. Users must reorder folders on non-mobile platforms. No admin action is required, but user notification and documentation updates are recommended."
    }
  ],
  "EndDateTime": "2025-07-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC926892",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-25T20:24:46.27Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-06T22:42:04Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Sync folder order",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
