{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Insights: Admins (global admins or Insights admins) will be able to assign or remove delegates for a manager, using Microsoft PowerShell cmdlets.</p><p>Before this rollout, only managers can assign delegates.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=464207\" target=\"_blank\">464207</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-November 2024 and expect to complete by late November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early January 2025 and expect to complete by late January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Managers will continue to be able to assign delegates in the Viva Insights app and this experience will not change. </p><p>Learn more: <a href=\"https://learn.microsoft.com/viva/insights/org-team-insights/delegate-access\" target=\"_blank\">Delegate access to organizational insights and Copilot Dashboard | Microsoft Learn</a> (will be updated with PowerShell cmdlet instructions before rollout)\n</p><p>This new feature will be off by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Learn more about the delegate and group manager roles: <a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/user-roles\" target=\"_blank\">Roles in Viva Insights | Microsoft Learn</a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "464207"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights will soon allow admins to assign or remove delegates for managers using PowerShell cmdlets. This feature, associated with Microsoft 365 Roadmap ID 464207, will roll out between mid-November 2024 and late January 2025. It will be off by default with no admin action required before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS, Web"
    }
  ],
  "EndDateTime": "2026-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC925394",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-04T23:58:16.673Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-04T23:58:06Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Insights: Admins assign delegate access",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
