{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 21, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In mid-November, Microsoft Copilot will become available to users with an Entra account in Microsoft Teams and Outlook. If pinned, Entra users will be able to access the Microsoft Copilot app directly from the left rail in Outlook and Teams.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=420330\" target=\"_blank\">420330</a>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): The Microsoft Copilot app will be available to pin in Teams and Outlook starting early January 2025 (previously late November) and is expected to complete shortly after.</p><p><b>How this will affect your organization:</b></p><p>Starting mid-November, Microsoft Copilot admins and users will be able to pin the Copilot app in Teams and Outlook. Copilot will not be pinned by default.  If pinned, users will be able to access the Microsoft Copilot app in Teams and Outlook.</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins can control if Copilot is pinned in Teams and Outlook using the&nbsp;<a href=\"https://aka.ms/PinCopilot\" target=\"_blank\">same Copilot pinning control shared previously to pin Copilot in the Microsoft 365 app</a>.\n</p><p>With the pinning control, you have the option to pin or not pin Copilot for your users. If you select to not pin Copilot, you also have the option to allow your users to be notified to make this choice. If no action is taken, Copilot will not be pinned but users will be notified to pin it themselves.\n</p><p>Currently, you can remove access to Copilot in the Microsoft 365 app and copilot.cloud.microsoft as documented in&nbsp;<a href=\"https://learn.microsoft.com/en-us/copilot/manage#removing-access-to-microsoft-\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Removing access to Microsoft Copilot</a>. These controls will continue to be respected as the Copilot app rolls out in Outlook and Teams.&nbsp;</p><p>In addition, you will soon be able to block the Copilot app from appearing in Outlook, the Microsoft 365 app and copilot.cloud.microsoft through&nbsp;<a href=\"https://learn.microsoft.com/en-us/microsoft-365/admin/manage/teams-apps-work-on-outlook-and-m365?view=o365-worldwide#how-to-block-an-app\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Microsoft 365 admin center (MAC) </a>and in Microsoft Teams through <a href=\"https://learn.microsoft.com/en-us/microsoftteams/manage-apps#allow-or-block-apps\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Teams admin center (TAC)</a> like you would block any other app.</p><p><b>Note: </b>During the rollout, the Microsoft Copilot app will temporarily be available for Semi-Annual Channel users of classic Outlook for Windows. These clients will respect admin and user preferences, but we typically do not show Copilot features in Semi-Annual Channel of classic Outlook for Windows. After customers update to Version 2408 or newer, the Microsoft Copilot app will once again be hidden for Semi-Annual Channel users.\n</p><p><b><br></b></p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420330"
    },
    {
      "Name": "Summary",
      "Value": "Starting early January 2025, Microsoft Copilot will be available for pinning in Teams and Outlook for Entra account users. Admins can control the pinning, and it's not pinned by default. Users can access it directly if pinned. The rollout is expected to complete shortly after January 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-02-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC922627",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-22T01:02:14.083Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T23:06:20Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot extending to Teams and Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
