{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 18, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Teams: With the <i>Best practice configurations</i> monitoring dashboard in the Teams admin center, Teams admins will be able to monitor the conformance of your tenant to the Microsoft recommended best practices for an optimal collaboration experience on Teams.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421185\" target=\"_blank\">421185</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-January 2025 (previously early December) and expect to complete by late January 2025 (previously mid-January).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Ensuring the quality and reliability of user's collaboration experience using Teams is crucial (specially the meeting-related experiences). Microsoft recommends best practices to ensure that organizations have an optimal environment setup for collaboration.\n</p><p>The <i>Best Practice Configurations</i> monitoring dashboard will assist admins in understanding their tenant’s non-conformance with these best practices, the overall impact, and how to comply with these recommendations.\n</p><p>You'll find the <i>Best practice configurations</i> dashboard in the <i>Meetings </i>section of the Teams admin center. In this release, we’ll monitor and highlight non-conformance in three key areas:\n</p><ul><li>Update out-of-date client versions\n</li><li>Enable the right ports and protocols\n</li><li>Implement split tunnelling for VPNs\n</li></ul><p>If a location does not adhere to these best practices, it will be highlighted on the dashboard. A widget on the main dashboard will also spotlight non-conforming practices. Also, a list of subnets/IP addresses will be displayed by city, showing the extent of non-conformance for each location. This list can be exported to share with relevant teams, and recommendations for addressing these issues will be available on the same page.\n</p><p>As these issues are resolved, the trend of non-conforming locations will be tracked to help monitor progress.\n</p><p>This new dashboard will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Administrators do not need to do anything to prepare for these changes. They will take effect automatically.\n</p><p>You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421185"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"421185\":[{\"RoadmapId\":421185,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-01-28T08:18:23.4394129Z\",\"LatestRing\":null},{\"RoadmapId\":421185,\"Platform\":\"Mac\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-01-28T08:18:23.4394133Z\",\"LatestRing\":null},{\"RoadmapId\":421185,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-01-28T08:18:23.4394134Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "The message details the upcoming 'Best Practice Configurations' dashboard in the Teams admin center, which helps monitor tenant conformance to Microsoft's best practices. The rollout begins mid-January 2025 and includes features to track non-conformance in key areas, with automatic updates for administrators. Microsoft 365 Roadmap ID 421185 is associated with this update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC929034",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-19T00:44:34.583Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-08T23:27:53Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Best practices configuration dashboard in Teams admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
