{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 22, 2025: Microsoft Copilot for Entra account users is M365 Copilot Chat. Thank you for your patience.</p><p>In mid-January, Microsoft Copilot will become available to users with an Entra account in Microsoft Teams and Outlook. If pinned, Entra users will be able to access the Microsoft Copilot app directly from the left rail in Outlook and Teams. On Teams Mobile, the pinned app will show up in the top header. Microsoft Copilot will also become available in the Store for users to add on their own, managed by the same admin settings used for app availability today. Outlook Mobile will have Copilot show up in the tab bar starting in February.</p><p>Note: During the rollout, the Microsoft Copilot app will temporarily be available for Semi-Annual Channel users of classic Outlook for Windows. These clients will respect admin and user preferences, but we typically do not show Copilot features in Semi-Annual Channel of classic Outlook for Windows. After customers update to Version 2408 or newer, the Microsoft Copilot app will once again be hidden for Semi-Annual Channel users.</p><p>In addition, users with a Microsoft 365 Copilot license will have Copilot automatically pinned in the left rail in Teams, along with the Copilot chat that is automatically pinned in the Teams Chat pane for them today.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=420330\" target=\"_blank\">420330</a>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): The Microsoft Copilot app will be available to install and pin in Teams and Outlook starting late January 2025 (previously mid-January) and is expected to complete by late February 2025 (previously late January).</p><p>General Availability (Worldwide): The Microsoft 365 Copilot app will be pinned by default in the Teams left rail staring late January 2025 (previously mid-January)  and is expected to complete by late February 2025 (previously late January).</p><p> </p><ul><li>On Teams Mobile, the pinned app will show up in the top header.&nbsp;</li><li>Outlook Mobile will have Copilot show up in the tab bar starting in mid-February 2025.</li></ul><p><b>How this will affect your organization:</b></p><p>Starting mid-January, Microsoft Copilot admins and users will be able to pin the Copilot app in Teams and Outlook. Copilot will not be pinned by default for users without a Microsoft 365 Copilot license.  If pinned, users will be able to access the Microsoft Copilot app in Teams and Outlook.\n</p><p>If your admins or users previously chose to pin Microsoft Copilot across the M365 app, Teams, and Outlook before pinning was released on Teams and Outlook, Microsoft Copilot will be retroactively pinned for them there.</p><p>Microsoft Copilot will also be added to the Store for users to add on their own. For licensed users, Microsoft 365 Copilot has already been installed, and users can open it from the Store.</p><p>Finally, in Teams, users with a Microsoft 365 Copilot license will be able to access Copilot in the left rail as a pinned app by default, along with the Teams Chat pane where they can find it today. On Teams Mobile, users can access Copilot in the top header, and on Outlook Mobile in the tab bar.</p><p><b>What you need to do to prepare:</b>\n</p><p>Admins can control if Microsoft Copilot is pinned in Teams and Outlook using the <a href=\"https://learn.microsoft.com/copilot/microsoft-365/pin-copilot\" target=\"_blank\">same Copilot pinning control shared previously to pin Copilot in the Microsoft 365 app.</a> Admins can also pin Microsoft Copilot in Teams by adding Copilot to Pinned apps in <a href=\"https://learn.microsoft.com/microsoftteams/teams-app-setup-policies\" target=\"_blank\">app Setup policies</a> and assigning the policies to unlicensed users in Teams admin center.\n</p><p>With the pinning control, you have the option to pin or not pin Copilot for your users. If you select to not pin Copilot, you also have the option to allow your users to be notified to make this choice. If no action is taken, Copilot will not be pinned but users will be notified to pin it themselves.\n</p><p>Users can unpin Copilot in Outlook. Users can unpin Copilot in Teams if User pinning is enabled in app <a href=\"https://learn.microsoft.com/microsoftteams/teams-app-setup-policies#pin-apps\" target=\"_blank\">Setup policies.</a>\n</p><p>Currently, you can remove access to Copilot in the Microsoft 365 app and copilot.cloud.microsoft as documented in <a href=\"https://learn.microsoft.com/copilot/manage#removing-access-to-microsoft-\" target=\"_blank\">Removing access to Microsoft Copilot</a>. These controls will continue to be respected as the Copilot app rolls out in Outlook and Teams. \n</p><p>In addition, you will be able to allow and block the Copilot app from appearing in Outlook, the Microsoft 365 app and copilot.cloud.microsoft through <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/teams-apps-work-on-outlook-and-m365?view=o365-worldwide#how-to-block-an-app\" target=\"_blank\">Microsoft 365 admin center (MAC)</a> like you would manage availability for any other app. These controls are already provided today for Microsoft Teams through <a href=\"https://learn.microsoft.com/microsoftteams/manage-apps#allow-or-block-apps\" target=\"_blank\">Teams admin center (TAC)</a>.</p><p>\n</p><p>\n</p><p>\n</p><p><b>\n</b></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420330"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat, now named for Entra account users, will be available in Teams and Outlook starting late January 2025. It will be pinned by default for licensed users and can be managed by admins. Rollout completion is expected by late February 2025. Roadmap ID: 420330."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-03-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC922627",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-22T21:03:29.483Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T23:06:20Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Chat available in Teams and Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
