{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">Updated April 3, 2025: We have updated the rollout timeline below. We are now one month away from this change taking effect.</p><p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">We're removing the&nbsp;<code>EnableAllOcsiClients</code>&nbsp;OneDrive group policy in the Microsoft 365 admin center. OCSI is the coordination between office and OneDrive for syncing office documents to the cloud.&nbsp;</p><p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\">This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=429874\" target=\"_blank\">429874</a>.</p><p style=\"margin-top:0in;margin-right:0in;margin-bottom:7.5pt;margin-left:0in\"><b>How this will affect your organization:</b></p><p>After this rollout, the <code>EnableAllOcsiClients</code> group policy will be removed, and Microsoft Office and Microsoft OneDrive will be able to communicate smoothly to ensure existing Office features like autosave, version history, real time user collaboration, and merging in the case of conflicts can work properly for end users. </p><p>Before this rollout, tenants had the option to disable this feature with a GPO, and when they disable the GPO, existing Office features like autosave, version history, real time user collaboration, and merging in the case of conflicts cannot work properly.&nbsp;</p><p>&nbsp;<b>When this will happen:</b>&nbsp;</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will be rolling out in early May 2025 (previously April).</p><p> <b>How this will affect your organization:</b></p><p>With OCSI enabled for all tenants, end users will be able to take advantage of features such as autosave, real time user collab, and merging in the case of conflicts of Office files.&nbsp; Autosave is a feature that end users will see in Word, Excel, and PowerPoint files; it is a toggle at the top left of the file header that will ensure that even if the user does not manually save a file, the file will be saved automatically to OneDrive and SharePoint. With real time user collaboration, different users can collaborate on the same file at the same time. Version history allows users to see when and who made changes to a file and provides the ability to restore to a previous version of the file within the Office app. If there are conflicts within a file that does not require user input, Office will merge the conflicts and ensure that the Office file is up to date with the latest changes. If user input is required to merge conflicts, Office will show the merge conflicts and prompt the user to choose which edits to prioritize.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change, especially if the policy is disabled, educate them about autosave, real time user collab, and merging in the case of M365 application conflicts, and update any relevant documentation.&nbsp;</p><p>For more information, see <a href=\"https://learn.microsoft.com/sharepoint/use-group-policy#allow-users-to-choose-how-to-handle-office-file-sync-conflicts\" target=\"_blank\" style=\"\">Allow users to choose how to handle Office file sync conflicts</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "429874"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is removing the `EnableAllOcsiClients` OneDrive group policy in May 2025. This change will enable features like autosave, real-time collaboration, and version history in Office documents. No admin action is required, but organizations should notify users and update documentation accordingly. More details are available on the Microsoft 365 Roadmap ID 429874."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC921916",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-03T19:39:50.163Z",
  "Services": [
    "Microsoft OneDrive"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-30T23:01:38Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: The Enable OCSI for Tenants group policy is being removed",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
