{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Forms is updating the end-to-end experience with a new appearance for the portal page, form creation, and response analysis. Users can toggle between upgraded templates as they create their form and then view insights and suggested actions when the responses come in.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=400715\" target=\"_blank\">400715</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out late October 2024 and expect to complete by early November 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>Employees who use Microsoft Forms will get the new UI experience after release.</p><p>In the portal page, templates are organized into four categories – Feedback, Registration, Research, and Quiz.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qpiA?ver=7330\" style=\"width: 659.006px;\"></p><p>As users enter the design page, they'll find a wide selection of templates displayed in the left-side pane. They can browse and switch between different types/topics.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qrTn?ver=4e35\" style=\"width: 532.997px;\"></p><p>In the right-hand pane, from the Style button, the users can select a style from our suggestions or personalize their own. Additionally, they can choose the layout for the cover page of the invitation.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1quvm?ver=4221\" style=\"width: 532.997px;\"></p><p>The results page has also has a new design. Users can now quickly analyze responses with charts and graphs, making the data easier to interpret for more effective analysis.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qpiE?ver=b343\" style=\"width: 685px;\"><br></p><p>This new feature is available by default.</p><p>Learn more: <a href=\"https://techcommunity.microsoft.com/t5/microsoft-forms-blog/revamped-forms-experience-is-now-available-for-commercial-users/ba-p/4277245\" target=\"_blank\">Revamped Forms experience is now available for commercial users</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "400715"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Forms is introducing a new, modern experience with an updated portal page, form creation, and response analysis. The update includes organized templates, a selection of styles, and enhanced results analysis with charts and graphs. Rollout begins late October 2024, with no admin action required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-01-23T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC922626",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-31T23:06:00.66Z",
  "Services": [
    "Microsoft Forms"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T23:05:50Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Forms: New streamlined and modernized experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
