{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this rollout, Microsoft Teams chat and Microsoft 365 Copilot interactions are available together to be included or excluded in the Microsoft Purview Data Lifecycle Management policy in the Purview compliance center.\n</p><p>After this rollout, admins can have separate policies for Copilot interactions. Also, admins can separate Teams chat from Copilot interactions to create new retention policies for Copilot messages only.\n</p><p>A Microsoft 365 Copilot license is required to use this feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=407897\" target=\"_blank\">407897</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-November 2024 and expect to complete by late November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 and expect to complete by late January 2025\n</p><p><b>How this will affect your organization:</b>\n</p><p>Admins will be able to separate existing Teams Chat from Copilot interactions:\n</p><p>This feature is available by default for admins to configure from the Data Lifecycle Management Retention policies.\n</p><p>Separate Copilot retention policies from Teams chats:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qpkZ?ver=2e1b\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "407897"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is separating Copilot retention policies from Teams chats, allowing admins to create distinct retention policies for Copilot interactions. This change requires a Microsoft 365 Copilot license and will be available in Public Preview from mid-November 2024, with General Availability starting mid-January 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC926899",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-06T22:44:26.72Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-06T22:44:07Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Lifecycle Management: Separate Copilot retention policies from Teams chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
