{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 28, 2025: Reminder - this rollout is coming up soon.</p><p>We will remove the<code> EnableHoldTheFile</code> group policy for Microsoft OneDrive from the Microsoft 365 admin center.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=429875\" target=\"_blank\">429875</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early April 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, if a tenant has disabled <code>EnableHoldTheFile</code> and users experience file conflicts, Microsoft OneDrive automatically creates a copy of the file in conflict. When tenants disable <code>EnableHoldTheFile</code>, users may have to manage hundreds of conflicts because OneDrive automatically copies a file instead of allowing users to choose to merge conflicts.\n</p><p>After this rollout, the <code>EnableHoldTheFile</code> group policy will be removed and the experience associated with the <code>EnableHoldTheFile</code> group policy will be enabled for all tenants. If a user opens a Microsoft Word, Excel, and PowerPoint file and there is a conflict that requires user input to resolve, the user will be given the option to choose the file variation to keep. If the conflict cannot be resolved, a banner will display to either <i>Save a Copy</i> of the file or <i>Discard Changes</i> if the user doesn't care about the changes that were made.</p><p>User notification to choose the file variation to keep in PowerPoint:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d89770ef-cd05-4488-8fb2-16b07819ff7f\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>User notification to <i>Save a Copy </i>or <i>Discard Changes</i> in PowerPoint:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f96f50cb-5046-4820-8d83-afba0508c23c\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>User notification to <i>Save a Copy</i> or <i>Discard Changes i</i>n Word:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/198badfd-326c-4323-8996-d7eac3c92ee0\" alt=\"user notification\" style=\"width: 400px;\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change, especially if the policy was disabled, and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/sharepoint/use-group-policy#allow-users-to-choose-how-to-handle-office-file-sync-conflicts\" target=\"_blank\">IT Admins - Use OneDrive policies to control sync settings - SharePoint in Microsoft 365 | Microsoft Learn</a> (direct link to the section called <i>Allow users to choose how to handle Office file sync conflicts)</i></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "429875"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft will remove the \"EnableHoldTheFile\" group policy for OneDrive in April 2025. Users will be prompted to resolve file conflicts by choosing which version to keep or by saving a copy/discarding changes. No admin action is required, but organizations should review configurations and inform users."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC922630",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-28T17:03:17.877Z",
  "Services": [
    "Microsoft 365 suite",
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T23:07:12Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft OneDrive: We will remove the \"EnableHoldTheFile\" group policy",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
