{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 5, 2025: General Availability timeline and admin requirements update. We have simplified enablement for Scheduled prompts.</p><p>Key updates:\n</p><ul><li>&nbsp;Power Automate license is no longer required. Users only need a Microsoft Copilot for Microsoft 365 license to use Scheduled prompts. \n</li><li>No changes to DLP policies are required. Admins no longer need to configure DLP settings to enable the Copilot for Microsoft 365 connector.\n</li><li>A dedicated Microsoft 365 environment will be created automatically the first time a licensed user creates scheduled prompt. The environment is a production environment type usable only by first party Copilot scenarios. For more details on this environment, please see <a href=\"https://go.microsoft.com/fwlink/?linkid=2324011&amp;clcid=0x409\" target=\"_blank\">here.</a>\n</li></ul><p>For more general info on Scheduled prompts usage and management, please reference the latest<a href=\"https://go.microsoft.com/fwlink/?linkid=2324010&amp;clcid=0x409\" target=\"_blank\"> Admin documentation</a>.</p><p>4/15/25: The onboarding process for the feature in public preview has concluded. New customers interested in using the feature will need to wait until it becomes available to all customers in May 2025. </p><p>Please note that customers who are interested in joining the preview must opt-in. To join the preview, customers should file a support ticket requesting to join the Scheduled prompts preview. Thank you for your feedback.</p><p>Coming soon for Microsoft Copilot for Microsoft 365: A new Scheduled prompts feature that allows users to automate Copilot prompts to run at set times and frequencies in Copilot in Microsoft Teams, <a href=\"https://www.office.com/chat\" target=\"_blank\">Office.com/chat</a>, and Microsoft Outlook for the web and Desktop. A Microsoft Copilot for Microsoft 365 license and a Standard Microsoft Power Automate license are required to use this feature. To be eligible, customers must also have the Optional Connected Experience (OCE) admin toggle enabled, and configure their DLP policies to allow the Copilot for Microsoft 365 connector in their default PowerPlatform environment.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=401124\" target=\"_blank\">401124</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-December 2024 (previously mid-November) and expect to complete by late December 2024 (previously late November).</p><p>General Availability: Rollout has officially begun early July 2025 (previously mid-May) expect to complete by mid-July 2025 (previously late May).&nbsp;</p><p>\n</p><p><b>How this will affect your organization:</b></p><p>Before this rollout: Users are unable to schedule Copilot for Microsoft 365 prompts to run at a specific time and frequency.\n</p><p>After the rollout: Users can find the Scheduled prompts feature by hovering over a prompt they have submitted to Copilot or by clicking on the Schedule prompts button in the Copilot response footer (references images below). After configuring their Scheduled prompt, when a user selects the <i>Save and activate</i> button to confirm the scheduled prompt, a user's prompt information will be sent to the Power Automate and Power Platform system, and the Power Automate <a href=\"https://learn.microsoft.com/power-platform/admin/security/overview\" target=\"_blank\">terms of service</a> and <a href=\"https://learn.microsoft.com/power-platform/admin/wp-compliance-data-privacy\" target=\"_blank\">privacy policy</a> apply:</p><p>Schedule prompt entry points</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d3aa7204-39a0-4e11-b6e8-16106b9d5f20\" style=\"width: 500px;\" alt=\"user controls\"></p><p>Schedule prompt Creation dialog</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/fb04f59d-18f1-4529-a5bc-04509ff65461\" style=\"width: 500px;\"></p><p>\n</p><p><b>What you need to do to prepare:</b></p><p>Managing the Scheduled prompts feature as an admin: To continue having the Scheduled prompts feature available in your organization, no action is required after completing the opt-in process. The feature is automatically included as part of the <a href=\"https://learn.microsoft.com/deployoffice/privacy/optional-connected-experiences\" target=\"_blank\">Optional Connected Experiences admin setting,</a> which is on by default.\n</p><p>Admins can access the Optional connected experiences setting at <a href=\"https://config.office.com\" target=\"_blank\">config.office.com</a></p><p>If you prefer not to have this feature available to your organization, you can file a customer support ticket requesting to exit the preview program or disable the optional connected experiences setting at <a href=\"https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fconfig.office.com%2F&amp;data=05%7C02%7Cv-rocioclark%40microsoft.com%7Cbbc6d36eafca4d1665ed08dcab2a9305%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C638573446583358918%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=0WkNxR10YTGSVMCIfmbxIqoy%2FEusUsPeZH9A85VjUo4%3D&amp;reserved=0\" target=\"_blank\" style=\"\">config.office.com</a>. For more information: <a href=\"https://learn.microsoft.com/microsoft-365-apps/privacy/optional-connected-experiences#admin-controls-for-optional-connected-experiences\" target=\"_blank\" style=\"\">Admin controls for optional connected experiences</a>. If you turn off the Optional connected experiences setting, this action will prevent anyone in your organization from seeing the Scheduled prompts feature in Copilot. If you choose to make these optional connected experiences available to your users, your users will also have the option to turn them by going to the<a href=\"https://support.microsoft.com/office/access-your-account-privacy-settings-3e7bc183-bf52-4fd0-8e6b-78978f7f121b\" target=\"_blank\" style=\"\"> privacy settings dialog box.</a></p><p>To prevent exposing organizational data, you should also create a data policy in the<a href=\"https://admin.powerplatform.microsoft.com/\" target=\"_blank\"> Power Platform admin center.</a> Creating a data policy in the center allows administrators to control access to these connectors in various ways to help reduce risk in your organization. Learn more here: <a href=\"https://learn.microsoft.com/power-platform/admin/wp-data-loss-prevention\" target=\"_blank\">Data policies - Power Platform | Microsoft Learn</a>\n</p><p>If you disable this feature after someone in your organization has already used the feature:\n</p><ul><li>Users will no longer be able to manage previously scheduled prompts.\n</li><li>Sessions for previously run scheduled prompts will continue to exist.\n</li><li>Users will no longer see the Scheduled prompts feature or the prompt management pane.\n</li></ul><p><i>Relevant articles</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/copilot/microsoft-365/microsoft-365-copilot-privacy\" target=\"_blank\">Data, Privacy, and Security for Microsoft Copilot for Microsoft 365 | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/power-platform/admin/security/overview\" target=\"_blank\">Security in Microsoft Power Platform - Power Platform | Microsoft Learn</a>\n</li><li>Admin controls for optional connected experiences in <a href=\"https://learn.microsoft.com/deployoffice/privacy/optional-connected-experiences#admin-controls-for-optional-connected-experiences\" target=\"_blank\">Overview of optional connected experiences in Office - Deploy Office | Microsoft Learn</a>\n</li></ul><p>Before rollout, we will update this post with revised documentation.</p><p>To learn more about Microsoft’s own review of this product with its works councils, please consider reading: <a href=\"https://aka.ms/Copilot/MSWorksCouncilsArticle\" target=\"_blank\">https://aka.ms/Copilot/MSWorksCouncilsArticle;</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The SharePoint SendEmail API is being retired. Key updates include the removal of the Power Automate license requirement, automatic creation of a dedicated Microsoft 365 environment, and no changes needed for DLP policies. Scheduled prompts feature will be available for Microsoft Copilot for Microsoft 365 users starting July 2025."
    }
  ],
  "EndDateTime": "2025-11-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC921752",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-06-05T20:12:00.447Z",
  "Services": [
    "SharePoint Online",
    "Power Apps in Microsoft 365",
    "Microsoft Power Automate in Microsoft 365"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-30T17:56:12Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of the SharePoint SendEmail API",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
