{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft 365 app: Microsoft Loop - Retention Labels will be available for Loop pages and components</p><p>Organizations that rely on Microsoft's records management capabilities in Purview can now include Loop content in their workflows with Retention Labels on Loop pages and components. There's an in-app experience when a label is applied. \n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=397755\" target=\"_blank\">397755</a></p><p>\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out late November 2024 and expect to complete by late December 2024.</p><p>\n</p><p><b>How this will affect your organization:</b>\n</p><p>Tenants that utilize retention labels will now be able to include Loop content in their workflows with Retention Labels on Loop pages and components. There's an in-app experience when a label is applied.\n</p><p>Retention labels from Microsoft Purview Data Lifecycle Management and Microsoft Purview Records Management are supported for .loop files by <a href=\"https://learn.microsoft.com/purview/create-apply-retention-labels?tabs=spo-onedrive\" target=\"_blank\">applying published labels</a> in OneDrive, SharePoint, or SharePoint Embedded or <a href=\"https://learn.microsoft.com/purview/apply-retention-labels-automatically\" target=\"_blank\">automatically applying</a> the labels.\n</p><p>For more information on where Loop content is stored, see <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-compliance-summary?view=o365-worldwide#loop-storage\" target=\"_blank\">Loop Storage</a>.</p><p><b>What you need to do to prepare:</b></p><p>There is nothing you need to do to prepare. Retention labels configured in your tenant will automatically begin working with Loop content when the feature is rolled out.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "397755"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Loop will support Retention Labels for pages and components, aligning with Microsoft Purview's records management. Rollout starts late November 2024, completing by late December 2024. No action is needed for tenants as existing labels will automatically apply to Loop content."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC929030",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-08T23:26:08.873Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-08T23:25:55Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Loop - Retention Labels are available for Loop pages and components",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
