{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 10, 2025: We have updated the content. Thank you for your patience.</p><p>We are changing how you enable or disable the new Microsoft Outlook for Windows and Microsoft Outlook for the web.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late February 2025 (previously late January) and expect to complete by mid-March 2025 (previously mid-February).\n</p><p><b>How this will affect your organization:</b>\n</p><p>We're changing the CASMailbox -<code>OWAEnabled</code> parameter that enables or disables access to user mailboxes using Outlook for the web (formerly known as Outlook Web App or OWA) to block only Outlook for the web and to not affect the behavior of new Outlook for Windows.\n</p><p>You can manage new Outlook for Windows with the CASMailbox-<code>OneWinNativeOutlookEnabled</code> policy.\n</p><p>You are receiving this message because our reporting indicates one or more users in your organization may be using the New Outlook for Windows.\n</p><p>Note: We will not change any existing value for the settings, but we will change which <b>setting controls if the new Outlook for Windows is allowed for the user.</b> Before this rollout, both CASMailbox-<code>OWAEnabled</code> and CASMailbox<code>OneWinNativeOutlookEnabled</code> policies are checked. After this rollout, we will remove the check for CASMailbox-<code>OWAEnabled</code> so you can have the chance to enable new Outlook and still disable Outlook for the web if desired.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>After this change takes effect, please confirm the CASMailbox&nbsp;<code>OneWinNativeOutlookEnabled</code> policy state for each mailbox. The default value is <code>Enabled</code>.\n</p><p><i>Learn more</i></p><ul><li><a href=\"https://learn.microsoft.com/exchange/clients/outlook-on-the-web/mailbox-access\" target=\"_blank\">Enable or disable Outlook on the web access to mailboxes in Exchange Server | Microsoft Learn</a>&nbsp;(will be updated before rollout)</li><li><a href=\"https://learn.microsoft.com/exchange/clients-and-mobile-in-exchange-online/outlook-on-the-web/enable-disable-employee-access-new-outlook\" target=\"_blank\">Enable or disable access to the new Outlook for Windows | Microsoft Learn</a>&nbsp;(will be updated before rollout)</li></ul><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is updating the process to enable/disable new Outlook for Windows and Outlook for the web, starting late January 2025. The rollout will change the CASMailbox parameters, separating the controls for web and Windows versions. Organizations should review configurations and update documentation accordingly. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-04-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC922623",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-10T21:15:48.067Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T23:03:11Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft new Outlook for Windows and Outlook for the web: Changing how to disable/enable",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
