{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Viva Engage: Network admins and corporate communicators will be able to use the new Mute conversations feature to remove individual conversation threads from the Home Feed and email digests.\n</p><p>This feature is part of Engage’s suite of new moderation and digital safety capabilities, following the release of <i>View-only mode </i>and <i>Mute user for network</i> in July-August 2024.\n</p><p>Muting applies to all Engage platforms: Engage on the web, the Engage app in Microsoft Teams and Microsoft Outlook, Engage apps for iOS and Android, and Microsoft SharePoint embeds. Network admins and corporate communicators may only mute from the Engage on the web and Teams and Outlook apps. The muted status will appear in all platforms.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=411583\" target=\"_blank\">411583</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Muting a conversation helps network admins and corporate communicators control which threads receive distribution in the Engage Home Feed and email digests. Muted conversations remain visible in communities and storylines and through search. Feature data are tracked in the Microsoft 365 activity log, showing who muted the conversation, the thread ID of the conversation, and the date/time the conversation was muted.\n</p><p>Network admins and corporate communicators will see an option to&nbsp;<i>Mute conversations in feeds</i>&nbsp;in the three-dot overflow menu in the top right of the conversation card:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7124d408-37a8-4caa-9adb-00a2999dc5c8\" style=\"width: 400px; \" alt=\"user settings\">\n\n</p><p>Users are not informed when conversations are muted. Network admins and corporate communicators will see evidence of the muted conversation on the conversation card.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>This feature will be available by default to Engage users with the corporate communicator and network administrator roles.</p><p>Learn more: <a href=\"https://support.microsoft.com/office/share-and-move-conversations-in-viva-engage-d63debf1-1c90-4ec5-b5ae-8a00939a1680\" target=\"_blank\">Share and move conversations in Viva Engage - Microsoft Support</a> (will be updated with screenshots at rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "411583"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will soon introduce a 'Mute conversations' feature allowing network admins and corporate communicators to remove threads from the Home Feed and email digests. This feature, part of new moderation tools, will be available on all Engage platforms but can only be muted from the web and Teams and Outlook apps. Rollout starts mid-November 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC922624",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-10-31T23:04:33.107Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-31T23:04:13Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Mute conversations in feeds and digests",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
