{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 3, 2025: Thank you for your engagement with the new chat and channels experience in Teams.</p><p>The GA rollout begins late March 2025 in a phased rollout and is expected to be completed by end of April 2025.</p><p>We're making the following product improvements from Public Preview and Targeted Release based on user feedback. \n</p><ul><li>Users who haven't onboarded yet to the new experience will have<b> a simplified onboarding flow</b> in Teams with fewer steps. Users who prefer to keep chat and channels separate can easily do so during the onboarding process or later, without IT assistance. </li><li>When the new experience is available for a user, a Get started screen is displayed. Users will have the option to defer the new experience up to three times over the course of approximately three days. About a week after the new experience is available for a user, they will be presented with a <b>final Get started screen</b> and transition to the new experience.</li><li>For users new to the experience on iOS, iPad, and Android,<b> message previews will be on by default. </b>For users new to the experience on Windows, Mac, and Web, message previews will be off by default.\n</li><li><b>A quick navigation bar for teams and channels</b> is available in Teams for Windows, Mac, and Web, at the bottom of the combined Chat view. Clicking on the bar will scroll the view to the teams and channels section for quick navigation. The bar displays in bold when there are unread messages in channels, or with indicators like \"@\" for unread @mentions in channels.\n</li></ul><p>Note: These updates will roll out to users in Public Preview and Targeted Release ahead of GA.</p><p>To help prepare organizations for the new features, product guides for admins and users are already available on the adoption web page https://adoption.microsoft.com/microsoft-teams/new-chat-and-channels-experience. Adoption content has been updated to reflect the above product improvements <a href=\"https://adoption.microsoft.com/microsoft-teams/new-chat-and-channels-experience\" target=\"_blank\">here</a>. We’ve been listening to user feedback on the pace of work and the challenges of keeping up with conversations, managing messages scattered across different locations, and triaging quickly. To address this, we’ve streamlined the chats, teams, and channels experience to make it easier for users to stay on top of what matters most.</p><p>For more details and screenshots, refer to <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2024/10/28/streamline-collaboration-with-the-new-chat-and-channels-experience-in-microsoft-teams/\" target=\"_blank\">Microsoft Teams announces out a new chat and channels experience | Microsoft 365 Blog</a>\n</p><p>This message applies to Teams on Windows desktops, Mac desktops, the web, and iOS and Android devices.\n</p><p>This message excludes Education tenants. We will send a future post with an update on the plan for Education tenants.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415249\" target=\"_blank\" style=\"\">415249</a>.</p><p><b>When this will happen:</b></p><p>Public Preview / Targeted Release: We will begin rolling out mid-November 2024 and expect to complete by mid-November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out late March 2025 (previously late January) and expect to complete by end of April 2025 (previously early April).</p><p>General Availability (GCC): We will begin rolling out mid-May 2025 (previously mid-June) and expect to complete by late May 2025 (previously late June).</p><p>General Availability (GCC High, DoD): We will begin rolling out mid-June 2025 (previously mid-April) and expect to complete by late June 2025 (previously late April).</p><p><b>How this will affect your organization:</b></p><p>The new experience brings chat, teams, and channels into one place, in <i>Chat</i>, so users can easily navigate between all conversations without switching between contexts. Users start in the combined <i>Chat </i>view but can opt to keep chat separate from teams and channels like before.\n</p><p>In the Chat view, users will see these sections (in order):\n</p><ol><li><i>Favorites </i>containing any previously pinned chats and channels\n</li><li><i>Chats </i>sorted by most recent\n</li><li><i>Teams and channels</i>, organized in same order as in the <i>Teams </i>view\n</li></ol><p>Also, users can create custom sections to organize projects and topics that can include individual, group, and meeting chats, as well as channels. \n</p><p><i>Favorites, Chats, </i>and <i>Teams and channels </i>in one list in Teams for Windows: \n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/93d6a3fa-dc93-48fb-8892-ad7f7f8a4df4\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>Favorites, Chats, </i>and <i>Teams </i>and <i>channels </i>in one list in Teams for iOS (also available for Android):\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/4fa0d5e7-5933-4c9e-96a6-b701b85759d3\" style=\"width: 250px;\" alt=\"user controls\">\n</p><p>New filters for <i>Unread, Chat, Channels, Meetings</i> and more help users focus on relevant conversation in their list. Filters persist until turned off.\n</p><p>The new @mention view gathers all personal @mentions into one interactive list. Users can quickly access messages with @mentions across chats, channels, and meetings.</p><p>Use /go to: Quickly navigate to your frequently used conversation across your chat and channels with a new keyboard shortcut Ctrl+G (Cmd+G on Mac).</p><p>\n</p><p><i>Customizing the experience</i>\n</p><p>Users can tailor their chat and channels experience in Teams <i>Settings</i>. Users can choose to keep chat, teams, and channels combined in <i>Chat </i>(default) or switch to separate <i>Chat </i>and <i>Teams </i>views. In the combined <i>Chat view on</i>&nbsp;Windows, Mac, and Web, message previews are off by default to simplify the list. Users can turn on message previews in <i>Settings</i>.\n</p><p>When using the separate <i>Chat</i> and <i>Teams </i>views, users can still use the new filters and the @mentions view to triage and organize topics with custom sections.</p><p>\n</p><p><i>Starting the new experience</i>\n</p><p>A self-service guided onboarding flow in Teams will help users discover the new experience and configure it to their preferences. Users who prefer to keep chat and channels separate can easily do so during the onboarding process or later, without IT assistance. \n</p><p>When the new experience is available in your tenant, this screen will display to users:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/326d3c5b-3654-44a2-ac42-9c27841227f2\" style=\"width: 400px;\" alt=\"user notification\">\n</p><p>The Get started button will take users to the new combined chat, teams, and channels experience in Chat, and highlight the location of settings. Users will have the option to defer the new experience up to three times over the course of approximately three days, providing flexibility while also moving an organization to the new experience overall.\n</p><p>This feature is on by default. The new experience has no admin policy. Each user can make choices to optimize for how they work best.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. For admins who <a href=\"https://support.microsoft.com/office/send-recommended-office-365-and-microsoft-365-training-81df76b4-1fca-430d-918e-b7fe03c3c056\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">opt in to emails for recommended Microsoft 365 training</a>, an email for users will summarize the update when released.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "415249"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"415249\":[{\"RoadmapId\":415249,\"Platform\":\"iOS\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-10-28T21:13:42.5669795Z\",\"LatestRing\":null},{\"RoadmapId\":415249,\"Platform\":\"Mac\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-15T13:22:48.1704439Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":415249,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-11-15T13:22:48.1704446Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":415249,\"Platform\":\"Android\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-10-28T21:13:42.5669792Z\",\"LatestRing\":null},{\"RoadmapId\":415249,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2024-11-15T13:22:48.1704454Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is rolling out a new streamlined Chat and Channels experience starting late March 2025, completing by end of April 2025. Key updates include a simplified onboarding process, message previews by default on mobile, a quick navigation bar, and combined Chat view. Users can customize their experience and defer the new setup up to three times. This applies to Windows, Mac, web, iOS, and Android, excluding Education tenants. For more details, refer to the Microsoft 365 Roadmap ID 415249."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-08-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC920179",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-03T22:52:44.83Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-10-28T19:23:57Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: The new streamlined Chat and Channels experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
