{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The order of folders in Microsoft Outlook mobile will now sync to match the folder order on Outlook web, Mac, and Windows platforms.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422816\" target=\"_blank\">422816</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early December 2024 and expect to complete by early January 2025.</p><p>Users will now see an updated folder order on their mobile devices that reflects the folder order on Outlook web and desktop platforms. If users want to re-order the folders, they must do so on Outlook for the web, Mac, and Windows devices, as folder re-ordering is currently not supported on mobile devices.&nbsp;</p><p>This feature is on by default and cannot be turned off.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook's folder order will now sync across mobile, web, Mac, and Windows, starting early December 2024 and completing by early January 2025. This update is automatic and cannot be turned off. Admins should inform users and update documentation. Re-ordering must be done on non-mobile platforms."
    }
  ],
  "EndDateTime": "2025-02-17T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC926892",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-06T22:42:25.863Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-06T22:42:04Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: Sync folder order",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
