{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 15, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Before this rollout, users with a Microsoft 365 license can use the <i>Planner </i>tab in Microsoft Teams to create and add existing basic plans and lists to <a href=\"https://support.microsoft.com/office/standard-private-or-shared-channels-in-microsoft-teams-de3e20b0-7494-439c-b7e5-75899ebe6a0e\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">standard channels</a> in Teams. With this update, these users will be able to use built-in templates in the <i>Planner </i>tab in Teams to create plans. If users have licenses for Microsoft 365 and Microsoft Project, they can also create and add existing premium plans to <i>Planner </i>tabs. Plans added to Teams channels with the existing <i>Planner </i>tab will continue to work after the rollout and will not be affected by the rollout. This message applies to Teams for Windows desktop, Teams for Mac desktop, and Teams for the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=464175\" target=\"_blank\">464175</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 (previously early January) and expect to complete by late January 2025 (previously mid-January).\n</p><p><b>How this will affect your organization:</b>\n</p><p>To access the built-in templates in the Planner tab in Teams, select Create new plan in the Planner tab. Templates will be below the options to create basic and premium plans from scratch.\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Admin documentation, including how to turn off the Planner tab if desired: <a href=\"https://learn.microsoft.com/microsoftteams/manage-planner-app#enable-or-disable-planner-in-your-organization\" target=\"_blank\">Manage the Planner app for your organization in Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</p><p>User documentation: <a href=\"https://support.microsoft.com/office/add-and-use-a-planner-tab-in-microsoft-teams-83302f43-f821-47d0-8181-921c36437e22\" target=\"_blank\">Add and use a Planner tab in Microsoft Teams - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "464175"
    },
    {
      "Name": "Summary",
      "Value": "The Microsoft Teams Planner tab is being updated to include built-in templates for creating plans. The rollout, now rescheduled, will begin mid-January 2025 and end by late January. Users with Microsoft 365 and Microsoft Project licenses can also add premium plans. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC937952",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-15T19:50:57.94Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-20T00:23:15Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Updated Planner tab experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
