{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 20, 2025: We would like to inform you that the general availability and other releases of this feature will be delayed. New timelines for release will be communicated in due course. In the meantime, this feature will be rolled back for about a month from the current target releases.</p><p>Now users can quickly review files in Microsoft Teams chat and channel conversations using the file preview option. Using preview, users will be able to consume the file within the flow of work, minimizing the context switch and potentially enhancing the efficiency for the users.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421188\" target=\"_blank\">421188</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will communicate via Message center when we are ready to proceed.</p><p>General Availability (Worldwide): We will communicate via Message center when we are ready to proceed.</p><p>General Availability (GCC): We will communicate via Message center when we are ready to proceed.</p><p>General Availability (GCC High): We will communicate via Message center when we are ready to proceed.</p><p>General Availability (DoD): We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b>\n</p><p>The stage 1 release of this feature will enable previews for single file attachments in Teams messages, starting with PDF files and gradually extending the support for other popular formats such as Microsoft PowerPoint, Microsoft Word, and later Microsoft Excel. The preview option for files in messages with multiple files will be supported in subsequent releases.&nbsp;&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/8aa46256-ef19-40e9-ab5a-d67ba25efa72\" style=\"width: 650px;\"><br></p><p>This new feature is available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421188"
    },
    {
      "Name": "Summary",
      "Value": "The general availability of Microsoft Teams' file interactive previews feature is delayed, with new timelines to be communicated later. The feature allows users to preview files within Teams chats and channels, starting with PDFs and later including other formats. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-07-21T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC934727",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-20T14:34:34.697Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-15T00:41:52Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: File Interactive Previews",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
