{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>With the export of data being one of the core fundamentals of Microsoft Purview eDiscovery, we are excited to announce significant changes coming to the <i>Export </i>feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469031\" target=\"_blank\">469031</a> and with MC808165 <i>(Updated) Microsoft Purview eDiscovery | Modernized eDiscovery in new Microsoft Purview porta</i>l (July 2024)\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: Available now.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-December 2024 and expect to complete by mid-December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>You'll experience these key changes related to the <i>Export </i>enhancements:\n</p><ul><li><i>Unified structure for exports: </i>With eDiscovery’s new modern experience, the <i>Export </i>function between Standard and Premium cases has been streamlined. Customers have a consistent experience for downloads, reports, and error messages. \n</li><li><i>No application needed for Standard customers: </i>Standard users can download data directly through eDiscovery in the browser instead of installing an application to download.\n</li><li><i>Faster exports:</i> We enhanced the backend architecture and optimized partition for faster exports. Also, we removed the limit on the number of ZIPs created for exports. Customers can now have multiple ZIPs with optimized sizes for easier handling of data.\n</li><li><i>Better reporting:</i> The new <i>Export </i>feature has better reporting capabilities, with four reports generated for each export from <i>Search </i>or from <i>Review set</i>. These reports are available for all formats (report only, .pst, or .msg).\n</li><li><i>More export options</i>: Admins will be able to export files in .msg format, a key request from multiple customers. Also, we grouped the options for Microsoft SharePoint and Microsoft OneDrive separately from options for Microsoft Teams and Microsoft Viva Engage.\n</li><li><i>Options removed:</i> We retired the Microsoft Office 365 eDiscovery Export Tool (eDiscovery Standard) and the option to export to a customer-owned Azure Storage location (eDiscovery Premium) because of feedback from customers regarding potential exfiltration risks as well as Microsoft’s security protocols. We removed the .eml export format option, due to low usage.\n</li><li><i>New columns for the </i>Export item report: For more efficiency, we added new columns for <i>Classification types, Documentation parts, </i>and <i>Meeting names.\n</i></li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/purview/edisc-search-export\" target=\"_blank\">Export search results in eDiscovery (preview) | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/edisc-review-set-export\" target=\"_blank\">Export items from a review set in eDiscovery (preview) | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/edisc-ref-export\" target=\"_blank\">Export reference for eDiscovery (preview) | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469031"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC939916",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-22T18:07:54.847Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-22T18:07:45Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | eDiscovery: Export enhancements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
