{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 27, 2025: We have updated the timeline. Thank you for your patience.</p><p>We are providing this update because your tenant is utilizing sensitivity labels and Microsoft SharePoint Online.</p><p>Coming soon: A new capability that ties together SharePoint Online library permissions and Purview sensitivity labeling and protection. We are happy to bring this capability to Public Preview. This is an opt-in feature in Microsoft PowerShell.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=467254\" target=\"_blank\">467254</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-November 2024 and expect to complete by mid-January 2025.</p><p>General Availability (Worldwide, GCC): We will begin rolling out late mid-September 2025 and expect to complete by mid-October 2025.\n</p><p>General Availability (GCCHigh, DoD): We will begin rolling out mid-September 2025 and expect to complete by mid-October 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, SharePoint Online document library owners will be able to apply a sensitivity label at the library level, automatically applying that label to all unprotected and unlabeled files (Microsoft Word, Microsoft Excel, Microsoft PowerPoint, and PDFs) in the target library. This simplifies labeling in bulk across document libraries in an organization. This capability also helps protect files as they egress from the original document library, such as for collaboration purposes or attempted exfiltration. Files downloaded from these libraries are protected at download. Users accessing these files outside of SharePoint Online have their rights evaluated in real time against the document library. Changes to user permissions on the document library are reflected on downloaded files, including full revocation for users removed from the document library. This provides a more streamlined way to revoke access to documents for individual users (instead of revoking access to each document).\n</p><p>Learn more about how to use this feature and its capabilities, limitations, and licensing: <a href=\"https://learn.microsoft.com/purview/sensitivity-labels-sharepoint-extend-permissions\" target=\"_blank\">Configure SharePoint with a sensitivity label to extend permissions to downloaded documents | Microsoft Learn</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>After this feature is available, we recommend you test this feature first on sites with non-production data to understand its capabilities.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review the referenced documentation links to learn more about enabling this feature.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "467254"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint Online library owners can soon apply sensitivity labels at the library level, automatically protecting all files and extending permissions to downloaded documents. This opt-in feature, rolling out from November 2024 to October 2025, enables real-time rights evaluation and streamlined access revocation for users."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC937935",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-27T16:12:23.563Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-19T23:51:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: SharePoint Online library permissions extend to downloaded files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
