{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In response to your feedback, we've updated public documentation, published IT Admin items to the Microsoft 365 Public Roadmap, issued Message Center posts for roadmap features, and summarized everything in a comprehensive blog, linked below, on managing Loop in your organization.</p><p>Blog:&nbsp;<a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/loop-governance-lifecycle-manageability-for-it-admins-%E2%80%93-nov-2024/4237591\" target=\"_blank\">Loop governance, lifecycle, manageability for IT Admins – Nov 2024</a></p><p>This message is associated with and summarizes multiple Microsoft 365 Roadmap IDs. See below.</p><p>\n</p><p><b>When this will happen:</b></p><p>Each Microsoft 365 Roadmap ID has its own schedule and MC post. Refer to each Roadmap ID for details. This summary is a convenience. Recent <a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/loop-governance-lifecycle-manageability-for-it-admins-%E2%80%93-nov-2024/4237591\" target=\"_blank\">IT Admin blog</a> summary covers:</p><p><i>ID 111225, MC923176: Loop workspace Sensitivity Labels</i></p><p style=\"margin-left: 25px;\">Users can apply container-level sensitivity labels to Loop workspaces to prevent oversharing and manage access effectively.</p><p style=\"\"><i>ID 421614, MC923419: Loop guest sharing via Entra B2B configuration for organizations with sensitivity labels</i></p><p style=\"margin-left: 25px;\">Enable B2B guest sharing for Loop workspaces, pages, and components, subject to administrator policy. This allows sharing with people outside your tenant, and now includes organizations that utilize sensitivity labels.</p><p style=\"\"><i>ID 397755, MC929030: Retention Labels are available for Loop pages and components\n</i></p><p style=\"margin-left: 25px;\">Organizations that rely on Microsoft's records management capabilities in Purview can now include Loop content in their workflows with Retention Labels on Loop pages and components. There's an in-app experience when a label is applied.\n</p><p style=\"\"><i>ID 421613, MC929029: Common Admin Management Tasks Enabled for all Loop workspaces\n</i></p><p style=\"margin-left: 25px;\">Admins can manage membership, ownership, deletion, and restoration of Loop workspaces in the SharePoint Embedded admin center or PowerShell. These changes are visible within the Loop experience.\n</p><p style=\"\"><i>ID 422727, MC929028: New personal Loop workspace\n</i></p><p style=\"margin-left: 25px;\">The Loop app now provides a personal workspace to all users, which is shared with Copilot Pages. This personal workspace is a user-owned SharePoint Embedded container, one per user. All governance, lifecycle management and compliance processes apply the same way they would to a user's OneDrive.\n</p><p style=\"\"><i>ID 422729, MC929028: Ideas Workspace Functions as a Shared Loop workspace.\n</i></p><p style=\"margin-left: 25px;\">Loop Ideas workspaces are tenant-managed like SharePoint Communication sites. They appear with existing Loop workspaces, with all features such as adding members and organizing pages.\n</p><p style=\"\"><i>ID 362124, MC929027: Promote Members to Owners in Loop workspaces\n</i></p><p style=\"margin-left: 25px;\">Loop workspaces support multiple owners, allowing end-users to promote members to owners.\n</p><p style=\"\"><i>ID 422728, MC929023: Microsoft 365 Groups for Managing New Loop workspaces\n</i></p><p style=\"margin-left: 25px;\">When creating a new Loop workspace, users can choose an existing Microsoft 365 Group to manage the workspace's lifetime, governance, and compliance, similar to SharePoint Team sites.\n</p><p style=\"\"><i>ID 422725, MC929022: Require Existing Microsoft 365 Group for New Loop workspaces\n</i></p><p style=\"margin-left: 25px;\">Ensure new Loop workspaces are connected to and managed by an existing Microsoft 365 Group, similar to SharePoint Team sites.\n</p><p style=\"\"><i>ID 421616, MC929025: Multi-Geo Support for Shared Loop workspaces\n</i></p><p style=\"margin-left: 25px;\">Data storage for shared Loop workspaces in the correct geo. M365 group-owned workspaces are created in the group's geo, while non-M365 group-owned workspaces are created in the creator's preferred data location.\n</p><p style=\"\"><i>ID 421615, MC929021: User Accessible Recycle Bin for Loop workspaces\n</i></p><p style=\"margin-left: 25px;\">When users delete a Loop workspace, owners can restore it from a recycle bin in Loop. In development Published 9119872\n</p><p style=\"\"><i>ID 421611, MC929020: Admin Usage Reports\n</i></p><p style=\"margin-left: 25px;\">View and monitor Loop usage in the tenant through existing M365 admin usage dashboards.\n</p><p style=\"\"><i>ID 421612, MC929014: Departed User Content Workflows for User-Owned Loop workspaces\n</i></p><p style=\"margin-left: 25px;\">Manage retention and deletion workflows for user-owned Loop workspaces like Copilot Pages when users leave the organization. Notify and provide temporary access to other employees or administrators to save important data before deletion policies take effect.\n</p><p style=\"\">General Availability (Worldwide): We will begin rolling out late November 2024 and expect to complete most of the work by late April 2025.</p><p><b>How this will affect your organization:</b></p><p>We've consolidated all the information in one place to build confidence for enabling and using Loop in your organization. The blog and companion video (linked in at the top of the blog) provide the full story. Leave your questions in the blog comments!</p><p>Blog:&nbsp;<a href=\"https://techcommunity.microsoft.com/blog/microsoft_365blog/loop-governance-lifecycle-manageability-for-it-admins-%E2%80%93-nov-2024/4237591\" target=\"_blank\" style=\"\">Loop governance, lifecycle, manageability for IT Admins – Nov 2024</a>&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>No action needed. These capabilities will be available automatically with each feature rollout.</p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC938646",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-20T22:07:59.44Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-20T22:07:45Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Loop governance, lifecycle, manageability for IT Admins – Nov 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
