{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Microsoft Purview | Insider Risk Management will introduce a central location for all reports including analytics and user activity reports. New <i>Alerts </i>and <i>Cases </i>operational reports will summarize trends in alerts generated and cases created. Sample reports include alerts and cases generated over time, alerts actioned over time, alerts and cases generated by region and department, top triggering events of alerts generated, and average time to triage alerts and cases. Users with the admin, analyst, or investigator role will be able to access the new <i>Alerts </i>and <i>Cases </i>operational reports.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420939\" target=\"_blank\">420939</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early December 2024 and expect to complete by late December 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 and expect to complete by mid-March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p><i>To access the Alerts and Cases reports</i>\n</p><ol><li>In Insider Risk Management, go the new <i>Reports </i>page at <a href=\"https://purview.microsoft.com/insiderriskmgmt/reportingpage\" target=\"_blank\">https://purview.microsoft.com/insiderriskmgmt/reportingpage</a>\n</li><li>Select <i>Alerts </i>or <i>Cases</i></li><li>To drill deeper into each report, select <i>View details\n</i></li></ol><p>Access the new unified <i>Reports</i> page at <a href=\"https://purview.microsoft.com/insiderriskmgmt/reportingpage\" target=\"_blank\">https://purview.microsoft.com/insiderriskmgmt/reportingpage</a>:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e9a14797-c623-44f0-9c72-e663faa86ac4\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>To view new reports, Select <i>Alerts </i>or <i>Cases </i>on the <i>Reports </i>page:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/6e06f319-dc42-4215-b0b0-844c7d9ae462\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Photo2- Example of an <i>Alerts </i>report:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/db1d2dce-b457-45d7-8fdf-af4998fe6226\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This feature is available by default to be configured by admins, analysts, or investigators.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins and investigators about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management\" target=\"_blank\">Learn about insider risk management | Microsoft Learn</a>\n</p><p>Before rollout, we will update this post with revised documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420939"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview | Insider Risk Management is introducing new reporting capabilities with a central location for all reports, including analytics and user activity. New Alerts and Cases operational reports will be available for admins, analysts, or investigators, rolling out from December 2024 to March 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC932480",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-13T01:19:59.16Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-13T01:19:28Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: New Insider Risk Management reporting capabilities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
