{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 13, 2024: We have updated the content. Thank you for your patience.</p><p>Coming soon to the Microsoft 365 admin center: Tenant restrictions v2 enables tenants to enhance security by limiting what users can access when they use an external account to sign in from your networks or devices. The Tenant restrictions v2 settings, included with cross-tenant access settings, are designed to address the security of cross-company exchange.\n</p><p>Authentication plane protection is supported by Microsoft Entra ID. This rollout enables data plane protection for the Microsoft 365 admin center. Learn more: <a href=\"https://learn.microsoft.com/entra/external-id/tenant-restrictions-v2\" target=\"_blank\">Configure tenant restrictions - Microsoft Entra ID - Microsoft Entra External ID | Microsoft Learn</a>\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Admins are not able to limit what users can access when they use the Microsoft 365 admin center with an external account to sign in from their networks or devices.\n</p><p><i>After this rollout</i>\n</p><ul><li>Tenant restriction v2 (TRv2) can be used to prevent data exfiltration using a foreign identity. \n</li><li>TRv2 works by sending special signals to Microsoft Entra ID, Microsoft Account, and other Microsoft resources.\n</li><li>Tenant restrictions v2 settings will be off by default and available for admins to enable them.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Review your current configuration to determine the impact for your organization.</p><p>To take advantage of TRv2 in the Microsoft 365 admin center, create a cross-tenant access setting. Learn more: <a href=\"https://learn.microsoft.com/entra/external-id/tenant-restrictions-v2\" target=\"_blank\">Configure tenant restrictions - Microsoft Entra ID - Microsoft Entra External ID | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft 365 admin center will soon support Tenant Restriction v2, enhancing security by limiting user access via external accounts. This feature, part of cross-tenant access settings, will be rolled out from mid-November to late December 2024 and will be off by default. No admin action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC931380",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-13T17:37:32.187Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-11T23:38:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 admin center will support Tenant restriction v2",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
