{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Your organization can already apply Microsoft Purview Data Loss Prevention (DLP) policies to Microsoft Fabric, but soon you will also be able to restrict access to Fabric sematic models by applying DLP policies. After this rollout, admins will be able to configure DLP policies that automatically detect sensitive information in sematic models and then restrict access to this data to internal users or data owners.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422501\" target=\"_blank\">422501</a>.</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late November 2024 and expect to complete by mid-December 2024.</p><p>\n</p><p>We will update this message later to add the plan for General Availability</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, you can configure DLP policies for Fabric workspaces to audit and notify users through Policy Tips based on sensitive content. \n</p><p>After this rollout, DLP policies can also be configured to block or restrict access to internal users or data owners. This action is especially valuable when your organization has guest users, and you want to enforce proper restrictions to ensure these users do not accidentally access sensitive information.\n</p><p>This change is available by default for admins to configure.\n</p><p>Configuring the <i>Restrict access</i> action in DLP policy for Fabric:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d94ac7d9-4c32-4263-8714-8da40ca65053\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. If your organization does not wish to start using the <i>Restrict access</i> action for Fabric, no additional action is required. If you would like to start restricting access to internal users or data owners, your security or compliance admin will need to update or create new DLP policies for Fabric to include the new <i>Restrict access</i> action.\n</p><p>Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/en-us/fabric/governance/data-loss-prevention-overview\" target=\"_blank\">Data loss prevention policies in Microsoft Fabric - Microsoft Fabric | Microsoft Learn</a>\n</li><li><a href=\"https://aka.ms/DLPblog\" target=\"_blank\">New Capabilities for Microsoft Purview DLP</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422501"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC937920",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-19T23:41:43.39Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-19T23:41:26Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Restrict Access action for semantic models in Microsoft Fabric (preview)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
