{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Microsoft Teams Explicit Consent meeting policy is expanding to support group calls and Meet Now. When applied to a user, this policy will ensure that any recording/transcription initiated by that user in a group call or Meet Now will prompt all participants to provide consent for their media to be included in the recording and transcription. Participants cannot share audio, video, or screenshare/content-share until consent is given.&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-November 2024 and expect to complete by late November 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>The Explicit Consent feature is off by default and is controlled by IT administrators through Teams meeting policy. Admins can enable this feature either for the entire tenant or for specific individuals, according to their business requirements.</p><p>When a user with the policy enabled starts a recording in a group call or Meet Now, all call participants will be prompted to give their consent to be included in the recording/transcription. Until consent is given by each participant, their audio, video, and screenshare/content-share will not be captured in the recording/transcription.</p><p><b>What you need to do to prepare:</b>\n</p><p>Update any relevant training materials to reflect that this policy now applies to group calls and Meet Now.</p><p>Admins can enable or disable this feature using PowerShell or the Teams Admin Center. For more details, visit:</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/meeting-recording?tabs=meeting-policy#require-participant-agreement-for-recording-and-transcription\" target=\"_blank\">Require participant agreement for recording and transcription</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/meeting-recording?tabs=meeting-policy#manage-explicit-consent\" target=\"_blank\">Manage via Teams Admin Center</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/meeting-recording?tabs=meeting-policy#manage-explicit-consent-through-powershell\" target=\"_blank\">Manage through PowerShell</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-01-13T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC937915",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-19T23:39:18.727Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-19T23:39:03Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Explicit Consent for recording and transcription in group calls and Meet Now",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
