{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Purview Insider Risk Management (IRM): We have enhanced these existing Microsoft Office 365 indicators:\n</p><ul><li><i>Downgrading sensitivity labels applied to SharePoint files\n</i></li><li><i>Removing sensitivity labels from SharePoint files\n</i></li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=466742\" target=\"_blank\">466742</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-November 2024 and expect to complete by early December 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out late January 2025 and expect to complete by early February 2025.\n</p><p><b>How this will affect your organization:</b>\nBefore this rollout, IRM only captures sensitivity label changes on the Microsoft SharePoint web app.\n</p><p>After this rollout, IRM will capture sensitivity label changes (downgrade or remove) when performed on Microsoft OneDrive, Microsoft Azure Information Protection, or endpoints (SharePoint files opened in an Office app or any sensitivity label change on the local files on a user's device). Also, we will rename the indicators:\n</p><ul><li><i>Downgrading sensitivity labels applied to SharePoint files </i>will become<i> Downgrading sensitivity labels applied to files\n</i></li><li><i>Removing sensitivity labels from SharePoint files </i>will become<i> Removing sensitivity labels from files\n</i></li></ul><p>In <i>Activity explorer</i>, events that occurred before this rollout for these indicators will continue to show <i>Labels of sensitive files on SharePoint downgraded</i> or <i>Label of sensitive files removed on SharePoint.</i> Events that occur after the rollout will be shown as <i>Labels of sensitive files downgraded </i>or <i>Labels of sensitive files removed.</i>\n</p><p>No action is needed to enable these features. This feature will be on by default. \n</p><p>The renamed indicators in the IRM policy wizard:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qHtP?ver=1899\" style=\"width: 400px;\" alt=\"admin controls\">\n\n</p><p>Example of a new event for <i>Downgrading sensitivity labels applied to files</i> as shown in <i>Activity explorer:</i>\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qHtQ?ver=4fb0\" style=\"width: 400px;\" alt=\"admin controls\">\n\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "466742"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will soon update to capture sensitivity label changes on OneDrive, Azure Information Protection, and endpoints, not just SharePoint. Public Preview starts mid-November 2024, with General Availability in late January 2025. No action is required for this automatic update."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC934733",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-15T00:45:07.45Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-15T00:44:42Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Downgrade or remove sensitivity label",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
