{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Defender for Cloud Apps: The <a href=\"https://learn.microsoft.com/defender-cloud-apps/saas-security-initiative\" target=\"_blank\">SaaS Security Initiative</a>, a new capability designed to change the way our customers consume SaaS security posture recommendations that consolidates best-practice recommendations for configuring SaaS applications.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p><i>Why do you need this?</i>\n</p><p>The SaaS Security Initiative provides a centralized location for all SaaS Security best practices. It is designed to help our customers manage and prioritize security recommendations effectively. By starting with the metrics that hold the highest weight, customers can efficiently enhance their SaaS Security posture.\n</p><p><i>What is it?</i>\n</p><p>The SaaS Security Initiative serves as the new homepage for SSPM (SaaS Security Posture Management), consolidating all best-practice recommendations into 12 measurable metrics. These metrics enable our customers to efficiently manage and prioritize the large number of security recommendations.\n</p><p><i>How does it work?</i>\n</p><ol><li>Go to Defender for Cloud Apps &gt; <i>Exposure management</i> &gt; Select <i>Initiatives</i> &gt; Select the <i>SaaS security</i> initiative &gt; Select <i>Open initiative page</i> to access the <i>Security metrics</i> view. The <i>Security metrics</i> page displays 12 measurable metrics that categorize hundreds of best-practices recommendations.\n</li><li>We recommend you begin working on a metric with a <i>High</i> weight. For example, to review all best-practices recommendations related to SaaS-to-SaaS interactions, select the metric called <i>Missing best practices to secure apps interacting with other apps via oAuth protocol.\n</i></li><li>Select a <i>Not compliant</i> recommendation and follow the remediation steps.\n</li></ol><p>This new feature will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>To take full advantage of the SaaS Security Initiative, you must have a license for Defender for Cloud Apps and enable at least one connector in Defender for Cloud Apps. We recommend you enable the Microsoft 365 connector to seamlessly view more than 60 recommendations.\n<br>To learn more on app-connectors enablement: https://learn.microsoft.com/defender-cloud-apps/enable-instant-visibility-protection-and-governance-actions-for-your-apps</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/defender-cloud-apps/saas-security-initiative\" target=\"_blank\">SaaS security initiative - Microsoft Defender for Cloud Apps | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC937932",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-19T23:48:50.273Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-19T23:48:42Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Dender for Cloud Apps: New SaaS Security Initiative in the “Exposure management” experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
