{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated July 3, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>Extend your sensitivity labels to specific or all subscriptions within Azure Storage, Azure SQL, Azure Cosmos DB, Azure Data Explorer, Azure Database for MySQL, Azure Database for PostgreSQL, Azure Databricks Unity Catalog, Azure SQL Managed Instance, Azure Synapse Analytics, Snowflake, Dataverse, and SQL Server via auto-labeling policy. Clearly define labeling conditions for data sources beyond M365 without fear of it interfering with existing M365 files configurations.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=429876\" target=\"_blank\">429876</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early July 2025 and expect to complete by late July 2025.</p><p>General Availability (Worldwide): We will begin rolling out late November 2025  and expect to complete by late December 2025.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>You can create new auto-labeling policies for non-m365 workloads Server that allow you to specify specific data assets or ALL assets to be automatically labeled when the out-of-the-box sensitive information types are detected in a column or asset. After the auto-labeling policy is turned on, wait 15 minutes, and then rescan the scoped data assets. The assets will be labeled automatically.\n</p><p>This change will be available by default for admins to configure.\n</p><p>After the rollout, these capabilities will no longer be available:\n</p><ul><li>The ability to extend labeling to assets in the Microsoft Purview Data Map (opt in)\n<ul><li>Instead, you can select where to extend these assets in an auto-labeling policy\n</li></ul></li><li><i>Schematized data assets</i> as an applicable label scope\n<ul><li>You can select any label with the scope <i>Files &amp; other data assets</i> for labeling in non-Microsoft 365 workloads\n</li></ul></li><li>Auto-labeling for schematized data assets in label definition\n<ul><li>If you have configured <i>Auto-labeling for schematized data assets</i> in the label definition, you will need to reconfigure those conditions in an auto-labeling policy. \n</li></ul></li></ul><p>Tip: After you apply labeling to data assets, you can use protection policies to add access control settings associated with the label.\n</p><p>You will be able to select <i>non-m365 workloads</i>&nbsp;in the auto-labeling policy:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e8fe772e-b2fe-4c68-b96d-a6eced6f3199\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><ul><li><a href=\"https://learn.microsoft.com/purview/sensitivity-labels-frequently-asked-questions\" target=\"_blank\">Sensitivity Labels in the Microsoft Purview Data Map FAQ</a>\n</li><li><a href=\"https://learn.microsoft.com/purview/purview-billing-models\" target=\"_blank\">Learn about Microsoft Purview billing models | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/purview/purview-billing-models\" target=\"_blank\"><a href=\"https://learn.microsoft.com/purview/data-map-data-sources\" target=\"_blank\">Data sources that connect to Microsoft Purview Data Map | Microsoft Learn</a><br></a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "429876"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's auto-labeling for Azure Storage and Azure SQL will be available in public preview in July 2025 and generally available by December 2025. This feature allows auto-labeling of data assets beyond M365, with specific or all subscriptions. Admins can configure these policies, and existing capabilities will be updated."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-02-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC933531",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-07-11T19:46:59.897Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-13T23:14:19Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Auto-labeling for Microsoft Azure Storage and Azure SQL",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
