{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re updating Microsoft Secure Score improvement actions to ensure a more accurate representation of security posture.&nbsp; A new Microsoft Defender for Identity posture recommendation will be added: \"Prevent Certificate Enrollment with arbitrary Application Policies (ESC15)\".&nbsp;</p><p>\n</p><p>Your score will be updated accordingly.&nbsp;</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-November 2024 and expect to complete by mid-December 2024.</p><p>General Availability (Worldwide, GCC, GCC High, DoD):&nbsp;We will begin rolling out late November 2024 and expect to complete by mid-December 2024.</p><p>Please note that in order to provide the recommendation as quickly as possible, it will be introduced to your environment at the earliest opportunity rather than on the regular monthly schedule.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>We are adding a new Microsoft Defender for Identity posture recommendation that will be added as Microsoft Secure Score improvement actions: \"Prevent Certificate Enrollment with arbitrary Application Policies (ESC15)\".&nbsp;</p><p>This new security posture report is related to Active Directory Certificate Services (AD CS) that analyze the configurations of different AD CS components and guide remediation, if necessary.</p><p>This update is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>There's no action needed to prepare for this change. Your score will be updated accordingly. Microsoft recommends reviewing the improvement actions listed in Microsoft Secure Score. We will continue to add suggested security improvement actions on an ongoing basis.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Secure Score will add a new Defender for Identity recommendation, \"Prevent Certificate Enrollment with arbitrary Application Policies (ESC15)\", to improve security posture. Public Preview begins mid-November 2024, with General Availability starting late November 2024. No action is required for preparation."
    }
  ],
  "EndDateTime": "2025-01-20T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC932478",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-13T01:18:36.497Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-13T01:18:03Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Secure Score: New Microsoft Defender for Identity recommendation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
