{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, users will soon be able to customize their digital avatar by uploading a photo. After the photo avatar is set up, this avatar can be used in Teams meetings and Mesh immersive spaces.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-November 2024 and expect to complete by late November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p><i>Requirements and limitations\n</i></p><ul><li>You need to use Teams 2.1 to access the <i>Create from photo</i> feature. We do not support classic Teams (Teams 1.0).\n</li><li>The <i>Create from photo </i>feature is available in Teams for Windows desktops and Mac desktops. Creating an avatar from a photo feature is not currently supported in immersive spaces or the Mesh standalone app, but after an avatar is created, it will be available across all Mesh experiences.\n</li><li>To use this feature, tenants must have a license for Teams Enterprise, Teams Essentials, or one of these:\n<ul><li>Microsoft 365 Business Basic, Microsoft 365 Business Standard, Microsoft 365 Business Premium, Microsoft 365 E3/E5, or Microsoft Office 365 E1/E3/E5\n</li></ul></li><li>To use avatars in Teams meetings, the minimum hardware spec requires a dual-core processor with 6GB of RAM. For the best experience, we recommend a quad-core processor and 8GB of RAM.\n</li></ul><p><i>Setup</i>\n</p><p>After the rollout, when users select the + icon to create a new avatar, they will see a new option to <i>Create from photo</i> in addition to the other options available before the rollout.\n</p><p><a href=\"https://www.microsoft.com/en-us/videoplayer/embed/RW1qPhL\" target=\"_blank\">Watch the video for the&nbsp;<i>Create from photo</i> process</a> (no sound, 21 seconds)\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/29808e51-c8a7-4790-bd8b-3c72792aaee8\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The limit of three avatars per user remains unchanged. If all three avatar slots are filled, one must be deleted to create a new avatar from a photo.\n</p><p>This feature will be available by default for admins to enable.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>To enable this feature in Teams, you need to enable the Avatars for Microsoft Teams app in Teams through the Teams admin center. Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/manage-apps\" target=\"_blank\">Manage the Avatars app for Microsoft Teams - Microsoft Teams | Microsoft Learn</a>.\n</p><p><i>Additional information</i>\n</p><p>In alignment with the broader Microsoft 365 policies and operational practices, Mesh ensures the safety of your data as you traverse through the platform. Some of our commitments are listed below:\n</p><ul><li>Mesh secures data at rest and in transit.\n</li><li>Microsoft does not control your data.\n</li><li>Mesh data is stored in accordance with Microsoft 365 data commitments and honors the EU Data Boundary (EUDB).\n</li><li>User photos are not retained or used for any other purpose. Learn more about the <a href=\"https://support.microsoft.com/office/join-a-meeting-as-an-avatar-in-microsoft-teams-5384e7b7-30c7-4bcb-8065-0c9e830cc8ad#bkmk_biometric\" target=\"_blank\">use of biometric data in the <i>Create from photo</i> feature</a>.\n</li></ul><p>Microsoft Mesh adopts the privacy features from Microsoft 365, Teams and Microsoft SharePoint where applicable. For more information, refer to <a href=\"https://privacy.microsoft.com/privacystatement\" target=\"_blank\">Microsoft Privacy Statement</a>, the <a href=\"https://learn.microsoft.com/compliance/regulatory/gdpr\" target=\"_blank\">General Data Protection Regulation</a>, and the <a href=\"https://www.microsoft.com/trust-center/privacy/european-data-boundary-eudb\" target=\"_blank\">Microsoft EU Data Boundary</a>.\n</p><p>User documentation: <a href=\"https://support.microsoft.com/office/join-a-meeting-as-an-avatar-in-microsoft-teams-5384e7b7-30c7-4bcb-8065-0c9e830cc8ad\" target=\"_blank\">Join a meeting as an avatar in Microsoft Teams - Microsoft Support</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC937922",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-19T23:43:20.143Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-19T23:43:13Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Creating an avatar from a photo will soon be GA",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
