{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 3, 2024: We're delaying further rollouts of warning banners and blocking pages in December and intend to resume in mid-January. We'll have a more detailed update later.</p><p>In today’s security climate, our work across the company and greater industry to keep this critical ecosystem secure is more important than ever. And while we also ship bug fixes and other new features via continuous innovation, in the end security is job one.\n</p><p>Keeping Microsoft Teams up to date is critical to ensure your devices are secure and compliant.  By default, and as designed, Teams updates automatically which successfully updates most clients in the world without additional overhead for customers. \n</p><p>Microsoft Teams is governed by the <a href=\"https://docs.microsoft.com/lifecycle/policies/modern\" target=\"_blank\">Modern Lifecycle Policy</a> which requires that the Teams desktop client be kept up to date.  This is not a new policy, for instance in MC298823 (November 2021), a version that is far out of date will become incompatible with the service until it’s updated.  As <a href=\"https://learn.microsoft.com/microsoftteams/teams-client-update#servicing-agreement\" target=\"_blank\">documented</a>, when a client falls out of date, the user will see:\n</p><ul><li>Recurring in-app alerts, if the app is between 30d-90d out of date.\n</li><li>A blocking page in Teams, if the app is greater than 90 days out of date.  At this point, the app will show options to update, to contact their IT administrator, or continue to Teams on the web.  \n</li></ul><p>As an example, if the Teams app is hypothetically on a version released on January 1 and the next update is fully available on January 15, an in-app alert would be shown on February 14th (30 days after the January 15th update).  \n</p><p>For reference, link to the Teams app's  <a href=\"https://docs.microsoft.com/officeupdates/teams-app-versioning\" target=\"_blank\">version's release dates</a>.  Also, <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-usage-report\" target=\"_blank\">The Microsoft Teams desktop client usage report</a> gives you an overview of the Teams desktop clients in use within your organization.\n</p><p>Classic Teams is not in scope for this post; see MC783985 for Classic Teams Timelines regarding end of support and end of availability.\n</p><p><b>When this will happen:</b>\n</p><p>The existing policy enforcement will be visible beginning November 12th, 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>New Teams - Windows &amp; Mac Versions desktop clients (not running in a VDI environment) \n</p><ul><li>Beginning November 12th, 2024, Teams desktop clients &gt;30d out of date, will present a banner or notification to users that they are on an outdated version of Teams.  For reference,\n<ul><li>Windows client versions less than 24231.512.3106.6573 are impacted on November 12.\n</li><li>Mac client versions less than 242507.3125.3475 are impacted on Nov 12.\n</li></ul></li><li>(On hold) Beginning December 4th, 2024, Teams desktop clients older than 90d out of date, will present a blocking page. They will be shown an option to update to the latest version of Teams from <a href=\"https://www.microsoft.com/microsoft-teams/download-app\" target=\"_blank\">this page</a> or use Teams on the web.   For reference,\n<ul><li>Windows client versions less than 24193.1805.3040.8975 are impacted on December 4th.\n</li><li>Mac client versions less than 24215.1002.3039.5089 are impacted on December 4th.\n</li></ul></li></ul><p>New Teams app running in a VDI environment – Windows desktop clients will follow the same policies as non-VDI environments, with enforcement starting on dates below\n</p><ul><li>Beginning January 13th, 2025, for clients more than 30d out of date will get a banner or notification to users that they are on an outdated version of Teams.\n</li><li>Beginning February 3rd, 2025, for clients older than 90d out of date, the Teams desktop client will present a blocking page.\n</li></ul><p>Note: The enforcement policies on preview rings may start mid-November. The 30d out of date in app messaging and 90d out of date blocking dates still apply (for versions released to that ring) \n</p><p><b>What you can do to prepare:</b>\n</p><p>To avoid disruption to end-users, the admins with users on Teams versions older than the currently released versions, should update their users to the most recent version. \n</p><p>Admins should make sure Teams is automatically updating to stay current and within the compatibility window.  Common configurations to validate include:\n</p><ul><li>Teams clients on macOS have Microsoft AutoUpdate (MAU) configured properly.  <a href=\"https://learn.microsoft.com/microsoftteams/teams-client-update#updating-teams-on-mac-devices\" target=\"_blank\">Learn More</a>\n</li><li>Customer network settings, and any device management software e.g. antivirus, are configured properly to allow automatic updates.\n</li><li>Windows <a href=\"https://learn.microsoft.com/microsoftteams/troubleshoot/teams-administration/fix-new-teams-installation-issues#policy-settings-prevent-download-and-installation\" target=\"_blank\">Policies</a> must not block new Teams or the <a href=\"https://learn.microsoft.com/microsoft-edge/webview2/concepts/enterprise\" target=\"_blank\">Webview2 updater</a>.\n</li></ul><p>Please visit <a href=\"https://learn.microsoft.com/microsoftteams/teams-client-update\" target=\"_blank\">this page</a> to learn more.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message emphasizes the importance of keeping Microsoft Teams desktop clients updated for security and compliance. Teams updates automatically, but admins should ensure this feature is properly configured. Starting November 12th, 2024, outdated clients will receive notifications, and by December 4th, 2024 (on hold), a blocking page will appear for versions older than 90 days. Admins need to prepare by updating Teams and verifying configurations."
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC931401",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-03T19:10:00.143Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-12T00:06:12Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Ensuring Security and Compliance: Keep your Microsoft Teams desktop clients up to date",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
