{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft SharePoint Embedded is an API-only solution empowering app developers to leverage Microsoft 365's file and document storage to create line-of-business or multitenant applications. Microsoft Loop is an example of SharePoint Embedded application.\n</p><p>Organizations who are using these SharePoint Embedded applications in their Microsoft 365 tenants are the consuming tenants. The consuming tenant admins have the ability to manage SharePoint Embedded applications registered in their tenant in the SharePoint admin center. With this rollout, we will enhance the functionality so admins can manage the containers more effectively in the SharePoint admin center.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468886\" target=\"_blank\">468886</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out mid-November 2024 and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>To summarize the enhancements in the SharePoint admin center:\n</p><p><i>Container management features</i>\n</p><ul><li>Sorting containers\n</li><li>Filtering containers\n</li><li>Setting sensitivity labels on containers\n</li></ul><p><i>User management features</i>\n</p><ul><li>Add user to a role in container\n</li><li>Reassign a user from an existing role in a container\n</li><li>Remove a user from an existing role in a container\n</li></ul><p><b>Note: </b>Unlike SharePoint sites, in SharePoint Embedded containers, the available roles are:\n</p><ul><li>Owners, who have full control over the container and the contents of the container\n</li><li>Managers, who can add, update, and delete contents of a container and also maintain permissions of the container but cannot delete a container\n</li><li>Writers, who can add, update, and delete content in the container\n</li><li>Readers, who can only view content in the container\n</li></ul><p>Every user can be assigned to only one role at any given time. To access this functionality, admins must be assigned the SharePoint Embedded admin role in the Microsoft 365 admin center and log in to the SharePoint admin center.\n</p><p>Before this rollout, admins are able to perform these tasks:\n</p><p>On the <i>Active containers</i> page, the consuming tenant admin can:\n</p><ul><li>View all containers present in your tenant and their corresponding metadata</li><li>Have a detailed view of a singular container\n</li><li>Delete a container\n</li><li>Export the list of active containers\n</li></ul><p>On the <i>Deleted containers</i> page, the consuming tenant admin can:\n</p><ul><li>View all deleted containers in your tenant and their corresponding metadata\n</li><li>Restore a deleted container\n</li><li>Permanently delete a deleted container\n</li></ul><p>After the rollout, admins will be to perform these additional tasks:\n</p><p>On the <i>Active containers page</i>, the consuming tenant admin can:\n</p><ol><li>Sort containers on the basis of criteria applied on selected columns\n</li><li>Filter containers on basis of criteria applied on selected columns (including multi-filtering)\n</li><li>Add a sensitivity label to a container in the <i>Settings </i>tab of the container's detail panel\n</li><li>Manage user roles of a container in the <i>Membership </i>tab of the container's detail panel\n</li></ol><p>Container management through filters and sort functionality by application:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b885e04d-7b11-4b74-aa20-4649481389e5\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>User role management through addition, removal and reassigning of users:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/0df7bc52-1272-4ddd-bb46-57646ff3b44b\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Assign the SharePoint Embedded admin role to the admins.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/sharepoint/dev/embedded/concepts/admin-exp/consuming-tenant-admin/ctaux\" target=\"_blank\">Manage Containers in SharePoint Admin Center | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468886"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-21T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC939926",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-22T18:11:04.353Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-22T18:10:59Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft SharePoint: Enhanced functionality to manage SharePoint Embedded containers in SharePoint admin center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
