{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 20, 2024: We have updated the content with additional resources</p><p>Outlook Data Files (.pst) or Personal Storage Tables files contain Microsoft Outlook user messages and other Outlook items (contacts, appointments, tasks, notes, and journal entries) saved in local files on each user's computer.\n</p><p>With this rollout, the first phase of support for .pst files in the new Microsoft Outlook for Windows will provide read-only access to Mail items in .pst files. Users will be able to open .pst files, read their e-mails in .pst files, and search .pst files for e-mails. All Calendar, Contacts, and Tasks data are saved in .pst files, but cannot be accessed in this preview. In future releases, we will expand the support for PST support capabilities.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=399467\" target=\"_blank\">399467</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late November 2024 and expect to complete by early December 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 and expect to complete by late January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Users will be able to open .pst files, read their e-mails in .pst files, and search .pst files for e-mails.\n</p><ol><li>To open an Outlook Data File (.pst), go to <i>Settings &gt; General &gt; Outlook Data Files\n</i></li><li>Select <i>Add file</i></li><li>Select <i>Continue to open\n</i></li><li>Select a .pst file and then select <i>Open</i>\n</li></ol><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b7b334af-0648-4dbe-99cf-8bdc0e96655f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><i>Requirements</i>\n</p><ul><li>Outlook Data Files (.pst) require M365 to be installed.\n</li><li>Outlook Data Files (.pst) require M365 subscription.\n</li><li>Outlook Data File support is not available with ARM version of new Outlook for Windows.\n</li></ul><p><i>Policy</i>\n</p><p>Outlook Data File support is enabled by default in new Outlook for Windows, but you can limit and disable it with the <code>OutlookDataFile</code> mailbox policy. The new Outlook for Windows only enforces the <code>OutlookDataFile</code> policy of the primary account. For more information on enabling the policy, refer to the<a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy?view=exchange-ps#-outlookdatafile\" target=\"_blank\"> OutlookDataFile parameter in Set-OwaMailboxPolicy</a>.\n</p><p><b>NOTE: </b>The group policy used to control Outlook Data File (.pst) in classic Microsoft Outlook for Windows desktop does not affect new Outlook for Windows.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Outlook Data File (.pst) support is enabled by default in new Outlook for Windows. If you organization wants to block or limit Outlook Data File support, set the <code>OutlookDataFile</code> mailbox policy.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p><p>Additional resources:&nbsp; <a href=\"https://support.microsoft.com/en-us/office/open-and-find-items-in-an-outlook-data-file-pst-2e2b55a4-f681-4b93-90cb-31d39349fb95\" target=\"_blank\">Open and find items in an Outlook Data File (.pst) - Microsoft Support</a>.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "399467"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Outlook for Windows will offer read-only support for .pst files, allowing users to open, read, and search emails in .pst files. Calendar, Contacts, and Tasks data in .pst files will not be accessible in this phase. Rollout begins late November 2024 for Targeted Release and mid-January 2025 for General Availability. Outlook Data File support is enabled by default but can be managed with the OutlookDataFile mailbox policy."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC931404",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-20T23:06:06.94Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-12T00:07:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Read-only support for .pst files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
