{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As communicated in MC807798 <i>Microsoft Purview: The new Microsoft Purview Portal enters GA </i>(July 2024), the classic Microsoft Purview compliance portal is retiring starting November 14, 2024, and ending December 14, 2024. Instead, please use the <a href=\"https://purview.microsoft.com\" target=\"_blank\">new Microsoft Purview portal</a> that provides all capabilities in the classic portal, and more.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The new Purview portal has a streamlined design and unified experience that helps you discover and access data security, risk and compliance solutions for all your data. You will be able to access all Purview solutions in one portal, as well as experiences such as settings, global search, recommendations, roles and permissions management. The Purview portal is where we will continue to invest our development resources.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>All the existing configurations and data will be carried over at parity in the new Microsoft Purview portal. This change will happen automatically before mid-December 2024.</p><p>If your organization is secured with a firewall or proxy server, you must add the new Purview portal's internet protocol (IP) addresses and domain uniform resource locators (URLs) to the allowlist. You may want to notify your admins about this change and update any relevant documentation.\n</p><ul><li>Worldwide endpoint: <a href=\"https://go.microsoft.com/fwlink/?linkid=2297901\" target=\"_blank\">https://go.microsoft.com/fwlink/?linkid=2297901</a>\n</li></ul><p>Learn more about new Microsoft Purview portal: <a href=\"https://learn.microsoft.com/purview/purview-portal\" target=\"_blank\">Learn about the Microsoft Purview portal | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC939918",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-22T18:08:16.587Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-22T18:08:10Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Reminder: Microsoft Purview classic compliance portal will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
