{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Email sent from Microsoft Viva Amplify and from Microsoft SharePoint when SharePoint News posts are shared will contain a new required footer. Effective immediately, we will add this footer to all email sent from these products.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out early November 2024 and expect to complete by mid-November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The new footer includes your customer logo, a statement that the email was generated by Microsoft and may contain content that is controlled by the customer, and a link to your privacy statement (if that statement has been configured in the Microsoft Entra admin center).\n</p><p>Example of a footer from a Microsoft email. Your footer will have your organization's name and logo in place of Microsoft:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e2c66b55-29a4-41be-be1c-f921ca682287\" style=\"width: 400px;\" alt=\"user email\">\n</p><p>Administrators may want to confirm that they have configured their tenant's logo and privacy policy in the Entra admin center. Learn more: <a href=\"https://learn.microsoft.com/entra/fundamentals/how-to-customize-branding\" target=\"_blank\">Add company branding to your organization's sign-in page - Microsoft Entra | Microsoft Learn</a>\n</p><p> Also, we recommend that you inform communicators in your organization of this change, so they can take action to avoid duplication if they have manually added a footer or links to privacy policies in their mailings.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. The footer will be automatically applied by default to all user-generated email sent via SharePoint or Viva Amplify email.\n</p><p>Review your current configuration to determine the impact for your organization. You may want to notify your organization and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "New automatic footers will be added to emails sent from Microsoft Viva Amplify and SharePoint when sharing SharePoint News posts. These footers will include the customer logo, a Microsoft-generated statement, and a privacy statement link. Rollout begins early November 2024 and completes by mid-November. No admin action is required before the rollout. Organizations should update configurations and inform internal communicators."
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC933529",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-13T23:13:22.977Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-13T23:13:06Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Amplify and Microsoft SharePoint: New required footers will be automatically applied to email",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
