{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated November 22, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: We're adding support when sharing screens with Microsoft Mesh in Microsoft Teams immersive events. Presenters will now be able to choose whether they'd like to include system audio when starting a screen share in an immersive event. This feature is available for presenters in Mesh with a Teams Premium license. This message applies to Mesh on Windows desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=423475\" target=\"_blank\">423475</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early January 2025 (previously early December) and expect to complete by early January 2025 (previously early December).\n</p><p>General Availability (Worldwide): We will begin rolling out early January 2025 (previously early December) and expect to complete by mid-January 2025 (previously mid-December)</p><p><b>How this will affect your organization:</b>\n</p><p>The <i>Share content</i> screen in a Mesh event will have an <i>Include sound</i> option, which includes system audio when sharing content.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qpm6?ver=6e63\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be available by default for users to enable.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No new admin work or action is required in order to use this new capability.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "423475"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams immersive events will soon support audio during screen sharing for presenters using Microsoft Mesh with a Teams Premium license. This feature, associated with Roadmap ID 423475, will roll out in early January 2025 and requires no admin action to enable."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-02-24T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC932489",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-22T18:41:06.02Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-13T01:28:00Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Updated) Microsoft Mesh: Support for audio when sharing screens in Microsoft Teams immersive events",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
