{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the general availability of solution-aware cloud flow sharing limits to the Power Platform. You can now start to control how you want your makers to share their solution-aware cloud flows. Customers should have access to this control for their managed environments by December 13, 2024.<br><br><b>How does this affect me?</b><br><ul> \n\n<li>The control enables administrators to either enable or disable sharing.</li> \n\n<li>When sharing is disabled, this means that makers cannot share their flows with any individual or security group.</li> \n\n<li>The access of individuals or security groups that were shared with before sharing was disabled will not be affected.</li> \n\n<li>When sharing is enabled, this means that makers are free to share their flows with as many individuals or security groups as they want.</li> \n\n<li>This control specifically applies to solution-aware cloud flows.</li></ul> \n\nYou can configure this control through the settings of your managed environment. This control can be configured on an individual managed environment and also as a rule that can be applied to an entire environment group.<br><br><b>What do I need to do to prepare?</b><br>This message is for awareness and no action is required.<br><br>For additional information about solution-aware cloud flows, please visit <a target=\"_blank\" href=\"https://aka.ms/8820-1\">Limit sharing - Power Platform </a> after November 19, 2024.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-12-11T21:26:58Z",
  "HasAttachments": false,
  "Id": "MC931293",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-11T21:29:36.75Z",
  "Services": [
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-11T21:26:58Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Power Platform - General availability of solution-aware cloud flow sharing limits is now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
