{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 5, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: A control that allows users to control if web search queries are sent to Microsoft Bing when using Microsoft Copilot.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 (previously late January) and expect to complete by late February 2025 (previously late January).</p><p><b>How this will affect your organization:</b>\n</p><p>Users can disable or enable web searches with the new control, which is accessible from the three-dot overflow menu:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/96e8c6ba-a738-4f93-8c68-2678bf51e064\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>If the user disables web search, they will be notified that Copilot responses won't include the latest date from the web:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/98345d83-af38-468c-b455-f430c14217b7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>If an admin has disabled web search in Copilot using either <a href=\"https://learn.microsoft.com/microsoft-365-apps/privacy/optional-connected-experiences\" target=\"_blank\">optional connected experiences</a> or the new <i>Allow web search in Copilot </i>policy (available November 2024 as communicated October 2024 in MC910984 <i>Manage web searches in Copilot separately from optional connected experiences with new policy)</i> in the Microsoft 365 admin center, the user control will remain disabled after this rollout and users will not be able to enable web search using the control.\n</p><p>If web search is not disabled by the admin, users can use the control in the three-dot menu to enable or disable web search as desired.\n</p><p>This change is on by default and available to users.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more about controlling web search queries in Copilot: <a href=\"https://learn.microsoft.com/copilot/microsoft-365/manage-public-web-access#controls-available-to-manage-web-search\" target=\"_blank\">Data, privacy, and security for web queries in Microsoft 365 Copilot and Microsoft Copilot | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Copilot introduces a user control for web searches. Rollout starts early February 2025, completing by late February. Users can enable/disable web searches in the overflow menu. Admin-disabled searches remain off post-rollout. No admin action needed; organizations should review configurations and inform users."
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC931407",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-05T20:57:30.537Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-12T00:08:34Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Copilot: New user control for web searches",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
