{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 10, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Teams: Links to Microsoft <i>Lists, Lists items, </i>and <i>Lists forms</i> will display richer details such as title and path when shared in Teams chats and channels. This new feature will enhance collaboration by making it easier for users to recognize specific List link types, in addition to viewing the title and path. This message applies to Teams for Windows and Mac desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=419812\" target=\"_blank\">419812</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early February 2025 (previously early January) and expect to complete by mid-February 2025 (previously mid-January).\n</p><p>General Availability (Worldwide): We will begin rolling out mid-February 2025 (previously mid-January) and expect to complete by late February (previously early February).</p><p><b>How this will affect your organization:</b>\n</p><p>With this update, new details will display in a Teams chat or channel for these links:\n</p><ul><li>For <i>Lists </i>links, a <i>List </i>icon and the name and path of the list will be displayed.</li><li>For <i>Lists item</i> links, a <i>List item</i> icon, the title of a specific list item, and the path of the list will be displayed.</li><li>For <i>Lists form</i> links, a <i>List form</i> icon, the title of the form, and directions for a user to fill out the form will be displayed.</li></ul><p>A sender will be able to opt to provide permissions to view or edit the <i>List, List item, </i>or <i>List form.</i>\n</p><p>This feature will improve the efficiency of collaboration by reducing the need to switch between Teams and other applications to view or interact with list data.\n</p><p>This feature will be on by default.\n</p><p>A <i>Lists </i>link, a <i>Lists item</i> link, and a <i>Lists form</i> link in a Teams chat:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qK5R?ver=1b14\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>You may want to:\n</p><ul><li>Inform your users about this upcoming feature and how it can enhance their workflow.\n</li><li>Ensure your Teams environment is updated to the latest version to take advantage of this new functionality.\n</li><li>Review your organization's policies and permissions related to sharing and accessing List data in Teams.\n</li></ul><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "419812"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"419812\":[{\"RoadmapId\":419812,\"Platform\":\"Mac\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-17T17:13:41.9431235Z\",\"LatestRing\":null},{\"RoadmapId\":419812,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-17T17:13:41.943132Z\",\"LatestRing\":null},{\"RoadmapId\":419812,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-17T17:13:41.9431322Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon display richer details for Microsoft Lists links in chats and channels, enhancing collaboration. The rollout for this feature, associated with Roadmap ID 419812, is rescheduled to begin in early February 2025, with completion expected by late February 2025. This update will be on by default."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-04-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC939930",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-11T01:28:39.213Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-22T18:13:20Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Improved Microsoft Lists links in Teams chats and channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
