{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 2, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>The ability to distinguish between internal and external recipients is crucial for maintaining secure and efficient communication. This update will improve offline accuracy and overall performance of the External Recipients MailTips feature on Microsoft Outlook for iOS and Android.</p><p>This post is associated with MC834102 <i>External recipients MailTip offline behavior update for Microsoft Outlook for iOS and Android</i> (published July 2024, updated to cancel November 2024).\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out mid-February 2025 (previously late January) and expect to complete by late April 2025 (previously mid-March)</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, organizations that have enabled External Recipient MailTips feature will benefit from the client retrieving and caching internal domain information from the Microsoft Exchange Server. This improves accuracy for users who are offline or have unreliable internet connections and overall feature performance.\n</p><p>Before this rollout, Outlook for iOS and Android calls the MailTips service for an External Recipient determination when users add recipients to an email. When the user is offline, we are unable to reach the MailTips service, so domain comparison is used.\n</p><p>This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically by the specified date. No admin action is required. Please notify your users about this change and update relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/exchange/clients-and-mobile-in-exchange-online/mailtips/mailtips\" target=\"_blank\" style=\"\">MailTips in Exchange Online | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Outlook for iOS and Android is enhancing the External Recipients MailTips feature for better offline accuracy and performance. The rollout, starting mid-February 2025 and completing by late April 2025, requires no admin action but users should be notified. More details will be updated on Microsoft Learn."
    }
  ],
  "EndDateTime": "2025-06-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC946793",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-02T14:42:44.823Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-02T17:09:03Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook for iOS and Android: Enhanced external recipient determinations",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
