{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 12, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Teams: Third-party application developers will be able to extend the Public Switched Telephone Network (PSTN) calling experience with contextual information, making it possible for Teams users to have access to relevant data without leaving the call experience. This feature will make it possible for developers to bring additional context and workflow integration into calling experiences and make customer-facing professionals more efficient by having data from line of business applications readily available. This functionality is available for developers to integrate their applications and add new functionality to calls.\n</p><p>This message applies to Teams on Windows and Mac desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468280\" target=\"_blank\">468280</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early February 2025 (previously mid-January) and expect to complete by mid-February 2025 (previously late January)</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-February 2025 (previously mid-February) and expect to complete by early March 2025 (previously late February).</p><p><b>How this will affect your organization:</b>\n</p><p>This feature only applies if you or your developers create a new personal scope Tab app and pin it for your users.\n</p><p>This change will be available by default for admins to configure. Learn more about app setup policies: <a href=\"https://learn.microsoft.com/microsoftteams/teams-app-setup-policies\" target=\"_blank\">Manage app setup policies in Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</p><p>The new calling extensions section to pin apps in Teams admin center:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d550b08d-ce52-4136-940e-ecb2495eef72\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No need to prepare if you are not planning to build apps to extend PSTN calling experience in Teams. If you want to build a personal scope Tab app for Teams PSTN calling, we will update this message with the documentation when rollout begins. Learn more: <a href=\"https://learn.microsoft.com/microsoftteams/platform/tabs/what-are-tabs?tabs=personal\" target=\"_blank\">Microsoft Teams tabs - Teams | Microsoft Learn</a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your developers and users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468280"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"468280\":[{\"RoadmapId\":468280,\"Platform\":\"Mac\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-06T05:14:59.5704194Z\",\"LatestRing\":null},{\"RoadmapId\":468280,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-06T05:14:59.5704193Z\",\"LatestRing\":null},{\"RoadmapId\":468280,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-06T05:14:59.5704195Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating to allow third-party app developers to enhance PSTN calls with contextual information. Rollout begins early February 2025 for Targeted Release and mid-February for General Availability, with completion expected by early March 2025. This feature is for Teams on Windows and Mac desktops and is associated with Microsoft 365 Roadmap ID 468280. No action is needed unless developing personal scope Tab apps for Teams."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC947831",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-12T19:35:25.31Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-03T23:25:13Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Extensibility for PSTN calls",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
