{
  "ActionRequiredByDateTime": "2027-03-01T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2026: We have updated the timeline. Thank you for your patience.&nbsp;</p><p><b><b>Introduction</b></b></p><p>Microsoft is updating the opt‑out phase start date for new Outlook for Windows in Enterprise environments from <b>April 2026</b> to <b>March 2027</b>.</p><p><b><b>When this will happen:</b></b></p><ul><li>The opt‑out phase for <b>Enterprise environments</b> will now begin in <b>March 2027</b> (previously April 2026), providing organizations with 12 months of lead time to prepare.&nbsp;</li><li>GCC High and DoD timelines will be communicated separately at a later date.</li></ul><p><b>Why is there a change to the timeline?</b></p><p>We’re seeing strong and accelerating adoption of new Outlook as organizations progress on timelines that match their readiness. At the same time, we continue to invest heavily in expanding capabilities and addressing feedback from customers who want to go further with new Outlook. To ensure organizations have the time they need to prepare—and to fully realize the value of ongoing innovation—we’re extending the opt-out timeline and providing 12 months of lead time as we continue delivering key features and improvements.</p>\n<p><b><b>How this affects your organization:</b></b></p>\n<p><b>Who is affected:</b></p>\n<ul>\n<li>Microsoft 365 administrators managing<b> Outlook for Windows.</b></li>\n<li>Users of&nbsp;<b>classic Outlook for Windows.</b></li><li>Organizations that previously disabled the <b>new Outlook</b> toggle or have not yet begun migration planning.</li></ul>\n\n<p><b>What will happen:</b></p>\n<ul>\n<li>Migrated users will receive in‑app onboarding prompts and can switch back to classic Outlook if needed.</li><li>Existing policies that disable or limit access to new Outlook will remain in effect.</li><li>Admins can continue using <b>Admin‑controlled migration</b> to move users in a staged, reversible manner ahead of time.</li><li>Users will not be migrated if one or more of the following is true:<ul><li>You have opted out users using the&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install?branch=main#admin-control-over-migration\">Policy of automatic migration</a></li><li>New Outlook toggle is hidden via policy</li><li>Perpetual license is in use</li><li>On premise account</li></ul></li></ul><p><b><b>What you can do to prepare:</b></b></p><p>Prepare your organization for the opt-out phase that will begin <b>March 2027</b>. Evaluate and use the <b>Admin-controlled migration</b> policy to the stage and schedule that is right for your organization. </p><p>Take preparatory steps to:  </p>\n<ul><li>Assess feature and web add-in readiness.\n</li><li>Conduct any needed pilots.\n</li><li>Build a timeline that works for your organization.\n</li><li>Re-enable the toggle if previously disabled and enable the Admin-controlled migration policy to move forward.</li></ul>\n<p>Be sure to communicate with your users about what to expect, and leverage Microsoft’s adoption resources to make the experience smooth.</p><p><b>Resources and Support: \n</b></p><p>Microsoft is committed to helping you manage this transition effectively. Refer to the following resources for detailed guidance and tools:</p><ul><li><b>Adoption Kit:</b> A downloadable kit with checklists, project planning templates, user communication examples, and FAQs to support your rollout. <a href=\"https://adoption.microsoft.com/new-outlook-for-windows/\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">New Microsoft Outlook for Windows – Microsoft Adoption</a>.</li><li><b>Tips for new users:</b> <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/start-users-new-outlook\" target=\"_blank\">Start new users in new Outlook | Microsoft Learn</a>.</li><li><b>Control installation and use:</b> If you have previously disabled the <b>new Outlook</b>&nbsp;<b>toggle </b>via policy and now want to roll out new Outlook. <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install?source=recommendations\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Control installation and use of new Outlook | Microsoft Learn</a>.</li><li><b>Policy for Admin-controlled migration:</b> This policy allows you to toggle users into new Outlook in a controlled manner, with in-app prompts that ease users into the new experience over successive Outlook launches. Users who are moved by policy will be presented with a user-friendly onboarding experience and will have the option to switch back to classic Outlook. Microsoft recommends starting with new users in your organizations and those piloting and using Copilot as early target audiences. <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/manage/admin-controlled-migration-policy\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Policy for Admin-Controlled Migration to new Outlook for Windows | Microsoft Learn</a>;&nbsp;<a href=\"https://support.microsoft.com/office/switch-to-new-outlook-for-windows-f5fb9e26-af7c-4976-9274-61c6428344e7?OCID=NewOutlook_AutoSwitch_LearnMore\" target=\"_blank\">User-facing article</a>.</li></ul><p><b><b>Compliance considerations</b></b></p><table border=\"1\" cellpadding=\"6\" cellspacing=\"0\">\n  <tbody><tr>\n    <th>Question</th>\n    <th>Explanation</th>\n  </tr>\n  <tr>\n    <td>Does the change include an admin control?</td>\n    <td>Admins can manage the change using the <a href=\"https://learn.microsoft.com/en-us/microsoft-365-apps/outlook/get-started/control-install?branch=main#admin-control-over-migration\" target=\"_blank\">policy for automatic migration</a> and existing Outlook policies.</td>\n  </tr>\n  <tr>\n    <td>Can the change be controlled through Entra ID group membership?</td>\n    <td>Migration can be scoped to specific users or groups using Entra ID group targeting.</td>\n  </tr>\n  <tr>\n    <td>Does the change allow a user to enable and disable the feature themselves?</td>\n    <td>Users moved to new Outlook can switch back to classic Outlook during the transition period.</td>\n  </tr>\n</tbody></table>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft has postponed the opt-out phase for new Outlook in Enterprise from April 2026 to March 2027, giving organizations 12 months to prepare. Admins can use policies for staged migration, users can switch back temporarily, and resources are provided for smooth transition and adoption."
    }
  ],
  "EndDateTime": "2028-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC949965",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2026-02-20T20:05:23.45Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T01:09:13Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact"
  ],
  "Title": "Toggle to new Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
