{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Viva Pulse capabilities will now be included with your Microsoft 365 Copilot subscription. This message applies to Pulse on Windows and Mac desktop, on the web, and on iOS/Android.\n</p><p> This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=407706\" target=\"_blank\">407706</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early December 2024 and expect to complete by mid-December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Only users assigned with a Viva Pulse premium license can create and send Pulse requests to users in their tenant. Pulse authors can use the available out of the box content and/or templates that have been made available by their tenant’s Pulse administrators.\n</p><p><i>After this rollout</i>\n</p><p>Viva Pulse experience included in your Microsoft 365 subscription:\n</p><p>Users with a Pulse license or a Microsoft 365 Copilot license can create and send Pulse requests to users in the tenant. With Viva Pulse experience included with your Microsoft 365 Copilot subscription, leaders can send brief surveys to gather real-time feedback about Copilot implementation from teams. Pulse helps identify challenges and concerns quickly, enabling prompt and localized responses to improve the Copilot journey.\n</p><ul><li><i>Create and send a Pulse request</i>: Users need a Microsoft 365 Copilot license or a Viva Pulse premium license. They also need a Microsoft Forms license. \n</li><li><i>Respond to a Pulse request: </i>No license needed. Anyone can respond.\n</li></ul><p>Users' view of the Pulse home page when they only have Microsoft 365 Copilot license:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1ruUt?ver=4818\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically, and the features described here are enabled by default by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><ul><li>Tenant admins can review and assign licenses available to your users through Microsoft Entra Admin center.\n</li><li>Tenant admins can review the new templates and questions through the Viva Pulse admin <i>Content management</i> feature and modify or restrict access to the templates and questions as needed.\n</li></ul><p>\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com//viva/pulse/get-started/licensing-requirements\" target=\"_blank\">Licensing requirements | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/set-up-in-app-pulse-experience\" target=\"_blank\">Set up the in-app Viva Pulse experience | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/pulse/setup-admin-access/manage-available-surveys-and-questions\" target=\"_blank\">Manage available surveys and questions | Microsoft Learn</a>\n</li><li><a href=\"https://support.microsoft.com/topic/create-a-pulse-to-get-feedback-from-your-team-817d3eba-3ce7-4079-80cc-ae8ae96fa61e\" target=\"_blank\">Create a Pulse to get feedback from your team - Microsoft Support</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "407706"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Pulse will be included with Microsoft 365 Copilot subscriptions, enabling users with Copilot or Viva Pulse licenses to create and send Pulse surveys. This feature rolls out in early December 2024 and requires no admin action for implementation."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-01-31T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC948979",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-05T00:17:21.753Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-05T00:17:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Pulse experience will be included with Microsoft 365 Copilot subscription",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
