{
  "ActionRequiredByDateTime": "2026-04-01T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to the migration from classic Outlook to new Outlook for Windows.\n</p><p>We aim to give more than 12 months of notice to help our customers prepare. Starting April 2026, users with Microsoft 365 for Enterprise licenses will be toggled from classic Outlook for Windows to new Outlook for Windows. Users will be toggled into new Outlook once with this roll-out, with potential to be toggled again in the future. Users will maintain the ability to go back to and use classic Outlook.\n</p><p>Our goal with this change is to give users an opportunity to try new Outlook as millions of users already have. New Outlook gives users the most modern experience with Copilot features, theming, and a wave of valuable time-saving features like Pinning and Snoozing mails. Users are also welcome to give us feedback on new Outlook using Feedback in the Help ribbon, so we can tailor the best email and calendar experience. \n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out April 2026.\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates one or more users in your organization are using Microsoft 365 Enterprise licenses.\n</p><p>Users will have notice in the application prior to being toggled and will have the option to opt out of the experience in Outlook Options &gt; General. Users who are toggled into new Outlook can toggle back to classic Outlook if they choose to.\n</p><p>Users will not be toggled if one or more of the following is true:\n</p><ul><li>You have opted your users out of being automatically toggled per <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install?branch=main#policy-manage-user-setting-for-new-outlook-automatic-migration\" target=\"_blank\">Admin-Controlled Migration to New Outlook</a></li><li>New Outlook toggle is hidden via policy\n</li><li>Perpetual license is in use</li><li>On premise account</li></ul><p>User-facing article:&nbsp;<a href=\"https://support.microsoft.com/office/switch-to-new-outlook-for-windows-f5fb9e26-af7c-4976-9274-61c6428344e7?OCID=NewOutlook_AutoSwitch_LearnMore\" target=\"_blank\">Switch to new Outlook for Windows - Microsoft Support</a>. We will continue to update this article as we get closer to April 2026.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required starting April 2026. You may want to notify your users about this change and update any relevant documentation as appropriate. When this change takes effect, if you choose to exclude users from the experience, you can use the following Admin policy to manage new Outlook migration:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install?branch=main#policy-manage-user-setting-for-new-outlook-automatic-migration\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Admin-Controlled Migration to New Outlook</a></p><p>Later, this policy will also be available via Group Policy Objects (GPO), Cloud Policy, and Intune.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting April 2026, Microsoft 365 for Enterprise users will be switched from classic to new Outlook for Windows, with the option to revert back. This change aims to enhance user experience with modern features. Organizations are notified to prepare, with automatic rollout requiring no admin action but allowing opt-out options."
    }
  ],
  "EndDateTime": "2027-09-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC949965",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-06T01:09:33.82Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T01:09:13Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Toggle to new Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
