{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Outlook: Users can move emails between their new Outlook for Windows and Outlook for the web, streamlining organization and productivity. For enterprise users, this feature is controlled by the Set-OWAMailboxPolicy policy managed by admins in Microsoft Exchange PowerShell. By enabling this policy, admins can grant their users the ability to move emails between accounts in a way that aligns with organizational needs and policies. With this rollout, we are introducing a new parameter called <a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy?view=exchange-ps#-itemstootheraccountsenabled\" target=\"_blank\">-ItemsToOtherAccountsEnabled</a> for the Set-OWAMailboxPolicy policy.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470018\" target=\"_blank\">470018</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by late February 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late February 2025 and expect to complete by early March 2025.\n</p><p>General Availability (GCC): We will begin rolling out early March 2025 and expect to complete by mid-March 2025.\n</p><p>General Availability (GCC High, DoD): We will begin rolling out late March 2025 and expect to complete by early April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The new parameter <code>-ItemsToOtherAccountsEnabled</code> controls whether users can move or copy their emails between accounts. By default, the value will be <code>False</code>, which means that the policy is disabled and users won't be able to move emails between accounts unless an admin changes the policy to <code>True</code>.\n</p><p>If you enable this parameter, users will be able to move emails between accounts in these ways:\n</p><p>1. Dragging and dropping an email from one account to another\n</p><p>2. Using shortcuts:\n</p><ul><li>Copy: Ctrl C + Ctrl V\n</li><li>Copy: Ctrl + Drag and drop\n</li><li>Move: Drag and drop\n</li><li>Move: Ctrl X + Ctrl V\n</li></ul><p>3. Right-click an email and select <i>Move </i>or <i>Copy</i> from the menu (menu items only available if the policy is enabled)\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy?view=exchange-ps#-itemstootheraccountsenabled\" target=\"_blank\">Set-OwaMailboxPolicy (ExchangePowerShell) | Microsoft Learn</a>\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470018"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC943640",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-27T18:58:59.063Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-27T18:58:43Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook: Move emails between accounts (new Outlook for Windows and Outlook for the web)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
