{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 18, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon: We will automatically set your Home site as the default experience for Microsoft Viva Connections app in Microsoft Teams.\n</p><p><b>Note: </b>This change will only apply to customers who have not yet set a Viva Connections experience in their tenants. Customers who already have a Viva Connections experience (either standalone or backed by a Home site) will not be affected by this change.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422815\" target=\"_blank\">422815</a>.\n</p><p><b>When will this happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 and expect to complete by late March 2025 (previously late February).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, end users could access the Homesite through the SharePoint website. With this rollout, end users are now able to also access the Homesite through the Viva Connections app in Teams.\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>If you are okay with this change:\n</p><ul><li>No additional admin action is required.\n</li><li>We recommend creating awareness about this feature with your users by sending a new post, sharing the link to the Viva Connections app in Teams, or configuring and pinning Viva Connections in Teams. Learn more about <a href=\"https://learn.microsoft.com/viva/connections/set-up-admin-center#how-to-access-viva-connections-in-the-microsoft-admin-center\" target=\"_blank\">how to access Viva Connections in the Microsoft admin center</a>.\n</li></ul><p>If you want to turn off this change, you have two options:\n</p><ul><li>Use Microsoft PowerShell with <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-spohomesite?view=sharepoint-ps\" target=\"_blank\">Set-SPOHomeSite</a>: <code>Set-SPOHomeSite -VivaConnectionsDefaultStart:$false</code>\n</li><li>Disable the Viva Connections app from the Teams admin center. Learn how to <a href=\"https://learn.microsoft.com/microsoftteams/manage-apps#allow-or-block-apps\" target=\"_blank\">allow or block apps</a>.\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422815"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Connections will automatically set the Home site as the default experience in Teams for customers who haven't set a Viva Connections experience. This rollout starts mid-January 2025 and ends late March 2025. No action is required unless you want to disable this change."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC942817",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-18T18:56:05.047Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-26T23:39:52Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Connections: Default experience for Home site customers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
