{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Introducing in Communication Compliance the ability to detect potentially risky generative AI interactions using Microsoft Azure AI Content Safety's Prompt shields and Protected materials classifiers. The Prompt shield classifier can detect risk of prompt injection attacks (jailbreak) by malicious users and the Protected material classifier can identify when generative AI responses contain branded or copyrighted material so organizations can maintain content originality and protect their reputations.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422334\" target=\"_blank\">422334</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We began rolling out mid-November 2024 and expect to complete by late December 2024.\n</p><p>General Availability (Worldwide): We will communicate the plan for General Availability in a separate post.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Communication Compliance admins can expect two new classifiers in the trainable classifier list:<i> Prompt shield</i> and <i>Protected material classifier</i>. These classifiers are configured by default in the <i>Detect Microsoft Copilot interactions template</i> policy. When a policy flags a potentially risky Generative AI interaction, you can see the new classifier names listed in the <i>Conditions detected</i> banner:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qzPS?ver=2d74\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This change is available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your admins about this feature availability and update any policies that may benefit from the new classifiers.\n</p><p>No action is required for the new classifiers to be enabled in your tenant. When classifiers are visible in your tenant, you can configure them in any Communication Compliance policy looking at a generative AI workload.\n</p><p>Learn more: The Trainable classifiers section of <a href=\"https://learn.microsoft.com/purview/communication-compliance-policies?view=o365-worldwide&amp;tabs=purview-portal#trainable-classifiers\" target=\"_blank\">Create and manage communication compliance policies | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422334"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Communication Compliance now includes detection for risky generative AI interactions, with new classifiers for prompt injection attacks and protected material. Public Preview began mid-November 2024, with General Availability details to follow. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC947833",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-03T23:26:42.95Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-03T23:26:17Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Communication Compliance: Detect potentially risky generative AI interactions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
