{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 31, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We’re updating the Microsoft Secure Score improvement action of Microsoft Defender for Endpoint (MDE) to ensure a more accurate representation of security posture.</p><p>As part of this change, we will gradually retire the MDE recommendation on SCID-2020,&nbsp;<i>Turn on all system-level Exploit protection settings</i>.</p><p>We are working to refine the recommendation, ensuring it aligns more accurately with recommended policies and enhances the overall security value. \n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early January 2025 (previously early December) and expect to complete by early February 2025 (previously early January).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>The <i>Turn on all system-level Exploit protection settings</i>&nbsp;recommendation will be completely removed from the UI, and the score will be changed in accordance.\n</p><p>This update is available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft is updating the Secure Score action for Defender for Endpoint to better reflect security posture, retiring the SCID-2020 recommendation. Rollout starts January 2025, with no admin action needed. The related recommendation will be removed from the UI, and scores will be adjusted accordingly."
    }
  ],
  "EndDateTime": "2025-03-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC941863",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-31T19:23:11.547Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-26T00:44:12Z",
  "Tags": [
    "Updated message",
    "Admin impact"
  ],
  "Title": "Microsoft Secure Score: Changing Microsoft Defender for Endpoint recommendation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
