{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are announcing the introduction of the Summarize Records with Copilot feature for Dynamics 365 Field Service. This enhancement enables technicians to quickly access a summary of their work orders, including key details and contextual information within the mobile application. This feature will become generally available in the Dynamics 365 Field Service mobile app on January 13, 2025.<br><br><b>How does this affect me?</b><br>When a summary is generated with Copilot, the system uses the work order ID and your security profile to determine which relevant data to display by pulling contextual information directly from the work order and related records to create the summary.<br><br>By default, Copilot provides summaries based on a list of fields that Microsoft maintains. Administrators can <a target=\"_blank\" href=\"https://aka.ms/ADO8551\">change the summary configuration</a> to meet their business needs. The default summary includes the following data fields from work orders and related records:<ul><li>Booking information</li><li>Activity details</li><li>Notes from the work order and bookings</li><li>Work order product details</li><li>Work order service details</li><li>Work order service tasks</li><li>Asset information and work order history</li></ul><b>What do I need to do to prepare?</b><br>This message is for awareness and no action is required.<br><br>If you would like more information on this feature, please visit <a target=\"_blank\" href=\"https://aka.ms/ADO8851_1\">Summarize records with Copilot in Field Service</a>.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-01-02T20:45:52Z",
  "HasAttachments": false,
  "Id": "MC946934",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-02T20:46:33.517Z",
  "Services": [
    "Dynamics 365 Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-02T20:45:52Z",
  "Tags": [
    "New feature"
  ],
  "Title": "Dynamics 365 Field Service - Summarize records with Copilot in the mobile app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
