{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As part of Microsoft 365 Copilot for Security in Data Loss Prevention (DLP), Policy Insights helps admins understand DLP policies and its constructs. This enhancement enables DLP admins to gain insights on coverage of policies on pivots like&nbsp;location, classifiers, and notifications.</p><p>DLP admins can get these insights on all the policies or on a few selected policies. They will be able to use prompts to gain a deeper level view of how a policy is configured for their digital landscape. This helps them align their data posture on a regular basis and make corrections to policy posture as needed.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=466740\" target=\"_blank\">466740</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We will began rolling out mid-November 2024 and expect to complete by early December 2024.</p><p>General Availability (Worldwide): We will begin rolling out early January 2025 and expect to complete by late January 2025.\n</p><p>Currently, Copilot for Security is not designed for use by customers using US government clouds, including but not limited to GCC, GCC High, DoD, and Microsoft Azure Government. For more information, consult with your Microsoft representative.</p><p><b>How this will affect your organization:</b>\n</p><p>Administrators can invoke the policy insights to understand the insights from all their policies or selected polices. The insights offered start with a higher-level view of how their policies:\n</p><ul><li>are effective across locations.</li><li>detect the presence of sensitive information types throughout their digital estate.</li><li>notify administrators of violations.</li><li>educate users while they perform activities they should not.</li></ul><p>These insights are offered with different pivots by location, classification, and by administrative scopes. This is offered to give the security policy administrators different views for deeper understanding of policy constructs and their impact.</p><p><u>Step 1: \n</u></p><p>Select the policies you wish to get insights/quick summaries about.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qPiy?ver=6af2\" style=\"width: 600px;\"><br></p><p><u><br></u></p><p><u>Step 2: \n</u></p><p>Click on the <i>Get Insights with Copilot</i> button. You will see the prompt is already pushed into the Copilot Experience in the side panel.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qPiB?ver=419a\" style=\"width: 600px;\"><br></p><p>\n</p><p><u><br></u></p><p><u>Step 3: \n</u></p><p>Copilot responds with insights on the selected policies.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qRTT?ver=b72c\" style=\"width: 600px;\"><br></p><p><br></p><p><b>What you need to do to prepare:</b>\n</p><p>Admins can prepare by having Security Computer Units (SCUs). Copilot for Security is sold in a provisioned capacity model and is billed by the hour.&nbsp;</p><p>Get more information about SCUs:<a href=\"https://learn.microsoft.com/copilot/security/get-started-security-copilot\" target=\"_blank\"> Get started with Microsoft Copilot for Security | Microsoft Learn</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "466740"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot for Security in Data Loss Prevention now includes Policy Insights, enabling admins to understand and align DLP policies better. Public Preview begins mid-November 2024, with General Availability in early January 2025. Not designed for US government clouds. Admins need Security Computer Units to prepare."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC949003",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-05T00:30:42.62Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-05T00:30:15Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Gain policy insights with Microsoft 365 Copilot for Security",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
