{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>8 new Copilot feature metrics are now generally available in the Copilot Dashboard and Viva Insights Advanced insights. The new Copilot feature metrics being added, include:</p><ul><li>“Intelligent Recap” actions taken in Teams\n</li><li>“Visualize as table” actions taken in Word\n</li><li>“Chat (Copilot in Word)” prompts submitted in the in-app chat section in Word\n</li><li>“Add content to presentation” actions taken using PowerPoint\n</li><li>“Organize presentation” actions taken using PowerPoint\n</li><li>“Chat (Copilot in PowerPoint)” prompts submitted in the in-app chat section in PowerPoint\n</li><li>“Chat (Copilot in Excel)” prompts submitted in the in-app chat section in Excel\n</li><li>“Business Chat (web)” prompts submitted. This feature is also known as “Copilot with Enterprise Data Protection” and the insights include prompts submitted through Edge and the Microsoft 365 app. \n</li></ul><p>As part of this update the “Total actions taken” numbers will also be updated to reflect activity related to the Copilot features listed above. “Total number of active Copilot users” and “Percentage of active Copilot users” already included the features above, but will be impacted by the addition of Business Chat (web).</p><p>Starting in early Devember, 2024, anyone with access to the Copilot dashboard will be able to view these insights. Anyone with the Viva Insights analyst role will be able to query the usage information related to these features through Viva Insights Advanced Insights. Note that in Copilot dashboard, these metrics and insights only show up for measured employees with a Microsoft 365 Copilot license. Measured employees also need to be assigned a Viva Insights license for their data to be available in Viva Insights Advanced insights.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=418379\" target=\"_blank\">418379</a> and Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=467249\" target=\"_blank\">467249</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Rollout will begin in early December 2024 and expect to complete by mid-December 2024.</p><p><b>How this will affect your organization:</b>\n</p><p>As a result of adding these new Copilot feature metrics, users can expect to see a significant increase in the “Total number of active Copilot users” (Copilot dashboard – “Adoption” tab) as well as the “Total actions taken” (Copilot dashboard – “Impact” tab).&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Share this information with anyone who has access to the Copilot dashboard and or Viva Insights Advanced Insights. Make sure that anyone who needs access gets the appropriate role assigned. For more information, visit: \n</p><ul><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/setup-maint/user-roles\" target=\"_blank\">Roles in Viva Insights | Microsoft Learn for access to Viva Insights Advanced Insights</a>\n</li><li><a href=\"https://learn.microsoft.com/viva/insights/advanced/admin/manage-settings-copilot-dashboard\" target=\"_blank\">Manage settings for the Microsoft Copilot Dashboard | Microsoft Learn for access to Copilot dashboard</a>\n</li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "418379,467249"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, iOS, Mac, Android, Web"
    }
  ],
  "EndDateTime": "2025-01-05T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC947046",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-02T23:51:58.523Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-02T23:51:46Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "8 new Copilot feature metrics in Copilot dashboard and Viva Insights advanced insights, including Business Chat (web)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
