{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated December 18, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We’re excited to announce updates to the Microsoft Viva admin landing page and the Feature Access Management experience in the Microsoft 365 admin center (MAC).\n</p><p><b>When this will happen:</b>\n</p><p>Viva admin landing page | General Availability (Worldwide, GCC): We will begin rolling out late December 2024 (previously early December) and expect to complete by early January 2025 (previously late December).</p><p>New user interface for Feature Access Management in the MAC | General Availability (Worldwide, GCC): We will begin rolling out late January 2025 and expect to complete by early February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>1. The <i><b>Viva admin landing page</b></i> will feature tabs, making it easier for admins to navigate and access important admin settings like organizational data uploads and feature access controls. Admins will benefit from a more intuitive layout, making it easier to navigate various settings directly from the MAC. Learn more: <a href=\"https://learn.microsoft.com/viva/setup-microsoft-viva\" target=\"_blank\">Set up Microsoft Viva | Microsoft Learn</a> (documentation will be updated before rollout)\n</p><p>Updated Viva admin landing page:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d45b7174-d40d-49e9-86fb-00a325f14d0c\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>2. Through the new <b><i>Feature Access management user interface</i></b>, admins will be able to manage feature access settings directly in the MAC. Feature access management allows admins to use access policies to manage which users can access specific features in Viva apps, so you can tailor your deployments to meet your local regulatory or business requirements.  Previously, these policies could only be managed with Microsoft PowerShell cmdlets. After this rollout, admins can choose to use either the MAC or PowerShell to manage feature access. Existing policies set for an organization will persist and can be managed in both places. Learn more: <a href=\"https://learn.microsoft.com/viva/feature-access-management\" target=\"_blank\">Microsoft Viva - Feature access management | Microsoft Learn</a> (documentation will be updated before rollout)\n</p><p>New user interface for Feature Access Management:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/4a214aff-a37c-4e8d-891d-b455db199b6d\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>These changes will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva's admin experience is updating, with a new Viva admin landing page and Feature Access Management UI in the Microsoft 365 admin center. Rollouts begin late December 2024 and late January 2025, respectively. No admin action is required for the updates. Documentation will be updated prior to rollout."
    }
  ],
  "EndDateTime": "2025-04-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC947830",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-19T00:23:03.603Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-03T23:24:37Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Updates to the admin experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
