{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "We are excited to introduce the new Maker inventory page, providing IT administrators with a centralized and secure way to view their company's agents, apps, and flows. As part of an exclusive early group, you can access this feature before its global release in early 2025.<br><br>\n<b>What can I accomplish with these capabilities?</b>\n<ul><li>Centralized Discovery: Access a comprehensive inventory of agents, canvas apps, model-driven apps, and cloud flows created by your makers-all in one unified location.</li>\n<li>High scale querying: Efficiently search through hundreds, thousands, or even millions of items. The Maker inventory page is optimized for performance, ensuring you get the results you need, fast.</li></ul>\n<b>How does this affect me?</b><br>\nThe new Maker inventory page is already available in your tenant when you enable the new admin center. To access it, simply select the \"<u>Try the new admin center</u>\" toggle in the toolbar and you will find the Maker inventory page under the Manage section of the left navigation.<br><br>\n<b>What do I need to do to prepare?</b><br>\nTo explore the features and benefits of the Maker inventory page in more detail, visit our comprehensive documentation. The new admin center (currently in preview) also includes many other new capabilities that you'll want to explore-learn more about them <a target=\"_blank\" href=\"https://aka.ms/9116_1\">here</a>.<br><br> \nFor personalized assistance, our dedicated customer support team is always ready to help. Plus, join our vibrant community forums to connect with other early-access users and share your experiences.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-01-04T22:30:07Z",
  "HasAttachments": false,
  "Id": "MC948880",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-04T22:32:07.003Z",
  "Services": [
    "Power Apps",
    "Microsoft Power Automate"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-04T22:30:07Z",
  "Tags": [],
  "Title": "Power Platform – Introducing the new Maker inventory page",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
