{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Users can seamlessly share apps and Microsoft 365 Copilot agents in Microsoft Teams chats and channels. A Microsoft 365 Copilot license is not required to share apps and agents, but a Microsoft 365 Copilot license is required to use apps and agents.\n</p><p>This message applies to Teams for Windows desktop, Mac desktop, Teams on the web, and Teams for Android/iOS.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-December 2024 and expect to complete by early January 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out early January 2025 and expect to complete by late January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, users will experience:\n</p><ul><li>New detailed cards for shared Copilot agents and apps\n</li><li>Shortened URLs for shared links\n</li><li>The developer’s name and branding icon on app cards</li><li>App details in short description in cards\n</li><li>Ability to dismiss cards while pasting a link in compose mode\n</li><li>Ability to right click and share apps from the left app bar</li><li>Ability to share from an app header\n</li><li>An updated sharing experience with <i>Share </i>and <i>Copy link</i> in the same window\n</li><li>Shared Copilot agents created from the embedded agent builder in Teams can now be acquired from Teams and used in the Copilot app within Teams.\n</li></ul><p>New detailed cards when sharing Copilot apps and agents in chats and channels:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/cd32b4f5-2b5d-4ed2-b90e-70c3a2b790e7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Sharing from left app bar in Teams:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2d32cc7c-d22b-4e8b-94a8-0e76d12ddd82\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Sharing from the app header or Copilot agent header:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7c50965a-49a9-4e87-8318-b6c6d6bbdab0\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow seamless sharing of apps and Microsoft 365 Copilot agents within chats and channels. No license is needed to share, but usage requires a Microsoft 365 Copilot license. Rollout starts mid-December 2024, with new features like detailed cards, shortened URLs, and an updated sharing experience."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC949004",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-17T18:41:58.35Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-05T00:31:00Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Seamlessly share apps and Microsoft 365 Copilot agents",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
