{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 28, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon, Microsoft Purview Insider Risk Management will be rolling out risky AI usage detections</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=394281\" target=\"_blank\">394281</a>\n</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out early December 2024 and expect to complete by mid-December 2024.</p><p>General Availability (Worldwide): We will begin rolling out mid-August 2025 (previously mid-February) and expect to complete by late August (previously late February).&nbsp;</p><p><b>How this will affect your organization:</b></p><p>With this update, Insider risk management will help admins identify risky AI usage. We are adding new detections of intentional and unintentional insider risk activity on generative AI apps that can pose a risk to an organization. Activities will include risky prompts containing sensitive info or risky intent and sensitive responses containing sensitive info or generated from sensitive files or sites.  Coverage will span across M365 Copilot, Copilot Studio and ChatGPT Enterprise. These detections will also contribute to Adaptive Protection insider risk levels.</p><p><b>What you need to do to prepare:</b></p><p>Below are some of the steps admin can take\n</p><p>\n</p>\n<p></p>\n<ol><li>Get insights into risky AI usage at an organization level in an anonymized form using analytics</li><li>Create Risky AI usage policy to track risky prompts and sensitive responses in M365 Copilot, Copilot Studio\n</li><li>The activity explorer in alerts gives a single threaded view of prompt, response along with the sensitive information present\n</li><li>Use the new Generative AI indicators in adaptive protection for user risk score</li></ol><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.&nbsp;</p><p>Main Admin link: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-policy-templates#risky-ai-usage-preview\" target=\"_blank\">Learn about insider risk management policy templates | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "394281"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will roll out risky AI usage detections. Public Preview starts in early December 2024, and General Availability begins mid-August 2025. This update helps admins identify risky AI activity in generative AI apps, including M365 Copilot, Copilot Studio, and ChatGPT Enterprise. Admins should prepare by creating policies and using new analytics and indicators."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-10-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC947048",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-28T17:06:46.963Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-02T23:52:18Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management- Risky AI usage",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
