{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Teams will soon allow users to personalize the placement of notifications on their screens. Users will be able to choose from four options: bottom right, top right, bottom left, or top left—to make notifications more convenient and less disruptive, enhancing both focus and productivity. This message applies to Teams for Windows desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469491\" target=\"_blank\">469491</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by late January 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late January 2025 and expect to be complete by mid-February 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, Teams notifications were limited to the bottom right corner.\n</p><p>After this rollout, users can customize notification placement in Teams settings under <i>Settings &gt; Notifications and activity &gt; Display.</i>\n</p><p>This feature will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469491"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"469491\":[{\"RoadmapId\":469491,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-06T01:12:12.1491149Z\",\"LatestRing\":null},{\"RoadmapId\":469491,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2024-12-06T01:12:12.149115Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing customizable notification locations with options for bottom right, top right, bottom left, or top left of the screen, starting mid-January 2025 for Targeted Release and late January 2025 for General Availability. This feature will be enabled by default. No admin action is required before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC949959",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-06T01:06:33.85Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T01:06:13Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Customize the location of notifications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
