{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 10, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>As part of the convergence of both Microsoft Defender for Identity and Microsoft Defender for Cloud Apps into Microsoft Defender XDR services, we are continuing to move away from legacy experiences and enhancing the unified experiences.\n</p><p>Therefore, we will gradually retire Defender for Identity's Active Directory and alerts data from Defender for Cloud Apps dedicated experiences. All data, as well as all functionality of the affected experiences, remain available through Microsoft Defender XDR unified experiences, where we will continue to invest our development resources.</p><p><b>When this will happen:</b>&nbsp;</p><p>General Availability (Worldwide, GCC, GCC High, DoD): This retirement will begin rolling out in late January 2025 and is expected to complete in early May 2025 (previously early March 2025).</p><p> <b>How this will affect your organization:</b>\n</p><p>You are receiving this message because the following changes may affect your organization:\n</p><p>Active directory activities coming from Defender for Identity will no longer be available in Defender for Cloud Apps activity logs. Consequently, Defender for Cloud Apps activity policies will cease from triggering based on Active Directory data.\n</p><p>All Active Directory activities data remains available through Advanced Hunting, in the following tables:\n</p><ul><li>IdentityLogonEvents\n</li><li>IdentityDirectoryEvents\n</li><li>IdentityQueryEvents \n</li></ul><p>To learn more about Advanced Hunting and the Data Schema, visit&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/advanced-hunting-overview\" target=\"_blank\">Proactively hunt for threats with advanced hunting in Microsoft Defender</a>&nbsp;and&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/advanced-hunting-schema-tables\" target=\"_blank\">Understand the advanced hunting schema</a>.</p><p>New Active Directory activities, as well as Defender for Identity's alerts data, will no longer be available through Defender for Cloud Apps Activities API, Alerts API, or dedicated SIEM agents.\n</p><p>All activities and alerts data remains available through Defender XDR Streaming API and Event Hubs.\n</p><p>Learn more about&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/streaming-api\" target=\"_blank\">Streaming API</a>.</p><p>For more information about how to integrate your SIEM tools with Microsoft Defender XDR, visit&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/configure-siem-defender#ingesting-streaming-event-data-via-event-hubs\" target=\"_blank\">Ingesting streaming event data via Event Hubs</a>.</p><p>The Identities page under 'Assets' in the XDR portal will be updated to better support the new experiences. The page will be divided into two distinct tabs: First-party identities and Third-party accounts. In the User page, \"View related activity\" action will no longer be available. To learn more about Defender for Identity's experiences in the XDR portal, visit <a href=\"https://learn.microsoft.com/defender-xdr/microsoft-365-security-center-mdi\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Microsoft Defender for Identity in the Microsoft Defender portal</a>.</p><p><b>What you need to do to prepare:</b></p><p>To ensure a seamless experience, create new custom detections for any activity policies based on active directory data in Advanced Hunting. To learn more about how to create custom detections, visit&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/custom-detection-rules\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Create and manage custom detections rules</a>. Suggested queries related to Active Directory activities are available through the portal under <i>Advanced Hunting &gt; Community Queries</i>. For more information, see&nbsp;<a href=\"https://learn.microsoft.com/defender-xdr/advanced-hunting-shared-queries\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Use shared queries in Advanced Hunting</a>.</p><p>If you are still using Defender for Cloud Apps dedicated API and SIEM agents to consume Defender for Identity activities or alerts, make sure to update your resources according to the above information.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Defender for Identity activities and alerts will retire from Defender for Cloud Apps and move to Microsoft Defender XDR services. This change starts in late January 2025 and completes in early May 2025. Users must prepare by creating new custom detections and updating resources accordingly."
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC940078",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-10T15:18:15.567Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-22T22:28:03Z",
  "Tags": [
    "Updated message",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Upcoming changes to Defender for Identity activities and alerts in Defender for Cloud Apps experiences",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
