{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: Microsoft Purview Insider Risk Management will be rolling out updates to email scoring.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469505\" target=\"_blank\">469505</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late November 2024 and expect to complete by late November 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out early January 2025 and expect to complete by mid-January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Insider risk management (IRM) email scoring logic is being updated. With current logic, a single email to multiple recipients is counted multiple times, and this is creating noise by increasing the risk score. In the new logic, a single email to multiple recipients is counted once, and this new principle is applicable to the email containing multiple unallowed domains or priority content. After this rollout, all email insights in Alerts will display the new count and score.\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.\n</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Microsoft Purview compliance portal.</a>\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators#create-a-variant-of-a-built-in-indicator\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469505"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC941861",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-11-26T00:42:51.507Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-11-26T00:42:32Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: Updates to email scoring",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
