{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As noted in MC958903, we are updating the Microsoft 365 app name and icon to Microsoft 365 Copilot in mid-January 2025. In addition, we are evolving the app's UI to support future AI-first experiences. Key changes include reducing the top app header, consolidating all app-level tools and settings into the App toolbar on the left, and retiring features like Help me create and My Day from the app.\n</p><p><b>When will this happen:</b>\n</p><p>These changes will begin rolling out in the Microsoft 365 Copilot app (web, Windows) starting in mid-January 2025. This is a phased rollout, so not all users will receive the update simultaneously.\n</p><p><b>How will this affect your organization:</b>\n</p><p>With these updates, users will notice the following changes:\n</p><ul><li>The app will no longer have a top header. Instead, tools like user profile, settings, and feedback will move to the bottom left toolbar. The feedback button will be available under the 'Settings and more' section in the bottom left toolbar.\n</li><li>The search box will now be presented on the Homepage for users to find all their content across multiple file types and storage locations. Note: There is no change to the search experience—only the placement of the feature.\n</li><li>All the apps on the left tool bar are aligned to the top and the AI rich experiences like Microsoft 365 Copilot Chat and Copilot Pages will be presented together to establish correlation.\n</li><li>The organization logo, previously displayed in the top header under the Organization theme, will no longer be visible in the app. Note: This change does not affect other Microsoft 365 apps where the organization logo will still appear in the header.\n</li><li>The 'Back' button on the Windows Microsoft 365 Copilot app will not be available. Users will still be able to use the left AppBar to navigate between pages. \n</li><li>The 'My Day' feature is being removed from the app experience, and users will no longer see the button to launch the calendar and to-do on the Microsoft 365 Copilot app. Note: This change does not affect other Microsoft 365 apps where My Day feature is available.\n</li><li>The 'Help me create' feature will be retired from the Microsoft 365 Copilot app. Launched in February 2024, ‘Help me create’ was focused on helping users go from their stated intent to document creation using an LLM. With Microsoft 365 Copilot app becoming the destination for Copilot, we will be bringing AI powered document creation into Copilot tab. Users will be able to brainstorm ideas and draft new content based on a storyboard or a script to an agenda or an executive summary from Copilot Chat.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>No admin or user action is required as these changes roll out. However, we recommend keeping your users informed about these updates to ensure they are aware that these changes are part of the app enhancements.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC958905",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-17T00:11:27.2Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-16T23:52:00Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "UI Changes to the Microsoft 365 app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
