{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are releasing an enhanced user experience in Viva Engage for email notifications that admins receive while monitoring network keywords. This enhanced experience addresses security upgrades and offers additional context about the monitored keywords and the associated conversations.<br></p><p>The enhancements and upgrades are summarized below.</p><ul><li>Only Entra ID-backed email addresses within your tenant will be supported as email recipients. Consumer email addresses (e.g. Google Gmail) will no longer be supported. Unsupported email addresses will receive a prompt to change to a compatible email address.</li><li>Private messages between individuals will no longer be detected by the keyword alert system. These messages are confidential and must be discovered through appropriate compliance solutions (e.g. Microsoft e-discovery) when necessary.</li><li>Email subjects will provide more context on the detected keyword and the associated community or storyline conversation.</li><li>Email bodies will include the detected keyword and an inline view of the conversation for public communities. For private community conversations, a link to the detected conversation/message will be provided. Recipients must have access to the community to view the conversation.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7ce3d1b6-55e8-4113-9cc4-f212bea2dde5\" style=\"width: 450px;\"></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470303\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">470303</a>.<br></p><p><b><b>When this will happen:</b></b></p><p>General Availability (Worldwide): We will begin rolling out mid-December 2024 and expect to complete by late January 2025.</p><p><b><b>How this will affect your organization:</b>\n</b></p><p>If your organization has configured keywords to be monitored in Viva Engage, ensure the alert recipient email address is updated to a compatible Entra ID-backed email address within the tenant. We are no longer supporting consumer email addresses to be added as alert recipients.&nbsp;<br></p><p><b><b>What you need to do to prepare:</b>\n</b></p><p>Ensure the keyword email alert recipients are updated to be compatible with our security standards, which are Entra ID-backed email addresses within your tenant.&nbsp;<br><br>Update any email rules or filters to support the new subject line format. If you process keyword email alerts with Power Automate or custom code, you may also need to make modifications to your solution.&nbsp;</p><p>If you use keyword monitoring to identify private messages matching specific keywords, work with your Purview administrator to implement an alternative process using eDiscovery.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470303"
    },
    {
      "Name": "Summary",
      "Value": "Viva Engage is updating email notifications for keyword monitoring with enhanced user experience and security upgrades, including supporting only Entra ID-backed emails, excluding private messages from keyword alerts, and providing more context in email subjects and bodies. Rollout begins mid-December 2024. Ensure alert recipient emails and processing rules are updated accordingly."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS, Web"
    }
  ],
  "EndDateTime": "2025-03-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC958892",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-16T23:30:48.633Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-16T23:30:39Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Viva Engage: Enhanced keyword monitoring email notifications",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
