{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are introducing a new entry point to Viva Connections from the SharePoint app bar, which will enhance the integration between the Intranet and Viva Connections.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468290\" target=\"_blank\">468290</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by late January 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late January 2025 and expect to complete by mid-February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, end users can easily and seamlessly navigate to Viva Connections via any SharePoint site.&nbsp;</p><p>Note: This feature will only be available to customers who have a configured and published dashboard and an enabled Viva Connections experience on their tenants. This feature will be on by default.</p><p>\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.</p><p>We recommend creating awareness about this feature with your users by sending a News post.\n</p><p>You may want to update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468290"
    },
    {
      "Name": "Summary",
      "Value": "A new entry point for Viva Connections will be added to the SharePoint app bar, with rollouts starting mid-January 2025 for Targeted Release and late January 2025 for General Availability. This feature requires a published dashboard and enabled Viva Connections on tenants. No admin action is needed before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-03-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC952886",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-10T00:25:40.293Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T00:25:21Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Connections on the SharePoint app bar",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
