{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>A new feature allows you to schedule messages in Microsoft Teams channels. This feature will help you plan and manage your communications more effectively.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=467447\" target=\"_blank\">467447</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by late January 2025.</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 and expect to complete by mid-February 2025.</p><p>General Availability (GCC): We will begin rolling out early March 2025 and expect to complete by mid-March 2025.\n</p><p>General Availability (GCC High): We will begin rolling out mid-March 2025 and expect to complete by late March 2025.\n</p><p>General Availability (DoD): We will begin rolling out early April 2025 and expect to complete by mid-April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Users will be able to schedule channels messages in Teams.</p><p>Key Features:</p><ul><li>Message Scheduling: Schedule messages to be posted at a specific date and time in any channel.\n</li><li>Easy Access: Use the scheduling option directly from the message compose box.\n</li><li>Flexibility: Edit or cancel scheduled messages before they are posted.</li></ul><p>Note that this feature already exists for Teams chat and is new for Teams channels.</p><p>This update is available by default.</p><p></p><ul></ul><p></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams introduces a feature to schedule messages in channels, enhancing communication management. Rollout begins mid-January 2025, with different completion dates for various releases. Users can schedule, edit, or cancel messages. No admin action needed; users should be informed of the change."
    }
  ],
  "EndDateTime": "2025-05-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC953752",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-10T23:54:20.633Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T23:53:55Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Scheduling channel messages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
