{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 27, 2025: We have updated the content. Thank you for your patience.</p><p>The <a href=\"https://learn.microsoft.com/en-us/powershell/module/exchange/search-unifiedauditlog?view=exchange-ps\" target=\"_blank\">Search-UnifiedAuditLog cmdlet </a>gives administrators in your organization access to critical audit log event data to gain insights and further investigate user activities. Microsoft had introduced a new <a href=\"https://learn.microsoft.com/en-us/powershell/module/exchange/search-unifiedauditlog?view=exchange-ps#-highcompleteness\" target=\"_blank\">HighCompleteness parameter</a> in this cmdlet in April 2024 that allowed customers to toggle between prioritizing completeness of search results and performance.</p><p>We previously announced a change in the behavior of the Search-UnifiedAuditLog cmdlet, specific to the functioning of the HighCompleteness parameter. We had announced plans to deprecate support for this parameter and enforce HighCompleteness on all search queries submitted via the Search-UnifiedAuditLog cmdlet.</p><p>Several customers and partners reached out to us with concerns about the performance of the cmdlet in certain scenarios when HighCompleteness is enabled. Based on these concerns, we have decided to postpone the deprecation of the HighCompleteness parameter to a future date. This postponement will allow us to address these concerns before making any lasting changes in the behavior of the cmdlet, and to minimize any impact on customers relying on this cmdlet.\n</p><p>To search the audit log programmatically, you could also consider using our new Audit Search Graph API for programmatic access to audit logs.&nbsp;</p><p>Learn more about Purview Audit: <a href=\"https://learn.microsoft.com/en-us/purview/audit-solutions-overview\" target=\"_blank\">Learn about auditing solutions in Microsoft Purview | Microsoft Learn</a>\n</p><p>Learn more about the Search-UnifiedAuditLog cmdlet: <a href=\"https://learn.microsoft.com/en-us/powershell/module/exchange/search-unifiedauditlog?view=exchange-ps\" target=\"_blank\">Search-UnifiedAuditLog (ExchangePowerShell) | Microsoft Learn</a></p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The HighCompleteness parameter in the Search-UnifiedAuditLog cmdlet will be permanently set to true starting late January 2025, ensuring more complete search results at the expense of longer query times. Users are advised to prepare and consider using the Audit Search Graph API."
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC955752",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-27T15:34:33.18Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-12T23:26:20Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Change in behavior of the HighCompleteness parameter in the Search-UnifiedAuditLog cmdlet",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
