{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon in Microsoft Teams: Users will be able to forward posts and reply messages to and from channels. We designed this feature to reduce limitations on the type of content that can be forwarded in Teams, to enhance collaboration. This message applies to Teams on Windows and Mac desktops.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469508\" target=\"_blank\">469508</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early January 2025 and expect to complete by mid-January 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late January 2025 and expect to complete by early February 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Before this rollout, users are unable to forward messages to and from channels.\n</p><p>After this rollout, users can select the three-dot <i>More actions </i>menu on any channel post or reply message and then choose <i>Forward</i>.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1rN7m?ver=8ca7\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>In the <i>Forward this message</i> dialog box, users can select any destination chat or channel. Including channels in the people picker is a new addition to the forward message dialog on desktop.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1rHUP?ver=e112\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Impact to admin: This new feature will be on by default. You can control message forwarding for individual teams or at the tenant level with sensitivity labels, using the label setting to prevent copying chat to the clipboard. Learn more: <a href=\"https://learn.microsoft.com/purview/sensitivity-labels-meetings#prevent-copying-chat-to-the-clipboard-label-setting\" target=\"_blank\">Use sensitivity labels to protect calendar items, Teams meetings, and chat | Microsoft Learn</a>. Message forwarding will be disabled in a team with this sensitivity label applied, and users will be blocked from sharing this content outside the channel.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Users must be on the latest Microsoft Teams build to receive this update.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>User documentation: <a href=\"https://support.microsoft.com/office/forward-a-message-in-a-teams-chat-b3190ce7-00da-45aa-978d-a45a7b041d21\" target=\"_blank\">Forward a message in a Teams chat - Microsoft Support</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469508"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"469508\":[{\"RoadmapId\":469508,\"Platform\":\"Desktop\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2025-01-10T09:15:43.198529Z\",\"LatestRing\":\"TargetedRelease\"},{\"RoadmapId\":469508,\"Platform\":\"Web\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2025-01-10T09:15:43.1985285Z\",\"LatestRing\":\"TargetedRelease\"},{\"RoadmapId\":469508,\"Platform\":\"All\",\"Status\":\"InRollout\",\"LastUpdateTime\":\"2025-01-10T09:15:43.1985293Z\",\"LatestRing\":\"TargetedRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow forwarding of posts and reply messages to and from channels to improve collaboration. This feature is for Teams on Windows and Mac, with rollouts starting in January 2025. It will be enabled by default but can be controlled with sensitivity labels. Users need the latest Teams build to use this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-04-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC950897",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-06T23:47:53.57Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T23:47:06Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Forward messages to and from channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
