{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're making some changes to feedback policies in Outlook mobile for iOS and Android behavior to match our documentation.\n</p><p></p><b>When this will happen:</b>\n<p></p><p>General Availability (Worldwide): We will begin rolling out late January 2025 and expect to complete by early February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>According to the current Microsoft documentation in <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-feedback-ms-org?view=o365-worldwide#configure-policies,\" target=\"_blank\">Manage Microsoft feedback for your organization - Microsoft 365 admin | Microsoft Learn</a>, setting feedback collection policies to <i>Not configured</i> has the same effect as setting them to <i>Enabled</i>. Before this rollout, Outlook for iOS and Android currently does the opposite of the documentation and prevents users from including log files and content samples when the <i>Allow users to include log files and content samples when feedback is submitted to Microsoft</i>&nbsp;policy is not configured.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>After this rollout, the behavior will align to the current documentation to allow users to include log files and content samples when submitting feedback if the policy is not configured. Please review the documentation and your organization's configuration to ensure that it matches your requirements.\n</p><p>This change will be available by default.\n</p><p> This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-feedback-ms-org\" target=\"_blank\">Manage Microsoft feedback for your organization - Microsoft 365 admin | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook mobile for iOS and Android is updating feedback policies to match Microsoft documentation, allowing log files and content samples in feedback when policies are 'Not configured'. Rollout begins late January 2025, completing early February. No admin action needed, but review of configurations is advised."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC958891",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-16T23:30:15.367Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-16T23:30:04Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Outlook for iOS and Android: Updated feedback policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
