{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 23, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Updated February 24, 2025: The Worldwide release has been temporarily rolled back. We will update this Message center post with new timelines once available. The Targeted release remains enabled.</p><p>Coming soon: Users will be able to pop out the side panes for Notes, Chat, and Microsoft Copilot panes in Microsoft Teams meetings\n</p><p><b>Note: </b>The Copilot pane is only available in Worldwide environments with a Microsoft 365 Copilot license.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=421607\" target=\"_blank\">421607</a>.\n</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by early February 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Meeting pane pop-out for Notes, Chat, and Copilot panes will start rolling out in late June 2025 and complete by early July 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, users will see a pop-out icon at the top of their Notes, Chat, and Copilot side panes in Teams meetings. This change will be on by default.\n</p><p>When users select the icon, the pane will pop out into a separate window that the user can resize and drag to their desired position, based on their screen setup and their productivity goals for the meeting. Users can view multiple meeting features at the same time, so they don’t miss the chat while they are monitoring meeting notes.\n</p><p>Chat window in the default position in a meeting:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/bb8af250-b4af-48fd-a871-8431763e20d6\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Chat windows popped out into a separate window:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/25d7823f-6368-44f9-9691-041a1ae81ba2\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Please notify your users about this change and update any relevant training documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "421607"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"421607\":[{\"RoadmapId\":421607,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-01-17T06:19:17.8288368Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":421607,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-01-17T06:19:17.8288371Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow users to pop out Notes, Chat, and Copilot panes in meetings. The targeted release is from mid-January to early February 2025, with general availability from late June to early July 2025. The Copilot pane requires a Microsoft 365 Copilot license. No admin action is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-09-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC952888",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-23T18:56:34.147Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T00:26:41Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Pop out Chat, Copilot, and Notes panes in meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
