{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 21, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>A new Microsoft Teams feature empowers moderators to respond discreetly to attendee questions during Teams events. This functionality ensures that responses to sensitive questions, personal inquiries, or follow-up discussions are not broadcast to the entire audience, allowing for a more tailored and respectful communication experience.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=417158\" target=\"_blank\">417158</a>.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out in late January 2025 (previously early January) and expect to complete in late March 2025 (previously early February).</p><p><b>How this will affect your organization:</b></p><p>Moderators can privately respond to an attendee's question, and the attendee can reply back to the moderator in private. After this exchange, the moderator can choose to either publish or dismiss the question without the private conversation being visible to other attendees.\n</p><p>Moderators also have the option to enable or disable the \"Private moderator replies to individual attendees\" feature in the Q&amp;A settings, which is only available when Moderation is turned on for the event. By default, this feature is enabled.</p><p><b>What you need to do to prepare:</b>\n</p><p>Notify the meeting organizers within your organization that this feature  will be available for use in meetings, webinars, and town halls. The <a href=\"https://support.microsoft.com/office/q-a-in-microsoft-teams-meetings-f3c84c72-57c3-4b6d-aea5-67b11face787\" target=\"_blank\">Q&amp;A public documentation</a> will soon be updated to include further details about this feature.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "417158"
    },
    {
      "Name": "Summary",
      "Value": "A new Microsoft Teams feature allows moderators to privately respond to attendee questions during events. This feature will roll out from late January to late March 2025. Moderators can enable or disable it in Q&A settings. Notify meeting organizers about this update. More details will be in the Q&A documentation."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac"
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC952893",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-21T17:24:13.937Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T00:28:29Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Private moderator replies to individual attendees",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
