{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 7, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We're introducing a pay-as-you-go (PayG) billing model for Agents in SharePoint allowing organizations to use an Azure subscription to pay for the service based on the number of queries used.</p><p><b>When this will happen:</b></p><p>Pay-as-you-go billing for Agents in SharePoint is expected to be released starting mid-January 2025. Pay-as-you-go services are disabled by default and services will be available to be used only after PayG billing is set up.</p><p>\n</p><p>General Availability (WW): We will begin rolling out mid-January 2025 and expected to complete by early February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>With this update, admins can now provide users without Copilot licenses with the ability to use and create agents on any SharePoint site or document library they have access to. Users with Microsoft 365 Copilot seat licenses can continue using agents in SharePoint according to their license terms.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>To use agents in SharePoint on a pay-as-you-go basis, admins must first set up billing and activate the service in the Microsoft 365 admin center. An Azure subscription and resource group are required to set up pay-as-you-go billing. \n</p><p>Admins need to have the owner or contributor role for the Azure subscription to setup billing.  Select Activate pay-as-you-go services from the Setup page to get started. \n</p><p>Follow these steps to enable PAYG billing for Agents in SharePoint:</p><ol><li>Visit the <a href=\"https://admin.microsoft.com/Adminportal/Home#/syntex/documents\" target=\"_blank\">https://admin.microsoft.com/Adminportal/Home#/syntex/documents</a> as a Global Admin or SharePoint Admin</li><li>Click Pay-as-you-go services in org settings or Activate pay-as-you-go under setup.</li><li>Go to “Agents in SharePoint” Tab under Billing Tab</li><li>Setup billing by adding Subscription, Region, and Resource group.</li></ol><p>To use pay-as-you go for Agents in SharePoint, you need:</p><ul><li>An Azure subscription.</li><li>An Azure resource group in that subscription.</li><li>For information about how to create an Azure subscription, see <a href=\"https://learn.microsoft.com/azure/cloud-adoption-framework/ready/azure-best-practices/initial-subscriptions\" target=\"_blank\">Create your initial Azure subscriptions</a>.</li><li>For information about how to create an Azure resource group, see <a href=\"https://learn.microsoft.com/azure/azure-resource-manager/management/manage-resource-groups-portal\" target=\"_blank\">Manage Azure resource groups by using the Azure portal</a>.</li></ul><p>Note: The use of PayG to allow unlicensed users to utilize Agents in SharePoint will respect any controls in place to manage Copilot within the organization.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint introduces a new Pay-as-you-go billing model for Agents, enabling payment through an Azure subscription based on usage. Rollout begins mid-January 2025, with general availability by early February. Admins must set up billing in the Microsoft 365 admin center to activate this service."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC952883",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-07T16:26:00.65Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T00:24:26Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Pay-as-you-go billing model for Agents in SharePoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
