{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Copilot will show current sensitivity label settings to users for any Microsoft 365 file used to ground a prompt in Microsoft 365 Copilot Business Chat web mode and Microsoft Copilot with enterprise data protection web grounding chat. These are the same sensitivity settings displayed across Microsoft 365 products like Word, Excel, PowerPoint, SharePoint, Outlook, etc.</p><p>\n</p><p>\n</p><p>Copilot will display sensitivity label shields at the bottom of Copilot responses with the file referenced file.  This will help users identify the level of sensitivity classification for the content included in the response from the file.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469497\" target=\"_blank\">469497</a></p><p><b>When this will happen:</b></p><p>General Availability (Worldwide) We will begin rolling out in early January 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Starting early January, Microsoft 365 Copilot users and Microsoft Copilot users logged in with their Entra account will start seeing the sensitivity labels in the response references anytime they use a Microsoft 365 file to ground their prompt.&nbsp; &nbsp;&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>No action is required.  Visit <a href=\"https://learn.microsoft.com/purview/get-started-with-sensitivity-labels\" target=\"_blank\">Get started with sensitivity labels | Microsoft Learn</a> to learn more about how you can setup and manage sensitivity labels for your organization.</p><p>Learn more here: <a href=\"https://learn.microsoft.com/purview/sensitivity-labels\" target=\"_blank\">Learn about sensitivity labels | Microsoft Learn</a><br></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469497"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot will soon display file sensitivity labels in Business Chat and enterprise data protection chat, consistent with other Microsoft 365 products. No action is needed; rollout begins January 2025. More information can be found on Microsoft's roadmap and learning pages."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC954841",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-11T23:45:11.583Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-11T23:44:47Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 file sensitivity labels in Copilot responses availability update",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
