{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring support for the Filmbox (.FBX) and SketchUp (.SKP) file formats in Microsoft 365 apps on March 1, 2025. Inserting these file formats requires using third-party transcoding packages that are no longer being maintained to our security standards. The two formats are currently off by default. We will continue to support the insertion of other 3D model formats, including OBJ, STL, GLTF, and GLB.\n</p><p>You are receiving this message because our reporting indicates your organization may be using Office 365 apps, which have previously supported .FBX and .SKP files.\n</p><p>Users will no longer be able to insert .FBX or .SKP files after this change is implemented. Note that because 3D models are converted to a shared base format after insertion, all Filmbox and SketchUp models that have already been inserted in Office documents will persist without issue.\n</p><p>This change will happen automatically by the specified date. No admin action is required. Please notify your users about this change, update relevant documentation as appropriate, and advise users that if they wish to insert .FBX or .SKP files going forward, they will need to first convert them outside of Microsoft 365 (or if they are the author of the file, export it to a different format).</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 apps will retire support for .FBX and .SKP file formats on March 1, 2025, due to security concerns. Users must convert these files externally after this date. Existing inserted 3D models will remain unaffected. No admin action is required."
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC950892",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-06T23:45:12.83Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T23:44:14Z",
  "Tags": [
    "User impact",
    "Retirement"
  ],
  "Title": "Support for .FBX and .SKP three-dimensional file formats in Microsoft 365 apps will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
