{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 19, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>The room audio auto-detect and pre-select feature for Microsoft Teams BYOD rooms (released October 2024) will soon activate the video component of composite audio-video peripherals as the selected camera in Teams. This message applies to Teams for Windows desktops and Teams for Mac desktops.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469496\" target=\"_blank\">469496</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early May 2025 and expect to complete by mid-May 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out in mid-May 2025 and expect to complete by late May 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>When a user selects an audio peripheral in the <i>Room Audio</i> option on the meeting prejoin screen, if that peripheral has a video component, that video component will be used as the video device for the Teams meeting.\n</p><p>This change will be available by default. \n</p><p><b>What you need to do to prepare:</b>\n</p><p>Inform your users that this new behavior will be coming so they are aware that the room's camera will be used if there is one.\n</p><p></p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your room peripheral inventory to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469496"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will activate the video component of audio-video peripherals as the selected camera in BYOD rooms starting May 2025. This applies to Teams for Windows and Mac desktops. Inform users about this change, which will occur automatically, and review room peripherals for impact. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC952881",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-19T15:17:13.133Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T00:23:44Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: BYOD mode will activate cameras on meeting room audio devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
