{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 28, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are introducing a new entry point to Viva Connections from the SharePoint app bar, which will enhance the integration between the Intranet and Viva Connections.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468290\" target=\"_blank\">468290</a>.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/43d11ee2-b199-415e-a4d9-48367dcf2f9f\" style=\"width: 600px;\"><br></p><p><i>Screenshot of Viva Connections on SharePoint App Bar feature</i></p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late January 2025 (previously mid-January) and expect to complete by early February 2025 (previously late January).\n</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 (previously late January) and expect to complete by late February 2025 (previously mid-February).</p><p>General Availability (GCC, GCC High, DoD): We expect to complete by late February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After the rollout, end users can easily and seamlessly navigate to Viva Connections via any SharePoint site.&nbsp;</p><p>Note: This feature will only be available to customers who have a configured and published dashboard and an enabled Viva Connections experience on their tenants. This feature will be on by default.</p><p>\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.</p><p>We recommend creating awareness about this feature with your users by sending a News post.\n</p><p>You may want to update any relevant documentation.</p><p>\n</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468290"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft is rolling out a new Viva Connections entry point on the SharePoint app bar, with a revised timeline for Targeted Release and General Availability. This feature, which integrates Intranet and Viva Connections, requires no admin action but suggests user awareness and documentation updates."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-03-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC952886",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-28T14:59:15.407Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T00:25:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Connections on the SharePoint app bar",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
