{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p _msttexthash=\"5300282\" _msthash=\"2426\">Updated February 21, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p _msttexthash=\"5300282\" _msthash=\"2426\">In order to automate <a href=\"https://support.microsoft.com/office/use-shared-display-mode-in-meeting-rooms-a59c6886-9028-44da-a3cc-5563be40a214\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">BYOD user experience (BYOD mode)</a> for users in meeting rooms, the peripherals that users plug in must be associated to those rooms in Microsoft Teams Rooms Pro management portal. The Pro management portal will soon use meeting room invite data to intelligently associate peripherals to rooms, automatically creating inventory relationships for you. The association logic relies on many unique users joining a meeting with a specific meeting room booked and the same peripheral plugged in, as identified by serial number and VIDPID. Auto association can also keep up with the times by re-associating a peripheral if it gets physically moved to another room.</p><p _msttexthash=\"2141711\" _msthash=\"2425\">This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469495\" target=\"_blank\">469495</a>.\n</p><p _msttexthash=\"474019\" _msthash=\"2424\"><b>When this will happen:</b>\n</p><p _msttexthash=\"5643534\" _msthash=\"2423\">Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by mid-January 2025.\n</p><p _msttexthash=\"8338876\" _msthash=\"2422\">General Availability (Worldwide): We will begin rolling out in late January 2025 and expect to complete by late March 2025 (previously early February).\n</p><p _msttexthash=\"1207817\" _msthash=\"2421\"><b>How this will affect your organization:</b>\n</p><p _msttexthash=\"32433973\" _msthash=\"2420\"><b>For you: </b>Shared peripherals (peripherals used by multiple unique users who are in the office) will be automatically associated to your BYOD rooms in the Pro management portal. This automatic process will enable you to see the peripherals in each room.\n</p><p _msttexthash=\"24715847\" _msthash=\"2419\"><b>For your users:</b> After this rollout, users who plug in an associated peripheral will automatically have BYOD mode activated because we can be confident these users are in a meeting room. BYOD mode will have these benefits:\n</p><ul><li _msttexthash=\"16551470\" _msthash=\"2414\">Auto selection of the associated audio/video device in Teams so users never accidentally use their PC’s audio\n</li><li _msttexthash=\"2873429\" _msthash=\"2415\">Shared display mode for enhanced content sharing to the meeting room\n</li><li _msttexthash=\"11066263\" _msthash=\"2416\">Speaker attribution to enable Microsoft Copilot (for Microsoft 365 Copilot license holders) and transcript to recognize speakers in the room\n</li><li _msttexthash=\"5628376\" _msthash=\"2417\">Automatically disable voice isolation to prevent this from filtering out other people in the room\n</li><li _msttexthash=\"1917045\" _msthash=\"2418\">Grouping users under a room node in participant roster\n</li></ul><p _msttexthash=\"25535887\" _msthash=\"2413\"><b>Note: </b>This process relies on bookings and peripheral plug-ins. It may take some time. Do not expect to see associations on day one of launch. We recommend checking back once a week or once a month to see how the process is going.\n</p><p _msttexthash=\"438893\" _msthash=\"2412\">You will also be able to:\n</p><ul><li _msttexthash=\"21566298\" _msthash=\"2408\">Configure the threshold of users who need to report a peripheral-room pairing in order to auto associate. A higher threshold may yield a more accurate result but may significantly slow down the process.\n</li><li _msttexthash=\"18842785\" _msthash=\"2409\">Independently mark auto associated rooms or peripherals as verified if you choose to manually check for accuracy, though this may be difficult to scale and is not recommended or necessary.\n</li><li _msttexthash=\"4638335\" _msthash=\"2410\">Enable/disable auto association for specific rooms, or for your entire tenant globally.\n</li><li _msttexthash=\"3758157\" _msthash=\"2411\">Export your inventory associations for use in your own asset management tools.\n</li></ul><p _msttexthash=\"1115283\" _msthash=\"2407\">This change will be available by default. \n</p><p _msttexthash=\"728585\" _msthash=\"2406\"><b>What you need to do to prepare:</b>\n</p><ul><li _msttexthash=\"20121452\" _msthash=\"2404\">Rooms that are hidden in the global address list (GAL) in your tenant are not seen by the Pro management portal. You may wish to make these rooms visible and use another method to make them unbookable.\n</li><li _msttexthash=\"28715505\" _msthash=\"2405\">Some users do not book rooms or plug in peripherals. Both behaviors are necessary for auto association to receive enough signals and confidence to work. You may benefit from encouraging your users to book rooms and plug in peripherals.\n</li></ul><p _msttexthash=\"42424005\" _msthash=\"2403\">This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current room inventory to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p _msttexthash=\"2933944\" _msthash=\"2402\">Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469495"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will automatically associate BYOD rooms and peripherals using meeting room invite data. The rollout starts mid-January 2025 for Targeted Release and late January 2025 for General Availability, completing by late March 2025. Users will benefit from auto selection of devices, shared display mode, speaker attribution, and more."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC950888",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-21T17:28:59.32Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T23:42:47Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Automatic association of BYOD rooms and peripherals",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
