{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft SharePoint eSignature allows users to easily request eSignatures on a PDF document via Microsoft SharePoint Online. Signers can easily add their electronic signature. Signed documents are then saved securely back to SharePoint.</p><p>As communicated in MC800502, SharePoint eSignature electronic signature service, SharePoint eSignature is currently available in the United States, United Kingdom, and Canada, and is rolling out to all of Europe.&nbsp; As well as rolling out to Europe, SharePoint eSignature will be rolling out to Australia Pacific.</p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=168828\" target=\"_blank\">168828</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out late November 2024 and expect to complete by January 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, users only had third-party (non-Microsoft) plugin options for eSignatures in SharePoint.\n</p><p>\n</p>\n<p></p>\n<p>After the rollout, if your region is now supported, you will be able to configure and use SharePoint eSignature in SharePoint Online.</p><p><b>What you need to do to prepare:</b>\n</p><p>\n</p><p>If you have SharePoint Premium configured before this rollout, you will need to turn on this feature.</p><p>If you sign up for SharePoint Premium after the rollout, the feature will be on by default, but you can turn it off.</p><p>References</p><ul><li><a href=\"https://learn.microsoft.com/en-gb/microsoft-365/syntex/esignature-setup\" target=\"_blank\">Set up SharePoint eSignature | Microsoft Learn</a></li><li><a href=\"https://adoption-dev.azurewebsites.net/sharepoint-premium/esignature/\" target=\"_blank\">SharePoint eSignature – Microsoft Adoption (adoption-dev.azurewebsites.net)</a>\n</li><li><a href=\"https://learn.microsoft.com/en-gb/microsoft-365/syntex/esignature-overview\" target=\"_blank\">Overview of SharePoint eSignature | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "168828"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint eSignature, enabling users to request eSignatures on documents via SharePoint Online, will soon be available in Australia Pacific. It's already available in the US, UK, Canada, and rolling out in Europe. Rollout began in late November 2024 and will complete by January 2025. Users need to configure this feature if they have SharePoint Premium before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-02-10T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC950902",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-09T17:51:14.773Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T23:49:21Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "SharePoint eSignature: Coming soon to Australia Pacific",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
