{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are introducing the Community Expert feature in Microsoft Viva Engage to enhance the trust and utility of knowledge in your communities. Experts will be able to endorse accurate and credible answers and be recognized as community experts with a special label next to their name.</p><p>A community expert is a member of a community who is assigned or approved by a community admin to serve as a subject matter expert within a specific community. A community expert has special capabilities, such as marking the best answer, marking a verified answer (coming separately and soon after with the launch of Community Experts), and pinning posts. However, a community expert does not have the ability to manage members, assign roles, and so on like a community admin. Additionally, they are given a label strictly within that community that says “Community Expert.”&nbsp;</p><p>Note: Community expertise is determined by community admins within your organizations, not Microsoft. Microsoft does not have the ability to define a community expert in your organization.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=408164\" target=\"_blank\">408164</a>.</p><p>General Availability (Worldwide): We will begin rolling out early January 2025 and expect to complete by late February 2025.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>This will be available for all customers as part of the seeded Viva Engage experience.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>Tips for identifying community experts:&nbsp;</p><ul><li>Engaged existing users: Identify individuals who consistently participate in community discussions, whether by providing answers, verifying information, or sharing relevant resources.&nbsp;</li><li>Peer recommendations: Consider recommendations from peers who regularly consult these individuals for guidance on specific topics. It could be as simple as putting up a poll in a community and asking people to respond.&nbsp;&nbsp;</li></ul><p>We will provide a blog post and documentation on how to best use this feature in the future.</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408164"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is introducing a Community Expert feature, allowing experts to endorse answers and be recognized with a special label. Community admins assign these roles, which include abilities like marking the best answer. The rollout begins in January 2025 and requires no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC956390",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-13T17:56:06.93Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-13T17:55:40Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Engage: Designated experts in Communities",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
