{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>There are important changes coming to a few Teams PowerShell cmdlets. Starting January 2025, we will be deprecating <a href=\"https://learn.microsoft.com/powershell/module/teams/get-csdialplan?view=teams-ps\" target=\"_blank\">Get-CsDialPlan</a> cmdlet. We will also be deprecating DialPlan attribute from <a href=\"https://learn.microsoft.com/en-us/powershell/module/teams/get-csonlineuser?view=teams-ps\" target=\"_blank\">Get-CsOnlineUser</a> and LocationProfile attribute from <a href=\"https://learn.microsoft.com/en-us/powershell/module/teams/get-csuserpolicyassignment?view=teams-ps\" target=\"_blank\">Get-CsUserPolicyAssignment</a> cmdlet. If you are using DialPlan or LocationProfile attribute found in these cmdlets, please stop using them.</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates your organization may be using Microsoft Teams Phone services. When this change is implemented,\n</p><ul><li>Administrators will no longer be able to use <b>Get-CsDialPlan</b> cmdlet.\n</li><li>Administrators will no longer be able to get <b>DialPlan </b>from <b>Get-CsOnlineUser</b> cmdlets.\n</li><li>Administrators will no longer be able to get <b>LocationProfile </b>from <b>Get-CsUserPolicyAssignment</b> cmdlet.</li></ul><p>DialPlan and LocationProfile are Microsoft internal use only attributes and we believe Microsoft Teams Phone administrators do not have any direct usage for these. To understand the effective dial plan please use: <a href=\"https://learn.microsoft.com/en-us/powershell/module/teams/get-cseffectivetenantdialplan?view=teams-ps\" target=\"_blank\">Get-CsEffectiveTenantDialPlan</a>.</p><p>\n</p><p>We will gradually roll out this change to customers in early January 2025, and we expect to complete by mid January 2025.</p><p>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically, no admin action is required. Please notify your admins about this change, update relevant documentation and automations as appropriate.</p><p>\n</p><p>Detailed instructions on these cmdlets are provided in <a href=\"https://learn.microsoft.com/powershell/module/teams/get-csonlineuser?view=teams-ps\" target=\"_blank\">Get-CsOnlineUser</a>, <a href=\"https://learn.microsoft.com/powershell/module/teams/get-csuserpolicyassignment?view=teams-ps\" target=\"_blank\">Get-CsUserPolicyAssignmen</a>t, <a href=\"https://learn.microsoft.com/powershell/module/teams/get-cseffectivetenantdialplan?view=teams-ps\" target=\"_blank\">Get-CsEffectiveTenantDialPlan</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting January 2025, the Get-CsDialPlan cmdlet will be deprecated, along with the DialPlan attribute from Get-CsOnlineUser and LocationProfile attribute from Get-CsUserPolicyAssignment. Organizations using Microsoft Teams Phone services should prepare for these changes, which require no admin action but may necessitate updates to documentation and automations."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC950879",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-06T23:38:47.363Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T23:38:00Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Update to Get-CsDialPlan, Get-CsOnlineUser, and Get-CsUserPolicyAssignment cmdlet in the Teams PowerShell Module",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
