{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 8, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>We are introducing the ability to forward app cards. With the addition of app card forwarding, users now have a new way to share app cards across chats. To forward a message containing an app card, simply navigate to the More Actions menu of any message containing an app card and select <i>forward</i>. From here, the forward message dialog will populate, which provides users with a preview of the message being forwarded, including the app card.&nbsp;</p><p>Please note: Forwarding of bot cards is excluded from this release.&nbsp;<br></p><p>\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469506\" target=\"_blank\">469506</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-February 2025 (previously early February) and expect to complete by late February 2025 (previously mid-February).</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late February 2025 (previously late January) and expect to complete by late May 2025 (previously late April).</p><p><b>How this will affect your organization:</b>\n</p><p>Users will now have less restrictions when forwarding content. Previously, users were unable to forward messages that contained app cards. With this improvement, this restriction does not exist.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Users must have the latest Microsoft Teams build to receive these updates. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow users to forward app cards in messages. This feature will be available from mid-February 2025 for Targeted Release and late February 2025 for General Availability. Users need the latest Teams build, and bot cards are excluded from this update. Roadmap ID: 469506."
    }
  ],
  "EndDateTime": "2025-06-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC956699",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-05-09T21:18:47.97Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-13T23:42:48Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Forward messages with app cards",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
