{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The <a href=\"https://learn.microsoft.com/powershell/module/exchange/search-unifiedauditlog?view=exchange-ps\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Search-UnifiedAuditLog cmdlet</a> gives administrators in your organization access to critical audit log event data to gain insights and further investigate user activities. Microsoft had introduced a new <a href=\"https://learn.microsoft.com/powershell/module/exchange/search-unifiedauditlog?view=exchange-ps#-highcompleteness\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">HighCompleteness parameter</a> in this cmdlet in April 2024 that allowed customers to toggle between prioritizing completeness of search results and performance. When the HighCompleteness parameter is set to true, the search query returns a more complete set of search results, but the query may take a longer time to finish. When set to false, the query runs faster but only returns a subset of results. We recommended setting the parameter to true in scenarios where a complete list of search results was required.&nbsp;</p><p>To improve our customers’ visibility into their security logging and reduce instances of customers missing out on important audit records in their search results, we are now changing the behavior of the HighCompleteness parameter. Previously, customers could toggle the parameter between true or false. With this change, the HighCompleteness parameter will always be set to true.&nbsp;</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC-High, DoD): Starting late January 2025, for all search queries submitted via the Search-UnifiedAuditLog cmdlet, the value of the HighCompleteness parameter will be set to true.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>The HighCompleteness parameter in the Search-UnifiedAuditLog cmdlet will now be set to true for all queries. With this change, the cmdlet will now prioritize completeness of search results over performance. As a result, search queries may take longer to finish.&nbsp;</p><p><b>What you can do to prepare:</b></p><p>You could also consider using our new <a href=\"https://learn.microsoft.com/graph/api/resources/security-auditlogquery?view=graph-rest-beta\" target=\"_blank\">Audit Search Graph API</a> for programmatic access to audit logs. This API is now Generally Available to all our Worldwide and Gov customers.</p><p>Learn more about Purview Audit: <a href=\"https://learn.microsoft.com/purview/audit-solutions-overview\" target=\"_blank\">Learn about auditing solutions in Microsoft Purview | Microsoft Learn</a></p><p>Learn more about the Search-UnifiedAuditLog cmdlet: <a href=\"https://learn.microsoft.com/powershell/module/exchange/search-unifiedauditlog?view=exchange-ps\" target=\"_blank\">Search-UnifiedAuditLog (ExchangePowerShell) | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The HighCompleteness parameter in the Search-UnifiedAuditLog cmdlet will be permanently set to true starting late January 2025, ensuring more complete search results at the expense of longer query times. Users are advised to prepare and consider using the Audit Search Graph API."
    }
  ],
  "EndDateTime": "2025-03-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC955752",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-12T23:26:28.683Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-12T23:26:20Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Change in behavior of the HighCompleteness parameter in the Search-UnifiedAuditLog cmdlet",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
