{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 21, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are excited to announce a new capability in the Microsoft Teams admin center designed to ensure that device operations are non-disruptive for Android-based Teams devices.\n</p><p>This new feature allows software updates, restarts, and configuration updates to occur only when the device is idle (not busy), preventing any disruptions during meetings or calls. Device admins will now have the ability to manage these operations without affecting end-user experience, ensuring smoother and uninterrupted device usage.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=418120\" target=\"_blank\">418120</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late February 2025 and expect to complete by early April 2025 (previously early March).</p><p><b>How this will affect your organization:</b>\n</p><p>This change will significantly enhance the user experience by ensuring that device operations such as software updates, restarts, and configuration updates are carried out only when the device is idle. This means meetings or calls will no longer be interrupted by these operations. This change will be applicable for Teams Rooms on Android, Panels, Phones, and Displays.\n</p><p>This change will require an update for Teams app and the Teams admin agent app to take effect. We will update this message closer to the release date with details about the required versions.\n</p><p>With this change, the following device operations will automatically function in a non-disruptive way:\n</p><ul><li>Software update\n</li><li>Device restart\n</li><li>Configuration update\n</li></ul><p>This change will be applicable for operations created by administrators manually from Teams admin center or the Teams Rooms Pro Management Portal, as well as those being carried out automatically.\n</p><p><u>How this will work:</u></p><p>At the time of execution, the device status is checked. The execution goes forward only if the device is free (no ongoing meeting or call) and has no upcoming scheduled event on the calendar.\n</p><p>A few minutes before the execution starts, the device shows a notification for the end-users, informing them that the operation is about to start. The device users get an option to Postpone the execution if they want to use the device.\n</p><p>The execution of the operation does not start if the device is busy, or has upcoming scheduled events on the calendar, or the end-user has opted to postpone the execution. The device status is checked at regular intervals for a safe window for execution.\n</p><p>The status of the operation is available in Teams admin center. Admins can view the details on the device page under the <a href=\"https://learn.microsoft.com/microsoftteams/devices/device-management#manage-phones-teams-rooms-on-android-teams-displays-and-teams-panels\" target=\"_blank\">History tab</a>.\n</p><p>This ensures that the end-users do not face any disturbance while they are using Teams devices.\n</p><p><u style=\"\">Additional aspects</u>\n</p><p>There could be scenarios where the devices are extremely busy thus delaying the execution of the operation. Administrators will have an option to decide the execution approach if the execution is unable to start even after 24 hrs. There are two options:\n</p><ul><li>The operation is cancelled after having tried for 24 hrs<b>.</b> There will be no impact on the device. If the administrator created this operation, they can come back can create it again. <u>This is the default behavior.\n</u></li><li>The operation is force-executed after having tried for 24 hrs. This option will execute the operation, but the status of the device will not be checked at this point. This may cause some disruption if the device is in use.\n</li></ul><p>The option to cancel or force the execution of the operations after the 24-hr search of a safe-execution window can be configured from Teams admin center through the <a href=\"https://learn.microsoft.com/microsoftteams/devices/device-management#use-configuration-profiles-in-teams\" target=\"_blank\" );\"=\"\">Configuration profiles</a>.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>The changes will take effect automatically after updating the devices to the required Teams app and Teams admin agent versions. The updates will happen automatically, but admins can choose to update manually also. The details about the required versions will be announced closer to the release date. Refer to <a href=\"https://learn.microsoft.com/microsoftteams/devices/remote-update\" target=\"_blank\">Update Microsoft Teams devices remotely - Microsoft Teams | Microsoft Learn</a> for more details about updating devices.\n</p><p>Admins should familiarize themselves with the new controls available in the Teams admin center. They should ensure that they configure the settings appropriately to suit their organization's needs. Additionally, it's recommended to communicate these changes to end-users, so they are aware of the improved experience and new notifications they might receive regarding device operations.\n</p><p>We believe this feature will greatly improve the reliability and user experience of Teams devices in your organization.\n</p><p>For any clarification, feel free to reach out to Microsoft Support.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "418120"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams admin center will introduce a feature to ensure non-disruptive operations for Android-based Teams devices. Updates, restarts, and configurations will occur only when devices are idle. Rollout starts late February 2025 and completes by early April 2025. Admins can manage these operations without disrupting meetings or calls."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC952889",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-21T16:46:33.583Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-10T00:27:16Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: Non-disruptive device operations for Microsoft Teams devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
