{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 20, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>To maintain the best performance and reliability of our service, we are updating the page size limit for the phone number retrieval API (Get-CsPhoneNumberAssignment cmdlet) to a maximum of 1,000 numbers per query.</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC): We will begin rolling out early February 2025 (previously mid-January) and expect to complete by late February 2025 (previously mid-February).&nbsp;</p><p><b>How this will affect your organization:</b></p><p>From January 6, 2025, any request with -Top parameter exceeding 1,000 will result in a \"Bad request.\" Please ensure that your Get-CsPhoneNumberAssignment requests do not surpass this limit. If the intended operation is to export your numbers, please use https://learn.microsoft.com/en-us/powershell/module/teams/export-csacquiredphonenumber?view=teams-ps</p><p><b>What you need to do to prepare:</b>\n</p><p>Please ensure that your Get-CsPhoneNumberAssignment requests do not surpass this limit.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Get-CsPhoneNumberAssignment cmdlet page size limit will be updated to a maximum of 1,000 numbers per query. The rollout will begin in early February 2025 and complete by late February 2025. Requests exceeding this limit will result in a \"Bad request\" starting January 6, 2025."
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC950880",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-20T14:51:43.363Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-06T23:39:01Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Update to Get-CsPhoneNumberAssignment",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
