{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are making several important updates to how your entire organization can experience <a href=\"https://learn.microsoft.com/copilot/overview\" target=\"_blank\">Microsoft Copilot</a>, our existing ad-free, AI-powered chat service grounded in the web and secured with enterprise data protection. Starting in mid-January, we will roll out the following changes:\n</p><ol><li>We are making name changes to simplify the user experience. Microsoft Copilot for Entra account users will be renamed Microsoft 365 Copilot Chat. Additionally, the <a href=\"https://www.microsoft365.com/\" target=\"_blank\">Microsoft 365</a> app will be named Microsoft 365 Copilot, and its icon will be updated as announced during the November 2024 Ignite conference.\n</li><li>The new Microsoft 365 Copilot Chat will allow end users to discover, create, and use agents.\n</li><li>The new Microsoft 365 Copilot Chat will be accessible within the new Microsoft 365 Copilot app, with options for admins and end users to control access.\n</li></ol><p><b>When will this happen:</b>\n</p><p>These changes will begin rolling out in mid-January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Microsoft 365 Copilot Chat (formerly Microsoft Copilot) will continue to offer web-grounded chat with the latest large language models including GPT-4o, features like Pages and file upload, and enterprise data protection at no additional cost for Entra account users. \n</p><p>Microsoft 365 Copilot Chat users will be able to discover, create, and use agents, including custom agents that can access shared work data in your tenant. Access to agents can be controlled and configured within the Microsoft 365 admin center. Specific agents, such as those that access shared work data, will be billed based on metered consumption for users without a Microsoft 365 Copilot license. Agents grounded only on web data will be available to use at no additional cost.\n</p><p>The name changes for Microsoft 365 Copilot Chat and the Microsoft 365 Copilot app, and the new Microsoft 365 Copilot app icon, will roll out across App stores and the web in mid-January.  \n</p><p>We are also introducing a new URL to make it easier to discover Microsoft 365 Copilot on the web: M365Copilot.com. Further, users visiting office.com and microsoft365.com will automatically redirect to m365.cloud.microsoft. \n</p><p>Additionally, we are rolling out updates to the Microsoft 365 Copilot app UI. For more details, refer to MC958905.\n</p><p>Here’s a summary of the name and icon changes:\n</p><p><br></p><p>\n</p><p></p><table>\n  <tbody><tr>\n    <th>Updates</th>\n    <th>Today</th>\n    <th>Mid-January 2025</th>\n  </tr>\n  <tr>\n    <td><p>Product Name&nbsp; &nbsp;</p><br><br></td>\n    <td><p>Microsoft Copilot<br>(for users with Entra Account)&nbsp; &nbsp;&nbsp;</p><br></td><td><p>Microsoft 365 Copilot Chat</p><br><br><br></td>\n  </tr>\n  <tr>\n    <td><p>Product URL</p><br></td>\n    <td><p>Microsoft.com/copilot</p><br></td>\n    <td><p>M365Copilot.com</p><br></td>\n  </tr>\n<tr>\n    <td><p>App Name</p><br></td>\n    <td><p>Microsoft 365</p><br></td>\n    <td><p>Microsoft 365 Copilot</p><br></td>\n  </tr><tr><td><p>App Icon</p><br><br><br><br><br><br><br><br><br><br><br><br></td><td><p>Microsoft 365</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/89d976aa-08e8-4d8a-aff2-be710fff0289\" style=\"width: 75px;\"></p></td><td><p>Microsoft 365 Copilot</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/111ced82-55ce-46ba-ac6b-521ade12026b\" style=\"width: 75px;\"></p></td></tr>\n\n</tbody></table>\n<p></p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required for Microsoft 365 Copilot Chat integration within the new Microsoft 365 Copilot app. Previous tenant pinning controls for Microsoft 365 Copilot Chat (formerly Microsoft Copilot) will be honored. These settings can be found and managed on the <a href=\"https://admin.cloud.microsoft/?#/copilot/settings\" target=\"_blank\">Copilot page within the Microsoft 365 admin center</a>.\n</p><p>Per above, web grounded agents are available at no cost and respect existing settings for enabling web grounding within a tenant.\n</p><p>Agents that access SharePoint or Graph Connector content will be billed based on metered consumption. Agents utilizing metered consumption are off by default. To enable, admins will need to set up or utilize an existing Azure subscription for Copilot Studio. More details on how to manage metered consumption will be available in mid-January.\n</p><p>No action is needed to enable agents for Microsoft 365 Copilot-licensed users – the use of agents comes with Microsoft 365 Copilot licenses.\n</p><p>For the name and icon changes, no action is required.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC958903",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-17T00:11:24.517Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-16T23:49:59Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Important updates to Microsoft Copilot and the Microsoft 365 app",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
