{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p><a href=\"https://learn.microsoft.com/purview/ocr-learn-about?view=o365-worldwide&amp;tabs=purview\" target=\"_blank\">Optical Character Recognition (OCR)</a> scanning enables Microsoft Purview | Information Protection to scan images for sensitive information. With this rollout, we will enhance the OCR capabilities to scan for sensitive content in images embedded in other files (such as a .png image file in a Microsoft Word .docx file) with a limit of 20 embedded images scanned per file for Microsoft Exchange Online. Before this rollout, OCR was able to scan standalone images only.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=323899\" target=\"_blank\">323899</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-January 2025 and expect to complete by late January 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out mid-February 2025 and expect to complete by late February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Optical character recognition (OCR) supports images embedded in Microsoft Office files or archive files in Exchange Online.\n</p><p>Images can be embedded in these Microsoft Office applications:\n</p><ul><li>Microsoft Word (.docx)\n</li><li>Microsoft PowerPoint (.pptx)\n</li><li>Microsoft Excel (.xlsx)\n</li></ul><p>Images can be embedded in .pdfs containing searchable text and images.\n</p><p>Images can be embedded in these container files and archive files:\n</p><ul><li>.rar\n</li><li>.tar\n</li><li>.xip\n</li><li>.7z\n</li></ul><p>After the policy matches, you will see the matches in Alerts, Activity explorer, email incident reports, and content explorer, just as you would for any other matched file.\n</p><p>This change will be available by default for admins to configure. There are no expected changes to the user experience.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. For existing customers using OCR for Exchange workload, by default embedded files will also be scanned by OCR and customers will be billed accordingly per usage. New customers not using OCR can <a href=\"https://learn.microsoft.com/purview/ocr-learn-about?view=o365-worldwide&amp;tabs=purview#configure-your-ocr-settings\" target=\"_blank\">turn on OCR</a> to start using OCR for standalone and embedded file types in Exchange.\n</p><p>Standalone images supported by OCR:\n</p><ul><li>.jpg\n</li><li>.png\n</li><li>.bmp\n</li><li>.tiff\n</li><li>.pdf (images only)\n</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/purview/ocr-learn-about?view=o365-worldwide&amp;tabs=purview\" target=\"_blank\">Learn about optical character recognition in Microsoft Purview | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "323899"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview | Information Protection's OCR capabilities will be enhanced to scan embedded images in files for sensitive content in Exchange Online, with a rollout starting mid-January 2025 for Public Preview and mid-February 2025 for General Availability. This update is associated with Microsoft 365 Roadmap ID 323899."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC966632",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-27T01:49:32.507Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-27T01:48:56Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Information Protection: Enhanced OCR support for embedded images for Microsoft Exchange Online",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
