{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 31, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>The AI and Copilot Resources Provider that powers the out-of-box (OOB) Microsoft Copilot Academy will be visible by default to users who have Copilot licenses. Admins will be able to enable, disable, and apply permissions to the content of this provider.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=412064\" target=\"_blank\">412064</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out in mid-February 2025 (previously mid-January) and expect to complete by late February 2025 (previously late January).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>If a tenant has at least one Copilot license, Knowledge admins or Knowledge managers will be able to view AI and Copilot Resources Provider by default under <i>Admin &gt; Manage provide</i>rs tab. They can delete and reconfigure as needed.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/9c0d960f-be24-4d9a-b449-47f631203bad\" style=\"width: 550px;\"></p><p>They can also apply permissions to the content of this provider through <i>Admin &gt;Manage permissions &gt; Provider </i>tab.&nbsp;</p><ul><li>By default, providers content is visible to Copilot licensed users.</li><li>On applying permissions, the content becomes visible to the selected group.\n</li><li>On removing permissions, the content returns to the default behavior.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/74444208-77dc-445c-a0b3-0d38250e6812\" style=\"width: 550px;\"></p><p></p><p>Users&nbsp;with Copilot licenses will also be able to search for AI and Copilot Resources content:</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/d8564b1c-c743-49f4-beb0-27f9438dd13c\" style=\"width: 550px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "412064"
    },
    {
      "Name": "Summary",
      "Value": "The AI and Copilot Resources Provider for Microsoft Copilot Academy will be visible by default to users with Copilot licenses starting mid-February 2025. Admins can manage permissions and content visibility. The rollout requires no admin action but updating documentation is advised. Microsoft 365 Roadmap ID 412064 details this update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-04-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC962529",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-31T20:10:48.293Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-20T22:46:39Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Learning: AI and Copilot Resources Provider visibility",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
