{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 23, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Purview: Insider Risk Management (IRM) data including alerts, indicators and events will be available in these Microsoft Defender XDR experiences:\n</p><ul><li>Unified alert queue: IRM alerts will appear in the unified alert and incident queue in Defender XDR for comprehensive investigation and correlation.\n</li><li>Advanced Hunting: IRM data will be available for advanced hunting in Defender XDR, allowing analysts to identify hidden risk patterns using KQL queries. Analytics can also create custom detections on the top of IRM data.\n</li><li>Graph API: IRM data will be accessible through the Microsoft Graph API, supporting bidirectional integrations with external applications.\n</li><li>Microsoft Sentinel: IRM alerts will be available in Microsoft Sentinel through the XDR-Sentinel connector, providing richer metadata.\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422730\" target=\"_blank\">422730</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-January 2025 and expect to complete by end of January 2025.\n</p><p>General Availability (WW, GCC, GCC High, DoD): We will begin rolling out late June 2025 (previously early May) and expect to complete by mid-July 2025 (previously mid-May).</p><p><b>How this will affect your organization:</b>\n</p><p>Enable this feature by turning on S<i>hare data with other security solutions</i> in the IRM global settings.\n</p><p>Only users with Insider risk analysis or investigation roles in the Microsoft Purview portal can access IRM data in Defender XDR.\n</p><p>To access alerts, incidents, and events from Defender XDR via API, you need to provision apps with the necessary permissions. IRM data is accessible via Microsoft Security Graph APIs, allowing for reading and updating alert or incident statuses. Permissions are set at the application level, without solution-specific scoping. Any existing apps pulling data from these APIs will also access IRM data. So, if you integrate XDR alerts into external ticketing systems, IRM alerts will show up, unless you specifically filter out the alerts.\n</p><p>IRM alerts will appear in Sentinel if your tenant has the Defender XDR connector enabled in Microsoft Sentinel.\n</p><p>In Defender XDR, IRM data is not pseudonymized to allow effective correlation of IRM alerts with alerts from other solutions within the platform, such as Defender for Endpoint and Defender for Cloud apps.\n</p><p>These changes will be available by default for admins to configure in IRM global settings.\n</p><p>Admins will be able to view Insider Risk Management alerts in Defender XDR:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/a7b53b37-df99-48fb-8497-5e9c87017b9a\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Harness the power of Advanced Hunting queries with two new tables that contain Insider Risk Management data: DataSecurityBehaviors and DataSecurityEvents. In this query, 54 confidential files were exfiltrated through mail.google.com by 2 unique users:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/419706ab-c7a4-4e0d-a176-d8c9a3b933b9\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><ul><li>Opt-in to data sharing settings in IRM global settings page.\n</li><li>Assign necessary permissions to analysts\n</li><li>Review existing apps accessing Defender XDR data through Graph APIs.\n</li><li>If your organization is using <a href=\"https://learn.microsoft.com/azure/sentinel/microsoft-365-defender-sentinel-integration?tabs=azure-portal\" target=\"_blank\">Microsoft Defender XDR connector</a>, please review the list of users who will gain access to this data through Sentinel.\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration in IRM global settings to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422730"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's Insider Risk Management (IRM) data will soon integrate with Microsoft Defender XDR, providing alerts, indicators, and events for comprehensive investigation and correlation. This includes a unified alert queue, advanced hunting, access via Microsoft Graph API, and availability in Microsoft Sentinel. Public Preview begins mid-January 2025, with General Availability in late June 2025. Admins need to enable data sharing and assign permissions to access this feature."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC961761",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-24T20:46:51.287Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-19T23:16:22Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: IRM alerts in Microsoft Defender XDR",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
