{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 23, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Teams: Users will be able to set their preference for how their cloud-hosted Microsoft Word, Microsoft Excel and Microsoft PowerPoint files should open when they select links for these files from Teams. The new setting (open in a browser, desktop app, or directly in Teams) will extend to links selected in other Microsoft365 apps, starting with classic Microsoft Outlook, Word, Excel, and PowerPoint, for greater consistency across apps.\n</p><p>This message applies to Teams for Windows desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=471000\" target=\"_blank\">471000</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early March 2025 (previously late February) and expect to complete by mid-March 2025 (previously early March).\n</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 (previously early March) and expect to complete by late March 2025 (previously mid-March).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, user can set the file open preference in Teams by following instructions in <a href=\"https://support.microsoft.com/topic/open-file-links-directly-in-microsoft-365-desktop-apps-from-teams-and-classic-outlook-7c1a08d0-54d0-499e-992e-2c41f70b59a1\" target=\"_blank\">Open file links directly in Microsoft 365 desktop apps from Teams and classic Outlook - Microsoft Support</a>. Users will be still able to set separate file open preferences for Teams only.\n</p><p>File open preference will apply to Word, Excel and PowerPoint links selected from Word, Excel, PowerPoint, Teams for Windows desktop, and classic Outlook.\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "471000"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"471000\":[{\"RoadmapId\":471000,\"Platform\":\"Desktop\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-01-24T22:12:46.6506791Z\",\"LatestRing\":null},{\"RoadmapId\":471000,\"Platform\":\"All\",\"Status\":\"FeatureRolloutStatusNotSupported\",\"LastUpdateTime\":\"2025-01-24T22:12:46.6506794Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow users to set preferences for opening Word, Excel, and PowerPoint files from Teams and other Microsoft 365 apps. This feature, starting with Teams for Windows desktop and classic Outlook, is expected to roll out between early March and late March 2025. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC967240",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-24T21:14:17.63Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-27T20:49:22Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: File open preferences will extend to more Microsoft 365 apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
