{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Purview Communication Compliance introduces the ability to identify and flag potential workplace safety concerns in user-reported messages in Microsoft Teams. Investigators now have an additional indication to decide what risk exists in user-reported messages and can configure an Inappropriate Content policy to proactively identify similar inappropriate content moving forward.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=422329\" target=\"_blank\">422329</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out mid-November 2024&nbsp;and expect to complete by late December 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Communication Compliance customers automatically have a user-reported message policy provisioned when they begin their Communication Compliance journey. After this rollout, user-reported content that triggers a Content Safety classifier will display the classifier name that flagged the message and a severity value in the <i>Severity </i>column:\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1qHu0?ver=f93c\" style=\"width: 400px;\" alt=\"admin controls\"></p><p>This feature will be on by default and cannot be turned off. The feature does not change the user-reported message experience. It will only show the following additional information: </p><ul><li>A new banner in the Policies page informing users about content safety classifiers evaluating on user-reported messages, which replaces the old user-reported messages banner.</li><li>A Severity column with a conditions banner if a user-reported message is flagged by a content safety classifier.</li></ul><p>For more information, see <a href=\"https://learn.microsoft.com/purview/communication-compliance-policies?tabs=purview-portal#microsoft-teams\" target=\"_blank\">Create and manage communication compliance policies</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p><p>Microsoft Purview Communication Compliance provides the tools to help organizations detect regulatory compliance violations (e.g. SEC or FINRA), such as sensitive or confidential information, harassing or threatening language, and sharing of adult content. Built with privacy by design, usernames are pseudonymized by default, role-based access controls are built in, investigators are opted in by an admin, and audit logs are in place to help ensure user-level privacy.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "422329"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Communication Compliance now flags potential workplace safety issues in user-reported Teams messages, displaying severity and classifier name. Rollout began mid-November 2024 and completes by late December 2024. This update is automatic and adds a severity column and content safety classifiers banner. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-03-07T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC969453",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-31T19:01:21.363Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-31T19:01:02Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Communication Compliance: Detect workplace safety concerns in user-reported Microsoft Teams messages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
