{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 6, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Outlook for iOS/Android: New built-in report buttons in version &gt; 4.2446. Admins can control the appearance and behavior of these buttons that allow users to report emails as phishing / junk / not junk from the User Reported setting page in the Microsoft 365 Defender portal (security.microsoft.com). Admins can also customize where messages get reported to (reporting mailbox, Microsoft, or both) and what the user sees both before and after reporting messages from these buttons.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=371383\" target=\"_blank\">371383</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High): We began rolling out in early December 2024 and expect to complete by late February 2025 (previously late January). </p><p><b>How this will affect your organization:</b></p><p>Information to keep in mind:\n</p><ul><li>Microsoft OWA (Outlook on the Web) and the new Microsoft Outlook for Windows have had this functionality since November 2022. This rollout to iOS/Android does not change or affect that functionality.\n</li><li>Classic Microsoft Outlook for Windows client has had this functionality in current channel since August 2024. Learn more: MC841229<i> (Updated) Classic Microsoft Outlook for Windows: New reporting buttons integrated with Microsoft Defender for Office 365</i> (published July 2024, updated October 2024).\n</li><li>Microsoft Outlook for Mac released this functionality in September 2024.\n</li><li>If you have turned off the reporting feature in the Microsoft 365 Defender <i>User reported </i>settings page or are using a third-party add-in, the report buttons in Outlook for Android/iOS won't be visible.\n</li><li>The Microsoft reporting add-in (the Microsoft report message add-in and Microsoft phishing add-in) will be supported till further notice. The future goal is to have a consistent button reporting experience across all Outlook platforms. If you are using Microsoft reporting add-ins in Outlook for iOS/Android, your users will see two reporting experiences: one from the built-in Outlook buttons (added by this rollout) and one from the add-in. Both options will behave the same for users (except for the newly customizable pop-ups) and the reported messages will end up in the same place, causing minimal disruption.\n</li><li>The selections you make on the user reported settings page will determine the reporting experience for your users (whether they choose the add-in or built-in reporting option in Outlook). Either option will report to the same place (Microsoft, custom mailbox, or both) based on your <i>User reported</i> settings.\n</li><li>Like OWA and new Outlook for Windows, the built-in reporting button in Outlook for iOS/Android supports reporting from shared and delegate mailboxes.</li></ul><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/22eb1216-2719-44ca-8ab5-e611d7cde37f\" style=\"width: 400px;\"></p><p><br></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/ebc62ca7-713b-4938-ae0e-dca993cb2e0f\" style=\"width: 400px;\"><br></p><p>This change is available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>No action is required form you after this rollout because your current settings in the <i>User reported</i> settings page will not be changed.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/defender-office-365/submissions-outlook-report-messages\" target=\"_blank\">Report phishing and suspicious emails in Outlook for admins - Microsoft Defender for Office 365 | Microsoft Learn</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/defender-office-365/submissions-user-reported-messages-custom-mailbox?view=o365-worldwide\" target=\"_blank\">User reported settings - Microsoft Defender for Office 365 | Microsoft Learn</a> (will be updated before rollout)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "371383"
    },
    {
      "Name": "Summary",
      "Value": "Outlook for iOS/Android is getting new reporting buttons, allowing users to report emails as phishing, junk, or not junk. Admins can customize these buttons and their behavior through the Microsoft 365 Defender portal. The rollout began in December 2024 and will complete by February 2025. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Android, iOS"
    }
  ],
  "EndDateTime": "2025-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC960818",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-06T21:13:11.247Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-19T00:49:32Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook for iOS/Android: New reporting buttons integrated with Microsoft Defender for Office 365",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
