{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams: Users can find and add Microsoft 365 Copilot agents to group chats and use the agents to help increase productivity in collaborative scenarios. Users do not require a Copilot license to use this feature. This message applies to Teams on Windows desktop, Mac desktop, and on the web.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=464988\" target=\"_blank\">464988</a>.\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out early February 2025 and expect to complete by mid-February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, your users can use agents to ask questions about and summarize information in their group conversations. To access the Copilot agents, users can go to the updated group chat participants roster and select <i>Add agents or bots:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/43ee5bd8-3655-40c0-bb41-cd4bf1e37f35\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The<i> Add agents or bots</i> option opens a contextual view of agents that users can add to the group chat. This view first displays previously installed agents that can be used in the group chat, followed by new agents that can be installed and used in the group chat. For additional agent offerings, users can select <i>Get more apps </i>in the bottom right:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c9bfab2b-af04-4e89-af43-bd32445255fe\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default. If you prefer to disable Copilot for your tenant, review these <a href=\"https://learn.microsoft.com/copilot/manage#removing-access-to-microsoft-\" target=\"_blank\">instructions</a> in Manage Copilot | Microsoft Learn.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "464988"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow users to add Microsoft 365 Copilot agents to group chats for increased productivity, without needing a Copilot license. The feature will roll out in early February 2025 and will be available on various desktop platforms and the web. It will be enabled by default but can be disabled if desired."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC966631",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-07T17:58:03.747Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-27T01:48:01Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Using Copilot agents in group chats",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
