{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to new Microsoft Outlook for Windows: Users will be able users will be able to move, copy, delete, flag/unflag, mark as read/unread, and set categories for email in an Outlook Data File (.pst or Personal Storage Table file). Also, users will be able to create, delete, move, and rename folders in .pst files. Future releases of new Outlook will expand the support for .pst file capabilities.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=473995\" target=\"_blank\">473995</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by late February 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out early March 2025 and expect to complete by late March 2025.\n</p><p>General Availability (GCC): We will begin rolling out late March 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b></p><p>Outlook Data File (.pst) support will be enabled by default in new Outlook for Windows. If you want to block or limit Outlook Data File support, set the OutlookDataFile mailbox policy. Learn more: <a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy?view=exchange-ps#-outlookdatafile\" target=\"_blank\">Set-OwaMailboxPolicy (ExchangePowerShell) | Microsoft Learn</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "473995"
    },
    {
      "Name": "Summary",
      "Value": "The new Outlook for Windows will soon support managing emails in PST files, including moving, copying, deleting, and categorizing. Rollouts begin mid-January 2025, with general availability in March 2025. PST support will be default, but can be managed with OutlookDataFile mailbox policy. No admin action is required before rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC966639",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-27T01:52:17.887Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-27T01:52:10Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Manage email in PST files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
