{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re updating Microsoft Secure Score improvement actions of Microsoft Defender for Identity to ensure a more accurate representation of security posture. With this rollout, we are adding two new Microsoft Defender for Identity posture recommendations regarding Entra Connect accounts that will be added as Microsoft Secure Score improvement actions:\n</p><ul><li>Remove unsafe permissions on Microsoft Entra Connect accounts\n</li><li>Replace Enterprise or Domain Admin Account for AD DS (Active Directory Domain services) Connector account\n</li></ul><p>Your score will be updated accordingly.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-January 2025 and expect to complete by late January 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-February 2025 and expect to complete by late February 2025.\n</p><p><b>Note:</b> To provide the recommendation as quickly as possible, we will introduce it to your environment at the earliest opportunity, rather than on the regular monthly schedule.\n</p><p><b>How this will affect your organization:</b>\n</p><p>These new security posture reports are related to Entra Connect server and will be available only if your tenant has a Defender for Identify sensor installed on the Entra Connect server. This update is available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Your score will be updated accordingly.\n</p><p>Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Microsoft recommends reviewing the improvement actions listed in Microsoft Secure Score. We will continue to add suggested security improvement actions on an ongoing basis.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Secure Score will update with new Microsoft Defender for Identity recommendations to better reflect security posture. Two new recommendations are being added for Entra Connect accounts, which will affect the Secure Score. Rollouts begin mid-January 2025 for Public Preview and mid-February 2025 for General Availability. No admin action is required for the update."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC966634",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-27T01:50:33.223Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-27T01:50:19Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Identity: New recommendations for Microsoft Secure Score",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
