{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 28, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for the Microsoft Viva Insights app: Leaders can explore organizational and behavioral data using Microsoft 365 Copilot in Viva Insights. After this rollout, leaders can ask questions about their organization in chat and explore new reports.\n</p><ul><li><b>New query capabilities:</b> Leaders and their delegates will be able to ask Copilot in Viva Insights questions about their organization’s composition, team collaboration, hybrid work patterns, geographic distributions, and more.\n</li><li><b>New Copilot in Viva Insights-driven reports:</b> Leaders and their delegates can also view reports on organizational composition information that include a list of employees and other uploaded attribute information like <i>Function, Manager,</i> and location information like <i>Country or City.\n</i></li><li><b>New Viva Insights app home page: </b>The home page will suggest queries that leaders can use in Copilot in Viva Insights. Previously existing leader reports and personal insights features will continue to be accessible through the <i>Organizational behavior reports</i> and <i>Personal insights</i> sections of the new home page.\n</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=415452\" target=\"_blank\">415452</a>.\n</p><p>A Viva Insights premium license is required to access most of the features described in this message. A Microsoft 365 Copilot license is not needed to access the features described in this message.\n</p><p>This message applies to Viva Insights on the web and in the Viva Insights app in Teams for Windows desktop, Teams for the web, and Teams for iOS/Android.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We began rolling out early December 2024 and expect to complete by late December 2024.\n</p><p>General Availability (Worldwide): We will begin rolling out late January 2025 (previously mid-January) and expect to complete by late February 2025 (previously late January).&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Leaders and delegates entering the Viva Insights app will experience an updated home page and new features in the Copilot in Viva Insights chat pane on the right of the screen:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/29dc1bd8-eb28-4adc-bc84-7c95932c2d1a\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Leaders and delegates will now be able to ask and visualize a richer set of organizational composition queries in Copilot in Viva Insights chat such as “how many employees do I have in the United States” or “how many new hires joined in the last 3 months?”\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/fddc06eb-3da4-41fc-a71b-9f6e9418e161\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be available by default.\n</p><p> <b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. Please make users in your organization aware of this upcoming change and direct them to Viva Insights documentation to learn more about how to use Copilot in Viva Insights.\n</p><p><b>Fresh data upload:</b> For this update to be valuable to leaders and their delegates, you must upload fresh and complete data once a month. If minimal data is provided, Copilot in Viva Insights will not be able to answer questions completely or accurately. Please refer to Viva Insights documentation for more information about what attributes to upload and how. Before rollout, we will update this post with new and revised documentation.\n</p><p><b>Data availability</b>: Uploaded data will be available to leaders and their delegates, so don’t upload sensitive Human Resources (HR) attributes that you would not want to be accessible to leaders and delegates. Questions regarding HR data will be answered based on all users who have a Viva Insights license. </p><p><b>Review general manager and delegate roles:</b> This update will be rolled out to anyone with a general manager (GM) role who meets minimum team size, or anyone who has delegate access from a leader. If you do not want a user to have access to Copilot in Viva Insights, you can remove their GM role. If you do not want a delegate to have access, you can <a href=\"https://github.com/MicrosoftDocs/office-docs-powershell/blob/Viva-chrisda/exchange/exchange-ps/exchange/Remove-VivaOrgInsightsDelegatedRole.md\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">remove their delegate access with a Microsoft PowerShell script</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "415452"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Insights will soon integrate Microsoft 365 Copilot, enabling leaders to analyze organizational data and generate reports. New features include query capabilities and Copilot-driven reports. The update requires a Viva Insights premium license and will be available on various Teams platforms, with a Public Preview in December 2024 and General Availability in January 2025. No additional Copilot license is needed."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Web"
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC960821",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-28T21:02:47.487Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-19T00:50:42Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva: Leaders can use Microsoft 365 Copilot in Viva Insights",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
