{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Search in Bing, the work search experience available on Bing.com, will be deprecated, such that the last day of availability is on March 31, 2025. This change is being made as we streamline search experiences and focus on enhancing core productivity tools.\n</p><p>The Microsoft Edge for Business address bar and the Windows search box will continue to support work search with some adjustments, which are detailed below.</p><p>Microsoft Search in Bing will no longer be available, with changes as follows:</p><ul><li>Bing.com will no longer show work search results. Consequently, there will not be a dedicated page of work results and users’ work profile will no longer appear on Bing.com\n</li><li>Search boxes you’ve configured to point to Microsoft Search in Bing will no longer provide work results.\n</li></ul><p>Edge for Business address bar and Windows search box will continue to support work search with some adjustments, including:\n</p><ul><li>Edge for Business address bar will no longer return work search results on a Bing.com page but will continue to provide suggested results within the address bar. Work search for documents will be available initially, with additional content types available as quickly as possible.\n</li><li>Windows search box will see the removal of organization branding and the “work” tab but will continue to support work search. Search for documents will be available initially, with additional content types available as quickly as possible. With these changes, users will see some UX changes in the Windows search box.\n</li></ul><p>As before, the core Microsoft Search experience remains accessible through Office.com, SharePoint Online, and Microsoft365.com.\n</p><p>An FAQ and further details will be available mid-January at https://aka.ms/MSBFAQ, which will be updated regularly.\n</p><p><b>When the Change Will Occur:</b></p><p>The last day of availability of Microsoft Search in Bing is March 31, 2025.</p><p><b>How this will affect your organization</b></p><p>For organizations using Microsoft Search in Bing, users will need to transition to using Microsoft Search through Office.com, SharePoint Online, or Microsoft365.com for work search. \n</p><p>Users who are accustomed to using the Edge for Business address bar and the Windows search box can continue to conduct work searches through these endpoints, with the expectation that there will be some adjustment in these experiences after the deprecation date. (For details on changes, please refer to the FAQ link above, which will be available mid-January 2025.)\n</p><p>There may be earlier impact to a small set of users prior to March 31, 2025, where they temporarily cannot use work search in Bing.com, embedded search boxes pointing to Microsoft Search in Bing, the Edge for Business address bar, or Windows search box, as we begin testing the deprecation experience. In all cases, Microsoft Search remains accessible through Office.com, SharePoint Online, and Microsoft365.com.\n</p><p><b>What you need to do to prepare:</b></p><p>Customers should prepare to stop using Microsoft Search in Bing by March 31, 2025, and transition to using Microsoft Search through Office.com, SharePoint Online, or Microsoft365.com. It is recommended to inform users about the upcoming change and the alternatives available.\n</p><p>Adding your preferred entry point from this set to favorites or favorites bar in Edge for Business may be a helpful alternative pathway. Admins can easily set favorites in Edge for Business for their organization, please see <a href=\"https://learn.microsoft.com/deployedge/edge-learnmore-provision-favorites\" target=\"_blank\">details here</a>.&nbsp;</p><p>Additionally, users can continue to use the Edge for Business address bar and the Windows search box, with some changes expected.\n</p><p>For admins who wish to set their own deprecation date prior to March 31, 2025, you can turn off Microsoft Search in Bing by going to the Microsoft 365 admin center &gt; Settings &gt; Search &amp; Intelligence.\n</p><p>When the FAQ becomes available, customers will be notified through an update of this Message center post.\n</p><p>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Search in Bing will be deprecated on March 31, 2025. Users should transition to Microsoft Search via Office.com, SharePoint Online, or Microsoft365.com. Edge for Business and Windows search box will continue to support work search with some changes. An FAQ will be available mid-January at a provided link."
    }
  ],
  "EndDateTime": "2025-12-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC961557",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-12-19T19:41:53.213Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-19T19:41:29Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Search in Bing Deprecation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
