{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 10, 2025: There are additional details available regarding the Microsoft Search in Bing retirement.</p><ul><li>Some Microsoft Search answers will no longer be available after March 31, 2025, including Q&amp;As and location answers. Recommended bookmarks will also be retired; you can keep them by manually publishing or exporting them by April 30, 2025.  Please see the FAQ for more information.\n</li><li>Work or school search history on Bing.com will be available through March 31, 2025. Individuals who wish to keep their recent search history must download it by March 31 by signing in with their Entra ID, going to Options on Bing.com, and selecting “Search history.” There is no control available for IT admins to download search terms on behalf of users.\n</li><li>To help users on Bing.com, a banner to redirect to M365.cloud.microsoft will be shown in Edge if search terms are high likelihood of being work-related. For more details, please see the FAQ available at <a href=\"https://aka.ms/MSBFAQ\" target=\"_blank\">Guidance for retiring Microsoft Search in Bing for your organization</a>.\n</li><li>Note: Microsoft Edge version 134.0.3124.51+ is required for the work search functionality described below.\n</li></ul><p><br></p><p>Microsoft Search in Bing, the search experience for work and school available on Bing.com, is being deprecated. The last day of its availability is on March 31, 2025. This change is being made as we streamline search experiences and focus on enhancing core productivity tools.\n</p><p>The Microsoft Edge for Business address bar and the Windows search box will continue to support work and school search, with some adjustments detailed below. \n</p><p>Details of the Change\n</p><p>After March 31, 2025, Microsoft Search in Bing will no longer be available, with changes as follows:\n</p><ul><li>Bing.com will no longer show work or school search results. Consequently, there will not be a dedicated page of work or school results and users’ work or school profiles will no longer appear on Bing.com. However, selecting the Work or School tab on Bing.com will redirect users to the new Microsoft Search experience on M365.cloud.microsoft (formerly Office.com and Microsoft365.com).\n</li><li>Search boxes you’ve configured to point to Microsoft Search in Bing will no longer provide work or school results.\n</li><li>The Edge for Business address bar and Windows search box will continue to support work and school search with some adjustments, including:\n<ul><li>The Edge for Business address bar will no longer return work or school search results on a Bing.com page but will continue to provide suggested results in the address bar. In addition, the address bar will send users to work and school results on M365.cloud.microsoft rather than Bing.com. Users of the address bar can continue to find work-related documents, bookmarks, and people in suggested results—clicking on these suggestions takes users to work or school results on M365.cloud.microsoft. Users can also type \"work\" in the address bar, hit the tab key, then input their work- or school-related query to get results on a M365.cloud.microsoft page. Work and school search results will include documents, people, and bookmarks. Work search for documents will be available initially, with additional content types available as quickly as possible.\n</li><li>The Windows search box will no longer display organization branding nor the “Work” or “School” tab but will continue to support work and school search. Search for documents and people remains available. will be available initially, with additional content types available as quickly as possible. With these changes, users will see some UX changes in the Windows search box.\n</li></ul></li></ul><p>As before, the core Microsoft Search experience remains accessible through M365.cloud.microsoft (formerly Office.com and Microsoft365.com) and SharePoint Online.\n</p><ul><li>Additionally, Entra ID sign-in will no longer be available on Bing.com, since work and school search is no longer available on Bing.com.\n</li></ul><p>An FAQ and further details are now available at <a href=\"https://aka.ms/MSBFAQ\" target=\"_blank\">Guidance for retiring Microsoft Search in Bing for your organization</a>, which will be updated regularly.\n</p><p><b>When will this happen:</b></p><p>The last day of availability of Microsoft Search in Bing is March 31, 2025.\n</p><p><b>How this affects your organization:</b></p><p>For organizations using Microsoft Search in Bing, users will need to transition to using Microsoft Search through M365.cloud.microsoft (formerly Office.com and Microsoft365.com) and SharePoint Online. \n</p><p>Users who are accustomed to using the Edge for Business address bar and the Windows search box can continue to conduct work searches through these endpoints entry points, with the expectation that there will be some adjustment in these experiences after the deprecation date. (For details on changes, please refer to the FAQ: https://aka.ms/MSBFAQ.)\n</p><p>Users who click on suggestions in the Edge for Business address bar or Windows search box may be redirected to Microsoft365.com before March 31, 2025. Also, as we begin testing the retirement experience, a small set of users may find before March 31 that Bing is intermittently unavailable as an entry point for work search. We recommend that you proactively inform your users of the change and direct them to M365.cloud.microsoft (formerly Office.com and Microsoft365.com) and SharePoint Online. Adding M365.cloud.microsoft to their favorites or to the favorites bar in Edge for Business may be a helpful alternative pathway. \n</p><p><b>What you can do to prepare:</b></p><p>Customers should prepare to stop using Microsoft Search in Bing by March 31, 2025, and transition to using Microsoft Search through M365.cloud.microsoft (formerly Office.com and Microsoft365.com) and SharePoint Online. We recommend that you inform users about the upcoming change and the alternatives available. \n</p><p>Adding your preferred entry point from this set to favorites or favorites bar in Edge may be a helpful alternative pathway. Admins can easily set favorites in Edge for their organization, please see details here. \n</p><p>Additionally, users can continue to use the Edge for Business address bar and the Windows search box, with some changes expected. Please educate users that they should now type \"work\" in the address bar, hit the tab key, then type in their work-related query to get work results on a M365.cloud.microsoft page.\n</p><p>If your organization is using the <code>AddressBarMicrosoftSearchInBingProviderEnabled</code> policy today, you should update to the <code>AddressBarWorkSearchResultsEnabled</code> policy, if the policy is still needed.   \n</p><p>The new policy, <code>AddressBarWorkSearchResultsEnabled</code>, will be available starting in early March, with Edge for Business version 134 (ahead of the Microsoft Search in Bing deprecation). This allows admins to configure the display of work suggestions in the address bar. If the policy is enabled or not configured, users who are signed into Edge for Business with their Entra ID can view internal work-related suggestions, such as bookmarks, files, and people results powered by Microsoft 365, in the Edge for Business address bar suggestion dropdown. If the policy is disabled, Entra ID signed-in users will not see internal workplace results in the Microsoft Edge address bar suggestion dropdown. \n</p><p>Admins who wish to set their own deprecation date prior to March 31, 2025, can turn off Microsoft Search in Bing by going to the Microsoft 365 admin center &gt; Settings &gt; Search &amp; Intelligence.\n</p><p>Regarding SafeSearch settings: \n</p><ul><li>If you had set the search experience for your organization to “School search,” SafeSearch was set to Strict by default. If you’d like to ensure that your users continue to have SafeSearch set to Strict after the Microsoft Search in Bing retirement, you can map www.bing.com to strict.bing.com at a network level. See <a href=\"https://support.microsoft.com/topic/blocking-adult-content-with-safesearch-or-blocking-chat-946059ed-992b-46a0-944a-28e8fb8f1814\" target=\"_blank\">Blocking adult content with SafeSearch or blocking Chat</a> for more details.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Search in Bing will be deprecated on March 31, 2025. Users should transition to Microsoft Search via Office.com, SharePoint Online, or Microsoft365.com. Edge for Business and Windows search box will continue to support work search with some changes. An FAQ will be available mid-January at a provided link."
    }
  ],
  "EndDateTime": "2025-12-19T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC961557",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-10T19:20:25.813Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-19T19:41:29Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Search in Bing Deprecation",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
