{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Authors can utilize drag and drop functionality to place content from the content pane onto their pages. The content pane serves as a convenient hub for various panes that support authoring in crafting their publications. There are new updates to the drag and drop experience on the SharePoint canvas. This update also applies to the Amplify canvas.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out mid-January 2025 and expect to complete by mid-February 2025.</p><p>General Availability (Production, GCC, GCC High, DOD): We will begin rolling out mid-February 2025 and expect to complete by late February 2025.</p><p><b>How this will affect your organization:</b></p><p>Users may now see bigger drop hints when moving web parts on the canvas. Drop hints will appear as square/rectangle when space allows or lines when space does not allow.</p><p>Cursor icons have been updated to reflect drag and drop actions. The cursor will change to an open and closed hand when using drag and drop to move web parts.&nbsp;</p><p>Users can now drop a web part on the plus button between sections to add a new one-column section to the page with the dropped web part.&nbsp;</p><p>Users can replace images that exist on the canvas by dropping an image from the content pane toolbox on top of the pre-existing image.&nbsp;</p><p>Default stock images on the content pane toolbox will update based on the SharePoint page title.&nbsp;</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1s5u0?ver=d930\" style=\"width: 400px;\"><br></p><p><b>What you need to do to prepare:</b></p><p>You might want to notify users, update your user training, and prepare your help desk.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "SharePoint and Amplify canvas have new drag and drop updates, including bigger drop hints, updated cursor icons, and the ability to add new sections or replace images easily. Rollout begins mid-January 2025, with general availability in February. Organizations should prepare users and help desks for these changes."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC962525",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-20T22:44:46.14Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-20T22:44:37Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "SharePoint Drag and Drop Experience Updates",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
