{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft is making it easier for Administrators to deploy new Outlook for organizations that are ready for it.&nbsp;</p><p>New installations of Microsoft 365 desktop client apps on Windows devices will include new Outlook in addition to classic Outlook. There is no change to existing installations.</p><p><b>When this will happen:</b></p><p>General availability (Worldwide): We will begin rolling out this change in late February 2025 and expect to complete by early March 2025.</p><p>\n</p><p><b>What you need to do to prepare:</b></p><p>Administrators can configure new Microsoft 365 deployments to control which apps are included before using custom configs to do installations. Classic Outlook and new Outlook are turned on in the new default configuration, and new Outlook will be added as \"on\" for existing configurations unless administrators edit to exclude it. In case new Outlook is not needed yet, administrators need to specifically edit their configurations to exclude the new Outlook app in the configuration before new installations.&nbsp;</p><p>If administrators have blocked the \"try the new Outlook\" toggle in classic Outlook, that policy will not be affected by these configuration changes or installs of new Outlook. If users install new Outlook alongside classic, they will see new Outlook in the apps list in the Start menu and can use it side by side the classic app if desired.\n</p><p>In case new Outlook was installed and is not needed later, Administrators can continue to remove new Outlook at any time after it has been installed:&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/control-install\" target=\"_blank\">Control the installation and use of new Outlook</a>.</p><p>More details are available in the updated associated documentation here: <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/get-started/deployment-new-outlook\" target=\"_blank\">Deployment overview for new Outlook for Windows</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 desktop client apps' new deployments will now include new Outlook. Rollout starts late February 2025, with completion by early March 2025. Administrators can configure deployments to include/exclude new Outlook, which will be on by default. Existing \"try new Outlook\" policies remain unaffected. Further details are in the updated documentation."
    }
  ],
  "EndDateTime": "2025-08-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC961774",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-12-19T23:29:25.327Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-19T23:27:49Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "New deployments of Microsoft 365 desktop client apps to include new Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
