{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 24, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Administrators and security operators who are using third-party report message solutions in Microsoft Outlook to allow their users to report suspicious messages (for example, Knowbe4, Hoxhunt, Cofense, Proofpoint add-ins, and so on) can now configure Defender for Office 365 to automatically send these messages to Microsoft for analysis.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=406167\" target=\"_blank\">406167</a>.</p><p><b>When this will happen:</b></p><p>General Availability: We will begin rolling out late February 2025 (previously mid-May) and expect to complete by early March 2025 (previously late May).</p><p><b>How this will affect your organization:</b></p><p>You must configure this setting if you want the benefit of sending third-party reported messages to Microsoft. </p><p>To enable this setting:</p><ol><li>Go to&nbsp;<a href=\"https://security.microsoft.com/securitysettings/userSubmission\" target=\"_blank\">User reported settings</a> in the Microsoft Defender portal, select <i style=\"\">Monitor reported messages in Outlook</i>, and then select <i style=\"\">Use a non-Microsoft add-in button</i>. </li><li>In the <i style=\"\">Reported message destination</i> section, select <i style=\"\">Microsoft and my reporting mailbox</i>, and then provide the email address of the internal Exchange Online mailbox where user-reported messages by the third-party add-ins are being routed to. If the third-party vendor<a href=\"https://learn.microsoft.com/defender-office-365/submissions-user-reported-messages-custom-mailbox?#message-submission-format-for-third-party-reporting-tools\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\"> follows the guidance</a> for message submissions format, Defender for Office 365 will submit these messages automatically to Microsoft for analysis.</li><li>&nbsp;The <a href=\"https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/how-your-submissions-to-defender-for-office-365-are-processed-behind-the-scenes/4231551\" target=\"_blank\">result from Microsoft</a> after analysis is shown on the <a href=\"https://sip.security.microsoft.com/reportsubmission?viewid=user\" target=\"_blank\">User reported page</a> in the Defender portal.</li></ol><p>For more details about how Microsoft handles user-reported suspicious messages, see <a href=\"https://learn.microsoft.com/defender-office-365/submissions-report-messages-files-to-microsoft#report-suspicious-email-messages-to-microsoft\" target=\"_blank\">Report suspicious email messages to Microsoft</a>.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f38e8741-bf50-480f-8a71-ad1a63048ac1\" style=\"width: 750px;\"><br></p><p><a href=\"https://learn.microsoft.com/purview/alert-policies#default-alert-policies\" target=\"_blank\">Alerts </a>are automatically generated for user reported messages in Defender for Office 365. If you have Defender for Office 365 Plan 2, <a href=\"https://learn.microsoft.com/defender-office-365/air-about\" target=\"_blank\">Automated investigation and response (AIR)</a> is also automatically triggered for user reported phishing messages. Both alerts and their investigations are automatically correlated to Defender XDR Incidents, which helps SOC teams with automation to triage, investigate, and respond. Submitting these messages to Microsoft for analysis provides a response of this analysis to security analysts and also helps improve Defender for Office 365 filters.</p><p><b>What you need to do to prepare:</b>\n</p><p>If your user reporting settings are already set to <i style=\"\">Use a non-Microsoft add-in button</i> and <i>Microsoft and my reporting mailbox</i>, you don't need to do anything to benefit from this change. However, if the destination is <i>My reporting mailbox only</i>, you need to change the destination to <i style=\"\">Microsoft and my reporting mailbox</i> to benefit from this change.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "406167"
    },
    {
      "Name": "Summary",
      "Value": "Administrators can now configure Microsoft Defender for Office 365 to automatically send third-party reported messages to Microsoft for analysis. The rollout starts late February 2025 and ends early March 2025. Configuration involves updating user reporting settings in the Defender portal. No action is needed if settings are already correctly configured."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-14T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC962528",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-24T18:22:18.763Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-12-20T22:46:03Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office 365: Third-party add-in user report can be sent to Microsoft for analysis",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
