{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 3, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>Coming soon to Microsoft Teams: Add a Loop workspace tab to standard channels enabling your team to brainstorm, co-create, collect, and organize content—together in real time. Everyone in the Team will have access to the Loop workspace, even as Team membership changes, and the workspace will adhere to the governance, lifecycle, and compliance standards set by the Microsoft 365 group backing the team. This message applies to Teams on Windows desktop, Teams on Mac desktop, and Teams on the web.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=472022\" target=\"_blank\">472022</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late March 2025 (previously late February) and expect to complete in early April 2025 (previously early March).</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 (previously early March) and expect to complete in late April 2025 (previously late March).</p><p> <b>How this will affect your organization:</b>\n</p><p>After this rollout, all users with the Loop app enabled on Teams will receive this experience by default.\n</p><p>To get started, users can select the plus sign (+) at the top of the Teams channel and select <i>Loop </i>from the list.\n</p><p>With this rollout, we will support these features:\n</p><ul><li>Creating a new workspace for a standard Teams channel where the workspace membership is the Channel group membership.\n</li><li>Adding pages, files, and links to the workspace, collaborating with others, and sharing pages as components in Teams chats and channels. Users will be able to complete all their Loop workspace workflows in Teams.\n</li><li>Recreating the Loop workspace tab in the channel, in case someone removes it by mistake.\n</li><li>Deleting the Team will delete the attached Loop workspace. The workspace will be restored if the Microsoft 365 group is restored.\n</li><li>If the user adding the Loop app to a channel does not have the appropriate license or permission to create a workspace, the user will be blocked from adding the app.\n</li><li>The Loop workspace created in a Teams channel will automatically receive the sensitivity label of the Microsoft 365 group at creation time. With this rollout, when the label of a Microsoft 365 group changes after workspace creation, the label will not be automatically propagated to the workspace's Microsoft SharePoint Embedded (SPE) container. Admins can update labels for these workspaces in the SharePoint admin center.\n<ul><li>Coming soon in late February: When the label of the Microsoft 365 group changes, that update will automatically propagate to the SPE container for the workspace within 24 hours. We will update this message when this feature is available.\n</li></ul></li></ul><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/cb32aeed-694d-4171-a018-ff6cd5d48c93\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>If you want to block the Loop app in Teams, this will remove the Loop tab applications in channels and the Loop personal app in Teams. To learn more: <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-workspaces-storage-permission?view=o365-worldwide\" target=\"_blank\">Overview of Loop workspaces storage and permissions | Microsoft Learn</a>\n</p><p>If you want to keep the Loop application in Teams but disable to ability for users to create Loop workspaces, follow these instructions:</p><ol><li>Sign in to the Microsoft 365 Apps admin center at <a href=\"https://config.office.com/\" target=\"_blank\">https://config.office.com/ </a>with your Microsoft 365 admin credentials.\n</li><li>Select <i>Customization </i>from the left pane.\n</li><li>Select <i>Policy management.\n</i></li><li>Create a new policy configuration or edit an existing one.\n</li><li>From the <i>Choose the scope</i> dropdown menu, choose either <i>All users</i> or select the group for which you want to apply the policy. Learn more: <a href=\"https://learn.microsoft.com/microsoft-365/loop/loop-components-configuration?view=o365-worldwide#microsoft-365-groups-for-cloud-policy\" target=\"_blank\">Microsoft 365 Groups for Cloud Policy</a> in Manage Loop components in your organization | Microsoft Learn.\n</li><li>In <i>Configure settings,</i> choose your desired setting for <i>Create Loop workspaces in Loop:</i>\n<ul><li><i>Disabled</i>: Users cannot create Loop workspaces in Teams. (When disabled, the Loop app will open Loop components in Teams.)\n</li><li><i>Enabled or not configured: </i>Users can create Loop workspaces in Teams.\n</li><li>Not configured = Enabled\n</li></ul></li><li>Save the policy configuration.\n</li><li>Reassign priority for any security group, if required. (If two or more policy configurations are applicable to the same set of users, the one with the higher priority is applied.)\n</li></ol><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/manage-apps\" target=\"_blank\">Manage your apps in the Microsoft Teams admin center - Microsoft Teams | Microsoft Learn</a></li><li>Related message center post: MC929022 <i>Microsoft Loop – Require Existing Microsoft 365 Group for New Loop workspaces</i> (published November 2024)</li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "472022"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon allow adding a Loop workspace tab to standard channels for real-time collaboration. Rollout starts late March 2025 and completes late April 2025. Users can create, manage, and share content within Teams. Admins should review configurations and notify users. For more details, visit the provided Microsoft Learn links."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC973493",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-04T16:25:58.463Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-07T00:13:23Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Add a Loop workspace tab to standard channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
