{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 15, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are rolling out the Verified Answers feature in Microsoft Viva Engage. This new functionality empowers community experts and admins to mark answers on questions as \"Verified\" to provide a reliable indicator of credible and trustworthy information.&nbsp;</p><p>Only assigned community experts and community administrators have the ability to mark an answer as \"Verified.\" This ensures that the verification comes from users with recognized expertise and authority within the community.&nbsp;</p><p>Key Benefits of Verified Answers:&nbsp;</p><ul><li>Enhanced credibility: With Verified Answers, users can confidently rely on the accuracy of responses, knowing that they have been reviewed and endorsed by designated experts.&nbsp;</li><li>Streamlined knowledge sharing: Verified Answers are highlighted and pinned at the top of discussion threads, making it easier for everyone in the community to access key information quickly.&nbsp;</li><li>Robust community engagement: This feature not only recognizes the expertise within your community but also fosters a culture of trust and thorough knowledge exchange.&nbsp;</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=408165\" target=\"_blank\">408165</a>.</p><p><b>When this will happen:</b></p><p>Preview: We will begin rolling out late January 2025 (previously early January) and expect to complete by early February 2025.</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 and expect to complete in early March 2025.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>The Verified Answers feature is a seeded feature, which means it is available to all users of Viva Engage.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "408165"
    },
    {
      "Name": "Summary",
      "Value": "The message details the rollout of the Verified Answers feature in Microsoft Viva Engage, allowing community experts and admins to mark answers as \"Verified.\" The rollout timeline has been updated, with the preview phase starting late January 2025 and general availability beginning in early February 2025. No admin action is required for this automatic rollout."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC976828",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-15T19:54:58.283Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-11T00:30:16Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Viva Engage: Verified Answers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
