{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 16, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft SharePoint: A new <i>Accessibility assistant</i> tool to help content creators meet accessibility standards when authoring SharePoint Pages. This tool provides checks and brief guidance to help ensure pages are inclusive and accessible to a broad audience. This rollout reflects our ongoing commitment to fostering accessibility and inclusivity in SharePoint.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470603\" target=\"_blank\">470603</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late January 2025 and expect to complete by late January 2025 (previously early February).\n</p><p>General Availability (Worldwide, GCC, GCC High and DoD): We will begin rolling out early February 2025 (previously mid-February) and expect to complete by mid-February 2025 (previously early March).\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, authors can initiate an accessibility test while editing a page. Authors can select the <i>Accessibility assistant</i> icon from the right vertical toolbar. The <i>Accessibility assistant</i> will support five web parts: Banner, Text, Image, Hero, and Quick Links.\n</p><p>The <i>Accessibility assistant</i> identifies accessibility issues:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2d0c2af7-8af8-4cfb-b3e9-c9754e4c3b03\" style=\"width: 372.997px;\" alt=\"user controls\">\n</p><p>The <i>Accessibility assistant</i> guides authors to address accessibility issues in the specific web part:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/3991827c-e987-4f6a-8480-8b44f5e2c06f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The <i>Accessibility assistan</i>t confirms the author has addressed all accessibility issues:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1638eaf7-bfd8-4a4a-962f-b9481c09b6e6\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Before rollout, we will update this post with revised documentation.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470603"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint is introducing an 'Accessibility assistant' tool for creating accessible pages, with a rollout starting late January and completing by mid-February 2025. This tool will help authors identify and fix accessibility issues in five web parts. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC976819",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-16T15:30:42.443Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-11T00:19:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: New Accessibility assistant tool for authoring Pages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
