{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: We are updating our default policy settings for transcription for new tenants. Before this rollout, the setting was <i>off</i> by default. After this rollout, the setting will be <i>on</i> by default. This change applies to new global policies created for new tenants. Existing policies in the Teams admin center will not be changed; however, tenants that have not customized any part of their Teams meeting policy will be impacted.\n</p><ul><li>Tenants without customized policies: The new default settings will apply, and these tenants will be impacted by this change.\n</li><li>Tenants with customized policies: Policies for user-level assignments or group-level assignments will remain unchanged and unaffected.\n</li></ul><p>This change is designed to streamline the adoption of transcription and enhance the use of all AI features. This change will align transcription with the default policy for recording, which is also enabled by default in Teams admin center. This message applies to Teams for Windows desktop and Teams for Mac desktop.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=468282\" target=\"_blank\">468282</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 and expect to complete by mid-February 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, transcription services will be more accessible to users, allowing them to turn on and use transcription as needed during meetings. Transcription will not be automatically activated for every meeting.\n</p><p>For new tenants, transcription will be enabled by default when admins set up their global policies. New tenants will automatically have the transcription policy turned on when they start. Existing tenants without a global policy will also have the policy turned on by default.\n</p><p>Transcription policy on by default in Teams admin center. Admins can turn off the policy if needed:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/825d5c65-c747-42e8-8413-3b3426aa3b98\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "468282"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating its default policy settings for transcription, which will be enabled by default for new tenants starting early February 2025. Existing tenants without customized policies will also be affected. This change aims to streamline transcription adoption and align with recording policies. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-04-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC973519",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-07T00:25:56.763Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-07T00:25:12Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Enable transcription policy by default",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
