{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 5, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Viva Engage: Users will have a new way to engage with the Viva Engage app in Microsoft Teams through new notifications in the Teams Activity feed. This message applies to Teams for the web, Teams for Windows desktop, Teams for Mac desktop, and Teams for iOS/Android.\n</p><p>Updated February 5, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>After this rollout, users with the Engage app installed can be notified in Teams for replies and reactions to their community posts. This new feature helps large organizations stay connected and informed of news, updates, and safety while in Microsoft Teams.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=474126\" target=\"_blank\">474126</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 and expect to complete by late February 2025 (previously late January).\n</p><p><b>How this will affect your organization:</b>\n</p><p>This feature will be available by default and the notifications will be on by default.\n</p><p>After this rollout, users can change notification settings in Teams for desktop or the web: Go to <i>Activity</i> on the left side of Teams, select the gear icon, and change settings in the Viva Engage section. In Teams for iOS/Android, users can turn notifications on or off for all apps from the notifications settings page.&nbsp;</p><p>\nUser documentation:&nbsp;<a href=\"https://support.microsoft.com/office/manage-notifications-in-microsoft-teams-1cc31834-5fe5-412b-8edb-43fecc78413d\" target=\"_blank\">Manage notifications in Microsoft Teams - Microsoft Support</a></p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout.\n</p><p>Share this news with users at your organization and consider <a href=\"https://learn.microsoft.com/microsoftteams/teams-app-setup-policies#pin-apps\" target=\"_blank\">pinning Engage next to Chats and Team</a>s. Ensure your corporate communications team is aware of this additional channel of reaching users across the organization.\n</p><p>You may want to update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "474126"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage will introduce new reply and reaction notifications in Microsoft Teams, starting mid-January 2025. This feature will be on by default and users can adjust settings in Teams. No admin action is required, but sharing this update and adjusting documentation is advised. The feature is associated with Microsoft 365 Roadmap ID 474126."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC978923",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-05T21:04:40.07Z",
  "Services": [
    "Microsoft Teams",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-14T00:16:52Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: New reply and reaction notifications in Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
