{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 13, 2025: We have updated the content. Thank you for your patience</p><p>Coming soon for Microsoft Teams: We have enhanced the privacy and security of voicemail system greetings for calls.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Available since November 2024.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, if a call recipient does not answer, the caller will be forwarded to the recipient's voicemail. The&nbsp; system greeting will inform the caller that the user is unavailable and prompt the caller to leave a message after the tone. Also, the recipient's real name will only be announced for internal calls. For external calls, the recipient's name will be replaced with \"the person.\"\n</p><p>Before this rollout, the recipient’s real name was announced to all callers.\n</p><p><b>Note:</b>&nbsp;a) Change applies to the system greeting only and custom greetings are not affected by the change. </p><p>b) This change also applies to Microsoft Skype for Business.</p><p>This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No admin action required after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams has updated voicemail greetings to enhance privacy, now omitting the recipient's real name for external calls. This feature has been available since November 2024 and requires no admin action post-rollout, but users should be informed of the change."
    }
  ],
  "EndDateTime": "2025-03-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC974356",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-13T16:52:44.72Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-08T00:21:38Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Enhanced confidentiality in voicemail greetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
