{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 24, 2025: We have updated the content. Thank you for your patience.</p><p>We are renaming the Viva Connections app to Connections. This change is intended to ensure the app name fits better within Microsoft Teams, preventing it from being truncated.</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late January 2025 (previously mid-January) and expect to complete by late February 2025 (previously mid-February).</p><p><b>How this will affect your organization:</b></p><p>If you have already customized the Viva Connections app name in the Microsoft Teams app store, your customizations will remain unchanged.</p><p>This update is available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Viva Connections app will be renamed to Connections to fit better in Microsoft Teams. The rollout starts late January 2025 and ends by late February 2025. Customizations remain if already made. No admin action is required, but users should be informed."
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC979826",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-24T20:51:49.08Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-15T01:13:05Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Connections: Update to app name",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
