{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 9, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon to the Microsoft Viva Engage adoption community for Microsoft 365 Copilot, users will receive recommendations of similar questions and answers when composing a question, leveraging the collective knowledge of the Copilot topic across all of Engage to help them find what they're looking for faster. Additionally, admins will have the ability to remove adoption features from the existing community and apply them to a new or different community.</p><p>Since general availability in August 2024 (referenced in MC784156), network admins and corporate communicators can enable a new type of community specifically built to facilitate the rollout and adoption of Copilot in their organizations. This community can bring employees together in a community of practice where employees can ask questions, seek support from both their peers and IT admins, share best practices, and learn more from articles and quick tips on how best to use Copilot.</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 (previously early January) and expect to complete by mid-February 2025 (previously early February).&nbsp;</p><p><b>How this will affect your organization:</b></p><p>When composing a question in the Copilot adoption community, users will soon have access to a new feature that provides a list of recommended similar questions<b> </b>that have been asked and answered across all of Viva Engage. Users will soon be able to quickly navigate to existing answers, contribute to recommended questions, or post a new question, leveraging the collective knowledge across their network to find information faster and more efficiently.</p><p>Admins who want to remove adoption features from the existing community and apply them to a new or different community can do so by navigating to the ellipses (...) menu on the right side of the community header and selecting <i>Unmark Copilot community</i>. This action will remove all adoption features, including suggested content, suggested members, and the setup checklist, while retaining all other content.</p><p>This update is available by default.</p><p><b>What you need to do to prepare:</b></p><p>There is no required action for admins before the rollout. If your organization is working on rollout and adoption of Copilot, we recommend reading the support documentation to learn more about this new capability in Viva Engage and connecting with the Copilot change managers in your organization to include this in your rollout and adoption change management plan.</p><p>Learn more:</p><ul><li><a href=\"https://techcommunity.microsoft.com/t5/viva-engage-blog/new-features-in-viva-engage-help-you-rollout-and-adopt-copilot/ba-p/4110449\" target=\"_blank\">New features in Viva Engage help you rollout and adopt Copilot - Microsoft Community Hub</a></li><li><a href=\"https://learn.microsoft.com/viva/engage/engage-365-copilot-adoption-platform\" target=\"_blank\">Microsoft 365 Copilot adoption community in Viva Engage | Microsoft Learn</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Engage is introducing new features to support Microsoft 365 Copilot adoption, including question recommendations and admin controls to manage community features. The rollout begins mid-January 2025 and completes by mid-February 2025. No action is required from admins before the rollout."
    }
  ],
  "EndDateTime": "2025-03-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC971030",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-09T20:06:00.763Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-03T00:35:52Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: New features for Microsoft 365 Copilot adoption community",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
