{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 16, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>This new feature provides the capability for admins to configure separate retention policies for various Microsoft 365 Copilot and AI apps. As a result, admins will have the option to configure policies that can delete Copilot and Generative AI interactions faster.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470025\" target=\"_blank\">470025</a>.</p><p><b>When this will happen:</b></p><p>Public preview: We will begin rolling out late May 2025 (previously late April) and expect to complete by early June 2025 (previously early May).\n</p><p>General Availability (Worldwide): We will begin rolling out mid-September 2025 (previously late June) and expect to complete by late September 2025 (previously early July).</p><p><b>How this will affect your organization:</b>\n</p><p>Organizations will now have controls to configure different retention policies for Microsoft Teams Chat, Copilot, Copilot studio, and ChatGPT Enterprise.</p><p>This feature is available by default.</p><p><b>What you need to do to prepare:</b></p><p>\n</p><p>For more information, see <a href=\"https://learn.microsoft.com/purview/create-retention-policies?tabs=teams-retention#create-and-configure-a-retention-policy\" target=\"_blank\">Create and configure a retention policy</a>.</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470025"
    },
    {
      "Name": "Summary",
      "Value": "Admins can now configure separate retention policies for Microsoft 365 Copilot and AI apps. The public preview starts in late May 2025, with general availability in mid-September 2025. This feature is enabled by default and requires no admin action. More details are available in the provided link."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-11-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC973511",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-16T21:05:18.237Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-07T00:20:01Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Lifecycle Management: Separate retention policies for Copilot and AI apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
