{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 21, 2025: After further review, we will not be rolling this out to DoD during the timeline outlined below. We will communicate via Message center when we are ready to proceed. Organizations in GCC High and DoD can safely disregard this message. Thank you for your patience.</p><p>We are rolling out fundamental Secure/Multipurpose Internet Mail Extensions (S/MIME) support for primary accounts in new Outlook. With this new feature, new Outlook will start supporting sending and reading signed and encrypted emails.</p><p>In new Microsoft Outlook, this option is available in <i>Options &gt; More Options</i>.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=397891\" target=\"_blank\">397891</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We began rolling out mid-December 2024 and expect to complete by late January 2025.</p><p>General Availability (GCC): We will begin rolling out early February 2025 and expect to complete by mid-February 2025.</p><p>General Availability (GCC High, DoD): We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b>\n</p><p>If your organization is not using New Outlook this will not impact you.</p><p>If your organization does not have S/MIME setup for your users, this will not impact you.&nbsp;</p><p>If your organization is currently using S/MIME, you will soon see controls to apply S/MIME encryption when signing into new Outlook. Similarly, you will be able to verify, sign, decrypt, and reply to S/MIME emails.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>Users with S/MIME certificates on their machine or Smart Card will be able to use this new feature in new Outlook.</p><p>Learn more: <a href=\"https://learn.microsoft.com/microsoft-365-apps/outlook/overview-new-outlook\" target=\"_blank\">Overview of the new Outlook for Windows</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "397891"
    },
    {
      "Name": "Summary",
      "Value": "Outlook for Windows is rolling out S/MIME support for sending and reading signed and encrypted emails. Rollout began mid-December 2024 and will continue through February 2025, excluding DoD for now. No admin action is needed, but users should be informed of the update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC974362",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-23T22:41:09.093Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-08T00:24:29Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Secure/Multipurpose Internet Mail Extensions encryption support in new Outlook for Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
