{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We have added a new source feed option in the <a href=\"https://support.microsoft.com/office/use-a-viva-engage-web-part-in-sharepoint-a53cfa0c-3d09-42c8-a286-1038a81c59da\" target=\"_blank\">Viva Engage conversations web part</a>, which is called the \"leaders\" feed.&nbsp;</p><p>As a result of this change, your site admins will be able to add the following Microsoft Viva Engage feeds to their Microsoft SharePoint site via the conversations web part: </p><ul><li> Community feed</li><li>User feed</li><li>Topic feed</li><li>Home feed</li><li>(New) leaders feed.&nbsp;</li></ul><p>If a site admin chooses to add the \"leaders\" feed to their SharePoint site, the content the user sees will be dependent on their license status.&nbsp;</p><ul><li>Users with either a Viva suite or Viva Employee Communications and Communities license will see content from their <a href=\"https://support.microsoft.com/topic/leadership-corner-in-viva-engage-2885e8d8-cb6c-4c11-b9aa-ed24a497b467\" target=\"_blank\">leadership corner</a> feed.</li><li>Users without a Viva suite or Viva Employee Communications and Communities license will see content from their home feed.</li></ul><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): This feature has completed&nbsp;rollout.</p><p>This update is available by default.</p><p><b>How this will affect your organization:</b></p><p>When site admins are editing their SharePoint site, they will have the additional \"leaders\" feed option when they are configuring the currently available conversations web part. There is no impact on any conversation web parts already added to SharePoint sites within your tenant.</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will have no impact on any existing conversations web parts. This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message details the addition of a \"leaders\" feed to the Viva Engage conversations web part in SharePoint. Site admins can now include this feed, which displays content based on user license status. The feature is globally available and requires no action from admins. Users may see content from the leadership corner or home feed."
    }
  ],
  "EndDateTime": "2025-03-10T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC976827",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-11T00:29:58.247Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-11T00:29:29Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Leadership feed available in SharePoint web part",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
