{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Teams: We have enhanced the privacy and security of voicemail greetings for calls.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): Available now.\n</p><p><b>How this will affect your organization:</b>\n</p><p>If a call recipient does not answer, the caller will be forwarded to the recipient's voicemail. The greeting will inform the caller that the user is unavailable and prompt the caller to leave a message after the tone. Also, the recipient's real name will only be announced for internal calls. For external calls, the recipient's name will be replaced with \"the person.\"\n</p><p>Previously, the recipient’s real name was announced to all callers.\n</p><p><b>Note:</b> This change also applies to Microsoft Skype for Business.\n</p><p>This change is on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>No admin action required after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams has increased voicemail greeting privacy, now omitting recipient names for external calls. This feature is available now and requires no admin action post-rollout. Users should be informed of this change, which also affects Skype for Business."
    }
  ],
  "EndDateTime": "2025-03-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC974356",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-08T00:22:58.673Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-08T00:21:38Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Enhanced confidentiality in voicemail greetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
