{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Teams now supports multiple windows on iPad. With this 'multi-window' feature, users can easily manage different Teams windows side-by-side, increasing productivity and flexibility.&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=467246\" target=\"_blank\">467246</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCCH, DoD): We will begin rolling out early February 2025 and expect to complete by late February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Apple's \"split view\" capability allows iPad users to have multiple applications and windows open side-by-side. Starting in February, Teams will now support the ability for there to be multiple Teams windows open at once. This makes it easier for users to attend a meeting and have their chat open on the other side or use Stage Manager to move windows to external displays.</p><p>This feature is available by default when users update the Teams app on iPad.&nbsp;</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "467246"
    },
    {
      "Name": "Platforms",
      "Value": "iOS"
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC975308",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-09T00:33:05.827Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-09T00:32:10Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: iPad Multi-window support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
