{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 23, 2025: We have updated our Threat Classification documentation on Microsoft Learn. You can now access the latest version from <a href=\"https://learn.microsoft.com/en-us/defender-office-365/mdo-threat-classification\" target=\"_blank\">here</a>.</p><p>Coming soon to Microsoft Defender for Office: We will introduce Threat classification details to enhance your ability to understand the intent behind email attacks. This update will allow you to integrate Threat classification information across key experiences, enabling better detection, analysis, and response. The <i>Threat classification</i> system utilizes large language models (LLMs), machine learning (ML) models, and other advanced techniques to understand the intent behind threats, providing a more accurate classification. As the system evolves, you can expect new <i>Threat classifications</i> to be added to keep pace with emerging attack methods.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early January 2025 and expect to complete by late January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Threat Explorer: You will be able to filter emails by <i>Threat classification</i>, view the classification in the results, analyze trends using charts, and export data with the classification details included:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e9bf120b-b7c5-4579-90f7-e67b440b8fad\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>Advanced Hunting: The <i>ThreatClassification</i> column will be available in the <i>EmailEvents </i>table, allowing you to create custom detection rules based on classification details:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f2777d53-a839-4793-aa49-f165962244fb\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>Email summary panel: <i>Threat classificatio</i>n will be integrated across multiple areas, including <i>Alerts, Incidents, Reports, AIR, Submission, Explorer, </i>and <i>Advanced Hunting,</i> providing a comprehensive view of threat classifications:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/bddf4e93-a1a0-4f67-8c97-fb886fcd2e19\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>Email entity page: A new <i>Threat classification</i> field will be added in the threat detection details, helping you understand the context and intent of the detected threat:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/699c51e1-37d7-4b01-93d7-1de9a2dfa7cd\" style=\"width: 400px;\" alt=\"admin settings\">\n</p><p>These changes will be available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Familiarize your team with the new <i>Threat classification</i> details available in the <i>Threat Explorer, Advanced Hunting, e</i>mail summary panel, and email entity page.\n</p><p>Leverage <i>Threat classification</i> to enhance filtering, hunting, and trend analysis in your workflows.\n</p><p>Prepare to update any custom detection rules or automated workflows to incorporate <i>Threat classification</i> for more targeted and insightful threat detection.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your team about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Office is introducing \"Threat classification\" for emails, enhancing detection and response capabilities. The system uses advanced techniques for accurate threat intent classification. It will be integrated across various features, with rollout expected in January 2025. Updated documentation is available on Microsoft Learn."
    }
  ],
  "EndDateTime": "2025-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC973503",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-23T22:36:46.21Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-07T00:17:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Office: Introducing \"Threat classification\" for email",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
