{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are introducing a new Carousel layout to make the Hero web part more attractive. This new layout will feature a slideshow and a selection of new styles with imagery, bold text, and a call to action, creating a more engaging page experience.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=395214\" target=\"_blank\">395214</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will start rolling out in mid-January 2025 and expect to complete by late January 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High and DoD): We will begin rolling out mid-February 2025 and expect to complete by late-February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Adding a Hero web part to a page or news post has not changed. This update allows authors to create eye-catching carousel slides in any section type, with up to five slides in Carousel layout, enhancing user engagement and highlighting key content to establish page hierarchy. It offers three new styles and supports Stream videos to make the page more appealing.&nbsp;</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/32122475-91dc-454e-893c-b96f1e523e6e\" style=\"width: 450px;\"></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/23a9cf44-978b-41fc-ab19-5147ab230179\" style=\"width: 450px;\"></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/8e436622-2e99-4acf-a718-feb469fef8ea\" style=\"width: 450px;\"><br></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395214"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint Online introduces a Carousel layout for the Hero web part, enhancing pages and news with a slideshow, new styles, and a call to action. Rollout begins mid-January 2025 for Targeted Release and mid-February 2025 for General Availability, requiring no admin action."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-04-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC974354",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-08T00:20:57.653Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-08T00:20:32Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft SharePoint Online: Re-imagined Hero with the new carousel layout in pages and news",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
