{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft SharePoint: A new <i>Accessibility assistant</i> tool to help content creators meet accessibility standards when authoring SharePoint Pages. This tool provides checks and brief guidance to help ensure pages are inclusive and accessible to a broad audience. This rollout reflects our ongoing commitment to fostering accessibility and inclusivity in SharePoint.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470603\" target=\"_blank\">470603</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late January 2025 and expect to complete by early February 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High and DoD): We will begin rolling out mid-February 2025 and expect to complete by early March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, authors can initiate an accessibility test while editing a page. Authors can select the <i>Accessibility assistant</i> icon from the right vertical toolbar. The <i>Accessibility assistant</i> will support five web parts: Banner, Text, Image, Hero, and Quick Links.\n</p><p>The <i>Accessibility assistant</i> identifies accessibility issues:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2d0c2af7-8af8-4cfb-b3e9-c9754e4c3b03\" style=\"width: 372.997px;\" alt=\"user controls\">\n</p><p>The <i>Accessibility assistant</i> guides authors to address accessibility issues in the specific web part:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/3991827c-e987-4f6a-8480-8b44f5e2c06f\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>The <i>Accessibility assistan</i>t confirms the author has addressed all accessibility issues:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1638eaf7-bfd8-4a4a-962f-b9481c09b6e6\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Before rollout, we will update this post with revised documentation.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470603"
    },
    {
      "Name": "Summary",
      "Value": "A new 'Accessibility assistant' tool for SharePoint Pages is coming to help creators ensure content accessibility. It will begin rolling out in late January 2025 for Targeted Release and mid-February 2025 for General Availability, completing in early March 2025. The tool will support five web parts and provide guidance to address accessibility issues. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC976819",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-11T00:22:24.497Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-11T00:19:36Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: New Accessibility assistant tool for authoring Pages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
