{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 21, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>In Microsoft Teams, while in a live meeting, participants will soon be able to edit their display name for the duration of the meeting. This name change is for the meeting duration only and does not affect a participant's original name on their People card.\n</p><p>This feature is available for participants using the Teams desktop and web apps for both Windows and Mac.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=122934\" target=\"_blank\">122934</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early March 2025 (previously February) and expect to complete by mid-March 2025 (previously mid-February).\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out early April 2025 (previously mid-March) and expect to complete by mid-April 2025 (previously early April).\n</p><p>General Availability (GCC High, DoD): We will begin rolling out late April 2025 (previously early April) and expect to complete by mid-May 2025 (previously mid-April).\n</p><p><b>How this will affect your organization:</b>\n</p><p>The feature is off by default for all tenants. Admins can turn it on for their organization in the Teams admin center for all or selected tenant members. These members can then enable the feature in their private scheduled meetings.\n</p><p>If turned on for the tenant, a meeting organizer can turn the feature on for their meeting in <i>Meeting options</i> &gt; <i>Let people edit their display name</i>. The feature is OFF by default in <i>Meeting options</i> and has to be enabled by meeting organizer.\n</p><p>If turned on for a meeting, participants can join the meeting and then select <i>People</i> at the top of the screen to edit their own display names in the <i>Participants </i>panel.\n</p><p>Example: Daniela Mandera can change her name in a meeting to Daniela M. (Before rollout, we will update this post with revised user documentation for changing the name.)\n</p><p>Participants who have edited their names will have an <i>(edited)</i> label next to their name in the meeting screens.\n</p><p>*Original People card names will display in some meeting features such as calendar invites, the list of people invited to meetings, group chat rosters, and so on.\n</p><p>Permanent meeting artifacts (such as the attendance report and transcriptions) will not reflect name changes.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/27f7464c-de5e-4d3d-9846-a0bb60539683\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b248f5e3-ffdd-48c9-9d84-eeeb33b48691\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7ca619f6-f8d3-47d7-8d60-936bd20c8b7a\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You can turn this feature on for your tenant users to allow the capability in the meetings they organize. You might want to notify your users about this new feature and update your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "122934"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"122934\":[{\"RoadmapId\":122934,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-03-06T15:15:45.8121719Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":122934,\"Platform\":\"Mac\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-03-06T15:15:45.8121724Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":122934,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-03-06T15:15:45.8121727Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams participants will soon be able to edit their display names during live meetings. This update, associated with Microsoft 365 Roadmap ID 122934, will roll out between March and May 2025. The feature is off by default and can be enabled by admins and meeting organizers."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC974361",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-21T15:00:41.253Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-08T00:23:51Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Edit your display name in meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
