{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be retiring certain SaaS security posture management (SSPM) recommendations from Exposure Management in the Defender portal. This update is to help ensure a more accurate representation of security posture.\n</p><p><b>When this will happen:</b>\n</p><p>This will begin rollout in mid-February 2025 and is expected to be complete by mid-March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates your organization may be using this feature.</p><p>As part of our efforts to keep recommendations updated and relevant, we will be retiring the following recommendations due to either low security value or change of settings in the applications.\n</p><p>Recommendations names:</p><ul><li>Ensure that collaboration invitations are sent to allowed domains only\n</li><li>Ensure notifications for internal users sending malware is enabled\n</li><li>Audit Exchange online Organization Sharing\n</li><li>Enable strong password policies\n</li><li>Enable Dropbox Multi-Factor Authentication (MFA)\n</li><li>Enable Single Sing On (SSO)\n</li><li>Enable session timeout for web users\n</li><li>Enable strong password policies\n</li><li>Enable multi-factor authentication (MFA)\n</li><li>Enable Single Sing On (SSO) with SAML\n</li><li>Enable Password expiration policies\n</li><li>Enable strong password policies\n</li><li>Enable session timeout for web users\n</li><li>Enable session timeout for web users\n</li><li>Enable and adopt two-factor authentication (2FA)\n</li><li>Ensure that DKIM is enabled for all Exchange Online Domains\n</li><li>Ensure external domains are not allowed in Skype or Teams\n</li><li>Guests must sign in using the same account to which sharing invitations are sent\n</li><li>Ensure devices lock after a period of inactivity to prevent unauthorized access\n</li><li>Ensure mobile device management policies are required for email profiles - iOS/iPadOS only\n</li><li>Ensure mobile device management policies are set to require advanced security configurations\n</li><li>Ensure mobile devices are set to wipe on multiple sign-in failures to prevent brute force compromise\n</li><li>Ensure mobile devices require the use of a password\n</li><li>Ensure that devices connecting have AV and a local firewall enabled\n</li><li>Ensure that mobile device encryption is enabled to prevent unauthorized access to mobile data\n</li><li>Ensure that mobile device password reuse is prohibited\n</li><li>Ensure that mobile devices are set to never expire passwords\n</li><li>Ensure that mobile devices require a minimum password length to prevent brute force attacks\n</li><li>Ensure that mobile devices require complex passwords (Simple Passwords = Blocked)\n</li><li>Ensure that mobile devices require complex passwords (Type = Alphanumeric)\n</li><li>Ensure that users cannot connect from devices that are jail broken or rooted\n</li><li>Create an OAuth app policy to notify you about new OAuth applications\n</li><li>Create an app discovery policy to identify new and trending cloud apps in your org\n</li><li>Create a custom activity policy to get alerts about suspicious usage patterns\n</li></ul><p><b>What you need to do to prepare:</b> \n</p><p>There's no action needed to prepare for this change. Your score will be updated accordingly.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Certain SSPM recommendations from Exposure Management in the Defender portal will be retired to ensure accurate security posture representation. This will start in mid-February 2025 and complete by mid-March 2025. The retirement includes various recommendations, and no action is needed to prepare for this change."
    }
  ],
  "EndDateTime": "2025-04-21T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC971037",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-01-03T00:40:38.873Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-03T00:40:20Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Exposure Management Recommendations Retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
