{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 27, 2025: We have updated the rollout timeline below. Thank you for your patience.\n</p><p>We will be retiring certain SaaS security posture management (SSPM) recommendations from Exposure Management in the Defender portal. This update is to help ensure a more accurate representation of security posture.</p><p><b>When this will happen:</b>\n</p><p>This will begin rollout in mid-February 2025 and is expected to be complete by mid-April 2025 (previously mid-March).</p><p><b>How this will affect your organization:</b>\n</p><p>You are receiving this message because our reporting indicates your organization may be using this feature.\n</p><p>As part of our efforts to keep recommendations updated and relevant, we will be retiring the following recommendations due to either low security value or change of settings in the applications.\n</p><p>Recommendations names:\n</p><ul><li>AAD: Ensure that collaboration invitations are sent to allowed domains only\n</li><li>EXO: Ensure notifications for internal users sending malware is enabled\n</li><li>EXO: Audit Exchange online Organization Sharing\n</li><li>Defender for Office: Ensure that DKIM is enabled for all Exchange Online Domains\n</li><li>Purview: Ensure external domains are not allowed in Skype or Teams\n</li><li>SPO: Guests must sign in using the same account to which sharing invitations are sent\n</li><li>Intune: Ensure devices lock after a period of inactivity to prevent unauthorized access\n</li><li>Intune: Ensure mobile device management policies are required for email profiles - iOS/iPadOS only\n</li><li>Intune: Ensure mobile device management policies are set to require advanced security configurations\n</li><li>Intune: Ensure mobile devices are set to wipe on multiple sign-in failures to prevent brute force compromise\n</li><li>Intune: Ensure mobile devices require the use of a password\n</li><li>Intune: Ensure that devices connecting have AV and a local firewall enabled\n</li><li>Intune: Ensure that mobile device encryption is enabled to prevent unauthorized access to mobile data\n</li><li>Intune: Ensure that mobile device password reuse is prohibited\n</li><li>Intune: Ensure that mobile devices are set to never expire passwords\n</li><li>Intune: Ensure that mobile devices require a minimum password length to prevent brute force attacks\n</li><li>Intune: Ensure that mobile devices require complex passwords (Simple Passwords = Blocked)\n</li><li>Intune: Ensure that mobile devices require complex passwords (Type = Alphanumeric)\n</li><li>Intune: Ensure that users cannot connect from devices that are jail broken or rooted\n</li><li>Defender for Cloud Apps: Create an OAuth app policy to notify you about new OAuth applications\n</li><li>Defender for Cloud Apps: Create an app discovery policy to identify new and trending cloud apps in your org\n</li><li>Defender for Cloud Apps: Create a custom activity policy to get alerts about suspicious usage patterns</li></ul><p><b>What you need to do to prepare:</b> \n</p><p>There's no action needed to prepare for this change. Your score will be updated accordingly.</p><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Certain SSPM recommendations will be retired from Exposure Management in the Defender portal to ensure accurate security posture representation. The rollout will occur from mid-February to mid-April 2025. No action is required from organizations, and security scores will be updated accordingly."
    }
  ],
  "EndDateTime": "2025-06-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC971037",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-03-28T14:23:14.363Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-03T00:40:20Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Exposure Management Recommendations Retirement",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
