{
  "ActionRequiredByDateTime": "2025-04-29T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 11, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Effective April 30, 2025 (previously April 1), the <i>New usage insights</i> toggle on the <i>Insights</i> tab of the <a href=\"https://admin.microsoft.com/Adminportal/Home#/MicrosoftSearch/connectors\" target=\"_blank\">Microsoft 365 Search and Intelligence admin portal</a> will be retired, making old search usage reports inaccessible. The new usage reports have improved consistency and are more efficient to maintain.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The retirement will not affect existing default reports in the Search and Intelligence portal. There are some differences between the new and old reports, including changes in metrics (such as the new reports have no query count or average position) and improvements to the user experience. For consistency, you cannot switch back to the old reports, and we will not address the disparities of the old reports at this time.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You will have access to view old reports until April 29, 2025 (previously March 31). We encourage you to download any necessary old reports by this date for your records. Also, we invite you to explore our new search usage reports available in the <i>Insights</i> tab and provide your feedback using the feedback icon in the Search and Intelligence portal.\n</p><p>Learn more about the new search usage reports: <a href=\"https://learn.microsoft.com/microsoftsearch/usage-reports\" target=\"_blank\">Search Usage Reports | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The old Search usage reports in Microsoft 365 will be retired on April 30, 2025. Users should download necessary old reports by April 29, 2025, and familiarize themselves with the new reports, which cannot be reverted to the old format. Feedback on the new reports is welcomed."
    }
  ],
  "EndDateTime": "2025-06-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC976821",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-04-11T16:35:21.563Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-11T00:23:52Z",
  "Tags": [
    "Updated message",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Search: The old Search usage reports will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
