{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated August 14, 2025: After further review we have decided not to proceed with this change at this time. We apologize for any inconvenience.</p><p>This new feature enables data governance administrators to expedite the permanent deletion of sensitive content from Microsoft Exchange mailboxes, overriding any existing retention settings or eDiscovery holds. This process may be required for security or privacy, such as after a data spillage incident or for compliance and regulatory requirements.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=392838\" target=\"_blank\">392838</a>.</p><p><b>When this will happen:</b></p><p>Public Preview: We will begin rolling out late February 2025 (previously early February) and expect to complete by mid-March 2025 (previously mid-February).</p><p>Worldwide: We will communicate via Message center when we are ready to proceed.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Priority Cleanup administrators can now set up a Priority Cleanup policy for Exchange to create exceptions to retention principles and e-Discovery holds for specific scenarios. Once administrators are within the Data Lifecycle Management (DLM) Solution on Microsoft Purview, they can visit the Priority Cleanup tab and follow the wizard to set-up this policy. Like auto-apply retention labels, Priority Cleanup supports policy simulation mode, so administrators can check the returned samples in case the policy configuration needs any fine-tuning before enabling the policy. Once set-up, because the deletion by a priority cleanup policy is irreversible and can override existing holds, the process requires multiple approvals, specific roles, and is audited. Thus, respective reviewers must be mandatorily added during policy creation to allow for disposition of items under a retention or e-Discovery hold.&nbsp;</p><p><b>What you need to do to prepare:</b>\n</p><p>Because of the built-in safeguards, the feature itself is enabled by default at the tenant level. However, Priority Cleanup can be turned off on the Priority Cleanup settings page. If you can't create new Priority Cleanup policies, refer to  your Data Lifecycle Management documentation for necessary roles and permissions requirements. A new role permission \"Priority cleanup administrator\" is now added to Purview role permissions to enable data governance administrators to use this feature.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "392838"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft postponed the rollout of a new Microsoft Purview feature allowing administrators to bypass retention and legal holds for urgent data deletion. The feature includes strict safeguards, multiple approvals, and a new \"Priority cleanup administrator\" role, with rollout initially planned for early 2025."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-21T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC971035",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-08-15T20:24:34.84Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-03T00:38:32Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Updated: Microsoft Purview | Data Lifecycle Management: New secure workflow to bypass legal holds and retention policies",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
