{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Multi-pin Conversations Carousel is now available for Microsoft Viva Engage.</p><p>The behavior of single pin remains the same; two or more pins will enable the carousel. Posts will appear in the order of the most recently pinned post first. Pinned conversations will remain in the feed with a thumbtack icon on the corner to denote that it is a pinned conversation.</p><p>&nbsp;<b>When this will happen:</b>&nbsp;</p><p>General Availability (Worldwide): We will begin rolling out mid-January 2025 and expect to complete by early February 2025.</p><p><b>How this will affect your organization:</b></p><p>Community admins can now pin up to six posts at the top of the community feed. When you pin two or more posts, the carousel feature will automatically activate, enhancing visibility and engagement.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/c95b4321-f2ff-4682-8a4a-1dfa5967c968\" style=\"width: 600px;\"></p><p>This new feature is available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Multi-pin Conversations Carousel for Microsoft Viva Engage is now available, allowing up to six posts to be pinned with a carousel feature for two or more pins. Rollout begins mid-January 2025, completing by early February, with no admin action required."
    }
  ],
  "EndDateTime": "2025-03-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC973512",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-07T00:21:43.21Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-07T00:21:31Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Engage: Multi-pin Conversations Carousel is now available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
