{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Flexible sections are a new section type that allow authors to build pages without a strict column structure. Web parts can be dynamically resized and moved within flexible sections to create a fully customized section. Flexible sections unlock an endless number of design possibilities for sections.&nbsp;</p><p>With the introduction of flexible sections, we have reimagined section templates that are located in the content pane toolbox. The new section templates will be powered by both flexible and column-based sections with example content. All sample content from these templates is placed onto the canvas when a section template is applied.&nbsp;</p><p>The new flexible section type and section templates will be available in SharePoint and Viva Amplify.&nbsp; </p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=395213\" target=\"_blank\">395213</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out late-January 2025 and expect to complete by mid-March 2025.</p><p>General Availability (Production, GCC, GCC High, DOD): We will begin rolling out mid-March 2025 and expect to complete by late April 2025.&nbsp;</p><p><b>How this will affect your organization:</b>\n</p><p>Users will see a new option when adding a section to a page, called “Flexible”. Within a flexible section, users can drag and drop web parts anywhere on the grid.  Web parts will snap to the closest grid line when moved.</p><p>Users can also resize web parts. Card-based web parts, such as Quick Links, People, or Hero, only have four different width options (full width, 1/3 canvas width, ½ canvas width, and 2/3 canvas width). These web parts can only be resized to one of the four options.&nbsp;</p><p>Non-card-based web parts, such as Text, Image, and File &amp; Media can be resized to any width. Web parts will snap to the closest gird line when being resized.&nbsp;</p><p>Users can resize flexible sections manually, change the arrangement of overlapping web parts, multi-select web parts, and group web parts.&nbsp;</p><p>Users can select or drag and drop a new section template from the content pane toolbox. After the template is added to the canvas, users can make adjustments to the web parts and section until ready to publish. </p><p><b>What you need to do to prepare:</b>\n</p><p>You might want to notify users, update your user training, and prepare your help desk.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "395213"
    },
    {
      "Name": "Summary",
      "Value": "SharePoint introduces Flexible Sections, allowing page customization without strict column structures. Web parts can be resized and moved dynamically. New section templates are available, and the features will roll out from late January to late April 2025. Organizations should prepare users and help desks for these updates."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC973514",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-07T00:23:15.047Z",
  "Services": [
    "SharePoint Online",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-07T00:22:51Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "SharePoint Pages Flexible Sections",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
