{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In Microsoft Teams, while in a live meeting, participants will soon be able to edit their display name for the duration of the meeting. This name change is for the meeting duration only and does not affect a participant's original name on their People card.\n</p><p>This feature is available for participants using the Teams desktop and web apps for both Windows and Mac.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=122934\" target=\"_blank\">122934</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early February 2025 and expect to complete by mid-February 2025.\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out mid-March 2025 and expect to complete by early April 2025.\n</p><p>General Availability (GCC High, DoD): We will begin rolling out early April 2025 and expect to complete by mid-April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The feature is off by default for all tenants. Admins can turn it on for their organization in the Teams admin center for all or selected tenant members. These members can then enable the feature in their private scheduled meetings.\n</p><p>If turned on for the tenant, a meeting organizer can turn the feature on for their meeting in <i>Meeting options</i> &gt; <i>Let people edit their display name</i>. The feature is OFF by default in <i>Meeting options</i> and has to be enabled by meeting organizer.\n</p><p>If turned on for a meeting, participants can join the meeting and then select <i>People</i> at the top of the screen to edit their own display names in the <i>Participants </i>panel.\n</p><p>Example: Daniela Mandera can change her name in a meeting to Daniela M. (Before rollout, we will update this post with revised user documentation for changing the name.)\n</p><p>Participants who have edited their names will have an <i>(edited)</i> label next to their name in the meeting screens.\n</p><p>*Original People card names will display in some meeting features such as calendar invites, the list of people invited to meetings, group chat rosters, and so on.\n</p><p>Permanent meeting artifacts (such as the attendance report and transcriptions) will not reflect name changes.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jZoJ?ver=61a3\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1k1Xo?ver=d4e1\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1jWPM?ver=a2e4\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>You can turn this feature on for your tenant users to allow the capability in the meetings they organize. You might want to notify your users about this new feature and update your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "122934"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"122934\":[{\"RoadmapId\":122934,\"Platform\":\"Mac\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2025-01-08T04:17:08.6595102Z\",\"LatestRing\":null},{\"RoadmapId\":122934,\"Platform\":\"Desktop\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2025-01-08T04:17:08.6595104Z\",\"LatestRing\":null},{\"RoadmapId\":122934,\"Platform\":\"All\",\"Status\":\"Scheduled\",\"LastUpdateTime\":\"2025-01-08T04:17:08.6595105Z\",\"LatestRing\":null}]}"
    },
    {
      "Name": "Summary",
      "Value": "Participants in Microsoft Teams meetings will soon be able to edit their display name temporarily during the meeting. This feature is optional and controlled by meeting organizers. Rollouts begin in February 2025 and continue through April 2025, depending on the release schedule. Admins can enable this feature in the Teams admin center."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC974361",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-08T00:24:12.63Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-08T00:23:51Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Edit your display name in meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
