{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Multi-tenant organization (MTO) users will be able to see additional work information in people search results. With this feature, MTO users will be able to see the company name and department name of a user in people search results, helping users to make sure they are communicating with the right people.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early February 2025 and expect to complete by late February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Tenant admins who have MTO enabled will be able to toggle this feature on and off in the Teams admin center.\n</p><p>Toggle behavior:\n</p><ul><li>This toggle will be off by default.\n</li><li>Turning on the toggle will enable the ability to see company name and department name in results. \n</li><li>Turning off the toggle will disable the ability to see company name and department name in results.\n</li></ul><p>Instructions to toggle:\n</p><ol><li>Navigate to the Teams admin center (TAC).</li><li>Navigate to the Teams Client Config page.</li><li>Using the Enable Extended Work Info in People Search toggle:</li></ol><p style=\"margin-left: 75px;\">a. Switch the toggle to on to enable the ability to see company name and department name in results.</p><p style=\"margin-left: 75px;\">b. Switch the toggle to off to disable the ability to see company name and department name in results.</p><p>For more information, see&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/enterprise/set-up-multi-tenant-org?view=o365-worldwide\" target=\"_blank\">Set up a multitenant org in Microsoft 365</a>.</p><p><b>What you need to do to prepare:</b>\n</p><p>Tenant admins will need to complete cross-tenant synchronization and sync the company name field in order to take advantage of this feature. \n</p><p>For more information, see <a href=\"https://learn.microsoft.com/microsoft-365/enterprise/sync-users-multi-tenant-orgs?view=o365-worldwide\" target=\"_blank\">Synchronize users in multitenant organizations in Microsoft 365</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will enable MTO users to see additional work information in people search results, including company and department names. This feature will roll out in February 2025 and can be toggled on or off by tenant admins in the Teams admin center. Admins must complete cross-tenant synchronization to use this feature."
    }
  ],
  "EndDateTime": "2025-04-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC985484",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-22T02:06:14.413Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-22T02:05:53Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Additional work information in people search results",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
