{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 21, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Teams: Organizers of town halls and webinars will be able to select and assign presenters to also moderate the Q&amp;A, allowing them to manage and publish questions asked during the event. This feature lets organizers make changes to the group of moderators at any time (before or during the event), and it is available to all users organizing a town hall or webinar.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=469492\" target=\"_blank\">469492</a>.\n</p><p>This message applies to Teams for Windows desktop, Teams for Mac desktop, Teams for the web, and Teams for iOS/Android.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late February 2025 and expect to complete by early April 2025 (previously early March).\n</p><p><b>How this will affect your organization:</b>\n</p><p>This feature is supported for presenters with Microsoft Azure Active Directory (AAD) IDs. Presenters using consumer domains (such as live.com or gmail.com) are not supported.\n</p><p>Meeting organizers can enable this feature in <i>Meeting options</i> while setting up the event or during the event.\n</p><p>This feature will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/q-a-in-microsoft-teams-meetings-f3c84c72-57c3-4b6d-aea5-67b11face787\" target=\"_blank\">Q&amp;A in Microsoft Teams meetings - Microsoft Support (will be updated before rollout)</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "469492"
    },
    {
      "Name": "Summary",
      "Value": "Organizers of Microsoft Teams town halls and webinars will soon be able to assign presenters to moderate Q&A sessions. This feature, available to all users with Microsoft Azure Active Directory IDs, will roll out from late February to early April 2025. No admin action is required for the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Web"
    }
  ],
  "EndDateTime": "2025-05-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC980799",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-21T16:51:10.047Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-16T00:34:26Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Allow presenters to moderate Q&A",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
