{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 31, 2025: The policy setting is available in Cloud Policy as of January 30, 2025. Currently the policy setting is only available in English. But we’re working on making the localized versions available as soon as we can.</p><p>Multiple account access to Copilot in Microsoft 365 desktop and mobile apps will be available soon.</p><p><b>When will this happen</b> \n</p><p>General availability (Worldwide): We will begin rolling out in early March 2025 and expect to complete by late March 2025.</p><p><a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Cloud Policy</a> to manage use will be available by late January 2025.</p><p><b>How this will affect your organization</b> \n</p><p>As an M365 service, Copilot can be used across signed in accounts in clients that allow you to sign in with multiple accounts. This lets users use their Copilot value on any document to which they have permission. Note that Copilot data protection is always based on the identity used to access the file. This ensures enterprise data protection for files in your organization, regardless of which account grants Copilot access. The setting for web grounding in Copilot is also based on the identity used to access the file. If you disabled web grounding in Copilot, users will not be able to use web grounding even when using Copilot access from another account.  This feature will be available starting in March 2025, at which point, users signed into accounts with external Copilot licenses will be able to use Copilot on their work and school documents in Word, Excel, PowerPoint, Outlook and OneNote desktop and mobile apps.</p><p><b>What you need to do to prepare</b> \n</p><p>If you wish to restrict multiple account access to Copilot, you can use the “Multiple account access to Copilot for work documents” <a href=\"https://learn.microsoft.com/microsoft-365-apps/admin-center/overview-cloud-policy\" target=\"_blank\">Cloud Policy</a>.&nbsp; This policy setting is expected to be available in Cloud Policy by the end of January 2025</p><p><b>Additional information</b> \n</p><p>For more information, see <a href=\"https://go.microsoft.com/fwlink/p/?linkid=2300619\" target=\"_blank\">Multiple account access to Copilot for work and school documents</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Copilot in Microsoft 365 will support multiple account access on desktop and mobile apps starting early March 2025. A Cloud Policy to manage this feature is available now. Organizations can use this policy to restrict access if needed."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC981462",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-01-31T17:44:57.107Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-16T19:58:33Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Multiple account access to Copilot in Microsoft 365 desktop and mobile apps",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
