{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The <b>Apps </b>area within the Microsoft Intune admin center will have an updated look, similar to the <b>Devices </b>area, that provides a more consistent user interface (UI) and an improved navigation structure. This update is expected to start in early February 2025 and enabled for all admins by the end of the month.</p><p><b>How this will affect your organization:</b>\n</p><p>This is an admin center UI update only. The updated <b>Apps </b>area includes:\n</p><ul><li>Scenario-focused navigation structure that brings monitoring in line with management workflows.\n</li><li>Updated navigation naming to align with the Devices area, such as <i>App protection polices</i> will become <i>Protection</i>.\n</li><li>A dedicated list of monitoring reports and key metrics and reports on the overview page. \n</li><li>Platform specific navigation pivots that show menu items applicable to that platform.\n</li><li>Consistency across list views to search, sort, and filter data.</li></ul><p><br></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/80c96f6e-a661-4388-a82b-0439be378b25\" width=\"400\" height=\"\"></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1c096474-d178-4b94-96c7-278b2e2d4c87\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b>\n</p><p>No action is required, only awareness.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Intune admin center's 'Apps' area will soon have a UI update, offering a consistent look and improved navigation, starting early February 2025 and reaching all admins by month's end. This update is for admin center UI only and includes scenario-focused navigation, updated naming, dedicated monitoring reports, platform-specific pivots, and consistent list views. No action is needed, just awareness."
    }
  ],
  "EndDateTime": "2025-03-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC987318",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-24T00:28:48.27Z",
  "Services": [
    "Microsoft Intune"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-24T00:28:22Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Coming Soon: Update to Apps user interface experience in Intune",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
