{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>By default, Microsoft Outlook for the web and new Microsoft Outlook for Windows support separating recipients by using either a semicolon or a comma. After this rollout, users can choose if a comma should be used as a recipient separator or if it should be allowed as part of the contact's name. This change is helpful for organizations where contacts use the \"Last name, First name\" format.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=470020\" target=\"_blank\">470020</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out in late February 2025 and expect to complete by late March 2025.</p><p>General Availability (Worldwide): We will begin rolling out in late March 2025 and expect to complete by late April 2025.\n\n</p><p><b>How this will affect your organization:</b>\n</p><p>This release only includes the user-level setting to change the separator behavior, so users will need to change this default themselves if they need to. The default will continue to enable the comma as a separator.\n\n</p><p>Users can change the default to allow commas as part of the contact's name in Outlook <i>Settings &gt; Mail &gt; Compose and reply &gt; Commas to separate recipients:</i></p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/06222b3f-96d8-4d75-b7e1-5927070eaa43\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "470020"
    },
    {
      "Name": "Summary",
      "Value": "Outlook users will soon have the option to include a comma in a recipient's contact name, useful for \"Last name, First name\" formats. This setting will be user-adjustable in Outlook's \"Compose and reply\" settings. Rollout begins late February 2025 for Targeted Release and late March 2025 for General Availability. No admin action is required for the rollout. Microsoft 365 Roadmap ID 470020."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC981634",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-16T23:52:46.79Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-16T23:52:24Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Outlook: New user setting to include a comma in recipient's contact name",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
