{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Clipchamp brings video creation skills to Visual Creator in Copilot. Simply type your prompt, and Clipchamp will generate a bespoke script, source high-quality stock footage, and assemble a video project complete with music, voiceover, text overlays, and transitions. This provides you with a first draft, which you can open in the Clipchamp app to continue editing. You can then export the video to mp4, which will be saved in OneDrive and count towards your OneDrive quota, ready for sharing. This feature is ideal for creating informational videos, video messaging, how-to guides, demos, and video presentations. Available on the <a href=\"https://www.microsoft.com/microsoft-365/copilot/\" target=\"_blank\">Microsoft 365 Copilot</a> plan.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/51737ea1-b8d6-4e46-9c11-35ce74e3c3a2\" width=\"400\" height=\"\"></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=402192\" target=\"_blank\">402192</a>.</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out mid-February 2025 and expect to complete by mid-March 2025.</p><p><b>How this affects your organization:</b></p><p>Once available, users can type a prompt, and Clipchamp will generate a bespoke script, source high-quality stock footage, and assemble a video project complete with music, voiceover, text overlays, and transitions.&nbsp;</p><p><i>Video creator limitations:</i></p><p>The video creation skill does not generate new video clips, animations, images or audio. We use content in existing Microsoft 365 service asset libraries (enterprise compliant stock media), to bring your video to life. Once the script is generated, we select the most appropriate audio and imagery available in our asset libraries, to complement both the content and the style of your video. You can edit the video in Clipchamp to update the script, replace the selected media or extend the video with new content.</p><p><b>What you can do to prepare:</b></p><p>You may consider updating your training and documentation as appropriate.</p><p><i>Controlling access to your videos:</i></p><p>The video creation skill with generate a Clipchamp video project within the user's OneDrive (inside a Videos/Clipchamp folder). Users must first open this project in Clipchamp (a link is provided in Copilot) to export a video file (e.g. mp4). For more information about Clipchamp, visit our <a href=\"https://adoption.microsoft.com/en-us/clipchamp/\" target=\"_blank\">Clipchamp Adoption</a> page, or the <a href=\"https://support.microsoft.com/topic/what-is-clipchamp-750e8940-cd76-4abf-9767-b34d3d3285d7\" target=\"_blank\">Get Started</a> page on our support site.</p><p><i>Managing access to video creation:</i></p><p>You can find the Visual Creator agent within Microsoft 365 Copilot sidebar. Users must click into the agent to activate the video creation skill.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/14be5021-ebf7-4b6a-a63e-44c3b8a94885\" width=\"300\" height=\"\"></p><p>Access to Copilots agents is centrally managed, in the Microsoft 365 Admin Center, by using the <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/manage-copilot-agents-integrated-apps?view=o365-worldwide\" target=\"_blank\">Copilot extensibility controls</a>.</p><p><i>Providing feedback:</i></p><p>In addition to existing support and feedback mechanisms, users can provide quick feedback by clicking the thumbs-up or thumbs-down icon below their video. Clicking these icons will open the feedback dialog and allow users to enter comments and (optionally) include a screenshot or prompt information.</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/bff9f4dd-191d-4bd5-a1b4-4fbc610d7538\" width=\"400\" height=\"\"></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "402192"
    },
    {
      "Name": "Summary",
      "Value": "Clipchamp's integration with Copilot Visual Creator allows users to generate videos from typed prompts, sourcing from Microsoft 365's stock media. Videos are saved in OneDrive and can be edited in Clipchamp. The feature rolls out from mid-February to mid-March 2025 and is available with Microsoft 365 Copilot plan. Users can control access and provide feedback within the app."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC986546",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-23T01:42:48.107Z",
  "Services": [
    "Microsoft Clipchamp "
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-23T01:42:36Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Video creation in Copilot Visual Creator powered by Clipchamp",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
