{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will be adding a new in-product message to display the recording owner's information.  This feature is especially important to our users when the person who starts the recording is different from the recording owner, participants will be able to reach out to the correct recording owner as needed.</p><p><b>When this will happen:</b></p><p>General availability (Worldwide): We will begin rolling out early March 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b></p><p>This feature provides an in-product message in the chat that displays the recording owner's information, making it easier for participants to reach out to the correct recording owner when needed.</p><p>\n</p><p>We understand the importance of governance and predictability in managing recordings, which is why we have rolled out Recordings saved to Organizers OneDrive in GCC, GCCH, and DOD. By default, the recording saves to the organizer's OneDrive, even if the organizer did not attend the meeting or event. Co-organizers have the same editing permissions as organizers for recording files.&nbsp;</p><p>When the organizer doesn’t have a OneDrive account such as meetings scheduled using a shared mailbox, we will have a fallback logic to go through Organizer -&gt; Co-organizer (s) -&gt; Initiator -&gt; Async Media Storage (AMS).&nbsp;</p><p>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/51ab713b-5870-4d8a-96e9-1092e30ec438\" width=\"400\" height=\"\"></p><p><b>What you need to do to prepare:</b></p><p>Ensure -MeetingRecordingOwnership is set to MeetingOrganizer, which is the default value.</p><p> When the organizer doesn’t have a OneDrive account such as meetings scheduled using a shared mailbox, fallback logic is to automatically enable Organizer -&gt; Co-organizer (s) -&gt; Initiator -&gt; Async Media Storage (AMS) to determine the recording owner. The&nbsp;Who keeps recording<b> </b>feature will help you identify the recording owner in any situation.  \n</p><p>\n</p>\n<p></p>\n<p>You can find more information by visiting related documentation to understand convenience recording in Teams meeting experience:</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/teams-recording-policy\" target=\"_blank\">Introduction to recording Microsoft Teams calls and meetings</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/tmr-meeting-recording-change\" target=\"_blank\">Teams meeting recording and transcript storage and permissions in OneDrive and SharePoint</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is adding a feature to show the recording owner's information, ensuring participants can contact the correct person. It rolls out in March 2025. Recordings save to the organizer's OneDrive by default, with fallback logic for recording ownership if needed. Users should ensure the -MeetingRecordingOwnership setting is correct."
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC985482",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-22T02:03:35.07Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-22T02:03:11Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: More predictable recording experience with Who keeps recording",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
