{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 28, 2025: After further review we have decided not to proceed with this change at this time. We apologize for any inconvenience.\n</p><p>\n</p><p>We are introducing the App Management Unification Impact report, a new tool that offers administrators a comprehensive preview of changes to app and tenant settings before the implementation of the unified management of Microsoft Teams apps (MC796790). This report brings awareness to the expected changes, enabling admins to adjust settings in Teams admin center or Microsoft 365 admin center before unification is applied. The report is available only in tenants that have migrated to Microsoft App Centric management (MC688930).</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide):&nbsp; We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b>\n</p><p>The report will be available on the Manage Apps page in the Teams admin center to preview changes to app or tenant settings resulting from the upcoming release of unified app management.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/76e7d591-5c3e-45ed-9c77-0b7cef7a15b8\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Administrators should run the App Management Unification Impact report from the Manage Apps page in the Teams admin center. This report will display apps and agents listed in the Teams admin center along with their tenant settings and app availability values as well as those in the Integrated Apps page of the Microsoft 365 admin center. The report will show the projected unification outcomes for each app and agent, enabling administrators to preview changes resulting from the upcoming release of unified app management (announced in MC796790, roadmap item 393931). The report will use the merge logic previously shared in public documentation. Administrators may need to make changes in either the Teams admin center or Microsoft 365 admin center and coordinate with other departments.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft has decided not to proceed with the App Management Unification Impact report at this time. The report was intended to help administrators preview changes to app and tenant settings before the unified management of Microsoft Teams apps. Administrators should prepare by running the report to understand projected unification outcomes."
    }
  ],
  "EndDateTime": "2025-03-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC982569",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-28T16:33:56.693Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-18T00:37:02Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams admin center: App Management Unification Impact report",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
