{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Lists: A new admin control in Microsoft PowerShell to hide real-time Microsoft Lists collaborators at the site collection level.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Available now (since early December 2024).\n</p><p><b>How this will affect your organization:</b>\n</p><p>In MC891238<i> Microsoft SharePoint and Microsoft Teams: Update on new Microsoft Lists rollout </i>(published September 2024, updated November 2024), we rolled out the ability for users to see who is collaborating with them in real time. Before this rollout and by default, Lists shows real time collaborators next to <i>Filtering and Grouping</i> actions (in the upper right of the screen) and at the list-item level.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/abec75d2-4a5e-44be-9691-5e56d7ae71d9\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After this rollout: Based on customer feedback regarding privacy, admins can run the PowerShell command <code>Set-SPOSite -Identity -HidePeopleWhoHaveListsOpen $false</code> to disable this feature on a per-site collection basis, so users cannot see who is working on the List at the same time.\n</p><p>This admin control to hide collaborators is available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to:\n</p><ul><li>Inform your users about this upcoming feature and how it can enhance their workflow.\n</li><li>Ensure your Teams environment is updated to the latest version to take advantage of this new functionality.\n</li><li>Review your organization's policies and permissions related to sharing and accessing List data in Teams.\n</li><li>Update any relevant documentation.\n</li></ul><p>Learn more: <a href=\"https://learn.microsoft.com/powershell/module/sharepoint-online/set-sposite?view=sharepoint-ps\" target=\"_blank\">Set-SPOSite (Microsoft.Online.SharePoint.PowerShell) | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "107131"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Lists now offers admin control to hide real-time collaborators at the site collection level, available worldwide since early December 2024. Admins can use a PowerShell command to disable this feature for enhanced privacy. No action is required before the rollout."
    }
  ],
  "EndDateTime": "2025-03-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC982551",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-18T00:22:50.827Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-18T00:22:31Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Lists: Admin control to hide real-time list collaborators at site collection level",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
