{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft SharePoint: The new Preview mode can be used to understand how Pages and News posts will appear on different device types when viewed by an audience.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=473452\" target=\"_blank\">473452</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out late January 2025 and expect to complete by late February 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late February 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>After this rollout, a <i>Preview</i> button will display in the command bar while users are editing Pages and News posts in SharePoint. After selecting <i>Preview</i>, users can see what the page will look like in view mode for the audience. When previewing Pages, users can navigate between Desktop and Mobile device types. When previewing News posts, users can also choose to view the email version as Desktop or Mobile device types.\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b></p><p>You may want to notify users, update your user training, and prepare your help desk.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "473452"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC989979",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-28T01:13:08.063Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-28T01:12:56Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft SharePoint: New preview mode for Pages and News posts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
