{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon from Microsoft Purview Endpoint Data Loss Prevention: Support for restricting users from pasting sensitive content into a web browser on macOS devices using Microsoft Edge, Safari, Chrome or Firefox.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=476073\" target=\"_blank\">476073</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late February 2025 and expect to complete by late March 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 and expect to complete by early May 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, if an organization has configured DLP policies to restrict users from pasting sensitive content to browsers, the restriction only applies on Windows devices.</p><p>After this rollout, if an organization has configured DLP policies to restrict users from pasting sensitive content to browsers, the policies will automatically apply to macOS devices also.</p><p>Browser messages for users. Left: Microsoft Edge. Right: All other browsers:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/0ddfa20e-fad7-4463-9690-7cb31869e5a7\" style=\"width: 400px;\" alt=\"user message\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>There is no change required to your existing DLP policies as they will automatically include macOS devices in your organization.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/endpoint-dlp-learn-about#endpoint-activities-you-can-monitor-and-take-action-on\" target=\"_blank\">Learn about Endpoint data loss prevention | Microsoft Learn</a> for the full list of protections on macOS devices.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "476073"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is introducing a feature to restrict pasting sensitive content into browsers on macOS devices, complementing existing Windows device policies. The Public Preview begins late February 2025, with General Availability starting early April 2025. No admin action is required for this update. Roadmap ID: 476073."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC987324",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-24T00:33:12.993Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-24T00:32:50Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention: Paste to browser restriction on macOS device",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
