{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As first announced in MC958903 (December 2024), Microsoft 365 Copilot Chat (Copilot Chat)—our new, enterprise-ready AI chat with agents for Entra account users (formerly known as Microsoft Copilot)—is now starting to roll out to customers. Copilot Chat is available at no additional cost for Entra account users with a Microsoft 365 subscription.</p><p>For more information on the announcement, read the blog: <a href=\"https://aka.ms/CopilotChat\" target=\"_blank\">https://aka.ms/CopilotChat</a>&nbsp;&nbsp;</p><p><b>When this will happen:</b></p><p>General Availability: Starting today, January 15, 2025, Microsoft 365 Copilot Chat is rolling out to customers.</p><p><b>How this will affect your organization:</b></p><p>Copilot Chat offers: \n</p><ul><li>Secure, enterprise-ready AI chat powered by GPT-4o\n</li><li>Pay-as-you-go agents grounded in shared tenant data, accessible right in chat\n</li><li>IT controls for data governance and management of agents, including enterprise data protection.</li></ul><p>Agents that access your organization’s shared tenant data are off by default. Admins need to set up or use an existing Copilot Studio subscription to enable these agents. Once enabled, they will be billed based on metered consumption. Agents grounded in instructions, public websites, and uploaded files are available to use at no additional cost and will be default on. Agent availability will be based on your existing store settings for Teams and Microsoft 365 apps.\n</p><p><b>What you need to do to prepare:</b></p><p>Microsoft 365 Copilot Chat can be pinned within the new Microsoft 365 Copilot app (formerly the Microsoft 365 app), Microsoft Teams, and Outlook. Copilot Chat is also accessible on the web at <a href=\"https://m365copilot.com\" target=\"_blank\">m365copilot.com</a>.</p><p>To help your organization get the most out of the new Microsoft 365 Copilot Chat, we have updated the <a href=\"https://aka.ms/Copilot/SuccessKit\" target=\"_blank\">Copilot Success Kit</a> and added the new <a href=\"https://aka.ms/Copilot/ChatAgentStarterKit\" target=\"_blank\">Copilot Chat and Agent Starter Kit</a>. This includes:</p><ul><li><a href=\"https://aka.ms/Copilot/AgentOverviewGuide\" target=\"_blank\">Copilot Chat and agent overview guide</a> to help your users learn how to use agents to make Copilot Chat even more personalized and intelligent for their daily work.\n</li><li><a href=\"https://aka.ms/Copilot/ITControlsGuide\" target=\"_blank\">Copilot Chat and agent IT set up and controls guide</a> to plan, deploy, manage, and measure Microsoft 365 Copilot Chat in your organization.\n</li><li><a href=\"https://aka.ms/Copilot/UserEngagementTools\" target=\"_blank\">User engagement templates</a> in a variety of formats—including email, Viva Engage, and Teams—that you can leverage to communicate updates and new features to your users.</li></ul><p>Please also refer to documentation for Copilot Chat here: <a href=\"https://aka.ms/CopilotChatDocs\" target=\"_blank\">https://aka.ms/CopilotChatDocs</a>&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft 365 Copilot Chat is now available for Entra account users with a Microsoft 365 subscription at no extra cost. It offers secure AI chat, pay-as-you-go agents, and IT controls. Admins need to enable agents for shared tenant data, and resources are provided to assist with deployment and user engagement."
    }
  ],
  "EndDateTime": "2025-03-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC980252",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-15T14:30:48.363Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-15T14:30:12Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Copilot Chat rolling out, IT admin resources available",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
