{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 30, 2025: After further review we have decided not to proceed with this change at this time. We will communicate via Message center when we are ready to proceed. We apologize for any inconvenience.</p><p>Coming soon to Microsoft Purview | Data Loss Prevention (DLP): To provide greater flexibility to manage your organization’s DLP policy workflows, we are integrating DLP with Microsoft Power Automate. With this capability you will be able to trigger custom Power Automate workflows as a DLP policy action.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=380721\" target=\"_blank\">380721</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (GCC, GCC High, DoD): We will communicate via Message center when we are ready to proceed.</p><p><b>How this will affect your organization:</b>\n</p><p>With this feature, DLP admins will have the ability to execute custom workflows they have created in Power Automate when a DLP policy is violated.\n</p><p>1. Create a workflow in Power Automate using the DLP rule trigger:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/04ff327f-e16b-4e50-8ffd-2577de575f55\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>2. Add Run a Power Automate workflow as an action in a DLP rule:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f8c52774-3b42-4f1f-875f-9213253b1872\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Consider updating any training or reference material for your Data Loss Prevention admins and evaluate if you would like to use this new capability.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/dlp-powerautomate-int-get-started\" target=\"_blank\">Get started with Power Automate integration | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "380721"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview's integration of Data Loss Prevention (DLP) with Power Automate has been postponed. The feature will allow DLP admins to trigger custom workflows in Power Automate when a DLP policy is violated. The rollout will occur automatically, and further updates will be communicated via the Message center."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2026-03-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC989969",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-30T19:09:04.48Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-28T01:03:49Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Loss Prevention: Trigger Power Automate workflows after DLP rule match (GCC, GCC High, DoD)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
