{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We will retire the <code>Search-MailboxAuditLog</code> and <code>New-MailboxAuditLogSearch</code> cmdlets in Microsoft Exchange Online starting March 1, 2025, and completing in late March 2025. After the retirement, new records will be written to <code>Search-UnifiedAuditLog</code> and <code>Search-MailboxAuditLog</code> will be accessible only as a historical record.\n</p><p><b>How this will affect your organization:</b>\n</p><p>After the retirement, admins will be able to access <code>Search-MailboxAuditLog</code> and <code>New-MailboxAuditlogSearch</code> and make changes and downloads until late June 2025. After late June, <code>Search-MailboxAuditLog</code> and <code>New-MailboxAuditlogSearch</code> will become a static record only, and admins will no longer be able to make changes and downloads.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This change will happen automatically by the specified dates. Please notify your users about this change, update your relevant documentation, and share the alternate capability <code>Search-UnifiedAuditLog</code>.\n</p><p>\n</p><p>To use the <code>Search-UnifiedAuditLog</code> cmdlet, you must ensure auditing is enabled for your tenant.\n</p><p>Learn more about enabling auditing for your tenant and about the changes to these cmdlets: <a href=\"https://techcommunity.microsoft.com/blog/microsoftsecurityandcompliance/microsoft-exchange-online-search-mailboxauditlog-and-new-mailboxauditlogsearch-w/4366310\" target=\"_blank\">Microsoft Exchange Online: Search-MailboxAuditLog and New-MailboxAuditLogSearch will retire | Microsoft Community Hub</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The cmdlets `Search-MailboxAuditLog` and `New-MailboxAuditLogSearch` in Microsoft Exchange Online will retire in March 2025. Admins can access and modify records until late June 2025, after which they become static. Users should be notified, documentation updated, and auditing enabled to use `Search-UnifiedAuditLog`."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC982553",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-01-18T00:33:41.107Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-18T00:23:56Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Exchange Online: Search-MailboxAuditLog and New-MailboxAuditLogSearch will retire",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
