{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated April 15, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon from Microsoft Purview: If you have enabled full file evidence collection, Data Loss Prevention can copy a file that matches a DLP policy from onboarded macOS devices to a Microsoft Azure storage account.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=476098\" target=\"_blank\">476098</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out late February 2025 and expect to complete by late March 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late April 2025 (previously early April) and expect to complete by late May 2025 (previously early May).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout, if you enable full file evidence collection in Data Loss Prevention, a file that matches a DLP policy from onboarded macOS devices will not upload to a Microsoft Azure storage account.\n</p><p>In Data Loss Prevention, you can configure <i>Setup evidence collection for file activities on devices</i> to enable full file evidence collection:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2151b597-4d27-488d-8ca6-b59aeeccc198\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. If you have already enabled Full file evidence collection, macOS devices protected by endpoint DLP will automatically upload files after this rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>There is no change required to your existing DLP policies as they will automatically include macOS devices in your organization after this rollout.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/dlp-copy-matched-items-learn\" target=\"_blank\">Learn about collecting files that match DLP policies from devices | Microsoft Learn</a> for more details on evidence collection.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "476098"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview is updating the rollout timeline for Endpoint Data Loss Prevention's full file evidence collection on macOS devices. Public Preview will start in late February 2025, and General Availability will begin in late April 2025. No admin action is required, but user notification and documentation updates are recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-08-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC987322",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-04-15T16:13:23.96Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-24T00:31:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Endpoint Data Loss Prevention: Full file evidence collection on macOS devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
