{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 4, 2025: We have updated the image of the new experience to show as intended. Thank you for your patience.</p><p>Coming soon: To make the language more friendly and relevant for all users, we will update the user experience for \"More information required\" during authentication method registration (Microsoft Entra).\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early March 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Before this rollout: Before a user starts the process of registering a new method for multifactor authentication and/or account recovery, they typically encounter this screen first:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/54b7f37e-584e-4387-9f73-adf81ea6848c\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>After this rollout, users will encounter this new screen instead:\n</p><p><img src=\"https://cxcs.microsoft.net/file/ccp/en-us/4f885fa6-6e6c-4f1d-a385-74f79074ae8d\" width=\"400\" height=\"\">\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation that includes screenshots of the current UX.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra will update the \"More information required\" user interface during authentication method registration starting early March 2025, completing by late March 2025. The update will happen automatically with no admin action required. Notify users and update documentation as needed."
    }
  ],
  "EndDateTime": "2025-05-09T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC989965",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-04T20:46:05.307Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-28T01:00:24Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Entra: Updated \"More information required\" user interface during authentication method registration",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
