{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: New recommended comments marked as <i>Relevant for you</i> in some conversations in the home feed of the Microsoft Viva Engage web experience. This feature is designed help users find relevant, meaningful responses in large discussion threads.\n</p><p>The recommended comments feature is available to all users with an Engage license and is not a premium feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=420338\" target=\"_blank\">420338</a>.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): We will begin rolling out early February 2025 and expect to complete by late March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>The recommended comments feature enhances the conversation view in feeds, which shows the two most recent comments by default.\n</p><p>When conversations have a large volume of comments and replies relevant to the user, two <i>Relevant to you</i> comments will display as the default feed view. Users can select <i>Show more comments</i> to expand all comments in the thread:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/3f70d520-8bc0-4b3c-86b9-58c8e30688d8\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Zoomed-in view of the <i>Relevant to you </i>comments and the <i>Show more comments</i> feature:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1884d13f-5886-46b1-84db-143aaaa386af\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>Recommended views vary by user and may not appear on all conversation threads. Comments from a user’s leaders or close connections may show more often in the recommended view.\n</p><p>This change is available in the home feed of Engage on the web and on Windows desktop and the Engage app in Teams and Outlook. Conversations in community feeds are not affected by this change. \n</p><p>Network and Engage admins can turn off recommended comments in the Engage admin center. This feature is on by default:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7956033d-1523-4d6c-9375-deeaf07fc099\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout to enable or opt-in to this feature.\n</p><p>You may want to notify your users about this change and consider updating internal training and documentation to reflect this feature enhancement.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "420338"
    },
    {
      "Name": "Summary",
      "Value": "The new Microsoft Viva Engage feature will show 'Relevant for you' comments in the home feed to help users navigate large discussions. It's available to all Engage license holders, will roll out between February and March 2025, and requires no admin action for implementation."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC982552",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-18T00:23:37.007Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-18T00:23:27Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Viva Engage: New recommended comments feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
