{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to Microsoft Teams: Updates to make meeting transcripts more accurate and reliable. These improvements will also enhance the quality of live captions in Teams, Microsoft Copilot in Teams, and intelligent meeting recap for Microsoft Teams Premium users and users with a Copilot license, ensuring more accurate outputs and enhancing the overall experience of each feature.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=471426\" target=\"_blank\">471426</a>.\n</p><p>This message applies to Teams for Windows desktop and Teams for Mac desktop.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-February 2025 and expect to complete by late February 2025.\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out late February 2025 and expect to complete by early March 2025.\n</p><p>General Availability (GCC High, DoD): We will begin rolling out mid-March 2025 and expect to complete by late March 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Key changes in this rollout:\n</p><p><i>Setting the meeting spoken language up front: </i>Before starting features like <i>Recording, Transcription, </i>or <i>Copilot</i> that generate transcripts, users will be prompted to set the spoken language. Whether users enable these features manually or through <i>Meeting options</i>, this change ensures the transcription system starts with the correct language configuration.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/f6809bdd-d6ae-4814-8004-5e078842f9de\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><i>Limiting who can change the spoken language for a meeting: </i>When transcription is enabled, either on its own or as part of <i>Recording </i>or <i>Copilot, </i>only the meeting organizer, co-organizer, or the person who started the transcript will be allowed to change the spoken language. This ensures consistency and prevents issues caused by mismatched language settings. If transcription is not enabled, any meeting participant can change the spoken language.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/8c95669e-c376-4805-8b0e-374568e62534\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><i>Simplifying language settings:</i> Language settings and caption customization options are on separate screens, instead of overwhelming users with all options in a single screen.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/e1cc25af-c534-452d-ab87-7f14121e411d\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><i>Identifying language mismatches:</i> A <i>Language mismatch detected</i> notification will appear onscreen if the spoken language does not match the settings. Users can quickly resolve mismatches by confirming the system’s language suggestion directly from the notification, avoiding the need to navigate through settings.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/7a6db575-4031-49c2-adcd-86fe370bdd16\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>This change will be available to users by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with revised documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "471426"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing updates to enhance transcript accuracy and reliability, with rollout starting mid-February 2025 and completing by late March 2025. New features include setting the spoken language upfront, limiting language change permissions, simplifying language settings, and identifying language mismatches. No admin action is required for this update."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC981629",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-16T23:50:32.303Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-16T23:50:20Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams: Updates to make meeting transcripts more accurate and reliable",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
