{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Before this retirement, when <a href=\"https://learn.microsoft.com/graph/api/application-post-onlinemeetings?view=graph-rest-1.0&amp;tabs=http#example-3-create-an-online-meeting-that-doesnt-require-a-passcode\" target=\"_blank\">creating an online meeting using the Microsoft Graph API</a>, admins or users can choose whether to require a passcode. If no value is specified, the default behavior does not require a passcode.\n</p><p>After this update: For enhanced security, users will still have the option to specify whether a passcode is required when creating a meeting. If no value is specified, the default behavior will require a passcode for the meeting.\n</p><p>Effective February 24, 2025, the default value of the <code>isPasscodeRequired</code> property will change from <code>false </code>to <code>true</code>.\n</p><p><i>Update your applications</i>\n</p><p>Review and update any applications that use the Create onlineMeeting API and passcode to ensure they account for the new default behavior.\n</p><p><i>Looking ahead</i>\n</p><p>In October 2027, we will remove the option to specify the need for passcodes. This change will ensure that all meetings are consistently secured with passcodes. This final step will simplify the meeting creation process and provide an additional layer of protection for users. We will remove the <code>isPasscodeRequired</code> property on the <a href=\"https://learn.microsoft.com/graph/api/resources/joinmeetingidsettings?view=graph-rest-1.0\" target=\"_blank\">joinMeetingIdSettings</a> resource of the Microsoft Graph online meetings API.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Microsoft Graph API's Create Meeting API will require a passcode by default from February 24, 2025, changing the current default setting. In October 2027, the option to create meetings without passcodes will be removed for increased security. Users should update applications accordingly."
    }
  ],
  "EndDateTime": "2027-11-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC985483",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-01-22T02:05:30.777Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-22T02:03:58Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Graph: New default passcode in the Create Meeting API",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
