{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 7, 2025: We have postponed this release to ensure the proper customer experience. The rollout timeline has been updated below. Thank you for your patience.</p><p>We are pleased to inform you that we will roll out two improvements to enhance compliance and security for voicemail messages in Microsoft Exchange.\n</p><p>This change is related to three products: Microsoft Teams calls, Microsoft Outlook/Exchange, and Microsoft Skype for Business calls. Results will be visible in Outlook/Exchange email messages.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out early May 2025 and expect to complete by mid-June 2025.\n</p><p>General Availability (GCCH, DoD): We will begin rolling out mid-May 2025 and expect to complete by mid-June 2025.</p><p><b>How this will affect your organization:</b></p><p>1. The <i>From:</i> field of voicemail email messages will be updated to comply with the latest RFC standard, <a href=\"https://www.rfc-editor.org/rfc/rfc6854\" target=\"_blank\">RFC 6854: Update to Internet Message Format to Allow Group Syntax in the From: and Sender Header Fields</a>. According to this compliance standard, the Internet message format must always include an address in the <i>From</i> header field.\n</p><p>Example:\n</p><ul><li>Before this rollout: +44 28 7584 5695 &lt;442875845695&gt;\n</li><li>After this rollout: +44 28 7584 5695 (Unverified) &lt;noreply@skype.voicemail.microsoft.com&gt;\n</li></ul><p>2. To strengthen trust and security in voicemails received from external PSTN calls and from federated tenants, <i>Unverified</i> and <i>External</i> tags will always be added to the <i>From</i> field of voicemail messages in the mailbox.\n</p><p>\n</p><table>\n<tbody>\n<tr>\n<th>Voicemail message type</th>\n<th>Label</th>\n</tr><tr><td>Voicemail messages from external PSTN callers that are found in Entra ID contacts\n</td><td><i>External</i>\n</td></tr><tr><td>Voicemail messages from federated tenant callers that are found in the federated Entra ID contacts\n</td><td><i>External</i>\n</td></tr><tr><td>Voicemail messages from external PSTN callers that are not found in Entra ID contacts\n</td><td><i>Unverified</i>\n</td></tr><tr><td>Voicemail messages from anonymous callers, for example Skype calls without a phone number\n</td><td><i>Unverified</i>\n</td></tr></tbody></table>\n\n<p></p><p><b>Note:</b> This rollout applies to voicemail messages in Microsoft Exchange received from external PSTN calls and calls from federated tenants.\n</p><p>Example of the <i>From</i> field in voicemail message if PSTN caller was not found in Entra ID contacts:</p><ul><li>Before this rollout: +44 28 7584 5695</li><li>After this rollout: +44 28 7584 5695 (Unverified)\n</li></ul><p>Example of the <i>From</i> field in voicemail message if PSTN caller was found in Entra ID contacts:</p><ul><li>Before this rollout: John Smith\n</li><li>After this rollout: John Smith (External)\n</li></ul><p>Example of the <i>From</i> field in voicemail message for calls from federated tenant:\n</p><ul><li>Before this rollout: John Smith\n</li><li>After this rollout: John Smith (External)\n</li></ul><p>Example of the <i>From</i> field in voicemail message for anonymous Skype calls:</p><ul><li>Before this rollout: Anonymous\n</li><li>After this rollout: Anonymous (Unverified)\n</li></ul><p><b>Note:</b> Both improvements will always be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Enhanced compliance and security for voicemail messages in Microsoft Exchange will be rolled out from May to mid-June 2025. Changes include updating the \"From:\" field to comply with RFC 6854 and adding \"Unverified\" and \"External\" tags to increase trust and security. No admin action is required."
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC987329",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-07T17:48:10.593Z",
  "Services": [
    "Exchange Online",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-24T00:35:56Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Enhanced compliance and security in voicemail messages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
