{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: The installed name for new Microsoft Outlook for Windows will change from \"Outlook (new)\" to \"Outlook.\"\n</p><p>This rollout comes after a change to the classic Outlook in version 2407, previously announced in MC803006 <i>(Update) Outlook for Windows display name change</i> (published June 2024, updated August 2024), which added \"(classic)\" to the installed name to differentiate the two apps.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC): We will begin rolling out early February 2025 and expect to complete by late February 2025.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>Outlook in the Windows Start menu. Left: Before the name change. Right: After the name change:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/535f64c3-a82e-4469-9771-1c1020e439eb\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p>This change will be on by default. This part of the app identity is not customizable for organizations.\n</p><p>As always, we recommend planning your organization's migration to the new Outlook using the resources at <a href=\"https://aka.ms/newOutlookAdoption\" target=\"_blank\">https://aka.ms/newOutlookAdoption</a><a href=\"https://aka.ms/newOutlookAdoption\" target=\"_blank\"></a>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The new Microsoft Outlook for Windows will be renamed from \"Outlook (new)\" to \"Outlook\" starting early February 2025, with the rollout expected to complete by late February. This follows the addition of \"(classic)\" to the original Outlook version. No action is required from admins, but user notification is advised."
    }
  ],
  "EndDateTime": "2025-04-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC981624",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-16T23:46:45.857Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-16T23:46:32Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Outlook name change: \"Outlook (new)\" on Windows will change to \"Outlook\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
