{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Customers have asked us to reduce the size of the Microsoft Teams meeting recordings when exported from Microsoft Clipchamp. Due to the way Clipchamp encodes the files, the file size of these exports can be larger than the original files. To address this issue, we implemented an algorithm to optimize the Teams meeting recording videos without compromising quality. After this rollout, meeting recordings exported from Clipchamp will be efficiently compressed, making them easier to store and share.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): Available now. We began rolling out early January 2025 and completed in mid-January 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>This feature will be on by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Clipchamp now compresses Microsoft Teams meeting recordings for smaller file sizes without quality loss. This feature is globally available since mid-January 2025 and is enabled by default, requiring no admin action but may necessitate user notification and documentation updates."
    }
  ],
  "EndDateTime": "2025-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC985477",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-22T02:00:10.827Z",
  "Services": [
    "Microsoft Clipchamp "
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-22T01:59:59Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Clipchamp: Reduced file sizes for Microsoft Teams meeting recordings exported from Clipchamp",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
