{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 7, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are excited to announce the upcoming People administrator role in Microsoft Entra, designed to improve and streamline administrative capabilities in Microsoft 365. Developed from customer feedback, this role will provide dedicated permissions for managing people-related settings and profile photos without needing the high privileges of Global admin or User admin roles.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out early February 2025 and expect to complete by late March 2025 (previously late February).</p><p><b>How this will affect your organization:</b></p><p>After this rollout, admins will be able to assign the new People admin role to users in:\n</p><ul><li><a href=\"https://ms.portal.azure.com/#view/Microsoft_AAD_IAM/AllRolesBlade\" target=\"_blank\">Entra Portal</a>\n</li><li><a href=\"https://admin.microsoft.com/Adminportal/Home?#/homepage\" target=\"_blank\">Microsoft 365 Admin Center</a>\n</li></ul><p><i>What are the capabilities of the People admin role?</i>\n</p><ol><li>Update profile photos for all users, including admins.\n</li><li>Update people settings for pronouns and name pronunciation, Profile card settings, and photo update settings for all users.\n</li></ol><p><i>Why is this new role a better solution?</i>\n</p><p>The People admin role allows organizations to delegate people-related tasks more effectively and securely. By limiting access to necessary settings, it reduces risks associated with higher privilege roles and aligns with user jobs focused on people administration.\n</p><p>The People admin role will enable organizations to:\n</p><ul><li>Delegate tasks without giving excessive permissions to other admins.\n</li><li>Access new features and configurations in the People domain more easily.\n</li><li>Maintain security by avoiding the use of highly privileged roles for routine tasks.\n</li></ul><p>This role complements existing roles and enhances satisfaction with Microsoft administrative tools.\n</p><p><b>What you need to do to prepare:</b></p><p>We recommend admins:\n</p><ol><li>Review the People admin role documentation to understand its capabilities.\n</li><li>Assess current roles to identify where the new role fits.\n</li><li>Communicate changes to staff if needed, highlighting improved delegation and people-related access.\n</li><li>Review your current configuration to determine the impact on your organization.\n</li></ol><p>This rollout will happen automatically with no admin action required before the rollout. The People admin role will be available by default.\n</p><p><i>Learn more</i>\n</p><ul><li><a href=\"https://learn.microsoft.com/entra/identity/role-based-access-control/permissions-reference\" target=\"_blank\">Microsoft Entra built-in roles - Microsoft Entra ID | Microsoft Learn</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/microsoft-365/admin/add-users/about-admin-roles?view=o365-worldwide\" target=\"_blank\">About admin roles in the Microsoft 365 admin center - Microsoft 365 admin | Microsoft Learn</a> (will be updated before rollout)\n</li><li><a href=\"https://learn.microsoft.com/entra/identity/role-based-access-control/manage-roles-portal?tabs=admin-center\" target=\"_blank\">Assign Microsoft Entra roles - Microsoft Entra ID | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Entra is introducing a new People administrator role to enhance administrative capabilities in Microsoft 365. This role, based on customer feedback, allows management of people-related settings and profile photos without requiring high privileges. The rollout will begin in early February 2025 and complete by late March 2025."
    }
  ],
  "EndDateTime": "2025-05-05T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC992218",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-07T14:57:41.497Z",
  "Services": [
    "Microsoft Entra"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-30T00:34:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Entra: New People administrator role",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
