{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 4, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>We are excited to announce that users will soon be redirected to new streamlined and efficient home pages for Microsoft Word for the web, Microsoft Excel for the web, and Microsoft PowerPoint for the web (WXP). The new home pages are available now at:\n</p><ul><li><a href=\"https://word.cloud.microsoft\" target=\"_blank\">https://word.cloud.microsoft</a>\n</li><li><a href=\"https://excel.cloud.microsoft\" target=\"_blank\">https://excel.cloud.microsoft</a>\n</li><li><a href=\"https://powerpoint.cloud.microsoft\" target=\"_blank\">https://powerpoint.cloud.microsoft</a>\n</li></ul><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out in early April 2025 (previously late February) and expect to complete in late April 2025 (previously mid-March).\n</p><p>General Availability (Worldwide): We will begin rolling out late April 2025 (previously mid-March) and expect to complete by mid-May 2025 (previously late April).</p><p><b>How this will affect your organization</b>\n</p><p>During the rollout, some users will be taken to the new WXP homepages. The WXP entry points being changed are the Microsoft 365 app launcher, the Microsoft 365 AppBar, and the Microsoft 365 Apps page. The new homepages are offered in 39 languages with additional languages arriving in the coming months. The previous Microsoft 365 launch pages for WXP for the web will continue to be available at the existing URLs until after the rollout is complete.\n</p><p>App launcher showing the apps that will have new home pages:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/2f484c38-beea-4cf0-aaa1-820152cf3f92\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare</b>\n</p><p>There is no preparation needed by IT Admins. We appreciate your cooperation and look forward to providing you with an improved user experience.\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Word, Excel, and PowerPoint on the web will have new streamlined home pages. Rollout starts in early April 2025 for Targeted Release and late April 2025 for General Availability, completing by mid-May 2025. No action is required from IT Admins, but user notification is recommended."
    }
  ],
  "EndDateTime": "2025-07-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC994290",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-04T21:11:48.823Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-31T23:42:50Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Word, Microsoft Excel, and Microsoft PowerPoint on the web: Improved home pages",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
