{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 8, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>For Microsoft Teams town halls and webinars, presenters and attendees will no longer receive an updated email every time a presenter is added or removed or when incremental changes are made to the participants list for the event.</p><p>\n</p><p>\n</p><p><b>When this will happen:</b></p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out late May 2025 and expect to complete by late June 2025.</p><p><b>How this will affect your organization:</b></p><p>\n</p><p>Teams attendees and event participants no longer receive an email when the attendee list is updated. </p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Attendees and presenters in Microsoft Teams events will no longer receive emails when the attendee list is updated. This change will roll out from late May 2025 to late June 2025, requiring no admin action. Notify users and update documentation as needed."
    }
  ],
  "EndDateTime": "2025-08-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC999446",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-08T22:45:11.743Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-07T00:45:35Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "Microsoft Teams Events: Attendees and presenters no longer receive an email when an attendee list is updated",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
