{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 21, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Microsoft Teams will soon have a new location sharing setting that will allow users to grant location access to specific features. This change will affect emergency dynamic policy and the network bandwidth policy.\n</p><p>This message applies to Teams for Windows desktop (version 24H2 or greater) and Teams for Mac desktop. VDI clients will not be supported at this time.\n<b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early February 2025 and expect to complete by mid-February 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-March (previously late February) and expect to complete by early April 2025 (previously early March).</p><p><b>How this will affect your organization:</b></p><p>Before this rollout: Location access was governed exclusively at the operating system level. With this update, location consent will also be required from users at the individual application level. As a result, users gain more granular control over which specific application features can access their location.\n</p><p>After this rollout, Teams users can grant location access to certain Teams features. The setting for <i>IT insights for admins</i> feature are in Teams <i>Settings &gt; Privacy &gt; Location</i>. The setting for the <i>Emergency calls</i> feature is in the user's device's location settings. The user can find a link to their device's location settings in Teams <i>Settings &gt; Privacy &gt; Location:</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/8a2b2583-193d-4576-8c8f-0cca51e97e36\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p>If a user consented to location access before the rollout, the user will be prompted to confirm their selection in this new popup that will display after the next Teams version update. If a user has not previously consented, they will not see the popup and can adjust their preferences in <i>Settings.</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/17e58a37-125e-4761-98c4-2aa35808ca09\" style=\"width: 400px;\" alt=\"user settings\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p><b>NOTE:</b> After this rollout, dynamic emergency calling may not work as intended unless users allow location detection at the operating system level and app level. This dynamic emergency calling issue includes scenarios where admins have configured a network site for their users (location must be enabled by the user). To ensure emergency calls are properly routed to the nearest public safety answering point (PSAP), please advise your users to accept the new location requests from Teams. This also applies to users who may have consented to location access before the rollout.\n</p><p>You can communicate this requirement by setting the emergency service disclaimer with a custom message that will display in the Calls app in Teams. Ensuring that end users have location turned on is crucial for proper functioning of emergency calls and their safety. Learn more about sending a custom message: <a href=\"https://learn.microsoft.com/MicrosoftTeams/manage-emergency-calling-policies\" target=\"_blank\">Manage emergency calling policies in Microsoft Teams - Microsoft Teams | Microsoft Learn</a>\n</p><p>To continue managing video and media settings with the <a href=\"https://learn.microsoft.com/microsoftteams/network-roaming-policy\" target=\"_blank\">network roaming policy</a>, users must enable <i>Insights for IT admins</i> in Teams Settings <i>&gt; Privacy &gt; Location &gt; Insights for IT admins.</i>\n</p><p>Learn more about the changes to location services and privacy policies\n</p><ul><li><a href=\"https://support.microsoft.com/windows/windows-location-service-and-privacy-3a8eee0a-5b0b-dc07-eede-2a5ca1c49088\" target=\"_blank\">Windows location service and privacy - Microsoft Support</a>\n</li><li><a href=\"https://support.microsoft.com/office/enable-location-sharing-583dd649-87fc-4b23-aed6-f4e2279297f9\" target=\"_blank\">Enable location sharing - Microsoft Support</a> (will be updated before rollout)\n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. Please notify your users and admins about this change and update any relevant documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will introduce new location sharing settings for emergency calls and other features, affecting Windows and Mac desktop versions (not VDI clients). Rollout begins in February 2025 for targeted release and mid-March 2025 for general availability. Users must grant location access at both OS and app levels for proper emergency call routing."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC993226",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-21T19:41:46.993Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-31T01:05:00Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New location sharing settings for emergency calls and other features",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
