{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Users familiar with keyboard shortcuts from third-party chat and meeting applications can use those same shortcuts in Microsoft Teams. To enable this, go to the <i>Settings and more</i>&nbsp;button in the upper right, access the keyboard shortcuts dialog, and select a communication or meeting layout. This allows users to apply the shortcuts they are used to from other applications.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=472913\" target=\"_blank\">472913</a>.</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out mid-March 2025 and expect to complete by late March 2025.</p><p>General Availability (Worldwide): We will begin rolling out early April 2025 and expect to complete by mid-April 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Users in your organization can now customize their keyboard shortcut layout to better suit their preferences in Teams.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "472913"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-05-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC992216",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-30T00:32:50.87Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-30T00:32:41Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Third-party chat and meeting keyboard shortcut support",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
