{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 28, 2025: We have updated the rollout timeline below. Thank you for your patience.</p><p>Coming soon for Microsoft Purview | Data Lifecycle Management: Admins will be able to apply a retention policy or retention label in Microsoft OneDrive and Microsoft SharePoint for files that have not been accessed by anyone in your organization for a specified period of time. This message applies to retention for Microsoft 365 file types. We will support other file types (non-Microsoft 365) in a future rollout.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=472030\" target=\"_blank\">472030</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out mid-February 2025 and expect to complete by late February 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late September 2025 (previously mid-March) and expect to complete by late October 2025 (previously late March).\n</p><p><b>How this will affect your organization:</b>\n</p><p>This feature will help delete obsolete data, which will improve the quality and relevance of Microsoft 365 Copilot responses.\n</p><p>This feature will be available by default.\n</p><p>After the rollout, admins can use the retention control <i>When items were last accessed</i> when configuring labels and policies.\n</p><p><i>Retention settings</i> page in Purview with the new “last accessed” option for retention policies:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/b4c0f80c-8eaa-4604-a7d4-abaefbd51945\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Before rollout, we will update this post with new documentation.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "472030"
    },
    {
      "Name": "Summary",
      "Value": "Admins will soon be able to apply retention policies based on the \"last accessed\" date for OneDrive and SharePoint files in Microsoft Purview. This feature will be available in public preview in February 2025 and generally available worldwide by October 2025. No admin action is required before the rollout."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-12-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC999442",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-28T16:19:09.083Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-07T00:43:46Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Lifecycle Management: Retention based on “last accessed” for OneDrive and SharePoint files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
