{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated May 15, 2025: We have updated the timeline below. Thank you for your patience.\n</p><p>For Microsoft Teams, in the Queues app, authorized users will be able to enter into a monitoring session for private coaching.  They can listen to customer calls, whisper to the agents for private messages, and barge into or takeover the call.&nbsp;&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=473884\" target=\"_blank\">473884</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early April 2025 (previously mid-March) for and expect to complete by mid-April 2025 (previously early April).</p><p>General Availability (Worldwide, GCC): We will begin rolling out late April 2025 and expect to complete by late May 2025 (previously early May).</p><p><b>How this will affect your organization:</b></p><p>In the Teams Queues app, authorized users will now have access to selected capabilities for private coaching.</p><ul><li>Monitor</li><li>Whisper</li><li>Barge</li><li>Takeover</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "473884"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Queues app will add Monitor, Whisper, Barge, and Takeover features for private coaching. Rollout starts early April 2025 and completes by late May 2025. No admin action is required, but user notification and documentation updates are recommended."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac"
    }
  ],
  "EndDateTime": "2025-06-16T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC999443",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-05-15T22:06:46.49Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-07T00:44:32Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Queues app to add Monitor, Whisper, Barge, and Takeover",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
