{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to new Microsoft Outlook for Windows desktop and Microsoft Outlook for the web: Users can <a href=\"https://support.microsoft.com/office/use-categories-in-outlook-87f27f03-4d9f-48dd-9623-2702692a4480\" target=\"_blank\">categorize</a> individual emails in conversation view to enhance organization and tracking.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=416450\" target=\"_blank\">416450</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We began rolling out early January 2025 and expect to complete by late February 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late February 2025 and expect to complete by late March 2025.\n</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late March 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b></p><p>To use the conversation view, users can go to the Outlook ribbon and select <i>View &gt; Messages &gt; Conversation &gt; Group into conversations</i>\n</p><p>To categorize an individual email, a user must select the <i>Group into conversations</i> option. Then, in the list of emails, expand a conversation and right-click the individual email to be categorized, select the <i>Categorize </i>option, and choose the category (or categories). The selected category will display in the individual email and in the email header and the reading pane.\n</p><p>Deleting a category from the message header or from the reading pane will remove the category applied to any individual emails in that conversation.\n</p><p>This change will be available by default.\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://support.microsoft.com/office/use-categories-in-outlook-87f27f03-4d9f-48dd-9623-2702692a4480\" target=\"_blank\">Use categories in Outlook - Microsoft Support</a>\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "416450"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC997580",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-05T01:43:35.47Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-05T01:43:10Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows and web: Categorize individual emails in conversation view",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
