{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon to new Microsoft Outlook for Windows desktop and Microsoft Outlook for the web: Users can customize folder icon colors, making it easier to visually differentiate and personalize folders.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=472921\" target=\"_blank\">472921</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release: We will begin rolling out early February 2025 and expect to complete by late February 2025.\n</p><p>General Availability (Worldwide): We will begin rolling out late March 2025 and expect to complete by late March 2025.\n</p><p>General Availability (GCC, GCC High, DoD): We will begin rolling out late April 2025 and expect to complete by late April 2025.\n</p><p><b>How this will affect your organization:</b></p><p>After this rollout, this feature will be available for all Outlook accounts except for shared mailboxes and shared folders. Colors work for light and dark mode. <b>Note: </b>Some Outlook themes will have low contrast with some folder colors.\n</p><p>To change the color of a folder, a user can hover over the folder name, select the three-dot menu, select <i>Change color</i> and then choose a color.\n</p><p>To turn off the color, follow the same process, and select <i>Automatic</i>.\n</p><p>The folder color will display in the list of folders and in <i>Favorites </i>if the colored folder is added to <i>Favorites.</i>\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/1025fb78-ed5f-41f6-b2b0-1e792441a408\" style=\"width: 400px;\" alt=\"user controls\">\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before or after the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your users about this change and update any relevant documentation.\n</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "472921"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2025-06-27T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC993229",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-31T01:06:37.447Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-31T01:06:29Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows and web: New folder color feature",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
