{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The existing \"Personal Information Removal\" setting is often used by commercial users to purge a file before sharing it with their customers. When users try to start a new file by copying an old file, this setting is currently carried over. Some users are not aware of it and, therefore, get confused when they collaborate on the new file. For example, their actual names (part of personal information) are automatically replaced by the generic \"Author\" in their comments. We are reducing this confusion by notifying users that this setting is enabled and offering a way to disable it.</p><p>When a file is opened for edit (not applicable for read-only files), if the \"Personal Information Removal\" setting is checked for the file, PowerPoint app displays the message <i>This document is set to automatically remove personal information when saved and can impact your collaboration experience. Only keep this setting if needed</i>. This message also comes with a \"Change setting\" button to disable the \"Personal Information Removal\" setting.</p><p><img src=\" https://cxcs.microsoft.net/file/messagecenter/en-us/891d39cc-6f3e-4c13-af6e-4a5d0ad5179e\" style=\"width: 700px;\"><span style=\"background-color: rgb(255, 156, 0);\"><i><br></i></span></p><p><i><b>When this will happen:</b></i></p><p><span style=\"background-color: rgb(255, 156, 0);\"><i>\n</i></span></p><p>Public Preview: We will begin rolling out late February 2025 and expect to complete by early March 2025.</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out mid-March 2025 and expect to complete by late March 2025.</p><p><b>How this will affect your organization:</b></p><p>This is a notification to make users aware of the \"Personal Information Removal\" document setting being enabled and providing a way for users to change this document setting. The existing way of changing this document setting via the Options dialog remains intact.</p><p>This feature update will be available by default.</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC996584",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-04T00:06:55.147Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-04T00:06:38Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "\"Personal Information Removal\" notification for files",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
