{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>New Outlook for Windows users will be able to group messages as a conversation for emails within Outlook Data File (.pst or Personal Storage Table file). Future releases of new Outlook for Windows will expand the support for .pst file capabilities.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://cch.azureedge.net/feature/96459/roadmap/479412\" target=\"_blank\">479412</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early February 2025 and expect to complete by mid-March 2025.</p><p>General Availability (Worldwide): We will begin rolling out mid-March 2025 and expect to complete by early April 2025.</p><p>General Availability (GCC): We will begin rolling out early April 2025 and expect to complete by early May 2025</p><p><b>How this will affect your organization:</b></p><p>Outlook Data File (.pst) support is enabled by default in new Outlook for Windows. If you organization wants to block or limit Outlook Data File support, set the <code>OutlookDataFile </code>mailbox policy. Learn more: <a href=\"https://learn.microsoft.com/powershell/module/exchange/set-owamailboxpolicy?view=exchange-ps#-outlookdatafile\" target=\"_blank\">Set-OwaMailboxPolicy (ExchangePowerShell)</a></p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required. You may want to notify your users about this change and update any relevant documentation.</p><p>Before rollout, we will update this post with revised documentation.</p><p>#newoutlookforwindows</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "479412"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-06-23T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC999441",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-02-07T00:43:26.403Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-07T00:43:16Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "New Microsoft Outlook for Windows: Group messages as a conversation for emails within Outlook Data File",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
