{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 7, 2025: Microsoft is updating its policies regarding the sharing of user location data to enhance privacy, improve data security, and ensure compliance with evolving regulatory standards.&nbsp;&nbsp;</p><p>To enhance transparency and user control, Teams is introducing a new location consent experience that gives users the choice of when and how Teams can use their location data (specifically SSID &amp; BSSID).</p><p>Please refer to the public documentation that will be published shortly.</p><p>This message applies to Teams for Windows desktop (version 24H2 or greater) and Teams for Mac desktop. VDI clients will not be supported at this time.\n</p><p><b>When this will happen:</b>\n</p><p>Targeted Release:&nbsp; We will begin rolling out mid-March 2025 (previously mid-March) and expect to complete by late March 2025 (previously early April).</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late March (previously mid-March) and expect to complete by early April 2025 (previously early March).</p><p><b>How this will affect your organization:</b></p><p>All new and existing Teams for Work users within your organization will be prompted to specify if they want to keep location detection on for<b> emergency calls only</b>, or if they consent to allowing location access used for <b>IT Admin Insights or troubleshooting</b>&nbsp;ex via tooling such as <a href=\"https://learn.microsoft.com/microsoftteams/cqd-what-is-call-quality-dashboard\" target=\"_blank\">Call Quality Dashboard </a>or <a href=\"https://learn.microsoft.com/microsoftteams/configure-dynamic-emergency-calling\" target=\"_blank\">Network and Locations matching via BSSID</a> for emergency calling location.&nbsp;</p><p><b>Important Note</b> - The new Teams location consent flow <b>does not apply to fully managed devices where users are restricted from user granted location access</b>. You can expect current policies to continue working as expected, and users will not be prompted with any of the new location consent dialogs.&nbsp;</p><p>The new Teams location consent changes will impact the following Teams features:&nbsp;</p><ol><li>Emergency Calling&nbsp;</li><li>Location Based Routing&nbsp;</li><li><a href=\"https://learn.microsoft.com/microsoftteams/configure-dynamic-emergency-calling\" target=\"_blank\">Network and Locations matching via BSSID&nbsp;</a> </li><li>Call Quality Dashboard&nbsp;</li></ol><p>For all new Teams for Work users, they will first be prompted with an operating system level consent dialog, requesting location permission granting.&nbsp; &nbsp;</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/919dacce-ab12-499f-a245-fe21391cccdd/534933c47e9f78b8852d5eca56c73d18e3f596fe.png\" style=\"width: 498.997px;\"><br></p><ul><li>Existing Teams for Work users who had previously accepted or denied operating system level consent for location will not see this dialog a second time. </li><li>If location access is<b> allowed,</b> dynamic emergency calling policies will work as configured, and users enabled for Location Based Routing will be able to make and receive PSTN calls. </li><li>If location access is<b> disallowed</b>, several Teams Call Quality Dashboard metrics will be impacted, and Network and Location matching via BSSID from dynamic emergency calling policies will not work. </li><li>Users can still manually add their physical address for emergency calls via the Teams Calls app if an admin has enabled ExternalLookupMode for their users.</li></ul><p>Immediately after consenting to allow location access at the operating system level (or for those who had previously consented to location access), both new and existing Teams for Work users will be presented with a new Teams app level location permission dialog.</p><p><img src=\"https://cxcs.microsoft.net/static/public/messagecenter/neutral/72a1e542-3c70-478f-9555-0ec3ba4ea448/e312694f82bc596dd584a853dd4f63eac531a70b.png\" style=\"width: 582.005px;\"><br></p><p>Users must choose between \"Allow all,\" which grants Teams full location access used for emergency calls and for IT Admin insights and troubleshooting, or \"Keep emergency only,\" which restricts location usage to emergency calling purposes. It is important to note only end users who are configured for a dynamic emergency calling policy will see this version of the dialog. Users without ExternalLookUpMode enabled will see a slightly different version of this in-app consent dialog that excludes emergency calling. Users can modify their operating system or app level location detection preferences at any time via Teams settings under Privacy &gt; Location. On fully managed devices, these settings will be ON by default and can only be disabled via the OS level location setting.</p><p><b>What you need to do to prepare:</b>\n</p><p>Please educate your users on these selections and what works best for your tenant.  \n</p><ol><li>If you regularly use the Call Quality Dashboard or leverage Network and Location matching via BSSID, you may want to recommend that users allow location access for those options, otherwise a user’s location data will no longer flow through to these services.  \n</li><li>For emergency calling, you can communicate these changes by setting the emergency service disclaimer with a custom message that will display in the Calls App in Teams. Ensuring that end users have location turned on is crucial for proper functioning of emergency calls and their safety. <a href=\"https://learn.microsoft.com/MicrosoftTeams/manage-emergency-calling-policies\" target=\"_blank\">Learn more about sending a custom message: Manage emergency calling policies in Microsoft Teams - Microsoft Teams | Microsoft Learn</a> \n</li></ol><p>Learn more about the changes to location services and privacy policies:  \n</p><ul><li><a href=\"https://support.microsoft.com/windows/windows-location-service-and-privacy-3a8eee0a-5b0b-dc07-eede-2a5ca1c49088\" target=\"_blank\">Windows location service and privacy - Microsoft Support</a> \n</li><li><a href=\"https://support.microsoft.com/office/enable-location-sharing-583dd649-87fc-4b23-aed6-f4e2279297f9\" target=\"_blank\">Enable location sharing - Microsoft Support</a> (will be updated before rollout) \n</li><li><a href=\"https://learn.microsoft.com/windows/win32/nativewifi/wi-fi-access-location-changes\" target=\"_blank\">WiFi Access Location changes – Microsoft Learn</a> \n</li></ul><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. Please notify your users and admins about this change and update any relevant documentation.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating its location sharing settings for emergency calls, introducing a new consent experience for users to control location data usage. This applies to Teams for Windows and Mac desktop but not VDI clients. The rollout starts mid-March 2025 and completes by early April 2025."
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC993226",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-07T20:12:02.423Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-31T01:05:00Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New location sharing settings for emergency calls and other features",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
