{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated March 3, 2025: We have updated the content. Thank you for your patience.</p><p>Coming soon for Microsoft Teams: When you have several peripheral devices connected to Teams, the one you use to answer a call will temporarily become the main device that will sync with Teams when using the device's buttons. After the call, the original device selected in Teams settings will take over again as the main device. After this rollout, users can use multiple native Bluetooth devices can be confident that call controls will function correctly with all of them.</p><p>This message applies to Teams for Windows desktop.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=475853\" target=\"_blank\">475853</a>.</p><p><b>When this will happen:</b></p><p>Targeted Release: We will begin rolling out early March 2025 and expect to complete by late March 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High): We will begin rolling out mid-March&nbsp;2025 and expect to complete by mid-April&nbsp;2025.</p><p><b>How this will affect your organization:</b></p><p>After this rollout, users will be able to switch between their connected peripheral devices when answering a call without manually changing the selected device in Teams settings.&nbsp;</p><p>This change will be available by default.</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.</p><p>\n</p><p>Learn more: </p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/devices/usb-devices?tabs=usb\" target=\"_blank\" style=\"\">Phones and Devices for Microsoft Teams - Microsoft Teams | Microsoft Learn</a></li><li><a href=\"https://learn.microsoft.com/microsoftteams/devices/personal-peripherals\" target=\"_blank\">Personal peripherals for Microsoft Teams - Microsoft Teams | Microsoft Learn</a></li></ul><p><br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "475853"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"475853\":[{\"RoadmapId\":475853,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-01-31T10:14:24.5764794Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":475853,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2025-01-31T10:14:24.5764795Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams will soon support native Bluetooth call controls for multiple peripheral devices on Windows desktop. The device used to answer a call will temporarily become the main device. This feature will roll out from early March to mid-April 2025. No admin action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2025-06-02T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC993227",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-03-04T15:00:56.447Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-31T01:05:50Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Native Bluetooth call controls using hands-free protocol for multiple peripheral devices",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
