{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 5, 2025: We have updated the timeline below. Thank you for your patience.</p><p>Coming soon to Microsoft Purview Insider Risk Management (IRM) admins will be able to select Data Loss Prevention (DLP) alerts as indicators in IRM policies. After this rollout, IRM admins can select DLP policies that they would like to bring into IRM and detect if a user has alerts for the pre-selected DLP policies. When an IRM alert is generated, admin and analysts can see if there are any high-risk alerts for this user within DLP for the policies that are enabled as indicators. This feature will help admins and analysts view this information in IRM without switching to DLP.\n</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=475057\" target=\"_blank\">475057</a>.\n</p><p><b>When this will happen:</b>\n</p><p>Public Preview: We will begin rolling out early March 2025 and expect to complete by late March 2025.\n</p><p>General Availability (Worldwide, GCC, GCC High, DoD): We will begin rolling out late May 2025 and expect to complete by late July 2025 (previously mid-June).\n</p><p><b>How this will affect your organization:</b>\n</p><p>Admins will be able to enable this indicator in IRM’s global settings for policy indicators. When enabled, this indicator can be selected in the Data Theft by departing users, Data leaks, Data leaks by risky users, Data leaks by priority users, and Risky AI Usage policy templates.</p><p><i>Using the indicator</i>\n</p><p>1. In Settings &gt;<i> Insider Risk Management &gt; Policy indicat</i>ors<i> &gt;</i> <i>Built-in Indicators:</i> Open the <i>Data loss prevention (DLP) alerts indicators (preview)</i> drop-down menu. Select <i>Add DLP policies</i> and choose the DLP policies to bring into IRM. Check the box for <i>Generating alerts from selected DLP policies</i>. Save the changes. <b>Note:</b> This indicator will not work if no DLP policies are added and if the checkbox is not selected.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/cf27002a-4301-4faa-9b15-5d53c08e2d5f\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>2. To use in a policy: In the policy wizard for <i>Data theft by departing users, Data leaks, Data leaks by risky users, Data leaks by priority users, </i>and <i>Risky AI usage </i>policy templates, configure the policies as applicable until you get to the <i>Indicators </i>page. Open the <i>Data loss prevention (DLP) alerts indicators (preview)</i> drop-down menu and check the box for <i>Generating alerts from selected DLP policies.</i> Configure the rest of the policy as applicable.\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/09104794-7ea7-47bd-ac04-4e33bf3433cb\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>3. Example of an alert generated by this indicator:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/47c2c580-c712-4d9b-8a31-cbed462035c6\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>The indicator will be available by default for admins to configure.\n</p><p><b>What you need to do to prepare:</b></p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. Review your current configuration to determine the impact for your organization. You may want to notify your admins about this change and update any relevant documentation.\n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators?tabs=purview-portal\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a> (will be updated before rollout)</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "475057"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview Insider Risk Management will soon allow admins to select Data Loss Prevention (DLP) alerts as indicators in IRM policies. This feature will roll out in March 2025 (Public Preview) and May-July 2025 (General Availability). Admins can configure this in IRM settings and relevant policy templates. No pre-rollout action is required."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-09-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC990961",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-06-05T17:39:50.84Z",
  "Services": [
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-29T00:39:43Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Insider Risk Management: DLP alerts as indicators",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
