{
  "ActionRequiredByDateTime": "2025-03-07T08:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We want to announce an upcoming change in the behavior of an existing tenant setting in Fabric that lets Fabric admins enable SQL database in their Fabric tenant. We will be introducing a checkbox on February 8, 2025, for tenant admins to accept Microsoft’s default selection (off for entire organization) for this specific setting. The default value for this setting will be turned on or after March 8th if Fabric admins do not take any action.</p><p>This update helps enhance visibility and ease of access for our customers, ensuring you're aware of and can leverage this functionality effortlessly. \n</p><p>Note also, billing for compute usage and data storage for SQL databases in Fabric commenced after February 1st, with backup charges following after April 1st. For the latest updates on billing practices and to ensure you are fully informed on how charges are applied, please refer to the following detailed blog post: Monitor SQL database usage and consumption in Microsoft Fabric.</p><p>\n</p><p><i>Why are we updating this setting?</i></p><p><b>  \n</b></p><p>The update to our tenant settings is designed to ensure Fabric admins can act based on their organizational policy before the setting is enabled by default. From February 8, 2025, when the checkbox is available to March 8, 2025, admins can assess impact and act on enablement. By setting SQL database in Fabric as a default option, we ensure that you don’t miss out on leveraging its full potential right from the start. This change reflects our commitment to enhancing user experience and operational efficiency.</p><p><b>When This Will Happen:</b></p><p><b> \n</b></p><ol><li>The default activation of the checkbox for SQL database in Fabric is scheduled to commence on March 8th, 2025\n</li><li>Billing for compute and data storage for SQL databases in Fabric commenced after February 1, 2025. Backup charges will commence after April 1, 2025.\n</li></ol><p><b>What You Need to Prepare:</b></p><ol><li>Review and Decide on Settings:<ul><li>Enable SQL database in Fabric by Default: As this setting is ON by default, please review its implications and decide if it should be enabled for your organization.</li></ul></li><li>Action for M365 and Fabric Admins:<ul><li>If no actions are taken on the tenant setting, SQL database in Fabric will remain active for all users, enhancing accessibility to database functionalities. If your organization prefers not to have this setting enabled by default, tenant admins must manually turn OFF this setting within the next 30 days.</li><li>We encourage you to assess these new settings and make any necessary changes to align with your organization's compliance and data storage policies.</li></ul></li><li>Review and Prepare for Billing Start:<ul><li>As billing for compute and data storage commenced after February 1, 2025, and backup charges will commence after April 1, 2025, it is essential to conduct a comprehensive review of your current and projected usage to anticipate charges.\n</li></ul></li></ol><p>If you have any questions or need further assistance, please do not hesitate to contact our support team.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-04-08T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC996579",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2025-02-04T00:04:32.94Z",
  "Services": [
    "Power BI"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-02-04T00:04:21Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Communications on default checkbox changes on tenant settings and billing start for SQL database in Fabric",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
