{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon: We will introduce a new Microsoft Teams PowerShell setting in Tenant Federation Configuration to enable you to customize your federation posture. Tenant administrators will be able to define a list of external trial tenants to be whitelisted for federation, while maintaining the default block on overall federation with trial-only tenants.\n</p><p><b>When this will happen:</b>\n</p><p>General Availability (Worldwide): The new setting is available now in Teams PowerShell. If populated, the allowed trial tenant domains list will start to take effect in mid-February 2025.\n</p><p><b>Note:</b> This feature requires no immediate admin action, and there will be no impact if the list is not populated.\n</p><p><b>How this will affect your organization:</b>\n</p><p>Microsoft Teams introduced a new PowerShell setting (<code>-ExternalAccessWithTrialTenants</code>) to the <code>Set-CsTenantFederationConfiguration</code> cmdlet in August 2024 that enabled blocking all external access with trial-only tenants. \n</p><p>Now, we’re introducing a new Tenant federation setting <code>-AllowedTrialTenantDomains</code> to enable more granularity in defining the federation posture for your organization. This setting will allow you to keep federation with trial-only tenants blocked, while explicitly allowing federation with trial tenant domains you trust and collaborate with for valid business needs.\n</p><p><i>Important notes</i></p><ul><li>A \"trial-only\" tenant is defined as a tenant with a Teams service plan that has only Trial subscriptions (0 purchased licenses).\n</li><li>Cross-cloud experience: Currently, all cross-cloud communication involving trial-only tenants in public clouds is blocked by default. The <code>AllowedTrialTenantDomains</code> setting will not be supported for cross-cloud communication.\n</li><li>This setting is only supported in PowerShell.\n</li></ul><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout. You may want to notify your users about this change and update any relevant documentation.\n</p><ul><li>Review your settings for external access to determine if you have a valid business need to allow federation with trial-only tenants and then prepare the whitelist.\n</li><li>Download or upgrade to the latest PowerShell package (6.7 or higher): <a href=\"https://www.powershellgallery.com/packages/MicrosoftTeams/\" target=\"_blank\">https://www.powershellgallery.com/packages/MicrosoftTeams/</a>\n</li><li>To block external communication with trial-only tenants, use: <code>Set-CsTenantFederationConfiguration -ExternalAccessWithTrialTenants \"Blocked\"</code>\n</li><li>To allow external communication with specific trial-only tenants, while blocking it by default for most trial-only tenants, use:</li></ul><p><code>$list = New-Object Collections.Generic.List<b>String</b></code>\n</p><p><code>$list.add(\"contoso.com\")</code>\n</p><p><code>$list.add(\"fabrikam.com\")</code>\n</p><p><code>Set-CsTenantFederationConfiguration -AllowedTrialTenantDomains $list</code>\n</p><ul><li>To remove tenants from the <code>AllowedTrialTenantDomains</code> list, use:\n</li></ul><p><code>$list = New-Object Collections.Generic.List<b>String</b>\n</code></p><p><code>$list.add(\"contoso.com\")\n</code></p><p><code>Set-CsTenantFederationConfiguration -AllowedTrialTenantDomains @{Remove=$list}\n</code></p><ul><li>To allow external communication with all trial-only tenants, use:\n</li></ul><p><code>Set-CsTenantFederationConfiguration -ExternalAccessWithTrialTenants \"Allowed\"</code>\n</p><p><i>Learn more</i>\n</p><ul><li>PowerShell cmdlet configuration: <a href=\"https://learn.microsoft.com/powershell/module/teams/set-cstenantfederationconfiguration?view=teams-ps\" target=\"_blank\">Set-CsTenantFederationConfiguration | Microsoft Learn</a>\n</li><li>Manage external communication: <a href=\"https://learn.microsoft.com/microsoftteams/trusted-organizations-external-meetings-chat?tabs=organization-settings\" target=\"_blank\">IT Admins - Manage external meetings and chat with people and organizations using Microsoft identities - Microsoft Teams | Microsoft Learn</a></li></ul><p></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2025-06-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC994289",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-31T23:42:34.537Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-31T23:42:23Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Microsoft PowerShell cmdlet to allow federation with specific trial tenant domains",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
