{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Coming soon for Microsoft Defender for Cloud Apps:\n</p><ul><li>A change to alerts generated by events originating from Defender for Cloud Apps that are generated in the Microsoft Defender XDR detection engine\n</li><li>A change to App governance alerts\n</li></ul><p>This rollout aims to provide more accurate and precise information on the origin of these alerts, enabling customers to identify, manage, and respond to alerts more effectively. \n</p><p><b>When this will happen:</b>\n</p><p>General Availability (GCC, GCC High, DoD, Production, DoD): We will begin rolling out early March 2025 and expect to complete by early April 2025.\n</p><p><b>How this will affect your organization:</b>\n</p><p>We will change the field indicating the alert source in the alert data itself.<b> Note: </b>The rollout will only affect new alerts generated after the rollout and will not alter existing alerts.\n</p><p>This rollout will be reflected in all experiences where alerts are represented, including <i>Incidents &amp; alerts</i> queues in the XDR portal, <i>Advanced hunting</i>, and the correlating APIs and SIEM systems.\n</p><p>In the Defender XDR portal, the change will be reflected in the Service sources field, replacing the current Microsoft Defender XDR and App governance values with the new value Defender for Cloud Apps. The detection sources will remain unchanged and will continue to indicate the detections are generated in the XDR detection engine, App governance policy, or App governance detection.\n</p><p>The alert ID prepended characters of some of the alerts will also be changed to comply with the Defender XDR mapping.\n</p><p>Service/Detection sources filter in the Incidents queue. Left: Before the change. Right: After the change:\n</p><p><img src=\"https://cxcs.microsoft.net/file/messagecenter/en-us/0cd40329-2d25-4b53-a5f3-3192e47c4293\" style=\"width: 400px;\" alt=\"admin controls\">\n</p><p>Learn more about the different alert sources in Defender XDR in the <i>Alert sources</i> section of <a href=\"https://learn.microsoft.com/defender-xdr/investigate-alerts?tabs=settings#alert-sources\" target=\"_blank\">Investigate alerts in Microsoft Defender XDR - Microsoft Defender XDR | Microsoft Learn</a>\n</p><p>In the Microsoft Graph API, Microsoft Defender for Endpoint streaming API, and the Microsoft Azure Events Hub, the change will be reflected in the alert resource type under the property <code>serviceSource</code>, and the previous values of <code>microsoft365Defender</code> and <code>microsoftAppGovernance</code> will change to <code>microsoftDefenderForCloudApps</code>.\n</p><p>Learn more about the Graph API alert resource: <a href=\"https://learn.microsoft.com/graph/api/resources/security-alert?view=graph-rest-1.0\" target=\"_blank\">alert resource type - Microsoft Graph v1.0 | Microsoft Learn</a>\n</p><p>Learn more about Streaming API: <a href=\"https://learn.microsoft.com/defender-xdr/streaming-api\" target=\"_blank\">Stream Microsoft Defender XDR events - Microsoft Defender XDR | Microsoft Learn</a>\n</p><p><b>What you need to do to prepare:</b>\n</p><p>This rollout will happen automatically by the specified date with no admin action required before the rollout.\n</p><p>Administrators should review and update any custom alert rules, playbooks, or automations involving the alerts mentioned above (Service sources = Microsoft Defender XDR and Detection sources = Defender XDR, or Service sources = App governance), to ensure they reflect the new value. You may also want to notify your users about this change and update any relevant documentation.\n</p><p>As a reminder, detection sources will remain unchanged, so if you only filter on detection sources, everything should continue to function as normal.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2027-05-28T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC992217",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-30T00:33:40.373Z",
  "Services": [
    "Microsoft Defender XDR"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-30T00:33:10Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender: Changes to Defender for Cloud Apps alerts",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
