{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>TeleMessage data connectors for T-Mobile and Hong Kong CSL (HKCSL) mobile networks will soon be available. These connectors will allow organizations to import and archive SMS and MMS data from the respective mobile networks to the Microsoft 365 environment.&nbsp;&nbsp;</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=477365\" target=\"_blank\">477365</a>.</p><p><b>When this will happen:</b>.</p><p>General Availability (Worldwide, GCC): We will begin rolling out early February 2025 and expect to complete by late February 2025.</p><p><b>How this will affect your organization:</b>\n</p><p>Once SMS and MMS messages for the users are successfully stored in user mailboxes, admins can apply Microsoft 365 Purview features such as Litigation Hold, Content Search, and Microsoft 365 retention policies to T-Mobile and HKCSL network data.</p><p>Third-party applications and services might involve storing, transmitting, and processing your organization's customer data on third-party systems that are outside of the Microsoft 365 infrastructure and, therefore, aren't covered by the Microsoft Purview and data protection commitments. Microsoft makes no representation that use of this product to connect to third-party applications implies that those third-party applications are Federal Risk and Authorization Management Program (FedRAMP) compliant.</p><p>This new feature is available by default. Admins can work with Microsoft Partner TeleMessage to set up these connectors.</p><p><b>What you need to do to prepare:</b>\n</p><p>More information about the connectors can be found here once they are live: <a href=\"https://learn.microsoft.com/purview/archive-third-party-data\" target=\"_blank\">Use data connectors to import and archive third-party data in Microsoft 365 | Microsoft Learn</a>.</p><p>This rollout will happen automatically with no admin action required. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "477365"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2025-05-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC994283",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2025-01-31T23:39:58.4Z",
  "Services": [
    "Microsoft 365 suite",
    "Microsoft Purview"
  ],
  "Severity": "normal",
  "StartDateTime": "2025-01-31T23:39:12Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Data Connectors - Microsoft partner data connectors for T-Mobile and HKCSL",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
