{
  "ActionRequiredByDateTime": "2023-05-01T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Yammer is committed to strengthening the alignment of Yammer to Microsoft 365. This means we will no longer support tenants having more than one non-external Yammer network. This change will ensure Yammer networks have the same organizational boundaries as their corresponding Microsoft 365 tenants.\n</p><p><i>Why is this happening now?\n</i></p><p>Integrating Yammer more fully into the Microsoft 365 ecosystem has been a multi-year effort. New 1:many configurations have not been permitted since October 2018. All new Yammer networks provisioned after January 2020 have been created in Native Mode. In September 2022, <a href=\"https://techcommunity.microsoft.com/t5/yammer-blog/non-native-and-hybrid-yammer-networks-are-being-upgraded/ba-p/3612915\" target=\"_blank\">the enforcement of Native Mode was announced</a>. Automated network consolidation is an important prerequisite to reaching Native Mode and gaining access to broader safety, security, and compliance features. \n</p><p>[When this will happen:]\n</p><p>Starting on May 1, 2023 and continuing through May 1, 2024. You are welcome to initiate network consolidation on your own at any time before or after May 1, 2023.\n</p><p>[How this will affect your organization:]\n</p><p>With automated network consolidation, you will lose access to all your secondary Yammer networks. Users from your secondary Yammer networks will be migrated to your primary network, but <b><i><u>groups and data will be lost.</u></i></b> In advance of this change, we strongly recommend that customers perform a full data export of their networks. You can read more about exporting data from your network <a href=\"https://docs.microsoft.com/yammer/manage-security-and-compliance/export-yammer-enterprise-data\" target=\"_blank\">here</a>.\n</p><p>It is strongly advised that customers <a href=\"https://docs.microsoft.com/yammer/configure-your-yammer-network/faq-consolidate-multiple-yammer-networks\" target=\"_blank\">perform this network consolidation themselves</a>.  This will allow you to choose the time of the consolidation and allow the administrator to choose which primary domain will be associated with the remaining network.\n</p><p>There are Microsoft partners that can help you migrate data from your secondary networks. Please reach out to your Microsoft Account Team or <a href=\"https://products.office.com/yammer/partners\" target=\"_blank\">contact a partner</a> for more information.\n</p><p>Post-consolidation of the networks into 1:1 alignment with Microsoft 365, they will be upgraded to Native Mode. This provides access to the latest features in Yammer and ensures that Yammer and Viva Engage content is included in Microsoft Purview's compliance and security features.\n</p><p>You can read more about our plans to ensure alignment to Native Mode <a href=\"https://techcommunity.microsoft.com/t5/yammer-blog/non-native-and-hybrid-yammer-networks-are-being-upgraded/ba-p/3612915\" target=\"_blank\">here</a>.\n</p><p>[What you need to do to prepare:]\n</p><p><i>If you would like to self-initiate your network consolidation:\n</i></p><ul><li>There is a guide to network consolidation available to walk you through the process. A network administrator can run the network migration tool from within Yammer.\n</li></ul><p><i>If you would like Microsoft to initiate your network consolidation:\n</i></p><ul><li>You are not required to take any action. Microsoft will notify you via the M365 Message Center of your scheduled consolidation date and default primary network and domain. The network with the highest total message count will be the default primary network. \n</li><li>If you would like a different default primary network, contact Microsoft 365 support to log an exception.\n</li></ul><p><i>If you need to postpone or schedule network consolidation around blackout dates:\n</i></p><ul><li>Contact Microsoft 365 support to log an exception.  \n</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "ExternalLink",
      "Value": "https://docs.microsoft.com/en-us/yammer/configure-your-yammer-network/faq-consolidate-multiple-yammer-networks"
    }
  ],
  "EndDateTime": "2024-06-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC454504",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-09-27T18:15:15.77Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2022-10-31T22:35:26Z",
  "Tags": [
    "Admin impact"
  ],
  "Title": "Multiple Yammer Networks Within Single Tenant No Longer Supported (1:Many Mode)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
