{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 25, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>In December 2021, a new section was added to the service health page in the Microsoft 365 admin center, featuring \"Issues in your environment that require action.\"   These types of issues are not caused by Microsoft services being unhealthy, but by something specific to your organization that require an admin to take action.<br></p><p>\n</p><p>To ensure that these notifications successfully reach you, an email will now be sent automatically each time a new issue is posted.<br></p><p>\n</p><p>If you do not want to receive these email notifications, you can adjust your email preferences by clicking the \"Customize\" button on the service health page.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=103631\" target=\"_blank\">103631</a></p><p>[When this will happen:]</p><ul><li>Targeted Release: We will begin rolling out late July (previously mid-June) and expect to complete by mid-August.<br></li><li>Worldwide: We will begin rolling out early August (previously early July) and expect to complete by late March 2024 (previously mid-February).</li></ul><p><b>Note: </b>These rollout timelines apply to customers in the following markets: United States, Canada, UK, Australia, New Zealand, South Africa, India, and Singapore.  When the work is completed to send these emails in languages other than English, the list of countries will be expanded.</p><p>[How this will affect your organization:]<br></p><p>Admins will receive new emails if an \"Issue in your environment that requires action\" is posted for their organization.</p><p>[What you need to do to prepare:]<br></p><p>Ensure that your email address on file is correct. You can see the email address on file for notifications by visiting Health -&gt; Service Health, clicking \"Customize\", and selecting the \"Email\" tab.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "103631"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 will now automatically send email notifications for \"Issues in your environment that require action\" posted on the service health page. Admins can customize their email preferences. Rollout timelines have been updated. Ensure correct email address is on file."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 will now automatically send email notifications for \"Issues in your environment that require action\" posted on the service health page. Admins can customize their email preferences. Rollout timelines have been updated. Ensure correct email address is on file."
    }
  ],
  "EndDateTime": "2024-06-03T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC470137",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-26T01:49:08.91Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2022-11-23T06:16:39Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "(Updated) Email notifications for \"Issues in your environment that require action\"",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
