{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated June 7, 2023: We have updated the message with additional details. Thank you for your patience.</p><p>We are announcing that Wiki's will be retired from Teams. We are offering note taking capabilities through Teams Channels powered by OneNote.</p><p>[When this will happen:] \n</p><p>The option to export wiki content to OneNote is now available. New documentation is available here: <a href=\"https://support.microsoft.com/en-us/office/export-a-wiki-to-a-onenote-notebook-8cd8ab0c-2314-42b0-a1d0-5c6c4c5e1547\" target=\"_blank\">Export a wiki to a OneNote notebook</a></p><p>The ability to create new a new Wiki will be disabled mid-June.</p><p>[How this affects your organization:]\n</p><p>With this release, users have an option to export their wiki content to OneNote notebooks in Teams standard channel. After exporting users can go to the Notes tab to collaborate using OneNote in channels. \n</p><p><b>Note:</b> With this change users can continue to access and edit existing wikis but can’t create new wikis in Teams channels.\n</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RE5egwT?ver=2d0e&quot;\" width=\"400\" height=\"\" alt=\"Wiki export to OneNote\">\n</p><p>OneNote provides an enhanced note taking experience. \n</p><ul><li>Easy collaboration across the team\n</li><li>View all channel notes in a team in one place organized within a single notebook\n</li><li>Rich editing with typing, ink annotations, highlighting, file attachments, etc.\n</li><li>Easy recall &amp; search for channel notes within OneNote on any platform\n</li></ul><p><i>Upcoming plans\n</i></p><p>Soon Notes tabs powered by OneNote will be added by default when users create new channels. For now, users can create OneNote tabs manually using the add tab experience (via +).\n</p><p>We will share out the details of Wiki retirement in advance to help our customers prepare for this change.\n</p><p>[What you can do to prepare:]\n</p><p>We urge users to export their channel wikis to OneNote once it is available. \n</p><p>If your organization has not enabled OneNote you can review this documentation: \n</p><ul><li><a href=\"https://learn.microsoft.com/deployoffice/deployment-guide-onenote\" target=\"_blank\">Deployment guide for OneNote</a></li></ul><p>[FAQs:]</p><p><i>Why is Teams retiring wiki?</i></p><ul><li>Our users’ needs for note taking are evolving every day and the current capabilities &amp; infrastructure of Wiki will not be able to cater to those needs in future. We understand that moving away from wiki is a difficult change and we want to help our users throughout the changes.</li></ul><p><i>How can I take notes in channels after this change?</i><br></p><ul><li>New channels will now come with a OneNote notebook (M365 brand for note taking). OneNote brings goodness of richer formatting, better organization, search within OneNote app and keeps the experience consistent across M365. &nbsp;\n</li></ul><p><i>When &amp; how are we retiring Wiki?</i></p><ul><li><u>Stage 1</u> – (Timeline – early March 2023) Users won't be able to create new wikis, but they can continue to access (read/write) their existing wiki. Users also have the option to export their content to OneNote. Once users export their content to OneNote, the Wiki is available as read only.&nbsp;\n<ul><li>After exporting, each wiki in a channel appears as separate section in OneNote and each Wiki page will be a separate page in OneNote.&nbsp;\n</li></ul></li><li><u>Stage 2</u> – (Timeline – Mid CY23) Wiki tab in channel will not be supported; users will be easily able access (read/write) content in Wiki app. Users can also export their content to OneNote.&nbsp;\n</li><li><u>Stage 3</u> – (Timeline – Jan 2024) Wikis tab and wiki App wouldn't be able to accessible in Teams and users wouldn't be able to export. Users can download their wiki files from SharePoint.\n</li></ul><p><i>What happens to my existing data?</i></p><ul><li>Your data is accessible from SharePoint as per retention policy even after Wiki is deprecated. You can download wiki content from SharePoint.</li></ul><p><i>Does end user need to export wiki one by one or in bulk?</i></p><ul><li>End users will have to export wikis one by one per Wiki tab. If there are more than wiki tabs in a channel, then users will have to export them separately. Users can export their wiki by visiting Wiki tab.\n</li></ul><p><i>Who can export Wiki to Notes?\n</i></p><ul><li>Any team member who has access to add/remove tab in a channel can export their Wiki. \n</li></ul><p><i>Is there a bulk export option available at tenant level?\n</i></p><ul><li>No, users can export their wikis as per their convenience. \n</li></ul><p><i>Known limitation:</i></p><ul><li>OneNote notes only work in Default (Light) and High contrast mode.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-02-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC496248",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-06-07T17:10:31.467Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-01-11T01:39:22Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "(Updated) Wiki retirement and the future of note taking in Teams Channels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
