{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated September 12, 2023: To ensure organizations have time to make necessary changes we are updating the timing of this change from September 15, 2023, to January 31, 2024.</p><p>This is an important message for customers who use Stream (Classic) or Yammer to create and host Stream live events. Microsoft will retire the Stream live events service on January 31, 2024. Microsoft Teams live events, with encoder support, will become your new platform to host and run live events.  \n</p><p>\n</p><p>For several years Microsoft has offered two venues for hosting live events -- Stream and Teams. While both services allow you to create live events, each had a slightly different set of capabilities and limitations. Our goal is to provide you with a single, simple, robust solution for hosting live events.<br></p><p><a href=\"https://support.microsoft.com/office/schedule-a-teams-live-event-7a9ce97c-e1cd-470f-acaf-e6dfc179a0e2\" target=\"_blank\">Teams live events</a> with encoder support is the replacement service to Stream live events. Teams live events is now rolling out the general availability of encoder support (see Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=84960\" target=\"_blank\">84960</a>), which will allow you to create, host and produce live events with the same functionality that you get with Stream. Teams live events will support 10,000 simultaneous event attendees and Real-Time Messaging Protocol input (RTMP-In). RTMP-in lets you create highly polished events that feature combined live streams, screen overlays, on-screen data and more.&nbsp;</p><p>Users will also get two other benefits from using Teams live events: </p><ol><li>The option to allow public anonymous attendees to attend Teams encoder live events.</li><li>Transcription (RTMP transcript only) and recording are available for both public and in-tenant encoder events. With in-tenant encoder events, the organizer will have ability to edit the video recording and upload it to SharePoint so that attendees who missed the event can view it.</li></ol><p>\n</p><p>If you use Yammer to create and host live events you will be able to continue using Stream Live Events in Yammer until September 15, 2023. Additionally, you’ll soon be able to select Teams within Yammer to run your event.&nbsp;</p><p>[When this will happen:] </p><ul><li>Teams live events with encoder support began its general availability roll out on February 1, 2023, and we expect the rollout to complete by February 15, 2023.  <br></li><li>The Stream live events service will be retired on January 31, 2024.<br></li></ul><p>[How this will affect your organization:] &nbsp;<br></p><p>We recommend that you begin using the Teams live events to schedule and host live events.&nbsp;<br></p><p>If your organization has Stream live events scheduled beyond January 31, 2024, please reschedule those events. Any Stream live events scheduled after January 31, 2024 will be automatically removed.&nbsp;<br></p><p>For more information see the links below:<br></p><ul><li><a href=\"https://aka.ms/StreamLiveEventsRetirement\" target=\"_blank\">Stream live events replacement service FAQs</a><br></li><li><a href=\"https://support.microsoft.com/office/schedule-a-teams-live-event-7a9ce97c-e1cd-470f-acaf-e6dfc179a0e2\" target=\"_blank\">How to set up a Teams live event</a><br></li><li><a href=\"https://support.microsoft.com/office/produce-a-teams-live-event-using-teams-encoder-b0026c9d-fd37-4bb3-bffc-6961f221fbe9\" target=\"_blank\">How to produce a Teams live event</a><br></li><li><a href=\"https://learn.microsoft.com/microsoftteams/teams-live-events/plan-for-teams-live-events\" target=\"_blank\">Teams live events capabilities and limitations</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "84960"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    }
  ],
  "EndDateTime": "2024-03-04T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC513601",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-09-12T19:31:46.093Z",
  "Services": [
    "Microsoft Stream"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-02-09T21:20:45Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Stream live events replacement service",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
