{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated August 30, 2023: We have updated the content below with additional information.&nbsp;</p><p style=\"\">This is an important message for customers who use Stream to host live events in Viva Engage.\n</p><p style=\"\">We’re informing you of changes to the Message Center Post MC513603 titled “Use Microsoft Teams to produce Yammer live events”. This message is associated with Microsoft 365 Roadmap ID 82054 and was originally sent on February 9, 2023 and stated that Stream Live Events would retire on September 15, 2023. Microsoft has moved the retirement date of the Stream Live Events service from September 15, 2023, to January 30, 2024. Microsoft Teams live events, with encoder support is your new platform to host and run live events.\n</p><p style=\"\">Teams live events with encoder support is the replacement service to Stream live events. Teams live events allows you to create, host and produce live events with the same functionality that you get with Stream. It also supports Real-Time Messaging Protocol (RTMP) input, which lets you create highly polished events that feature combined live streams, screen overlays, on-screen data and more.\n</p><p style=\"\">You will be able to use Stream live events in Viva Engage until January 30, 2024, and after that live events must be produced using Teams live events. In January 2023, the Stream options to produce live events will be removed from Viva Engage. \n</p><p style=\"\">Just like with Stream live events, there are two ways in which you can use Teams live events to produce events in Viva Engage:\n</p><ol><li>Microsoft Teams QuickStart: Use the Microsoft Teams desktop client to produce your event, generally used in producing simple events.\n</li><li>Microsoft Teams external app or device: Use this to produce large-scale events, such an executive town hall, where a single stream from a media mixer is broadcast to an audience.</li></ol><p>Once the live event is completed, the video, if recorded, is stored in the SharePoint library of the community where the event was produced.</p><p>\n</p>\n<p>[When this will happen:]<br></p><p>The Stream live events options will be removed from your tenant on January 30, 2024.\n</p><p>Viva Engage Community Managers will only be able to create live events only using the new Teams options. The Stream live events options will be removed.\n</p><p>[How this will affect your organization:]<br></p>\n\n<p>Yammer Community Managers will see two new Teams options for creating Yammer Live Events above the existing Stream options. \n</p><p>While the existing Stream options for producing live events will be shown on the Yammer event scheduling page, only users of tenants that have Stream live events provisioned will be able to use it.</p><p>\n</p><p>When will the Stream option for producing live events on Yammer retire?\n</p><ul><li>The Stream option for creating Yammer live events will be retired and removed from Yammer on September 15, 2023.</li></ul><p>[What you need to do to prepare:]</p>\n<p>We recommend that you begin using the Teams live events to schedule and host live events.\n</p><p>If your organization has Stream live events scheduled beyond January 30, 2024, please reschedule those events using Teams live events in Viva Engage. Any Stream live events scheduled after January 30, 2024 will be automatically removed.\n</p><p>Please review the updated Viva Engage live events documentation:\n</p><ul><li><a href=\"https://learn.microsoft.com/yammer/manage-yammer-groups/yammer-live-events\" target=\"_blank\">Organize a live event in new Yammer - Microsoft Support</a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "82054"
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, Mac, Mobile, Web"
    },
    {
      "Name": "HelpLink",
      "Value": "https://support.microsoft.com/office/organize-a-live-event-in-new-yammer-7338782a-4f0b-4fd0-a6c3-33625906ead1"
    }
  ],
  "EndDateTime": "2024-03-25T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC513603",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-09-27T18:16:19.71Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-02-09T21:21:20Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "(Updated) Use Microsoft Teams to produce Yammer Live Events",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
