{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are announcing the upcoming retirement of the Azure Information Protection (AIP) Unified Labeling add-in for Office on April 11th 2023, and will reach retirement after 12 months.  \n</p><p>[How this will affect your organization:] \n</p><p>You are receiving this message because your organization owns one or more licenses for Azure Information Protection. To continue using sensitivity labels powered by Microsoft Purview Information Protection in Office applications, you must transition to the built-in labeling experience in Microsoft 365 Apps. \n</p><p>Important retirement milestones are: \n</p><p>AIP Unified Labeling add-in is disabled by default starting in version 2302 of Office. Customers can opt-out of this change (see https://aka.ms/AIP2MIP/Newsletter). \n</p><p>May 11th 2023: Release of AIP Unified Labeling client version 2.16. Organizations that have previously never used the AIP Unified Labeling add-in for Office will be blocked from using the add-in with version 2.16 or higher. To get an exception to start using the AIP Unified Labeling add-in after May 11th, reach out to support. \n</p><p>April 11th 2024: AIP Unified Labeling add-in permanently disabled in Office. Extensions will be granted on a case-to-case basis; please reach out to Microsoft Support or your account team.  \n</p><p>[What you need to do to prepare:] \n</p><p>For detailed migration steps, refer to our playbook: <a href=\"https://aka.ms/AIP2MIP/HowTo/GetStarted\" target=\"_blank\">https://aka.ms/AIP2MIP/HowTo/GetStarted</a>. \n</p><p>For the announcement and FAQs of the retirement, refer to our blog: <a href=\"https://aka.ms/AIPRetireBlog\" target=\"_blank\">https://aka.ms/AIPRetireBlog</a>.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-05-13T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC541158",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-04-13T23:22:14.727Z",
  "Services": [
    "Microsoft 365 suite",
    "Azure Information Protection"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-04-13T23:20:27Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Azure Information Protection Unified Labeling add-in for Office is retiring",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
