{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated November 30, 2023: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">A new channels experience in Microsoft Teams has been built with an intuitive design that allows teams to focus and stay on tasks, bring everyone up to speed, and actively engage in real-time. The following features will be rolling ou<span style=\"font-size: 14px;\">t:&nbsp;&nbsp;</span><br></p><ul><li>The compose box and recent posts will appear at the bottom (previously top) of the channel by default. Users can configure channels to show new posts at the top via the more options ... menu the top of the channel. It'll now be much easier to start a new post, keep up with the latest conversations and participate - giving users the confidence that they’ve not missed anything.&nbsp;</li><li>Every post is now a true conversation that users can focus on. Users can navigate to a conversation view that makes the discussion more engaging and synchronous, just like a chat. Users can also pop out the post, keep an eye on the discussion, while continuing to work on other topics.&nbsp;</li><li>A streamlined information pane will include all the important contextual information like channel’s members and pinned posts so new team members can quickly on-board and for all members to find the information they need, right in the channel.</li><li>Pin posts to make it easy for everyone to know what’s important in the channel and quickly reference it.&nbsp;</li><li>Simplified badging is making it easier for users to understand when there are new unread activities in teams. In addition, the simplified design helps users focus on the specific channels which requires the most attention, like channels in which the user was @mentioned.&nbsp;</li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=91683\" target=\"_blank\">91683</a><br></p>\n\n<p>[When this will happen:]</p><p>Targeted Release: Started rolling out in May and is expected to complete in late August 2023 (previously early July). Complete</p><p>Standard: We will begin rollout in early October 2023 (previously mid-September) and expect to complete rollout by late October 2023 (previously mid-August). Complete</p><p>GCC, GCC High, and DoD: We will begin rollout in mid-December 2023 and complete in early February 2024.</p>\n\n<p>[How this will affect your organization:]</p><p>Users in your organization will not need to make any changes and will get the new channels experience by default.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW124xS?ver=12fe\" style=\"width: 400px;\" \"alt=\"Channels\" view=\"\" in=\"\" desktop\"=\"\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW12cpe?ver=9327\" style=\"width: 200px;\" \"alt=\"Channels\" view=\"\" in=\"\" mobile\"=\"\"><br></p>\n\n<p>[What you need to do to prepare:]</p><p>Admins will not need to make any changes.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "91683"
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS"
    }
  ],
  "EndDateTime": "2024-03-18T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC550081",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-11-30T19:16:00.973Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-05-03T21:10:04Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: New Channels Experience",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
