{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 16, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Customers will soon be able to apply container labels to rosters in Microsoft Planner.  This is enabled directly in Planner by using Microsoft Graph APIs.  When this feature is rolled out, the roster sensitivity labels can be set to respect the policy settings.  If the tenant admin has made container labels mandatory and has set a default label, then the default label will be used for roster creation through Microsoft Loop client.<br></p><p></p><ul><li >On the Loop client, if the default label is provided, it will be used as the roster's lable when creating the roster.  The roster system will not allow the user to create an unlabeled roster or to un-label a previously labeled roster.</li><li>On the Microsoft Graph API, if a request is made and the label is not included, the request is rejected as the default label is not applied by the service. Users will need to ensure that a default label is provided when labels are mandatory so that roster creation does not fail.\n</li></ul><p><b>Note</b>: The container sensitivity label applied to a roster applies only to the information in Microsoft Planner and does not protect or encrypt the information when it syncs with the Loop client.</span></p><p>This message is associated with Microsoft 365 Roadmap ID </span><a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=155837\" target=\"_blank\">155837</a><br></p>\n\n<p>[When this will happen:]<br></p>\n\n<p>We will begin rolling out in early January 2024 (previously late October) and is expected to complete by early March 2024 (previously early February).</p><p>USSec/USNat: Rollout will begin in mid-March 2024 (previously late January) and is expected to complete by mid-April 2024 (previously late February).</p<p>[How this will affect your organization:]<br></p>\n\n<p>Rosters can be configured with container labels being mandatory. When container labels are set to mandatory for rosters, ensure a default label is available otherwise rosters cannot be created unless a label is set. On the Microsoft Graph API, if a request is made and the label is not included, the request is rejected. (Note: default label is not applied by our service).</p>\n<p>[What you need to do to prepare:]<br></p>\n<p>By setting a container label to mandatory for an existing roster, there may be an impact to third parties used in your organization. For third parties using the labels Graph API, attempts to create a label-less roster will fail if labels are mandatory as the default label will not be applied by our service. To ensure roster creation does not fail when labels are mandatory, it is the client responsibility (third party responsibility) to apply the default label by either updating the apps (if under admin control) or modifying the dependency on such apps or by making labels not mandatory.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "155837"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Planner will soon support container sensitivity labels for rosters, which can be set to respect policy settings. The rollout will begin in early January 2024 and is expected to complete by early March 2024. Rosters can be configured with container labels being mandatory, and if a request is made without a label, it will be rejected. It is the client's responsibility to apply the default label to ensure roster creation does not fail when labels are mandatory."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Planner will soon support container sensitivity labels for rosters, which can be set to respect policy settings. The rollout will begin in early January 2024 and is expected to complete by early March 2024. Rosters can be configured with container labels being mandatory, and if a request is made without a label, it will be rejected. It is the client's responsibility to apply the default label to ensure roster creation does not fail when labels are mandatory."
    }
  ],
  "EndDateTime": "2024-04-08T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC669735",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-16T22:41:37.19Z",
  "Services": [
    "Planner"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-08-22T22:53:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Rosters in Microsoft Planner Supporting Container Sensitivity Labels",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
