{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 16, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The Reuse Files feature in Word will no longer be available. Starting August 2023, users will not be able to see Reuse Files on the ribbon in the Word user interface. However, users can use Search in Word to search their files, preview them, and reuse them. By January 2024, the feature will be fully removed from Word and no longer supported.</p><p>Microsoft is committed to improving your Microsoft 365 subscription. As a result, we occasionally remove features and benefits that duplicate equivalent offerings that are available to subscribers.<br></p><p>[When this will happen:]</p><p>We will be gradually removing entry points for this feature starting in late August 2023 and the feature will be fully retired by the late February 2024 (previously late January).</p><p>[How this affects your organization:]</p><p>As we proceed with retiring the Reuse Files feature, the various entry points will be gradually disabled up until February 2024.&nbsp;</p><p>[What you need to do to prepare:]<br></p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The Reuse Files feature in Word will be retired by February 2024. Starting August 2023, users will not be able to see Reuse Files on the ribbon in the Word user interface. However, users can use Search in Word to search their files, preview them, and reuse them. Microsoft will gradually remove entry points for this feature starting in late August 2023. Organizations may consider updating their training and documentation as appropriate."
    },
    {
      "Name": "HelpLink",
      "Value": "https://support.microsoft.com/office/reuse-files-is-no-longer-available-08537998-b322-46c4-abfc-245db6263519"
    }
  ],
  "EndDateTime": "2024-04-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC668802",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-16T23:23:45.307Z",
  "Services": [
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-08-18T21:43:11Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Retirement"
  ],
  "Title": "(Updated) Reuse Files in Word to be retired",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
