{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated December 18, 2023: We have updated the content below with additional information.</p><p style=\"\">We are introducing a revamped version of the gallery in Teams meetings and calls. The new gallery will be the default view when users join their meetings, so that they can use it without the need of taking an action.&nbsp;</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=118467\" target=\"_blank\">118467</a></p>\n<p>[When this will happen:]</p><p>Targeted Release: We will begin rolling out late January 2024 (previously early January) and expect to complete by early February 2024 (previously mid-January).\n</p><p>Production and GCC: We will begin rolling out mid-February 2024 (previously mid-January) and expect to complete by late February 2024 (previously late January).</p><p>GCC High: We will begin rolling late February 2024 (previously late January) and expect to complete by early March 2024 (previously early February).\n</p><p>DoD: We will begin rolling out late February 2024 (previously late January) and expect to complete by early March 2024 (previously early February).</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>This new version introduces a series of changes to help users in their meetings:</p><ul><li>16:9 aspect ratio participant tiles for more predictability. A consistent aspect ratio maintains a more predictable experience when users turn their videos on or off. It also provides more visibility into users' body language and hand gestures.\n</li><li>An audio-video mixed gallery for a more inclusive representation. Audio and video users share now the same space by default.\n</li><li>Meeting rooms are displayed larger than individual participants. In certain meeting sizes, we display Microsoft Teams Rooms video in a larger size than the rest of the participants to give an equivalent weight to participants joining from a meeting room. Non-Teams rooms joining Teams meeting via Direct Guest Join will remain the same tile size as today.\n</li><li>You appear next to the rest of the participants. Your own tile will now be included next to the rest of the participants.\n</li><li>Customization of the gallery. Users can adapt the gallery to their needs or preferences. The customization options include:\n<ul><li>Gallery size: Users can choose the maximum number of tiles that will be represented per page. The entry point for this action is available through the meeting toolbar: \"View\" &gt; \"Change gallery size\".\n</li><li>Placement of your own tile: For users who prefer to keep themselves separated from the rest of the participants. If chosen, the self-tile will be placed in an area separate from the rest of the participants. The entry point for this action is available through the meeting toolbar: \"View\" &gt; \"More options\" &gt; \"Remove me from gallery\".\n</li><li>Prioritizing videos: For users who want to give a higher weight to participants with their video on. If chosen, video participants will be displayed more prominently than audio participants. The entry point for this action is available through the meeting toolbar: \"View\" &gt; \"Prioritize video\".\n</li><li>Meeting room tile size: Users can decide if they want to resize the meeting room tile to the same size as the rest of the participants. The entry point for this action is available in the contextual menu of the room tile.</li></ul></li></ul><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1eytq?ver=619f\" style=\"width: 400px;\"></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1evPM?ver=9b49\" style=\"width: 400px;\"></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1eDDx?ver=8083\" style=\"width: 400px;\"></p><p>[What you need to do to prepare:]</p><p>Please notify your users about this change and update any training documentation, as appropriate.<br></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "118467"
    },
    {
      "Name": "FeatureStatusJson",
      "Value": "{\"118467\":[{\"RoadmapId\":118467,\"Platform\":\"Desktop\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-16T11:55:55.4515803Z\",\"LatestRing\":\"StandardRelease\"},{\"RoadmapId\":118467,\"Platform\":\"All\",\"Status\":\"Launched\",\"LastUpdateTime\":\"2024-02-16T11:55:55.4515807Z\",\"LatestRing\":\"StandardRelease\"}]}"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop"
    }
  ],
  "EndDateTime": "2024-04-29T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC686281",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-12-18T20:39:00.473Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-31T22:24:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Gallery in Teams Meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
