{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated January 5, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Microsoft Whiteboard now automatically utilizes Specific People Share Links (PSL) for participants of a Teams meeting when a whiteboard is shared and the tenant has Company-wide Share Links disabled (CSL).&nbsp;&nbsp;</p>\n<p>[When this will happen:]</p>\n\n<p>We will begin rolling out in mid-October and complete rolling out in late January 2024 (previously mid-December).</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>Whiteboards are stored in the OneDrive of the user who starts Whiteboard in the Teams meeting. If your tenant does not have CSLs enabled, previously when trying to share a whiteboard in a Teams meeting users would receive an error message and would not be able to access and collaborate on the whiteboard during and after the meeting.&nbsp;&nbsp;</p><p>Now, in the case that CSLs are disabled in your tenant, Whiteboard will fallback to utilizing PSLs and provide access directly to the participants of that Teams meeting. They will be able to access and collaborate on that whiteboard during and after the meeting.&nbsp;&nbsp;</p><p>Scenarios where PSL Fallback Apply:&nbsp;</p><ul><li>Teams meetings Whiteboard flow</li><li>Teams Screen sharing Annotations flow</li><li>Teams Whiteboard Tab App in channels (private, shared, public)</li></ul><p>Note: participants that join a meeting or annotation session after a whiteboard has been shared will need to have the whiteboard manually shared with them. For private and shared Tab channel, the whiteboard will need to be manually shared with participants.&nbsp;&nbsp;</p><p>Note: PSL Fallback will only apply to in-tenant users, not external users.</p>\n<p>[What you need to do to prepare:]</p>\n<p>No change will be required, this will happen automatically based on your tenant settings.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-03-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC682305",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-05T04:53:58.113Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-18T23:38:39Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Whiteboard: \"Specific people” Share Link Fallback",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
