{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated January 5, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>The latest version of Teams Rooms on Windows app 4.19 includes updates to Front Row experience to promote active video speakers to the spotlight area to improve space utilization and provide in-room users with immersive experience across single and dual display configurations.&nbsp; &nbsp;<br><p></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=161825\" target=\"_blank\">161825</a>.</p>\n<p>[When this will happen:]</p><p>Standard Release: We will begin rolling out mid-November and expect to complete it by late January 2024 (previously late-December).&nbsp;</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>The Front Row layout is improved to promote pinned or spotlighted participants to the center stage when there is no shared content in the meeting. This addresses customer feedback on empty space utilization and aligns pinned or spotlighted participants treatment across single and dual front of room displays. Additionally, active speaker video is promoted to the center stage to utilize display to create immersive experience for in room users. For single display configurations, when no one is pinned, spotlighted or sharing content, the most recent active speaker <i>video </i>will be promoted to the center. In dual display mode, when no one is pinned, spotlighted or sharing content, two most recent active speaker <i>videos </i>are promoted to the center on each screen. When someone is sharing content in the meeting, it’s displayed on one display while the other display shows the most recent active <i>video </i>speaker.&nbsp;<br></p>\n<p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1dpys?ver=6c60\" style=\"width: 400px;\" alt=\"raised hands\"><br></p><p>[What you need to do to prepare:]</p>\n<p>Please notify your users about this new experience and update your training and documentation as appropriate.&nbsp;</p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "161825"
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    }
  ],
  "EndDateTime": "2024-03-04T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC681887",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-05T05:41:58.153Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-16T22:04:00Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams | Front Row Enhancement: Active video speaker promotion for Teams Rooms on Windows",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
