{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 21, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>Soon, on Windows and macOS devices running the OneDrive sync app, we will enable a new feature called “Offline mode” that will allow you to continue working with the OneDrive web app in your browser, OneDrive PWA (Progressive Web App) or Microsoft Teams even when you are offline. This feature will be on by default and will give your users the ability to view, rename, move, copy their files, and create new folders when offline. Users will be able to open their files that are available offline on users’ device in a native app directly from inside OneDrive on the web. All of the metadata changes users make offline to their files in the browser will be automatically synced back to OneDrive when Internet connection is restored, and users can resolve conflicts, if there are any. As an administrator, you’ll be able to control various aspects of Offline mode using the Group Policies outlined in <a href=\"https://learn.microsoft.com/sharepoint/use-group-policy\" target=\"_blank\">here</a>.</p><p>When this feature becomes enabled for users in your organization and the user then visits OneDrive for web, Offline mode will be set up for the first time. A copy of user’s file metadata that powers OneDrive for web is securely stored locally on user’s device. These data on user’s device are only available and accessible by that user. If someone else were to sign in on your device, these local data on the device wouldn't be available to them.<br></p><p>A secure local web server on user’s device will handle the operations that users perform on their files in OneDrive for web, such as viewing, sorting, renaming, moving, and copying where traditionally these operations would need to be handled by the OneDrive cloud service. This allows to eliminate network as the bottleneck when loading and working with OneDrive for web resulting in fast and smooth interactions with users’ files like loading your files and folders, sorting, renaming, moving, renaming, and more. And all of these operations will continue to work even when users are offline, lose internet connection, or run into a service disruption.<br></p><ul><li>OneDrive Offline mode lets you work on OneDrive when offline in the browser, OneDrive PWA (Progressive Web App) and in Microsoft Teams, improves performance on all kinds of networks, and helps alleviate throttling related to working with large file collections.</li><li>OneDrive Offline mode is currently supported on Windows devices (Windows 10 or later) and macOS devices (macOS 12 Monterey or later) that have the OneDrive sync app installed and on Chromium-based browsers (Microsoft Edge, Google Chrome)<br></li><li>Offline mode will be on by default for user’s OneDrive on the web and both users and administrators will have the option to disable Offline mode for their OneDrive.<br></li><li>Offline mode is a per-device setting (configured separately for every device users use to access OneDrive on the web.<br></li><li>The data is securely stored in a local database under the user’s profile directory and requests are handled through a secure localhost HTTP server. Offline mode is powered by a separate background process (Microsoft.SharePoint.exe).<br></li><li>When Offline mode is on, users will see a new icon in the top navigation bar in OneDrive on the web.<br></li></ul><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=168618\" target=\"_blank\">168618</a></p><p>[When this will happen:]</p><p>Worldwide: We will begin gradually rolling out in late February 2024 (previously mid-February) and expect to complete in late April 2024 (previously mid-April).\n</p><p>[How this will affect your organization]<br></p><p>When this feature becomes enabled for users in your organization and the user then visits OneDrive for web, Offline mode will be set up for the first time. A copy of user’s file metadata that powers OneDrive for web will be downloaded and securely stored locally on user’s device. The actual contents of users’ files will not be downloaded. After Offline mode is set up, only changes to users’ file metadata will result in upload or download activity over the network. Users can continue working with OneDrive on the web as before and they can choose to turn off Offline mode if they desire to do so. As an administrator, you’ll be able to control various aspects of Offline mode using the <a href=\"https://learn.microsoft.com/sharepoint/use-group-policy\" target=\"_blank\">Group Policies.</a><br></p><p>[What you need to do to prepare]\n</p><p>Evaluate the new functionality and available controls as outlined in the <a href=\"https://support.microsoft.com/en-us/office/work-with-onedrive-web-app-when-offline-05d1865d-8694-4c0a-8e46-28ccb8c58b37?storagetype=live\" target=\"_blank\">help article</a>, prepare your users on how to take advantage of this new functionality. Leverage the group policies provided to control how this feature gets enabled in your organization.</p><p>More information:</p><ul><li><a href=\"https://support.microsoft.com/en-us/office/work-with-onedrive-web-app-when-offline-05d1865d-8694-4c0a-8e46-28ccb8c58b37?storagetype=live\" target=\"_blank\">Help article.</a></li><li>\n<a href=\"https://learn.microsoft.com/sharepoint/use-group-policy\" target=\"_blank\">Admin controls.</a><br><br></li></ul>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "168618"
    },
    {
      "Name": "Summary",
      "Value": "OneDrive for Web will soon enable \"Offline mode\" for Windows and macOS devices running the OneDrive sync app, allowing users to continue working with OneDrive even when offline. This feature will be on by default and will give users the ability to view, rename, move, copy their files, and create new folders when offline. Administrators will be able to control various aspects of Offline mode using the Group Policies outlined in the message. The feature will be rolled out gradually from late February 2024 to late April 2024. Users can turn off Offline mode if they desire to do so. More information is available in the provided links."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "Summary",
      "Value": "OneDrive for Web will soon enable \"Offline mode\" for Windows and macOS devices running the OneDrive sync app, allowing users to continue working with OneDrive even when offline. This feature will be on by default and will give users the ability to view, rename, move, copy their files, and create new folders when offline. Administrators will be able to control various aspects of Offline mode using the Group Policies outlined in the message. The feature will be rolled out gradually from late February 2024 to late April 2024. Users can turn off Offline mode if they desire to do so. More information is available in the provided links."
    },
    {
      "Name": "BlogLink",
      "Value": "https://support.microsoft.com/office/work-with-onedrive-web-app-when-offline-05d1865d-8694-4c0a-8e46-28ccb8c58b37?storagetype=live"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/sharepoint/use-group-policy"
    }
  ],
  "EndDateTime": "2024-05-27T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC686277",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-21T21:53:33.64Z",
  "Services": [
    "OneDrive for Business"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-31T22:17:12Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "(Updated) Offline mode in OneDrive for Web",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
