{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated November 16, 2023: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">The ability to create live Loop components starting with task lists, tables, voting tables, progress trackers &amp; checklists is coming soon to Whiteboard for the web, Whiteboard app in Teams, and Whiteboard for Windows.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=117400\" target=\"_blank\">117400</a></p>\n<p>[When this will happen:]</p><p>Standard Release: We will begin rolling out late October 2023 and expect to complete by early December 2023 (previously early November).</p>\n\n<p>[How this will affect your organization:]</p>\n\n<ol><li>Users will be able to create, copy/paste, view and edit live Loop components in Whiteboard. This functionality is controlled by the <i style=\"\">Create and view Loop files in Microsoft apps that support Loop</i> OCPS policy, which applies to all Microsoft apps that support Loop components. You can use this policy to enable or disable access for individual users.</li><li>On mobile devices, users can view and edit Loop components in Whiteboard, but will neither be able to create them nor copy/paste them. This functionality will be coming in a future update.</li><li>On Surface Hubs &amp; Microsoft Teams Room devices, users will not be able to view, edit, create or copy/paste Loop components in Whiteboard. This functionality will be coming in a future update.</li><li>External &amp; anonymous users when collaborating on whiteboards in Teams meetings, will not be able to view, edit, create or copy/paste Loop components. This functionality will be coming in a future update.</li><li>Environments other than commercial (such as GCC, GCC-H &amp; DoD) will be available when Loop components are supported in additional environments.</li></ol><p><i>(Please note that the below images are <b>illustrative</b> &amp; may differ from actual in-product user experience)</i></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1dpt2?ver=7cb2\" style=\"width: 400px;\" alt=\"make new whiteboards\"></p><p>Illustrative list of Loop components supported in Whiteboard for creation.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1dk6X?ver=32ba\" style=\"width: 400px;\" alt+\"marketing=\"\" sync\"=\"\"></p><p>Illustrative image showcasing a Progress tracker Loop component in Whiteboard.</p><p>[What you need to do to prepare:]</p>\n<p>No change is necessary, unless you wish to disable the Loop functionality in Whiteboard and other MS365 apps. To do this, you can use the <a href=\"https://docs.microsoft.com/deployoffice/admincenter/overview-cloud-policy\" target=\"_blank\">Office cloud policy service</a> in the Microsoft 365 Apps admin center.\n</p><ol><li>Sign in to <a href=\"https://config.office.com/\" target=\"_blank\">https://config.office.com/</a>&nbsp;with your Microsoft 365 admin credentials.</li><li>Select <b><i>Customization</i></b> from the left pane.</li><li>Select <b><i>Policy Management</i></b>.</li><li>Create a new policy configuration or edit an existing one.</li><li>In <b><i>Choose the scope</i></b>, choose the security group for which you want to apply the policy.</li><li>In <b><i>Configure Settings</i></b>, choose <b><i>Create and view Loop files in Microsoft apps that support Loop</i></b>.</li><li>In configuration setting, choose either – <i>enabled</i>, <i>disabled</i>, or <i>not configured</i>. The implication of each of these options is mentioned below:<ul><li><b>Enabled:</b> Loop functionality is available to users</li><li><b>Disabled:</b> Loop functionality isn't available to users</li><li><b>Not configured:</b> Loop functionality is available to users.</li></ul></li><li>Save the policy configuration.</li><li>Reassign priority for any security group if required (If two or more policy configurations are applicable to the same set of users, the one with the higher priority is applied).</li><li>In case you create a new policy, configuration or change the configuration for an existing policy, there will be a delay in the change being reflected as mentioned below:</li><li>If there were existing policy configurations prior to the change, then it will take 90 mins for the change to be reflected.</li><li>If there were no policy configurations prior to the change then it will take 24 hours for the change to be reflected.</li></ol><p>To learn more about the feature, visit the <a href=\"https://go.microsoft.com/fwlink/?linkid=2248604\" target=\"_blank\">Microsoft Whiteboard Help Hub page</a>.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "117400"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, TeamsAndSurfaceDevices, Web"
    },
    {
      "Name": "HelpLink",
      "Value": "https://go.microsoft.com/fwlink/?linkid=2248604"
    }
  ],
  "EndDateTime": "2024-03-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC681250",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-11-16T21:34:53.787Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-13T23:04:23Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "Create new Loop Components in Microsoft Whiteboard",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
