{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 16, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p><b>Note:</b> a Teams Shared Device license will be required per room to have access to the BYOD room's usage report after the public preview period.</p><p>BYOD (Bring Your Own Device) rooms are identified as rooms with no MTR (Microsoft Teams Rooms) but equipped with other peripherals such as camera, microphone.&nbsp;<br></p><p></p><p>In Teams Pro Management Portal, IT admins will finally have the capability to manage and track these specific BYOD rooms. They will get a comprehensive overview of their BYOD rooms and devices activities. With this new addition, they will gain valuable insights into how these spaces are being utilized and enabling them to make data driven decisions.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=161728\" target=\"_blank\">161728</a></p>\n<p>[When this will happen:]</p><p>We will begin rolling out in late January 2024 (previously late November) and expect to complete rollout by late February 2024 (previously early February 2024). </p><p>[How this will affect your organization:]<br></p>\n\n<p>IT admins will gain visibility of the BYOD rooms in the Teams Pro Management Portal upon logging in. To have access the portal, they will need at least one Pro, premium or Teams Shared Device license.&nbsp;<br></p><p>Under the<i> Inventory</i> tab, they will find a comprehensive list of all rooms within their organization, including information about BYOD rooms and devices.</p><p>Within the<i> Inventory</i> tab under the device page, IT admins will also have the capability to associate each device to its specific BYOD room. This association will be done in two different methods, with the \"<i>Import</i>\" function by importing the list of devices and adding the room information, or through auto discovery by selecting the specific room from list of available rooms.&nbsp;&nbsp;</p><p>In the <i>Report </i>tab, admins can finally see the BYOD rooms specific utilization metrics. However, an 8$ Teams Shared Device license will need to be assigned per room to have access to the BYOD usage report.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1cUwu?ver=1b5b\" style=\"width: 400px;\">&nbsp;</p>\n<p>[What you need to do to prepare:]</p>\n<p>To have access to the BYOD in Teams Pro Management Portal, at least one pro/premium or Teams Shared Device license is required on tenant level.&nbsp;</p><p></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "161728"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Pro Management Portal will soon allow IT admins to manage and track BYOD rooms, gaining insights into their usage and making data-driven decisions. Admins will need a Teams Shared Device license per room to access the BYOD usage report after the public preview period. Rollout will begin in late January 2024 and complete by late February 2024. At least one Pro, premium, or Teams Shared Device license is required on the tenant level to access the portal. Admins can associate devices with their specific BYOD room and view utilization metrics in the Report tab."
    },
    {
      "Name": "Platforms",
      "Value": "TeamsAndSurfaceDevices"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Pro Management Portal will soon allow IT admins to manage and track BYOD rooms, gaining insights into their usage and making data-driven decisions. Admins will need a Teams Shared Device license per room to access the BYOD usage report after the public preview period. Rollout will begin in late January 2024 and complete by late February 2024. At least one Pro, premium, or Teams Shared Device license is required on the tenant level to access the portal. Admins can associate devices with their specific BYOD room and view utilization metrics in the Report tab."
    }
  ],
  "EndDateTime": "2024-04-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC680963",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-16T21:19:31.713Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-12T23:20:36Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "(Updated) Bring-Your-Own-Device IT Admin Experience in Teams Pro Management Portal",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
