{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>On October 5, 2023, we announced <a href=\"https://techcommunity.microsoft.com/t5/microsoft-teams-blog/announcing-general-availability-of-the-new-microsoft-teams-app/ba-p/3934603\" target=\"_blank\">general availability of the new Microsoft Teams app for Windows and Mac</a>. Read the message center post MC679451 for details.<br></p><p>We mentioned in our GA announcement that classic Teams users will be automatically updated to new Teams in the coming months. <b><u>Today, we want to inform you that after March 31, 2024, any classic Teams users who have not updated to new Teams, will be automatically updated to new Teams. \n</u></b></p><p>With just one click, you can join millions of users who are relying on new Teams to stay connected with colleagues, partners, and customers. \n</p><p>How will this affect your organization?</p><ul><li>New Teams is a performance-focused update. New Teams is <a href=\"https://research.gigaom.com/report/new-microsoft-teams-performance-benchmark\" target=\"_blank\">up to 2x faster and use 50% less memory</a>. There is no major impact to the user experience for new Teams. This means you don’t need to invest in any additional training.  \n</li><li>Between now and March 31, 2024, you can continue to use classic Teams without interruption.  \n</li></ul><p>We encourage you to review the <a href=\"https://learn.microsoft.com/microsoftteams/teams-client-update#servicing-agreement\" target=\"_blank\">service agreement </a>that governs Teams app updates.\n</p><p>If you haven’t already updated to new Teams yet, review the <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center#prerequisites\" target=\"_blank\">prerequisites</a> and <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies\" target=\"_blank\">policy updates</a> for the update to new Teams.\n</p><p>How can I prepare for a seamless update to new Teams?\n</p><ul><li>Admins can <a href=\"https://aka.ms/newTeamsUpgrade\" target=\"_blank\">enable new Teams in their organizations</a> by leveraging robust IT admin policies and taking advantage of deployment options such as office update channels that allow them to enable users and groups within their organizations as needed. \n</li><li>Admins who currently have the Teams update policy set to 'Not enabled' for the 'Use new Teams client' setting, we suggest setting the value as ‘New Teams only’ after selecting the Teams update policy to  ‘Microsoft controlled’ in the Teams admin center.       \n</li></ul><p>Notes:  \n</p><ul><li>We have not made the new Teams in the Virtual Desktop Infrastructure (VDI) environment generally available yet, so the VDI users will not be affected by the auto-update timeline of March 31, 2024.     \n</li><li>Microsoft Teams Rooms (MTR) and Surface Hub devices        will also not be affected by the March 31, 2024, timeline.\n</li><li>For our education users, the update option to new Teams is available now and they can be seamlessly updated at any time.  Please visit <a href=\"https://techcommunity.microsoft.com/t5/education-blog/new-microsoft-teams-for-education-is-now-available-for-windows/ba-p/3945610\" target=\"_blank\">this page</a> for more information.     \n</li></ul><p>To learn more about this announcement, view this <a href=\"https://learn.microsoft.com/MicrosoftTeams/new-teams-automatic-upgrade-announced\" target=\"_blank\">page</a>.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-05-07T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC686187",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-10-31T16:49:21.8Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-10-31T16:48:52Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Classic Teams Users Will be Automatically Updated to New Teams After March 31, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
