{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Microsoft 365 Archive enables you to save on costs of storage exceeding the quota limit by archiving the inactive sites in SharePoint. The feature is a part of the Pay-as-you-go features in Microsoft Syntex and&nbsp;can be enabled through Microsoft 365 admin center.&nbsp;<br></p>\n<p>[When this will happen:]<br></p>\n\n<p>Preview: We will begin rolling out in November and expect to complete by early December 2023.</p>\n\n<p>[How this will affect your organization:]<br></p>\n\n<p>Admin impact: SharePoint admins and Global admins can choose inactive sites on SharePoint admin center, and via PowerShell, and archive them. Admins can select one or more sites in Active sites page, and archive them using the command bar.\n</p><p>When archived, the storage occupied by the site is deducted from active storage, and it will then be charged as a part of archived storage, which is charged based on consumption. \n</p><p>Sites can also be archived using PowerShell, starting version 16.0.24120.12000.\n</p><p>\n</p><p>End-user impact: If a site is archived, the content in the site cannot be accessed any longer. If it needs to be accessed, the site will need to be reactivated by the admins.<br></p><p>[What you need to do to prepare:]<br></p>\n<p>If you wish to use Archive, you can start by identifying inactive site in your tenant, that may be good candidates for being Archived. Once the feature is released, it will need to be enabled from Microsoft 365 admin center.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "BlogLink",
      "Value": "https://techcommunity.microsoft.com/t5/microsoft-syntex-blog/welcome-to-microsoft-inspire-2023-introducing-microsoft-365/ba-p/3874887"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoft-365/syntex/archive/archive-overview"
    }
  ],
  "EndDateTime": "2024-02-28T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC690184",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-11-16T00:03:50.64Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-16T00:03:24Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Archive: Public Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
