{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated February 16, 2024: We have updated the the content below with additional details.</p><p style=\"\">We’re introducing the ability to watch Stream videos inline in Outlook on the web and the new Outlook for Windows.&nbsp;<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=185389\" target=\"_blank\">185389</a></p>\n<p>[When this will happen:]</p><p>Standard Release: We will begin rolling out mid-February 2024 (previously mid-January) and expect to complete by mid-May 2024 (previously mid-April).<br></p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>Soon, if someone pastes a Stream video link in a supported Outlook app and sends it to you, you will be able to watch it directly in your inbox. The videos will play inline for recipients within the same organization, meaning you will not have to leave Outlook to watch the video. Recipients outside the organization, and those not using the new Outlook or web, will see a link to the video which they can watch in the Stream web app (depending on the organization’s file sharing settings).</p>\n<p>[What you need to do to prepare:]</p>\n\n<p>You may want to notify your users about this change and update any relevant documentation as appropriate.</p><p>A new policy controls the ability to preview and playback Stream videos in Microsoft 365 applications including in Outlook and the Loop application.\n</p><p>If you enable or do not configure this policy setting, users will be able to preview and playback Stream videos within supported Microsoft 365 applications.\n</p><p>If you disable this policy setting, users will not be able to preview and playback Stream videos within supported Microsoft 365 applications, however, users will be able to open Stream video links in the Stream Web Application.\n</p><p><b>Note:</b> This policy setting only applies to Outlook and Loop applications.</p><p>Review:</p><ul><li><a href=\"https://learn.microsoft.com/outlook/troubleshoot/message-body/embed-playback-videos-in-outlook-and-loop\" target=\"_blank\">Embed and play back videos in Outlook and Loop</a></li></ul><p> \n</p><p> \n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "185389"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is introducing the ability to watch Stream videos inline in Outlook on the web and the new Outlook for Windows. The feature will be rolled out from mid-February 2024 to mid-May 2024. The videos will play inline for recipients within the same organization and recipients outside the organization will see a link to the video which they can watch in the Stream web app. A new policy controls the ability to preview and playback Stream videos in Microsoft 365 applications including in Outlook and the Loop application."
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Web"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft 365 is introducing the ability to watch Stream videos inline in Outlook on the web and the new Outlook for Windows. The feature will be rolled out from mid-February 2024 to mid-May 2024. The videos will play inline for recipients within the same organization and recipients outside the organization will see a link to the video which they can watch in the Stream web app. A new policy controls the ability to preview and playback Stream videos in Microsoft 365 applications including in Outlook and the Loop application."
    }
  ],
  "EndDateTime": "2024-06-24T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC692026",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-16T22:34:59.34Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-20T23:41:13Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "(Updated) Stream videos can now be watched inline in Outlook",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
