{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Microsoft Whiteboard will soon leverage a new capability that allows guests of a tenant to access whiteboards shared with them via Specific People Share Links (PSL).</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=124990\" target=\"_blank\">124990</a></p>\n<p>[When this will happen:]</p>\n\n<p>This feature will begin rolling out in mid-December and complete by late January 2024.</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>Users of your tenant will have the ability to send Whiteboard PSLs to AAD guest users that will allow them to access and collaborate on whiteboards outside of meetings. This functionality is only available for PSLs generated for specific guest users.&nbsp;</p><p>If your tenant has <a href=\"https://learn.microsoft.com/entra/external-id/what-is-b2b\" target=\"_blank\">Business to Business Invitation Manager (B2B IM)</a> enabled, Whiteboard PSLs can be sent to non-guest users and an AAD guest account will be created for them in your tenant which will allow them to access the file.&nbsp;&nbsp;</p><p>Please note that Whiteboard will respect your OneDrive sharing settings. If your tenant does not allow sharing with guests, then it will continue to prevent sharing in Whiteboard as well.&nbsp;&nbsp;</p>\n<p>[What you need to do to prepare:]</p>\n<p>Ensure that your tenant’s OneDrive sharing settings reflect the level of sharing you would like to allow to your users.&nbsp;&nbsp;</p><p>It could be helpful to inform your users of this change.&nbsp;&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "124990"
    },
    {
      "Name": "Platforms",
      "Value": "Android, Desktop, iOS, TeamsAndSurfaceDevices, Web"
    }
  ],
  "EndDateTime": "2024-02-26T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC694383",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-11-30T00:04:35.21Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-30T00:03:19Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Whiteboard: External Guest Sharing via Specific People Share Link",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
