{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated January 30, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Viva Goals is launching this new team set up experience that enables end users to leverage their existing Microsoft 365 groups that they already own to create teams. The connected experience provides an effortless way for team owners to leverage the group membership and policy settings used commonly by Teams, SharePoint and other cloud apps. With this Microsoft 365 group-connected Viva Goals Teams experience, users will be able to also set their team` Viva Goals content as restricted and protect their team OKRs from unintended access.<br></p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=165682\" target=\"_blank\">165682</a></p>\n<p>[When this will happen:]</p><p>Standard Release: We will begin rolling out in late January 2024 (previously mid-January) and expect to complete by early-February 2024 (previously late January).</p>\n\n<p>[How this will affect your organization:]</p><p>Viva Goals will save time in creating teams from scratch and adding members to it as they can quickly use their existing groups to create teams in just a click. Since customers are already comfortable with Microsoft 365 groups, they do not have to climb a steep learning curve with respect to set up of teams.&nbsp;</p><p>IT and org admins will benefit from the seamless lifecycle and governance policies of Microsoft 365 group; This is because Team owners of these connected teams will have to make sure that the connected group adheres to the tenant level policies of Microsoft 365 groups, to keep the Viva Goals teams active.</p>\n<p>[What you need to do to prepare:]</p>\n<p>Once we send out our next pre-launch announcement, you can review our updated administration tool kit here. We’ve added important information about the way these Microsoft 365 connected Teams work and how to set up.&nbsp;&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "165682"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/viva/goals/intro-to-ms-viva-goals"
    }
  ],
  "EndDateTime": "2024-03-25T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC694124",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-30T23:18:12.457Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-29T01:28:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "(Updated) Microsoft 365 Groups Connected Viva Goals Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
