{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated February 16, 2024: We have updated the rollout timeline below. Thank your for your patience.</p><p style=\"\">Currently, there is there no support available for iOS users looking to edit PDF files on the previewer in Outlook mobile. We are rolling out a new “Open Microsoft 365” button that helps users open/edit PDF files received on Outlook through the Microsoft 365 for mobile app.<br></p>\n<p>[When this will happen:]</p>\n<p>Standard Release: We will begin rolling out mid-January 2024 (previously mid-December) and expect to complete by early March 2024 (previously early February).</p><p>[How this will affect your organization:]</p>\n\n<p>Users on iOS mobile will now be able to edit PDF files through their previewer in Outlook. The user can view a new “Open Microsoft 365” button (similar to that available for WXP files). On selecting the button, Microsoft 365 opens if the app is installed on the device. The user is redirected to the Microsoft 365 Appstore page if the app has not been installed on the device.</p>\n<p>[What you need to do to prepare:]<br></p>\n<p>You may want to notify your users about this change and update any relevant documentation as appropriate to build awareness about Microsoft 365 capabilities&nbsp; for mobile.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook Preview will have an updated \"Open Microsoft 365\" button to help users edit PDF files received on Outlook through the Microsoft 365 for mobile app. The rollout will begin mid-January 2024 and end early March 2024. iOS users will now be able to edit PDF files through their previewer in Outlook. Users will need to install the Microsoft 365 app if it is not already installed on their device. Organizations should notify their users about this change and update relevant documentation."
    }
  ],
  "EndDateTime": "2024-04-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC698126",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-16T22:59:18.993Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-14T04:14:21Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact"
  ],
  "Title": "(Updated) “Open Microsoft 365” button in Outlook Preview",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
