{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The Microsoft 365 app browser extension (formerly named Office browser extension) is a free extension available on Microsoft Edge and Google Chrome that gives you access to your Microsoft 365 apps and documents on the web. This extension will reach retirement and end of support on January 15th, 2024.&nbsp;</p><p>[When this will happen:]</p><p>January 15th, 2024</p><p>[How this will affect your organization:]</p><p>After this date, the extension will no longer receive security updates, non-security updates, bug fixes, or technical support. The Microsoft 365 browser extension will also be removed from Microsoft Edge and Google Chrome web stores as an extension add-on. Users should work in https://microsoft365.com as the central place to find apps and documents on the web. Users that have the browser extension installed will receive a note with a link to remove the extension using the guidance in the link below. There is no other action required.</p><p>[What you need to do to prepare:]</p><p>Communicate with your users and update training and documentation as appropriate.</p><p><a href=\"https://support.microsoft.com/office/end-of-support-for-the-microsoft-365-browser-extension-dc1024b4-92be-46eb-81a7-aea85368baa0\" target=\"_blank\">End of support for the Microsoft 365 Browser Extension</a></p><p><br></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-02-26T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC694123",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2023-11-29T01:28:06.027Z",
  "Services": [
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-29T01:26:35Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "End of support for the Microsoft 365 app browser extension",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
