{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 2, 2024: We have updated the content below with additional information. Thank you for your patience.</p><p>The Activity-Based Authentication Timeout for Outlook on the web will be replaced by Idle Session Timeout for Microsoft 365.</p><p>[When this will happen]\n</p><p>Starting in the second half of 2024.</p><p>[How this affects your organization]\n</p><p>In January 2024, we will begin to end support for Activity-Based Authentication Timeout. It is strongly recommended that all organizations who have not migrated to Idle-Session Timeout and are still using Activity-Based Authentication Timeout migrate to Idle Session Timeout, since no organization will be migrated automatically\n</p><p>Idle Session Timeout is already available and provides the same functionality as Activity-Based Authentication Timeout with the benefit of allowing the configuration not only for Outlook on the web, but for a range of other Microsoft 365 web apps.\n</p><p>To check the list of Microsoft 365 web apps, click&nbsp;<a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/idle-session-timeout-web-apps?view=o365-worldwide#details-about-idle-session-timeout\" target=\"_blank\" style=\"font-family: sans-serif; font-weight: 400; background-color: rgb(255, 255, 255);\">Details about idle session timeout</a>.</p><p>[What you can do to prepare]\n</p><p>You can migrate to Idle Session Timeout right now. To migrate to Idle Session Timeout, you only need to turn on Idle Session Timeout.\n</p><p>When Idle Session Timeout is enabled, users that reach the configured idle session timeout duration will get a notification that they are about to be signed out. They have to select to stay signed in or they will be automatically signed out of Microsoft 365 web apps, including Outlook on the web.</p><p>For more information about how to turn on Idle Session Timeout, click <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/idle-session-timeout-web-apps?view=o365-worldwide#turn-on-idle-session-timeout\" target=\"_blank\">Turn on Idle session timeout</a>.\n</p><p>For more information about Idle Session Timeout for Microsoft 365, click <a href=\"https://learn.microsoft.com/microsoft-365/admin/manage/idle-session-timeout-web-apps?view=o365-worldwide\" target=\"_blank\">Idle session timeout for Microsoft 365</a>.\n</p><p>For more information about Activity-Based Timeout for Microsoft Outlook on the web, click <a href=\"https://support.microsoft.com/topic/description-of-the-activity-based-authentication-timeout-for-owa-in-office-365-0c101e1b-020e-69c1-a0b0-26532d60c0a4\" target=\"_blank\">Description of the Activity-Based Authentication Timeout for OWA in Office 365</a>.</p><p>\n</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-12-30T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC694387",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-02T21:55:27.547Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-30T00:12:42Z",
  "Tags": [
    "Updated message",
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Outlook on the web: Replacing “Activity-Based Authentication Timeout” with “Idle Session Timeout for Microsoft 365”",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
