{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We have added new capabilities for admins in Viva Insights: Admins can disable the Reflection feature for their tenant, individual users, or AAD groups and M365 Groups.&nbsp;<br></p><p>[When this will happen:]<br></p><p>These changes will start to roll out in December 2023 and will be available worldwide by early February 2024.</p><p>[How this will affect your organization:]</p><p>A new capability for admins offers more flexibility to manage user access to specific Insights features: to start with, Insights Admins can configure access to the Reflection feature. They can configure access at the tenant level, group level (using AAD groups or M365 Groups), or at the user level, for maximum flexibility. \n</p><p>View our <a href=\"https://support.microsoft.com/topic/reflect-in-viva-insights-55379cb7-cf2a-408d-b740-2b2082eb3743\" target=\"_blank\">support content</a> to learn more about the Reflection feature.</p><p><br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1fBOO?ver=b3a2\" style=\"width: 400px;\"></p><p><br></p><p>Admins will now have the ability to configure access to this feature using a Powershell cmdlet. Use the Add-VivaModuleFeaturePolicy cmdlet to add a new access policy for a specific feature in Viva – in this case, Reflection. The attributes of the policy are defined using the various parameters of the cmdlet. Policies are used to restrict or grant access to the specified feature for specific users, groups, or the entire tenant.&nbsp;</p><p><br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1fzmH?ver=8e3d\" style=\"width: 400px;\"><br></p><p>For more information about the Powershell cmdlets and detailed instructions on how to set a policy, visit&nbsp;<a href=\"https://go.microsoft.com/fwlink/p/?linkid=2245618\" target=\"_blank\">Control access to features in Viva</a>&nbsp;<br></p><ul><li>Add-VivaModuleFeaturePolicy - Use this cmdlet to add a new access policy for a specific feature in Viva.</li><li>Get-VivaModuleFeaturePolicy - Use this cmdlet to view the access policies for a specified feature in a Viva module.</li><li>Remove-VivaModuleFeaturePolicy - Use this cmdlet to delete an access policy for a feature in a Viva module.\n</li><li>Update-VivaModuleFeaturePolicy - Use this cmdlet to update an access policy for a feature in a Viva module.</li></ul><p>[What you need to do to prepare:]</p><p>Review and assess the impact on your organization. Determine if you want to create a policy to configure access to the Reflection feature in Viva Insights.&nbsp;</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "ExternalLink",
      "Value": "https://go.microsoft.com/fwlink/p/?linkid=2245618"
    }
  ],
  "EndDateTime": "2024-03-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC697806",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-12-13T00:31:58.553Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-12-13T00:28:12Z",
  "Tags": [
    "Feature update",
    "Admin impact"
  ],
  "Title": "Viva Insights Feature Admin Controls: Reflection",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
