{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated December 22, 2023: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">Coming soon, Microsoft Purview Insider Risk Management will be rolling out the public preview of browsed to generative AI websites indicator.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=186584\" target=\"_blank\">186584</a></p>\n<p>[When this will happen:]</p>\n\n<p>Rollout will begin mid-January 2024 (previously mid-December) and is expected to be complete by early February 2024 (previously early January).&nbsp;</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>With this update, we are adding a new indicator, “browsed to generative AI sites,” for the risky browser usage policy template, giving visibility into organizational usage of generative AI domains. User information is pseudonymized by default with strong privacy controls in place to protect end user trust. While visiting one of these AI domains may be authorized by an organization, this indicator is designed to help ensure they are correctly accounting for whether and how, these sites may be accessed in policies.</p>\n<p>[What you need to do to prepare:]</p>\n<p>You can opt into the new indicator at insider risk settings &gt; policy indicators.</p><p>Microsoft Purview Insider Risk Management correlates various signals to identify potential malicious or inadvertent insider risks, such as IP theft, data leakage, and security violations. Insider Risk Management enables customers to create policies based on their own internal policies, governance, and organizational requirements. Built with privacy by design, users are pseudonymized by default, and role-based access controls and audit logs are in place to help ensure user-level privacy.</p><p>You can access the Insider Risk Management solution in the <a href=\"https://purview.microsoft.com/compliance\" target=\"_blank\">Microsoft Purview compliance portal.</a></p><p> \n</p><p>Learn more: <a href=\"https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators\" target=\"_blank\">Configure policy indicators in insider risk management | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "186584"
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/purview/insider-risk-management-settings-policy-indicators"
    }
  ],
  "EndDateTime": "2024-03-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC690597",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2023-12-22T05:58:35.417Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2023-11-17T00:25:28Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "(Updated) Microsoft Purview Insider Risk Management: Public preview of browsed to generative AI websites indicator",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
