{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Now, the “Recap” tab for scheduled meetings will include access to the recording and transcript.  For meetings that have a “Recap” tab, the previous “Recording and Transcription” tab will be removed since the “Recap” tab will replace it. For meetings that don’t have a “Recap” tab, users can continue to access the recording and transcript from the “Recording and Transcription” tab.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=181918\" target=\"_blank\">181918</a></p><p>[When this will happen:]</p><p>Targeted release: We will begin rolling out early February 2024 and expect to complete by early February 2024.</p><p>Standard Release: We will begin rolling out late February 2024 and expect to complete by early March 2024.</p><p>[How this will affect your organization:]</p><p>As users are able to review recording and transcription in the \"Recap\" tab now, the \"Recording and Transcription\" tab will be removed. For the meetings that do not have the \"Recap\" tab, please continue to review in the \"Recording and Transcription\" tab.</p><p>[What you need to do to prepare:]\n</p><p>There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "181918"
    },
    {
      "Name": "Platforms",
      "Value": "Desktop, Mac, Web"
    }
  ],
  "EndDateTime": "2024-04-19T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC704958",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-13T00:12:40.853Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-08T23:48:53Z",
  "Tags": [
    "Feature update",
    "User impact"
  ],
  "Title": "Meeting \"Recording and Transcription\" tab will be replaced by \"Recap\" tab",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
