{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated February 7, 2024: We have updated the content below for clarity. Thank you for your patience.</p><p style=\"\">We will be introducing the existing Teams Meetings feedback surveys (such as Net Promoter Score (NPS)) to unauthenticated users that join Teams Meetings. When an unauthenticated user joins a meeting originating from your organization, they may be eligible to receive a prompt to complete a feedback survey on their Microsoft Teams experience. We will be introducing a new Teams Meeting Configuration policy setting that will allow tenant admins to disable all Teams Meeting feedback surveys for unauthenticated users if needed.</p>\n<p>[When this will happen:]</p>\n\n<p>Standard Release: We will begin rolling out late February 2024 and expect to complete by late February 2024.<br></p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>When released, all unauthenticated users attending Teams Meetings originating from your organization will be eligible to receive surveys from Microsoft to assess their product experience. Some feedback responses, such as NPS, will appear in the existing feedback hub in the Microsoft Admin Center &gt; Health &gt; Product Feedback section. It will appear in the same format and tagging as internal user feedback.</p>\n<p>[What you need to do to prepare:]</p>\n<p>If you do not want unauthenticated meeting attendees to receive feedback surveys, you can implement a tenant policy via PowerShell to disable all feedback surveys for unauthenticated users in Teams Meetings. Use the CsTeamsMeetingConfiguration policy and the FeedbackSurveyForAnonymousUsers setting to enable/disable feedback surveys. This setting is default set to 'Enabled' but can be disabled via PowerShell. For more information about configuring this setting, visit <a href=\"https://learn.microsoft.com/powershell/module/skype/set-csteamsmeetingconfiguration?view=skype-ps\" target=\"_blank\">Set-CsTeamsMeetingConfiguration</a>.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/powershell/module/skype/set-csteamsmeetingconfiguration?view=skype-ps"
    }
  ],
  "EndDateTime": "2024-03-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC703705",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-07T22:18:03.703Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-04T00:43:49Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "(Updated) New Policy: Turn Off Teams Meeting Feedback Surveys for Unauthenticated Users",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
