{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Meeting invite is the first thing that the user invited to the meeting sees before joining. We are making some design improvements to make sure we have the most important information there and it's better grouped.&nbsp;<br></p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=366447\" target=\"_blank\">366447</a></p>\n\n<p>[When this will happen:]<br></p><p>Standard Release: We will begin rolling out mid-February 2024 and expect to complete by mid-March 2024.</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>With this update, the link for joining the meeting will become more visible – we changed the link text and also made it bigger. Sometimes people have troubles joining or simply have questions related to meeting join – after this update they’ll be able to easily find the information from Microsoft Help Center about that by clicking on “Need help” link of the very top of the meeting invite. If users need additional info for joining the meeting (e.g. meeting if or passcode) - they will also find it and it won’t be confused with other IDs (e.g. phone conference ID or video ID).&nbsp;</p><p>There are some options in the meeting invite that are highly relevant to meeting organizers only (in some use cases) and will be useless for participants – we moved these options to a separate session “For organizers”.</p><p>Please note that the screenshot below is only an example of how meeting invite may look like, your tenant may not have some of this functions/features enabled, in this case some of the blocks won’t be present.</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1gvBs?ver=2f8a\" style=\"width: 400px;\"><br></p>\n<p>[What you need to do to prepare:]</p>\n<p>You may consider updating your internal documentation to inform your users about this improvement.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "366447"
    }
  ],
  "EndDateTime": "2024-04-22T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC706174",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-01-12T02:45:50.17Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-12T02:45:09Z",
  "Tags": [
    "New feature",
    "User impact"
  ],
  "Title": "Microsoft Teams: Meeting invite improvements",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
