{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>In our continuous drive to increase the security of Microsoft Teams meetings, we are updating the labels for the participants' names. To bring in consistency and accuracy to the user labels, we are introducing the term Unverified, which will be seen for all meeting participants who do not have a trusted relationship with the organizer. All participants who are not part of the organizer's organization but are configured as a trusted relationship with the organizer will continue to be termed as External.</p><p>Additionally, we are ensuring that all areas within Team meetings - lobby, participant roster, meeting chat, and so on - will consistently show accurate user labels.</p>\n<p>[When this will happen:]</p><p>Standard Release: We will begin rolling out mid-February 2024 and expect to complete by early March 2024 for all the in-meeting participant views. Other areas within Teams meetings will soon follow with these updates. This will be announced in a future post.</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>Organizers and meeting participants in your organization who attend meetings with users outside of their organization - with or without a Microsoft Entra ID - will see the changes in labels that reflect the trust level of the participant with the organizer (External, Unverified, or no label). \n</p><ul><li>No label: All participants who are part of the organizer’s organization.\n</li><li>External: All participants who are external to the organizer’s organization but have a trusted relationship with the organizer or their organization.\n</li><li>Unverified: All other participants will be seen with this label. This will include Microsoft Entra ID users who belong to organizations that do not have an explicit external access setup with the organizer’s organization, Microsoft Account (personal) users, users who are not using any Microsoft ID while joining meetings, and others.</li></ul>\n<p>[What you need to do to prepare:]</p>\n<p>To prepare for this change, share this information with the meeting organizers who regularly invite participants outside of their organizations.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating labels for meeting participants to increase security. The term \"Unverified\" will be used for participants who do not have a trusted relationship with the organizer, while \"External\" will be used for those who are not part of the organizer's organization but have a trusted relationship. All areas within Team meetings will consistently show accurate user labels. The update will roll out mid-February 2024 and will affect organizers and meeting participants who attend meetings with users outside of their organization. No action is required to prepare for this change, but meeting organizers should be informed."
    }
  ],
  "EndDateTime": "2024-04-15T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC716008",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-14T23:46:30.2Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-14T23:46:05Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Updated labels for external participants in meetings",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
