{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 25, 2024: We plan to gradually roll out changes to the cloud app catalog starting later in 2024.  We will alert you via a new Message center post when we are ready to proceed. Thank you for your patience.</p><p>Microsoft Defender for Cloud Apps is making some changes to the cloud app catalog to improve our app risk scoring. </p><p>[When this will happen:]<br></p><p>We will communicate via Message center when we are ready to proceed.<br></p><p>[How this will affect your organization:]</p><p>We will remove the following irrelevant and redundant indicators from the catalog:</p><ul><li>Consumer Popularity Index\n</li><li>Safe Harbor\n</li><li>Jericho Forum Commandments\n</li><li>Heartbleed patched\n</li><li>Protected against DROWN\n</li><li>ISO 27002\n</li><li>The following PCI-DSS values: 1, 2, 3, 3.1, and 3.2\n</li></ul><p>We will also remove the following indicators from the default score calculation. These indicators will continue to be presented in the catalog and can be included in score calculations by configuring the score metrics: \n</p><ul><li>Founded\n</li><li>Holding\n</li><li>Domain Registration\n</li><li>FedRAMP level\n</li><li>FISMA</li></ul><p>Due to the changes in this message:\n</p><ul><li>If you’ve created discovery policies based on a total app score or any of the removed indicators, the risk score for some apps may change and new alerts may be triggered.&nbsp;</li><li>Any existing policies that were created based on the removed indicators will be disabled.</li></ul><p>[What you need to do to prepare:]<br></p><p>We recommend that you review your existing policies and modify them or create new policies as needed.</p><p>To learn more about the Cloud app catalog and risk scoring of apps: <a href=\"https://learn.microsoft.com/defender-cloud-apps/risk-score\" target=\"_blank\">Cloud app catalog and risk scores - Microsoft Defender for Cloud Apps | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Defender for Cloud Apps is making changes to the cloud app catalog to improve app risk scoring. Irrelevant and redundant indicators will be removed from the catalog, and some indicators will be removed from the default score calculation. These changes will be gradually rolled out later in 2024, and you will be alerted via a new Message center post when we are ready to proceed."
    }
  ],
  "EndDateTime": "2024-03-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715689",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-26T02:03:12.01Z",
  "Services": [
    "Microsoft Defender XDR",
    "Microsoft Defender for Cloud Apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-14T01:07:19Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "Admin impact"
  ],
  "Title": "Microsoft Defender for Cloud Apps: Changes to cloud app catalog",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
