{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>A small subset of the functionality in the Viva Insights Teams app, Viva Insights Outlook plug-in, and Viva Insights in-line nudges will be retired.</p><p>[When this will happen:]</p><p>Beginning late February 2024.</p><p>[How this affects your organization:]</p><p>You are receiving this message because our reporting indicates one or more users in your organization can access these features.\n</p><p>Currently, Viva Insights shows users suggested tasks based on commitments and requests they have made or received via email and Teams chat messages. \n</p><ul><li>While Viva Insights will continue to show users some task recommendations, such as reminders to prepare for upcoming meetings or to plan time away (details hyperlinked below), those suggestions will no longer include commitments and requests based on email and chat messages. \n</li><li>Specifically, within the Viva Insights Teams app, one of the sections of the Productivity tab, labeled “Suggested tasks”, will be retired.\n</li></ul><p>The following documentation sources describe suggested tasks available on each Viva Insights surface:\n</p><ul><li>Teams app: <a href=\"https://support.microsoft.com/topic/suggested-tasks-in-viva-insights-b326af14-e527-43c2-a4d8-92f6700ce18f\" target=\"_blank\">Suggested tasks in Viva Insights - Microsoft Support</a>\n<ul><li>The subsection labeled “Suggested tasks” will be retired.</li></ul></li><li>Outlook plug-in: <a href=\"https://support.microsoft.com/topic/use-microsoft-viva-insights-in-outlook-83d09caa-bfe8-4cb9-8f64-30afd79cc75d\" target=\"_blank\">Use Microsoft Viva Insights in Outlook - Microsoft Support</a>\n<ul><li>The subsections labeled “View outstanding tasks” and “Follow up on your requests” will be retired.</li></ul></li><li>Inline nudges: <a href=\"https://support.microsoft.com/topic/inline-suggestions-in-outlook-064a323e-6dc7-40e9-ab1b-199de8d39db5\" target=\"_blank\">Inline suggestions in Outlook - Microsoft Support</a>\n<ul><li>The subsection labeled “View outstanding tasks” will be retired.</li></ul></li></ul><p></p><ul></ul><p></p><p>[What you need to do to prepare:]</p><p>You may consider updating your training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [],
  "EndDateTime": "2024-04-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC713042",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-06T00:10:10.407Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-06T00:09:47Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Viva Insights: Changes to Suggested Tasks",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
