{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>As previously communicated in MC679529 (October 2023), we simplified permissions for Microsoft Purview Audit. This message is a clarification.&nbsp;<br></p><p>We have simplified the controls to manage Audit permissions in Microsoft Purview. You can now manage permissions from the Microsoft Purview Compliance portal. To search or export the audit log, administrators or members of investigation teams must be assigned to at least one of the <i>View-Only Audit Logs</i> or <i>Audit Logs</i> roles. These roles can be assigned through the Microsoft Purview Compliance portal. By default, these roles are assigned to the<i> Audit Reader</i> and <i>Audit Manager</i> role groups on the <i>Permissions </i>page in the Compliance portal.<br></p><p>Access to enable or disable auditing and access to audit cmdlets currently requires permissions from the Exchange admin center. You can use the existing <i>Audit Logs</i> and <i>View-Only Audit Logs</i> roles in the Exchange admin center to grant access to enable or disable auditing and access to audit cmdlets. By default, these roles are assigned to the <i>Compliance Management</i> and <i>Organization Management </i>roles on the <i>Permissions </i>page in the Exchange admin center.</p><p>Learn more about <i>Audit permission controls:&nbsp;</i><a href=\"https://learn.microsoft.com/purview/audit-standard-setup#step-2-assign-permissions-to-search-the-audit-log\" target=\"_blank\">Set up Audit (Standard) in Microsoft 365 | Microsoft Learn</a>.</p><p>[When this will happen:]</p><p>This change rolled out in November 2023.</p><p>[How this will affect your organization:]</p><p>We recommend that you use the Compliance portal to manage Audit permissions related to accessing Audit through the Compliance portal user interface. Any existing Audit permissions already assigned through the Exchange admin center will continue to be honored--you do not need to take any action to replicate these permissions at this point. You can learn more about the Audit permission controls at <a href=\"https://learn.microsoft.com/purview/audit-standard-setup#step-2-assign-permissions-to-search-the-audit-log\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Set up Audit (Standard) in Microsoft 365 | Microsoft Learn</a>.</p><p>Audit enables customers to centrally visualize cloud log data generated across their enterprise, thus helping them effectively respond to security events, forensic investigations, internal investigations and compliance obligations. Thousands of user and admin operations performed in dozens of Microsoft 365 services and solutions are captured, recorded, and retained in customers' unified Audit logs.&nbsp;</p><p><i>References</i></p><p>Learn about Microsoft Purview Audit: <a href=\"https://learn.microsoft.com/purview/audit-solutions-overview\" target=\"_blank\">Auditing solutions in Microsoft Purview | Microsoft Learn</a></p><p>Learn about the&nbsp;<a href=\"https://compliance.microsoft.com/\" target=\"_blank\">Compliance portal</a></p><p>Learn about the Exchange admin center:&nbsp;<a href=\"https://learn.microsoft.com/Exchange/permissions-exo/role-groups\" target=\"_blank\">Manage role groups in Exchange Online | Microsoft Learn</a></p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [],
  "EndDateTime": "2024-03-01T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC711660",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-01T04:15:33.01Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-01T04:15:23Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Purview | Audit: Simplified permissions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
