{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>This is an updated timeline for the rollout of the new Teams to Commercial and Education customers. The new Teams is available for all customers today and is being enabled in stages as defined below. Teams Admin Center policy controls <b>will remain available until end of March 2024, at which point they will only apply to your VDI users if applicable</b>. We have heard your feedback; if we are unable to update to new Teams by the end of March, users will be allowed to remain on classic Teams until classic Teams is no longer available. More updates on the end of availability will come in the next few weeks.</p><p>We recommend updating your organization to the latest version of the new Teams at your earliest convenience as<b> all new feature development will only be available in new Teams</b>. Comprehensive documentation is available here: <a href=\"https://learn.microsoft.com/microsoftteams/teams-classic-client-end-of-availability\" target=\"_blank\">End of availability for classic Teams client - Microsoft Teams | Microsoft Learn</a>\n</p><p>To help you execute and monitor your transition to new Teams, <b>we have released a new usage report in Teams Admin Center</b> that will show you usage of classic Teams vs new Teams within your tenant. Documentation is available here: <a href=\"https://learn.microsoft.com/MicrosoftTeams/new-teams-usage-report\" target=\"_blank\">Usage report for new Teams client - Microsoft Teams | Microsoft Learn</a>\n</p><p><b>Microsoft-controlled rollout</b>. If your policy is set to Microsoft-controlled (default state), Microsoft will continue rolling out new Teams on your behalf. There is one final stage remaining for this rollout option:\n</p><ul><li><b>New Teams Only:</b> Beginning early April 2024, all remaining classic Teams users will be updated to new Teams and the toggle switch will be removed. If we are unable to update to new Teams, users will be allowed to remain on classic Teams until classic Teams is no longer available. See End of Availability section below for more information. After this completes, Microsoft will attempt to uninstall classic Teams just once on your behalf after a small delay of 14 days. If this uninstall is blocked for any reasons (e.g. by machine configuration, etc.) the uninstall will not be attempted again and you will need to <a href=\"https://learn.microsoft.com/microsoftteams/msi-deployment#uninstallation\" target=\"_blank\">remove classic Teams</a> yourself if you want.\n</li></ul><p><b>Admin-managed rollout</b>. Admins may choose to control their new Teams rollout by setting the Teams update policy for their users (as described in: <a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center\" target=\"_blank\">Upgrade to the new Teams client using policies - Microsoft Teams | Microsoft Learn</a>.) Admins may control the Teams update policy until end of March 2024. \n</p><p>Starting early April, 2024, Teams update policies you have applied in the past or policies you apply going forward in Teams Admin Center or with PowerShell will no longer be honored except for your VDI users, if applicable. When this change is complete, a Microsoft-controlled rollout will begin according to the following schedule.\n</p><ul><li><b>New Teams becomes the default app:</b> Beginning early April 2024, new Teams will become the default app for all Teams users. The toggle will still be available to users to switch back to classic Teams if needed.\n</li><li><b>New Teams Only:</b> Beginning mid-May 2024, all remaining classic Teams users will be updated to new Teams and the toggle switch will be removed. If we are unable to update to new Teams, users will be allowed to remain on classic Teams until classic Teams is no longer available. See End of availability section below for more information. After this completes, Microsoft will attempt to uninstall classic Teams just once on your behalf after a small delay (currently 14 days, subject to change). If this uninstall is blocked for any reasons (e.g. by machine configuration, etc.) the uninstall will not be attempted again and you will need to <a href=\"https://learn.microsoft.com/microsoftteams/msi-deployment#uninstallation\" target=\"_blank\">remove classic Teams</a> yourself if you want.\n</li></ul><p><b>End of availability:</b> We will release more information in the next few weeks around the end of availability for classic Teams. <b>Based on your feedback, we will not block classic Teams users who do not meet the new Teams </b><a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center#prerequisites\" target=\"_blank\" style=\"font-weight: bold;\">prerequisites</a><b> or who experience other </b><a href=\"https://learn.microsoft.com/microsoftteams/new-teams-troubleshooting-installation\" target=\"_blank\" style=\"font-weight: bold;\">install failures</a><b> until July 1, 2024,&nbsp;at the earliest</b> to provide you more time to address these issues for your users and avoid disruption to your business.\n</p><p>(For more information on this update, see this document: <a href=\"https://learn.microsoft.com/MicrosoftTeams/new-teams-automatic-upgrade-announced\" target=\"_blank\">Classic Teams users to be automatically updated to new Teams - Microsoft Teams | Microsoft Learn</a>)</p><p>[When this will happen:] \n</p><p>Standard Release (if applicable): The new Teams rollout is ongoing and will reach all users by July 2024, as detailed above.\n</p><p>[How this will affect your organization:]\n</p><p>Until end of March, administrators may control the rollout of new Teams within their tenant. We recommend that tenants plan to update their users to new Teams now to ensure that they receive all the latest improvements and enhancements to the product.\n</p><p>[What you need to do to prepare:]\n</p><p>Administrators can develop their plan for updating their tenants and control the rollout of updates using policy until March 31, 2024, as documented above: \n</p><ul><li><a href=\"https://learn.microsoft.com/microsoftteams/new-teams-deploy-using-policies?tabs=teams-admin-center\" target=\"_blank\">Upgrade to new Teams using policies - Microsoft Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/new-teams-bulk-install-client\" target=\"_blank\">Bulk deploy the new Microsoft Teams desktop app - Microsoft Teams | Microsoft Learn</a>\n</li><li><a href=\"https://learn.microsoft.com/microsoftteams/new-teams-desktop-admin\" target=\"_blank\">Overview of the new Microsoft Teams - Microsoft Teams | Microsoft Learn </a></li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "The message announces an updated timeline for the rollout of the new Teams to Commercial and Education customers. The new Teams is available for all customers today and is being enabled in stages. Teams Admin Center policy controls will remain available until end of March 2024, at which point they will only apply to VDI users if applicable. All new feature development will only be available in new Teams. Microsoft will continue rolling out new Teams on behalf of customers until early April 2024. Admins may control the Teams update policy until end of March 2024. Beginning early April 2024, new Teams will become the default app for all Teams users. The new Teams rollout is ongoing and will reach all users by July 2024."
    }
  ],
  "EndDateTime": "2025-01-22T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC718748",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-23T22:54:56.893Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-23T22:54:28Z",
  "Tags": [
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "New Teams rollout schedule for Commercial and EDU customers",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
