{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Organizers who schedule meetings where attendees are presenters by default will now have a secured Microsoft Teams meetings experience. We are introducing a PowerShell, so admins can control the presenter role permissions in untrusted environments, such as EDU, where students assigned as presenters can remove other students from the meeting.&nbsp;<br></p><p>Key changes that apply to personal and work or school accounts excluding Microsoft Teams Rooms:<br></p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1gnNy?ver=14ab\" style=\"width: 400px;\"><br></p><ul><li>Disable attendee mics/cameras (hard mute) - Educators no longer need to worry about being muted by students in the classroom.<br></li><li>Enable single/all attendee mics/cameras - Educators no longer need to worry about students turning off their cameras or muting them during the meeting.</li><li>Change the roles of other participants - Stop other students from being able to present by converting them into an attendee.</li><li>Lower participants' hands (including 'lower all hands' from the participant roster in-meeting) - Stop other students from lowering other students' hands.</li><li>Remove participants - Stop other students from removing participants in the meeting.</li></ul><p>This message is associated with Microsoft 365 Roadmap ID: <a href=\"https://www.microsoft.com/microsoft-365/roadmap?rtc=1%26filters=&amp;searchterms=319398\" target=\"_blank\">319398</a></p><p>[When this will happen:]</p><p>Targeted Release: We will begin rolling out early March 2024 and expect to complete by end of March 2024.</p><p>Standard Release: We will begin rolling out early April 2024 and expect to complete by end of April 2024.</p><p>[How this will affect your organization:]</p><p><img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1gqlV?ver=0178\" style=\"width: 400px;\"><br></p><p>IT admins can manage this feature via PowerShell with:</p><p>Set-CsTeamsMeetingConfiguration -LimitPresenterRolePermissions (boolean)</p><p>You can read more about roles in Microsoft Teams meetings <a href=\"https://support.microsoft.com/office/roles-in-microsoft-teams-meetings-c16fa7d0-1666-4dde-8686-0a0bfe16e019#:~:text=There%20are%20three%20roles%20to,while%20attendees%20are%20more%20controlled.\" target=\"_blank\">here</a>.</p><p>[What you need to do to prepare:]<br></p><p>There is nothing you need to do to prepare.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is introducing a PowerShell to allow admins to control presenter role permissions in untrusted environments. Key changes include disabling attendee mics/cameras, enabling single/all attendee mics/cameras, changing the roles of other participants, lowering participants' hands, and removing participants. Targeted and standard releases will begin in March and April 2024, respectively. IT admins can manage this feature via PowerShell. No preparation is required."
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715431",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-16T22:54:40.143Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-13T01:32:49Z",
  "Tags": [
    "User impact",
    "Admin impact"
  ],
  "Title": "Microsoft Teams: Limit Presenter Role Permissions",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
