{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated February 21, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p style=\"\">An organization’s Global Admin is set by default as the Microsoft Viva Glint Admin, but they likely are not the ones using the platform. They need the ability to assign the correct person as their organization’s Viva Glint Admin and remove themselves.</p><p>Viva Glint (Service) administrators can now be assigned through the Microsoft 365 Admin Center (MAC) in addition to being able to setup within the Viva Glint product.  There will not be changes to existing user roles.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=163984\" target=\"_blank\">163984</a></p>\n<p>[When this will happen:]</p><p>Standard Release: We will begin rolling out early March 2024 (previously mid-February) and expect to complete by mid-March 2024 (previously late February).</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>From the Microsoft Viva suite page, admins can navigate to an individual app page and follow a guided dashboard that helps them set up and configure first steps. Upon completing the steps in the guided dashboard, Global Tenant Admins can now prepare to let the Viva Glint Admin take over management of the app. Global Tenant Admins can search, select, and confirm Viva Glint Admins by searching for these employees in their company’s Active Directory.\n</p><p><a href=\"https://learn.microsoft.com/viva/glint/introduction-viva-glint\" target=\"_blank\" style=\"background-color: rgb(255, 255, 255); font-family: sans-serif; font-weight: 400;\">Learn more about Viva Glint and how to manage it</a>.&nbsp;<br></p>\n<p>[What you need to do to prepare:]</p>\n<p>The following information must be available in order to assign Viva Glint Admins:\n</p><ul><li>First name\n</li><li>Last name\n</li><li>Business email address</li><li>Employee ID\n</li><li>Employee status – ACTIVE or INACTIVE\n</li></ul><p>Following this assignment, ensure that this person exists in the Viva Glint HRIS (human resources information system) file and is assigned the role of Company Admin.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "163984"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Glint admins can now be assigned through the Microsoft 365 Admin Center. Global Tenant Admins can search, select, and confirm Viva Glint Admins by searching for these employees in their company’s Active Directory. The rollout will begin early March 2024 and expect to complete by mid-March 2024. The message provides information on what is needed to assign Viva Glint Admins."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Viva Glint admins can now be assigned through the Microsoft 365 Admin Center. Global Tenant Admins can search, select, and confirm Viva Glint Admins by searching for these employees in their company’s Active Directory. The rollout will begin early March 2024 and expect to complete by mid-March 2024. The message provides information on what is needed to assign Viva Glint Admins."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-05-12T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715420",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-21T21:43:38.557Z",
  "Services": [
    "Microsoft 365 apps",
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-13T01:17:59Z",
  "Tags": [
    "Updated message",
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft Viva Glint: Use Microsoft 365 admin center to assign your organization's Viva Glint admins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
