{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Updated February 21, 2024: We have updated the rollout timeline below. Thank you for your patience.</p><p>We’re upgrading to the latest Fluent visual styling on the Microsoft SharePoint platform. You may notice minor changes, such as slight changes in padding or color on various user interface (UI) controls.</p><p>[When this will happen:]&nbsp;</p><p>Targeted Release: We will begin rolling out late February 2024 (previously mid-February) and expect to complete by early April 2024 (previously late March).&nbsp;</p><p>Worldwide: We will begin rolling out mid-April 2024 (previously early April) and expect to complete by mid-July 2024 (previously late June).&nbsp;</p><p>[How this will affect your organization:]&nbsp;</p><p>You may notice minor changes, such as slight changes in padding or color on various UI controls.&nbsp;</p><p>[What you need to do to prepare:]&nbsp;</p><p>There is no action needed to prepare for this change. You may want to notify your users about this change and update any relevant documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft SharePoint will upgrade to the latest Fluent visual styling, with minor changes in padding or color on various UI controls. The rollout will begin in late February 2024 for Targeted Release and mid-April 2024 for Worldwide. No action is needed to prepare for this change."
    }
  ],
  "EndDateTime": "2024-08-26T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC713894",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-21T21:57:01.347Z",
  "Services": [
    "SharePoint Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-08T04:35:00Z",
  "Tags": [
    "Updated message",
    "Feature update",
    "User impact"
  ],
  "Title": "(Updated) Upgrade for the latest Microsoft Fluent Design System visual styling on Microsoft SharePoint",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
