{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We’re making some changes to the way Outlook supports contextual add-ins. Contextual add-ins activate based on the content of an email message or a meeting request. Currently, Outlook supports two methods for activating contextual add-ins: entity stamping and regular expression (regex) matching. </p><p>Entity stamping is a process where Outlook identifies and highlights certain types of data in a message, such as addresses, phone numbers, meeting suggestions, and task suggestions. When a user clicks on a highlighted entity, Outlook shows a list of add-ins that are relevant to that entity. </p><p>Regex matching is a process where Outlook matches the content of a message against a set of regular expressions provided by the add-in developer. When a match is found, Outlook provides a control that can launch the add-in.</p><p>[When this will happen:]</p><p>We will begin rolling this out in mid-May 2024 and expect to complete by mid-June 2024.</p><p> </p><p>[How this will affect your organization:]<br></p><p>We’re retiring entity stamping and will stop highlighting entities in Outlook. This means that add-ins that rely on entity stamping will no longer activate when highlighted entities are selected. Add-ins that rely on entity stamping, such as Bing Maps, Action Items, and Suggested Meetings, will also be retired. However, we will continue to support regex matching in add-ins and the Join Meeting button in online meeting add-ins.</p><p>If you have any add-ins that use entity stamping, you’ll need to update them to use regex matching or the Join Meeting button prior to this change happening. Otherwise, your add-ins won’t activate in Outlook and may lose functionality.</p><p>As part of this retirement, the following APIs will stop working for add-ins:</p><ul><li>getEntities()</li><li>getEntitiesByType(entityType)&nbsp;</li><li>getFilteredEntitiesByName(name)&nbsp;</li><li>getSelectedEntities()&nbsp;</li></ul><p>[What you need to do to prepare:]</p><p>To learn how to update your add-ins, see <a href=\"https://learn.microsoft.com/office/dev/add-ins/outlook/use-regular-expressions-to-show-an-outlook-add-in\" target=\"_blank\">Use regular expression activation rules to show an Outlook add-in</a> and <a href=\"https://learn.microsoft.com/office/dev/add-ins/outlook/online-meeting?tabs=non-mobile\" target=\"_blank\">Create an Outlook add-in for an online-meeting provider.</a> For more details on the announcement, see <a href=\"https://devblogs.microsoft.com/microsoft365dev/retirement-of-entity-based-contextual-outlook-add-ins/\" target=\"_blank\">Retirement of entity-based contextual Outlook add-ins</a>.</p><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Outlook will retire entity stamping for contextual add-ins in mid-May to mid-June 2024. Add-ins relying on entity stamping, such as Bing Maps, Action Items, and Suggested Meetings, will also be retired. Regex matching and the Join Meeting button in online meeting add-ins will still be supported. Add-in developers need to update their add-ins to use regex matching or the Join Meeting button before the change to avoid losing functionality. Some APIs will also stop working for add-ins. See provided links for more information."
    },
    {
      "Name": "BlogLink",
      "Value": "https://devblogs.microsoft.com/microsoft365dev/retirement-of-entity-based-contextual-outlook-add-ins/"
    },
    {
      "Name": "HelpLink",
      "Value": "https://learn.microsoft.com/office/dev/add-ins/outlook/use-regular-expressions-to-show-an-outlook-add-in"
    }
  ],
  "EndDateTime": "2024-07-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715428",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-13T01:30:29.817Z",
  "Services": [
    "Exchange Online",
    "Microsoft 365 for the web",
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-13T01:29:55Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of entities in Outlook for contextual add-ins",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
