{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We are dedicated to providing our customers with the tools they need to achieve what matters, in their work and life. In order to focus on new benefits, we occasionally remove features and products.</p><p>In October 2026, Microsoft Publisher will reach its end of life. After that time, it will no longer be included in Microsoft 365 and existing on-premises suites will no longer be supported. Until then, support for Publisher will continue and users can expect the same experience as today.\n</p><p>As we look ahead to the retirement of Microsoft Publisher, we are exploring modern ways to achieve other common Publisher scenarios across applications like Microsoft Word, PowerPoint, and Designer.  We will update as we have more to share.&nbsp;&nbsp;</p><p>[When this will happen:]</p><p>October 13, 2026</p><p>[How this will affect your organization:]</p><p>You can continue to use Publisher with its current functionality until October 2026. \n</p><p>Support for the perpetual version of Publisher will end in October 2026, when Office LTSC 2021 reaches end of support. Microsoft 365 customers will not be able to access Publisher from that date forward. \n</p><p>[What you need to do to prepare:]<br></p><p>No action is required at this time. This notice is to allow you sufficient time to plan. We will share additional updates as the date approaches.\n</p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Publisher will no longer be supported after October 2026. Users can continue to use it with its current functionality until then. Support for the perpetual version of Publisher will end in October 2026. No action is required at this time, but Microsoft is exploring modern ways to achieve common Publisher scenarios across other applications."
    }
  ],
  "EndDateTime": "2026-11-30T08:00:00Z",
  "HasAttachments": false,
  "Id": "MC716267",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-15T17:12:45.637Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-15T17:12:22Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Microsoft Publisher will no longer be supported after October 2026",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
