{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We would like to inform you of an upcoming change that affects how a subset of users post and reply to conversations via email. The ability to create a new post or reply to an existing post directly using email will be retired from Viva Engage starting on March 31st, 2024. Interactive emails in Outlook provide the richest way to stay engaged in Viva Engage conversations, polls, questions, and praise, without leaving the Outlook inbox.<br></p><p>Historically, users could create new posts in a Viva Engage community by sending an email to a specific email address for that community. Additionally, users can reply to an existing post via an email sent to that conversation. These flows will stop working. Users must instead utilize one of the options listed below for their scenario. &nbsp;</p><p>If users attempt to post in a community or reply to an existing community post via email after the feature is disabled, they will receive an email notification explaining that the feature is no longer available. All other email related Engage features will remain unaffected. Community posts will still generate email notifications, and users will still be able to reply and react to posts using the Viva Engage Web, Mobile, Teams, and Outlook interactive email experiences. &nbsp;</p><p> </p><p>[When will this happen:]</p><p>Retirement will begin in late March 2024 and is expected to complete by late May 2024. We will not be providing extensions for continued use of these retired features. </p><p>[How this will affect your organization:]</p><p>If your organization makes heavy use of post to Viva Engage by sending an email message, they will be impacted by this change and may need to alter business processes. However, we expect minimal impact from this change for most customers.</p><p>After the feature is retired, users can expect to receive a bounce back email with deprecation information if they attempt to create a post by sending an email to the community email address. Additionally, they will receive a similar bounce back email if they attempt to reply to an existing post via email. </p><p>[What you need to do to prepare:]</p><p>Whether admin action is required depends upon how the post by email feature is being used in an organization. Most customers will have no action beyond reviewing internal help of guidance that may have been created for end users.</p><p>Admins can use the following examples to identify usage and key stakeholders within their organization, but other scenarios may exist:   </p><ul><li>If you are using an email client such as Outlook as a free form editing experience to create rich media posts, the new Viva Engage <a href=\"https://admin.microsoft.com/Adminportal/Home?source=applauncher#/MessageCenter?id=MC712149\" target=\"_blank\">Articles</a> feature is the best alternative.  &nbsp;</li><li>When Delayed Delivery in Outlook is used to schedule when posts are sent to a community, the new Viva Engage <a href=\"https://support.microsoft.com/topic/save-and-schedule-drafts-to-post-later-in-viva-engage-dc806ad9-73bb-49ae-9c68-d800fd902649\" target=\"_blank\">Scheduled Posts</a>  is the best alternative, as it allows scheduling announcements and posts when the audiences are most active. &nbsp;</li><li>Automatic posting workflows may be set up to post new messages, or reply to posts, through email from outside applications. These need to be reviewed and changed to use alternative mechanisms. Posting is possible through the Viva Engage <a href=\"https://learn.microsoft.com/rest/api/yammer/messages-json-post\" target=\"_blank\">REST API</a> and <a href=\"https://learn.microsoft.com/connectors/yammer/\" target=\"_blank\">Power Platform</a>, but admins will need to identify the appropriate solution and make changes for each scenario.</li></ul>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Starting March 31st, 2024, the ability to create a new post or reply to an existing post directly using email will be retired from Viva Engage (Yammer). Users must instead utilize interactive emails in Outlook. This change will not affect other email-related Engage features, and retirement is expected to complete by late May 2024. Admins may need to alter business processes and review internal help or guidance for end-users. Alternative mechanisms are available for automatic posting workflows."
    }
  ],
  "EndDateTime": "2024-07-01T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC718760",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-23T23:24:15.66Z",
  "Services": [
    "Microsoft Viva"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-23T23:23:29Z",
  "Tags": [
    "User impact",
    "Admin impact",
    "Retirement"
  ],
  "Title": "Retirement of Post by Email and Reply by Email in Viva Engage (Yammer)",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
