{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>We're thrilled to announce the addition of a new RBAC (Role-Based Access Control) role in Microsoft Teams Admin Center: the Teams Telephony Admin. This role has been specifically designed to manage telephony-related functions within the Teams Admin Center.</p>\n<p>[When this will happen:]<br></p>\n\n<p>Standard Release: We will begin rolling out late February 2024 and expect to complete by early March 2024.<br></p><p>[How this will affect your organization:]<br></p>\n\n<p>The Teams Telephony Admin role allows standalone management of telephony areas within Teams Admin Center. With this new role, administrators gain specific capabilities related to telephony management. Here's what it entails:</p><p>&nbsp; &nbsp; &nbsp;1. User Management: View user lists and manage voice settings and voice-related policies for individual users.</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hB8O?ver=72fd\" style=\"width: 400px;\"></p><p><br></p><p>&nbsp; &nbsp; &nbsp;2. Voice Management: Access phone numbers, locations, voice apps, and direct routing settings for the entire tenant.</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hw2H?ver=26dc\" style=\"width: 400px;\"></p><p><br></p><p>&nbsp; &nbsp; &nbsp;3. Analytics and Reporting: View and manage public switched telephone network (PSTN) related reports (PSTN Blocked Users, PSTN Minute pools, PSTN &amp; SMS Usage, and Audio Conferencing dial-out usage).</p><p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<img src=\"https://img-prod-cms-rt-microsoft-com.akamaized.net/cms/api/am/imageFileData/RW1hB8L?ver=5bca\" style=\"width: 400px;\"></p><p>[What you need to do to prepare:]</p>\n<p>You may want to notify your Teams Global administrators about this new capability and update any relevant training and documentation as appropriate.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft Teams Admin Center is introducing a new RBAC role, the Teams Telephony Admin, designed to manage telephony-related functions. The role will be available for standard release from late February 2024 to early March 2024. The new role allows standalone management of telephony areas and specific capabilities related to telephony management, including user management, voice management, and analytics and reporting. Teams Global administrators should be notified, and relevant training and documentation should be updated."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/microsoftteams/using-admin-roles?WT.mc_id=TeamsAdminCenterCSH"
    }
  ],
  "EndDateTime": "2024-04-29T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715426",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-13T01:26:22.05Z",
  "Services": [
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-13T01:25:05Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Introducing the New Teams Telephony Admin Role in Teams Admin Center",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
