{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Microsoft Planner is a single, unified work management experience. It brings together the simplicity of Microsoft To Do, the collaboration of Planner, the power of Microsoft Project, and the intelligence of Microsoft Copilot for Microsoft 365 into a single, simple solution that spans from individual task management and frontline task management to enterprise and professional project management.</p><p>We are updating the existing Tasks by Planner and To Do app in Microsoft Teams to the new Microsoft Planner app, which will maintain all existing app functionality and add new options and features to help users be more productive. \n</p><p>Learn more about the <a href=\"https://aka.ms/thenewplanner\" target=\"_blank\">new Microsoft Planner announced at Microsoft Ignite 2023</a>.</p><p>This message is associated with Microsoft 365 Roadmap ID<a href=\"https://www.microsoft.com/microsoft-365/roadmap?featureid=186964\" target=\"_blank\">186964</a>.</p><p>[When this will happen:]\n</p><p>The new app will start rolling out in late March 2024 and expect to complete by early May 2024.\n</p><p>[How this will affect your organization:]\n</p><ul><li>We are updating the app name for the Tasks by Planner and To Do app in Microsoft Teams to Planner.</li><li>Planner in Teams will maintain all existing functionality of the Tasks app while adding support to access all your plans, the power of Microsoft Project, and the intelligence of Copilot. \n</li><li>If your organization does not have a Microsoft 365 license, users must use the&nbsp;To Do&nbsp;app to create new lists. If your organization purchases at least one Microsoft 365 license, users can access the full functionality of Planner.</li></ul><p>[What you need to do to prepare:]\n</p><ul><li>Your organization should update any internal documentation that references the previous app name Tasks by Planner and To Do to use the new app name Planner.</li><li>Please review the <a href=\"https://aka.ms/thenewplanner\" target=\"_blank\">Planner announcement at Ignite 2023</a>&nbsp;in preparation to update any internal documentation to reflect the new Planner app.</li><li>Supporting adoption resources will be available on this website starting early March 2024: <a href=\"https://adoption.microsoft.com/microsoft-planner/\" target=\"_blank\">The new Microsoft Planner - Microsoft Adoption</a>.</li></ul><p><i>Resources</i></p><p>Learn more:&nbsp;<a href=\"https://learn.microsoft.com/office365/planner/planner-for-admins#where-is-data-for-the-microsoft-planner-app-in-microsoft-teams-stored\" target=\"_blank\">Where is data for the Microsoft Planner app in Microsoft Teams stored?</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "186964"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating the existing Tasks by Planner and To Do app to the new Microsoft Planner app, which will maintain all existing app functionality and add new options and features to help users be more productive. The new app will start rolling out in late March 2024 and expect to complete by early May 2024. Organizations should update any internal documentation that references the previous app name Tasks by Planner and To Do to use the new app name Planner. Supporting adoption resources will be available on this website starting early March 2024."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Teams is updating the existing Tasks by Planner and To Do app to the new Microsoft Planner app, which will maintain all existing app functionality and add new options and features to help users be more productive. The new app will start rolling out in late March 2024 and expect to complete by early May 2024. Organizations should update any internal documentation that references the previous app name Tasks by Planner and To Do to use the new app name Planner. Supporting adoption resources will be available on this website starting early March 2024."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    }
  ],
  "EndDateTime": "2024-05-17T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC718248",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-21T23:52:08.49Z",
  "Services": [
    "Planner",
    "Microsoft Teams"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-21T23:47:50Z",
  "Tags": [
    "Feature update",
    "User impact",
    "Admin impact"
  ],
  "Title": "The new Microsoft Planner app in Microsoft Teams",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
