{
  "ActionRequiredByDateTime": "2024-04-30T07:00:00Z",
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>Privileged Access Management (PAM) for Microsoft Graph Data Connect (MGDC) will be retired - all tenants must use the new MGDC onboarding experience after this date. If your tenant is already using the new onboarding experience, you may disregard this message.</p><p>  \n</p><p>[When this will happen:]</p><p>April 30, 2024</p><p>[How this affects your organization:]</p><p>You may migrate over to the new experience from now until April 30, 2024, with a one-click process on MGDC settings flyout in the Microsoft 365 Admin center that. If your tenant runs an MGDC pipeline between March 31, 2024, and April 30, 2024, MGDC will automatically migrate your tenant to the new experience during that pipeline run; during this time, no new PAM requests will be created. In both cases (one-click migration and automatic migration), MGDC will convert all your approved PAM requests for MGDC into MGDC app registrations and authorizations for the new experience so that existing pipelines continue working without any required modifications.</p><p>If neither of the above (one-click migration or automatic migration) occurs by April 30, 2024, your tenant's PAM approvals will NOT be converted, and you will need to manually use the new onboarding experience to enable your pipelines again after this date. </p><p>[What you need to do to prepare:]</p><p>Review your current configuration and make changes as appropriate for your organization.</p><p>Learn more here: <a href=\"https://learn.microsoft.com/graph/existing-customer-migration\" target=\"_blank\">Migrate existing customers to the enhanced Microsoft Graph Data Connect consent experience - Microsoft Graph | Microsoft Learn&nbsp;</a></p>",
    "ContentType": "html"
  },
  "Category": "planForChange",
  "Details": [
    {
      "Name": "Summary",
      "Value": "Microsoft will retire Privileged Access Management (PAM) for Microsoft Graph Data Connect (MGDC) on April 30, 2024. All tenants must use the new MGDC onboarding experience after this date. Tenants may migrate to the new experience until April 30, 2024, with a one-click process or automatic migration. If neither occurs, PAM approvals will not be converted, and tenants will need to manually use the new onboarding experience to enable pipelines again. Review current configurations and learn more at the provided link."
    },
    {
      "Name": "ExternalLink",
      "Value": "https://learn.microsoft.com/graph/existing-customer-migration"
    }
  ],
  "EndDateTime": "2024-06-03T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC715688",
  "IsMajorChange": true,
  "LastModifiedDateTime": "2024-02-14T01:07:02.527Z",
  "Services": [
    "Microsoft 365 apps"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-14T01:06:30Z",
  "Tags": [
    "Admin impact",
    "Retirement"
  ],
  "Title": "Privileged Access Management (PAM) for Microsoft Graph Data Connect (MGDC) will be retired on April 30, 2024",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
