{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p style=\"\">Updated February 16, 2024: We have updated the content below for clarity Thank you for your patience.</p><p style=\"\">We are adding support for DNS-based Authentication of Named Entities (or DANE) for SMTP and Domain Name System Security Extensions (DNSSEC) for inbound mail to Exchange Online. DANE for SMTP is a security protocol that uses DNS to verify the authenticity of the certificates used for securing email communication with TLS and protecting against TLS downgrade attacks. DNSSEC is a set of extensions to DNS that provides cryptographic verification of DNS records, preventing DNS-spoofing and adversary-in-the-middle attacks to DNS.</p><p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=63213\" target=\"_blank\">63213</a>.</p><p>\n</p><p>[When this will happen:]<br></p>\n\n<p>Public Preview: We will begin rolling out late March 2024 and expect to complete by late April 2024.<br></p>\n\n<p>Standard Release: We begin rolling out late June 2024 and expect to complete by late July 2024.</p><p>[How this will affect your organization:]<br></p>\n\n<p>Inbound SMTP DANE with DNSSEC will be off by default. If you do not want to enable the feature, you do not need to do anything.</p><p>If you want to enable the feature, please follow the documentation using Exchange PowerShell. When the feature is released, the documentation will be in the <i>How can Exchange Online customers use SMTP DANE inbound</i> section of <a href=\"https://learn.microsoft.com/purview/how-smtp-dane-works?view=o365-worldwide#how-can-exchange-online-customers-use-smtp-dane-inbound\" target=\"_blank\">How SMTP DNS-based Authentication of Named Entities (DANE) secures email communications | Microsoft Learn</a>. By the end of 2024, we will release a new experience for enabling DNSSEC and SMTP DANE without using PowerShell.</p>\n<p>[What you need to do to prepare:]</p>\n<p>Review your domain configuration internally to ensure you won’t be impacted by any of the limitations below, and visit <a href=\"https://techcommunity.microsoft.com/t5/exchange-team-blog/implementing-inbound-smtp-dane-with-dnssec-for-exchange-online/ba-p/3939694\" target=\"_blank\">Implementing Inbound SMTP DANE with DNSSEC for Exchange Online Mail Flow - Microsoft Community Hub</a>&nbsp;for more detailed information on limitations:</p><ul><li>Not supported: Fully delegated domain, onmicrosoft.com domains, and domains purchased from Microsoft known as “viral” or self-service sign-up domains\n</li><li>Supported with risk: 3rd-party gateways, connectors, and integration with hybrid mail flow (ex. if you are using a connector to smarthost to a domain that you want to enable with DNSSEC, you need to update the smarthost name for that connector [ex. contoso-com.mail.protection.outlook.com] to match the new MX record that will be provided during DNSSEC enablement or, preferably, to match the tenant's onmicrosoft.com domain [ex. tenant-name.onmicrosoft.com] before enabling the feature.)</li></ul><p>\n</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "63213"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Exchange Online will support inbound SMTP DANE with DNSSEC starting from late March 2024. Inbound SMTP DANE with DNSSEC will be off by default, and if you do not want to enable the feature, you do not need to do anything. If you want to enable the feature, follow the documentation using Exchange PowerShell. Review your domain configuration internally to ensure you won't be impacted by any of the limitations."
    }
  ],
  "EndDateTime": "2024-09-06T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC711018",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-16T23:20:42.847Z",
  "Services": [
    "Exchange Online"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-01-29T23:51:50Z",
  "Tags": [
    "Updated message",
    "New feature",
    "User impact",
    "Admin impact"
  ],
  "Title": "(Updated) Microsoft Exchange Online: Support for inbound SMTP DANE with DNSSEC",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
