{
  "ActionRequiredByDateTime": null,
  "Attachments": null,
  "AttachmentsArchive": null,
  "Body": {
    "Content": "<p>The new Microsoft Purview portal has a streamlined design and unified experience that helps you discover and access data security, data governance, and risk and compliance solutions for all your data, wherever it lives across your data estate. You can now access all Purview solutions in one single portal as well as experiences such as settings, global search, recommendations, and roles and permissions management.</p>\n<p>This message is associated with Microsoft 365 Roadmap ID <a href=\"https://www.microsoft.com/microsoft-365/roadmap?filters=&amp;searchterms=383017\" target=\"_blank\">383017</a></p>\n<p>[When this will happen:]</p>\n\n<p>Worldwide: Rollout will begin in late March 2024 and is expected to be complete by late April 2024.&nbsp;</p>\n\n<p>[How this will affect your organization:]</p>\n\n<p>The new Microsoft Purview portal is now generally available. You can now access all Purview solutions in one single portal with new experiences such as centralized settings experience, global search, a new home page with tailored recommendations, and more.&nbsp;</p><p>You can continue to use the Compliance portal and there is no current impact. However, there will be a shift from the Microsoft Purview Compliance portal to the new Microsoft Purview portal in the future. More information will follow in future communications.</p>\n<p>[What you need to do to prepare:]</p>\n<p>There is no action required to prepare for this change. Please familiarize yourself with the <a href=\"https://go.microsoft.com/fwlink/?linkid=2260547\" target=\"_blank\">new Microsoft Purview portal</a> since this will be the future home for all Microsoft Purview solutions.</p>",
    "ContentType": "html"
  },
  "Category": "stayInformed",
  "Details": [
    {
      "Name": "RoadmapIds",
      "Value": "383017"
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview portal has entered general availability, providing a unified experience for data security, governance, risk, and compliance solutions. The rollout will begin in late March 2024 and is expected to be complete by late April 2024. No action is required to prepare for this change, but users should familiarize themselves with the new portal."
    },
    {
      "Name": "Summary",
      "Value": "Microsoft Purview portal has entered general availability, providing a unified experience for data security, governance, risk, and compliance solutions. The rollout will begin in late March 2024 and is expected to be complete by late April 2024. No action is required to prepare for this change, but users should familiarize themselves with the new portal."
    },
    {
      "Name": "Platforms",
      "Value": "Web"
    },
    {
      "Name": "BlogLink",
      "Value": "https://go.microsoft.com/fwlink/?linkid=2260547"
    }
  ],
  "EndDateTime": "2024-07-31T07:00:00Z",
  "HasAttachments": false,
  "Id": "MC717966",
  "IsMajorChange": false,
  "LastModifiedDateTime": "2024-02-20T23:49:50.54Z",
  "Services": [
    "Microsoft 365 suite"
  ],
  "Severity": "normal",
  "StartDateTime": "2024-02-20T23:49:23Z",
  "Tags": [
    "New feature",
    "Admin impact"
  ],
  "Title": "Microsoft 365 Suite: The new Microsoft Purview portal entering general availability",
  "ViewPoint": {
    "IsArchived": null,
    "IsFavorited": null,
    "IsRead": null
  },
  "AdditionalProperties": {}
}
